{"title":"JAMF Casper Suite 7.3","uid":5885118,"size":177936044,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:001d3692b328b8ea427e9cf53c4d1dd7585ffd7e&amp;dn=JAMF+Casper+Suite+7.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"joernyc","files":2,"time":1287034569,"description":"A unified and extensible framework for Mac OS X Client Management\nThe Casper Suite simplifies the life of system administrators with a comprehensive platform to deploy, update, activate and report for Mac OS X. The Casper Suite increases the efficiency of your IT staff, reduces the cost of ownership, and minimizes liability by providing a framework that enforces software licensing compliance, security standards, energy usage, and other organizational rules and requirements.\n\nWorking with Mac administrators in business, education, and government throughout the world, JAMF Software developers have identified eight major tenets of client management: Inventory, Imaging, Patch Management, Software Distribution, Remote Control, Settings Management, License Management, and Usage Management.\n\nWithin these tenets, the Casper Suite offers features and functions that provide IT administrators with best practice strategies to meet the challenges of supporting Mac OS X in the enterprise, allowing your organization to build and sustain a stable, cost-effective, and user-friendly computing environment.\n\nThe Casper Suite is a powerful framework around which your IT ecosystem can be unified and extended to manage Mac OS X resources from a single console. Normalize your IT administration with the only client management suite developed exclusively for Mac OS X.","torrent":{"xt":"urn:btih:001d3692b328b8ea427e9cf53c4d1dd7585ffd7e","amp;dn":"JAMF+Casper+Suite+7.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"001d3692b328b8ea427e9cf53c4d1dd7585ffd7e","infoHashBuffer":{"type":"Buffer","data":[0,29,54,146,179,40,184,234,66,126,156,245,60,77,29,215,88,95,253,126]},"announce":[],"urlList":[]}}