{"title":"Codec Pack (ffdshow+vobsub+ac3filter)","uid":3438788,"size":4352278,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0050a4b51e6b5f22dd0bb121694d2f7b538259b4&amp;dn=Codec+Pack+%28ffdshow%2Bvobsub%2Bac3filter%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2303920","files":1,"time":1138813451,"description":"Codec pack \n\nVobsub :\n\nVobSub is a plug-in for VirtualDub that allows you to rip subtitles from DVD VOB files and to use the provided \nDirectShow filter for DivX playback with subtitles.\nPackage also contains other tools like SubResync which allows you to synchronize subtitles with your video file.\n\nFFDShow :\n\nFFDSHOW is a DirectShow decoding filter for decompressing several video formats, including DivX, XviD, WMV, MPEG-1 and MPEG-2 movies.\n\nFilter also supports nowadays decoding of virtually all audio formats used in movies, including AC3, DTS, MP3 and Ogg Vorbis, and several subtitle formats.\n\nCodec also features postprocessing capabilities, support for virtually all MPEG-4 video formats, support for various processor enhancements (such as SSE and MMX), etc. FFDSHOW is released as an open source software under GPL license agreement.\n\nTo summarize its main idea, the FFDSHOW consumes way less CPU power than original DivX or XviD codecs, even with maximum post-processing. At the same time the post-processing seems to give excellent quality results and allows more configuring than the original DivX codec. It can even automaticly reduce post-processing if your CPU is getting overloaded. The noise filter adds a kind of a rasterising effect to the picture - might be useful in some cases.\n\nAfter our reviewers tried FFDSHOW they removed the DivX codecs from their PCs and never looked back.\n\nAC3Filter:\n\nAC3Filter - it is DirectShow filter for AC3 decoding to play .AVI with AC3 audio tracks and MPEG2 (DVD). Distributed absolutely for free (FREEWARE, OpenSource). Sorry if my English is bad, but I think it is better to have something than nothing.\n\nMain features:\n\n    * Full AC3 standard compliance.\n    * S/P DIF passthrough support.\n    * Decode MPEG2 PES streams.\n    * Multichannel output support.\n    * LFE support.\n    * Dynamic Range Compression (DRC) support.\n    * Overflow control and automatic gain control.\n    * Gain levels control.\n    * Bitstream information (channel format, bitrate, sample rate, coupling freq and maximun freq).\n    * Input/output levels.\n    * Matrix mixer with direct control of mixing matrix.\n    * Stereo to multichannel mixing.\n    * DolbySurround/ProLogic/ProLogicII downmixing.\n    * Delays for each channel.\n    * Equalizer.\n\n\n                                \nTorrent created by:  eMorpheus","torrent":{"xt":"urn:btih:0050a4b51e6b5f22dd0bb121694d2f7b538259b4","amp;dn":"Codec+Pack+%28ffdshow%2Bvobsub%2Bac3filter%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0050a4b51e6b5f22dd0bb121694d2f7b538259b4","infoHashBuffer":{"type":"Buffer","data":[0,80,164,181,30,107,95,34,221,11,177,33,105,77,47,123,83,130,89,180]},"announce":[],"urlList":[]}}