{"title":"Il Divo - The Christmas Collection","uid":6012626,"size":230101840,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00558f133d10c5be629c61f9fe752d44b118d1c1&amp;dn=Il+Divo+-+The+Christmas+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"ddawg","files":-1,"time":1291512366,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61VMH04EXQL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61VMH04EXQL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: The Christmas Collection\nArtist: Il Divo\nAudio CD (October 25, 2005) \nOriginal Release Date: 2005 \nNumber of Discs: 1 \nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. O Holy Night\n02. White Christmas\n03. Ave Maria\n04. When a Child Is Born\n05. Adeste Fideles\n06. Over the Rainbow\n07. Panis Angelicus\n08. Rejoice\n09. Silent Night\n10. The Lord's Prayer\n\n\nAmazon Review:\nIf you thrill to the soaring operatic voices of The Three Tenors (and imagine every Christmas comes with its own orchestral majesty), Il Divo has made this disc for you. The four GQ-handsome male singers were handpicked by American Idol's Simon Cowell for what seems to be their ability to sing opera and classical music with the hint of a pop sensibility. Their Christmas Collection features 10 standards (although the last time Santa looked, he wasn't quite sure &quot;Over the Rainbow&quot; and &quot;The Lord's Prayer&quot; were part of the Christmas canon). Still, it' hard not to imagine these emotionally stirring renditions as part and parcel of the reverential treatment the four finely sculpted voices bring to more exact seasonal fare such as &quot;O Holy Night,&quot; &quot;Ave Maria,&quot; &quot;Panis Angelicus&quot; and even &quot;White Christmas.&quot; Dave Arch's predictable choral and orchestral arrangements are aimed right at the sweet spot where sophisticated church choir music and traditional classical music meet, with few surprises other than the dash of Irish folk music that colors &quot;When A Child Is Born.&quot; In the end, for people who have never heard of Cowell and his cohosts (would Paula Abdul really have picked the tenor guy for this group?!), this collection will prove just as rewarding for them as the best-selling Idol records are for fans of the TV stars.\n\nAllmusic Review:\nSimon Cowell's &quot;man band&quot; creation Il Divo bring their perfect hair and immaculate throats into the crowded holiday genre with the creatively titled Christmas Collection, a heavily decorated box of yuletide favorites that dutifully showcases each tenor's captivating voice. There's not much difference between this offering and the myriad of similarly themed releases from contemporaries like Celtic Tenors, Josh Groban, and Charlotte Church, but it's a pleasant enough deviation from your parents' Mannheim Steamroller record.","torrent":{"xt":"urn:btih:00558f133d10c5be629c61f9fe752d44b118d1c1","amp;dn":"Il+Divo+-+The+Christmas+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00558f133d10c5be629c61f9fe752d44b118d1c1","infoHashBuffer":{"type":"Buffer","data":[0,85,143,19,61,16,197,190,98,156,97,249,254,117,45,68,177,24,209,193]},"announce":[],"urlList":[]}}