{"title":"Charles Dickens - A Tale of Two Cities (Unabridged)","uid":4599219,"size":356668662,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:00615058b21a91c0ee6361546dacec4c5b1a21a7&amp;dn=Charles+Dickens+-+A+Tale+of+Two+Cities+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":170,"time":1230128796,"description":"Audio Books : Literary : MP3/Variable : English\n\nThe following review is lifted shamelessly from bbc audiobooks website: \n\n&quot;A Tale of Two Cities is one of Charles Dickens's most exciting novels. Set against the backdrop of the French Revolution, it tells the story of a family threatened by the terrible events of the past. Doctor Manette was wrongly imprisoned in the Bastille for eighteen years without trial by the aristocratic authorities. Finally released, he is reunited with his daughter, Lucie, who despite her French ancestry has been brought up in London. Lucie falls in love with Charles Darnay, another expatriate, who has abandoned wealth and a title in France because of his political convictions. When revolution breaks out in Paris, Darnay returns to the city to help an old family servant, but there he is arrested because of the crimes committed by his relations. His wife, Lucie, their young daughter, and her aged father follow him across the Channel, thus putting all their lives in danger.\n\nIt's fun listening to Martin Jarvis read this book. He clearly enjoys himself and knows the story. His rich English voice is easy to follow, and he reads with confidence, eloquence and glee. Jarvis is also Dickens's equal when it comes to characters, creating a theater of voices, inflections and attitudes. In lesser hands this classic could have become a caricature on audio, but Jarvis makes this familiar story seem fresh. He treats Dickens with the respect he deserves, and the result is utterly satisfying. &quot;\n\nThis audiobook was ripped with &quot;Audiograbber&quot; software, encoded with 56 kBit/s mpeg layer-3 codec. It lasts for 14 hours and 30minutes.\n\nEnjoy and seed!","torrent":{"xt":"urn:btih:00615058b21a91c0ee6361546dacec4c5b1a21a7","amp;dn":"Charles+Dickens+-+A+Tale+of+Two+Cities+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00615058b21a91c0ee6361546dacec4c5b1a21a7","infoHashBuffer":{"type":"Buffer","data":[0,97,80,88,178,26,145,192,238,99,97,84,109,172,236,76,91,26,33,167]},"announce":[],"urlList":[]}}