{"title":"The Marcels - The Best Of The Marcels (1990)","uid":8438740,"size":273713367,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00b7b9d4c01a2b227d2ac02e06a5fd6ba9ce203a&amp;dn=The+Marcels+-+The+Best+Of+The+Marcels+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":25,"time":1367708995,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Marcels - The Best Of The Marcels (1990)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41F1SQGHCSL._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41F1SQGHCSL._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Ron Wynn):\n\nThis Pittsburgh ensemble deserved a much better fate than being known primarily for a novelty-tinged cover of &quot;Blue Moon.&quot; Baritone vocalist Richard F. Knauss teamed with Fred Johnson, Gene J. Bricker, Ron Mundy, and lead vocalist Cornelius Harp to form an integrated ensemble. They named themselves after Harp's hairstyle, the marcel. The group did a string of covers as demo tapes that were sent to Colpix. The label's A&amp;R director had them cut several oldies at RCA's New York studios in 1961, one of them being &quot;Blue Moon.&quot; They used the bass intro arrangement from the Cadillacs' &quot;Zoom&quot; and the result was a huge hit. It eventually topped both the pop and R&amp;B charts, and also was an international smash. The group eventually appeared in the film Twist Around the Clock with Dion and Chubby Checker, and recorded an 18-cut LP for Colpix. Alan Johnson and Walt Maddox later replaced Knauss and Gene Bricker, making the Marcels an all-black unit. The group did score another Top Ten pop single with &quot;Heartaches,&quot; another cover of a pre-rock single. This peaked at number seven pop and number 19 R&amp;B in 1961. They continued recording on Kyra, Queen Bee, St. Clair, Rocky, and Monogram with varying lineups, but never again equaled their past success.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/artist/the-marcels-p4841/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/the-marcels-p4841/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nLest anyone think the Marcels were a one-song phenomenon (i.e. &quot;Blue Moon&quot;), this CD will be a valuable learning experience, as well as delightful listening. Drawing primarily from their singles (with three LP cuts and an unissued outtake filling out the song lineup), this is a fairly dazzling array of vocal acrobatics, much of it hung around old pop standards, among them &quot;Summertime,&quot; &quot;That Old Black Magic,&quot; &quot;My Melancholy Baby,&quot; and &quot;Over the Rainbow,&quot; as well as songs of more recent vintage. Among the discoveries to be made here is a gloriously radiant recording of an otherwise &quot;lost&quot; Barry Mann/Cynthia Weill number called &quot;Find Another Fool.&quot; Cornelius Harp's lead on &quot;Summertime&quot; is a glorious thing to hear, while the brilliantly arranged &quot;Heartaches&quot; -- dominated by Walt Maddox's baritone -- which managed to hit number nine nationally, manages to encompass something essentially poignant about R&amp;B and rock &amp; roll, and elicit a laugh or two (or three) in the process. Original producer Stu Phillips, whose subsequent career involved him in everything from the Monkees to the soundtrack of Battlestar Galactica, did a brilliant job on these tracks, which hold up very well today, the voices always out front and in your face, and just enough rhythm section and whatever lead instrument (usually a sax) to sweeten the mix and add a little punch behind the group. If this disc has any flaw, it's that the makers didn't follow the chronological order of the recording dates, which means that the sounds of the two distinctly different lineups of the group are intermingled -- but the notes also include a chart delineating precisely which lineup sang on which songs, and that's excellent compensation. The sound holds up extremely well for a CD mastered in 1990, and the only reason for not picking this up would be to grab Sequel records' Complete Colpix Sessions instead, which features 38 songs from the same source as these 18.\n\nTaken from: &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-best-of-the-marcels-rhino-r12411/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-best-of-the-marcels-rhino-r12411/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B0000032SC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000032SC&lt;/a&gt;\n\nTrack List:\n\n01. Blue Moon\n02. I'll Be Forever Loving You\n03. I Wanna Be The Leader\n04. That Old Black Magic\n05. Honestly Sincere\n06. Footprints In The Sand\n07. Summertime\n08. Heartaches\n09. Allright, Okay, You Win\n10. Goodbye To Love\n11. Find Another Fool\n12. My Melancholy Baby\n13. Sweet Was The Wine\n14. One Last Kiss\n15. Friendly Loans\n16. Crazy Bells\n17. Blue Heartaches\n18. Over The Rainbow\n","torrent":{"xt":"urn:btih:00b7b9d4c01a2b227d2ac02e06a5fd6ba9ce203a","amp;dn":"The+Marcels+-+The+Best+Of+The+Marcels+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00b7b9d4c01a2b227d2ac02e06a5fd6ba9ce203a","infoHashBuffer":{"type":"Buffer","data":[0,183,185,212,192,26,43,34,125,42,192,46,6,165,253,107,169,206,32,58]},"announce":[],"urlList":[]}}