{"title":"The Truth Is... (Melissa Etheridge) Retail epub mobi PDF [Itzy]","uid":11077821,"size":15984073,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01ed088fb2cc1cd3a827106ded7055d138d46c38&amp;dn=The+Truth+Is...+%28Melissa+Etheridge%29+Retail+epub+mobi+PDF+%5BItzy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Itzy","files":5,"time":1411358155,"description":"[img]http://i.imgur.com/P04XnPK.jpg?1[/img]\n\n[quote][b]Title:[/b] The Truth Is... My Life in Love and Music\n[b]Authors:[/b] Melissa Etheridge with Laura Morton\n[b]Torrent File Name:[/b] The Truth Is... (Melissa Etheridge) Retail epub mobi PDF [Itzy]\n[b]Publisher:[/b] Villard (August 7, 2001)\n[b]Sold by:[/b] Random House LLC\n[b]Genres:[/b] Nonfiction, Biography\n[b]Formats:[/b] Retail .epub, Retail .mobi, Retail .PDF[/quote]\n\nln the ten years since she burst on to the international music scene, Melissa Etheridge has released six albums that have sold more than 25 million records worldwide, garnering not only public adoration for her uncompromising honesty but numerous critical awards, including two Grammys and the prestigious ASCAP Songwriter of the Year award. She has given the world unforgettable hits such as &quot;Bring Me Some Water,&quot; &quot;Similar Features,&quot; &quot;Come to My Window,&quot; and &quot;I'm the Only One,&quot; with lyrics that touch on a universal nerve and the deeply human side of relationships. Her personal journey has been captured over the years through her music, transforming her voice and musicianship into inspiring messages of love, consciousness, hope, longing, desire, and pure passion.\n\n&quot;The Truth Is...&quot; is a bold and unflinching account of an extraordinary life, described as only Melissa can: from her Kansas roots through her early love of music to her brilliant rise to stardom, becoming a female superstar in a male-dominated rock world. Melissa will openly discuss the massive impact of her public coming-out, a revelation that only increased her popularity and made her a highly visible spokesperson for the gay and lesbian community. &quot;The Truth Is...&quot; shares Melissa Etheridge's fascinating story - sometimes shocking, always inspiring - with unprecedented candor and insight.\n\nFilled with personal insights, the stories behind the music and lyrics, and never-before-seen personal photographs, &quot;The Truth Is...&quot; is a poignant, thoughtful, sometimes difficult expression of who Melissa Etheridge has been, who she is, and who she hopes to become.\n\n","torrent":{"xt":"urn:btih:01ed088fb2cc1cd3a827106ded7055d138d46c38","amp;dn":"The+Truth+Is...+%28Melissa+Etheridge%29+Retail+epub+mobi+PDF+%5BItzy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01ed088fb2cc1cd3a827106ded7055d138d46c38","infoHashBuffer":{"type":"Buffer","data":[1,237,8,143,178,204,28,211,168,39,16,109,237,112,85,209,56,212,108,56]},"announce":[],"urlList":[]}}