{"title":"My Bloody Valentine - Loveless [24 bit FLAC] vinyl","uid":8841935,"size":1159469090,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02f7be333d36cfc4639695171802fcc6b2f82b6c&amp;dn=My+Bloody+Valentine+-+Loveless+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1377270946,"description":"\n  My Bloody Valentine - Loveless [24 bit FLAC] vinyl\n\n  Released: 1991\n  Genre: Pop/Rock\n  Styles: Shoegaze, Dream Pop, Noise Pop, Alternative\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Only Shallow\n  02 Loomer\n  03 Touched\n  04 To Here Knows When\n  05 When You Sleep\n  06 I Only Said\n  07 Come in Alone\n  08 Sometimes\n  09 Blown a Wish\n  10 What You Want\n  11 Soon\n\n  Rip Info\n\n  Grado Prestige Gold Diamond Stylus\n  NAD 7140\n  Delta 44\n\n  Review\n\n  Isn't Anything was good enough to inspire an entire scene of My Bloody Valentine soundalikes, but Loveless' greatness proved that the band was inimitable. After two painstaking years in the studio and nearly bankrupting their label Creation in the process, the group emerged with their masterpiece, which fulfilled all of the promise of their previous albums. If Isn't Anything was the Valentines' sonic blueprint, then Loveless saw those plans fleshed out, in the most literal sense: &quot;Loomer,&quot; &quot;What You Want,&quot; and &quot;To Here Knows When&quot;'s arrangements are so lush, they're practically tangible. With its voluptuous yet ethereal melodies and arrangements, Loveless intimates sensuality and sexuality instead of stating them explicitly; Kevin Shields and Bilinda Butcher's vocals meld perfectly with the trippy sonics around them, suggesting druggy sex or sexy drugs. \n\n  From the commanding &quot;Only Shallow&quot; and &quot;Come in Alone&quot; to breathy reflections like &quot;Sometimes&quot; and &quot;Blown a Wish,&quot; the album balances complexity and immediately memorable pop melodies with remarkable self-assurance, given its difficult creation. But Loveless doesn't just perfect the group's approach, it also hints at their continuing growth: &quot;Soon&quot; fuses the Valentines' roaring guitars with a dance-inspired beat, while the symphonic interlude &quot;Touched&quot; suggests an updated take on Fripp and Eno's pioneering guitar/electronics experiments. These glimpses into the band's evolution make Shields' difficulty in delivering a follow-up to Loveless even more frustrating, but completely understandable -- the album's perfection sounded shoegazing's death-knell and raised expectations for the next My Bloody Valentine album to unreasonably high levels. Though Shields' collaborations with Yo La Tengo, Primal Scream, J Mascis, and others were often rewarding, they were no match for Loveless. However, as My Bloody Valentine fans -- and, apparently, Shields himself -- will attest, nothing is.","torrent":{"xt":"urn:btih:02f7be333d36cfc4639695171802fcc6b2f82b6c","amp;dn":"My+Bloody+Valentine+-+Loveless+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02f7be333d36cfc4639695171802fcc6b2f82b6c","infoHashBuffer":{"type":"Buffer","data":[2,247,190,51,61,54,207,196,99,150,149,23,24,2,252,198,178,248,43,108]},"announce":[],"urlList":[]}}