{"title":"Porn King - The Autobiography of John C. Holmes","uid":8677070,"size":23705391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:031df960fdc83b5fd0e03dfbe7d9f0736b1839ca&amp;dn=Porn+King+-+The+Autobiography+of+John+C.+Holmes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gnv65","files":-1,"time":1373622750,"description":"Porn King: The Autobiography of John C. Holmes \nby John Holmes and Laurie Holmes \nBearManor Media | January 2012 | ISBN: 1593936850 | ePUB/PDF | 5 /17 mb &lt;a href=&quot;\nhttp://www.amazon.com/Porn-King-Autobiography-John-Holmes/dp/1593936850&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Porn-King-Autobiography-John-Holmes/dp/1593936850&lt;/a&gt; &lt;a href=&quot;\nhttp://www.johnholmes.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.johnholmes.com&lt;/a&gt;\n\nAutobiography of the KING of PORN In the world of adult cinema, one name stands out above all others: John Holmes. For nearly 20 years, from 1967 to 1987, Holmes reigned as the undisputed king of X-rated films, having appeared in a record 2,200 plus productions, from the landmark Johnny Wadd movies (one of which became the first adult motion picture to gross over $1 million) to the legendary Insatiable with Marilyn Chambers. To a legion of fans world-wide, he was known as &quot;Mr. Big.&quot; To industry insiders, he was &quot;Mr. Nice Guy.&quot; Yet for all of his fame and notoriety, Holmes remained an intensely private person and a mystery man. - that is, until now. In a startlingly frank autobiography, PORN KING was written in large part prior to his death (with new material added by his widow, Laurie). Holmes tells the story of his incredible life. This is not a typical celebrity story, filled with bright lights and glamor, giant sound stages and movie moguls. It is, instead, a rare portrait of a young man drawn into an unknown Hollywood, a secret, forbidden Hollywood, and the parallels between his astounding career and the sexual revolution in American films. Holmes knew his subject better than anyone. Holmes candidly tells of a lucrative but often harrowing &quot;other&quot; life as a male prostitute to the rich and famous, a shattering fall into drugs and his side of the grisly Wonderland Murders and his desperate cross-country right afterwards. From start to finish, in this newly revised edition, complete with never-before-seen candid photos of Holmes in his private life, PORN KING is a sizzling, sensuous, fast-paced story laced with controversy. If ever there was an untold story, PORN KING is it. ","torrent":{"xt":"urn:btih:031df960fdc83b5fd0e03dfbe7d9f0736b1839ca","amp;dn":"Porn+King+-+The+Autobiography+of+John+C.+Holmes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"031df960fdc83b5fd0e03dfbe7d9f0736b1839ca","infoHashBuffer":{"type":"Buffer","data":[3,29,249,96,253,200,59,95,208,224,61,251,231,217,240,115,107,24,57,202]},"announce":[],"urlList":[]}}