{"title":"The Inspector Lynley Mysteries - Series 4 (2005) [ TVRip (XVID)","uid":4269498,"size":2990772394,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:03353d28f36d8f66121b46769dbfcbeeec8714f3&amp;dn=The+Inspector+Lynley+Mysteries+-+Series+4+%282005%29+%5B+TVRip+%28XVID%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":8,"time":1214865347,"description":"Episode 1 - In Divine Proportion\n\nHavers gets back to work after being shot and is assigned to a case in rural Suffolk, where a young woman has been murdered with a shot gun. Lynley is worried about the effect the case will have on Havers. Then a photograph of the murdered woman arguing with a man is sent to the police, and a mysterious word is painted on the wall of the crime scene - it seems as if someone is trying to give the team some clues. As a result, they uncover a dark secret that villagers have kept quiet for years. In a final confrontation, Havers has to face down her fear of being back in the line of fire.\n\nEpisode 2 - In The Guise of Death\n\nHavers is on holiday in Cornwall, learning Akido, and Lynley is also in the county to visit his mother, when a local horse trainer is found hanged in a stable on the estate next to Lynley&amp;#039;s. The dead man&amp;#039;s money troubles suggest suicide, but then Lynley finds he had links with smuggling. Another lead suggests that the killer may be uncomfortably close to home. As the case develops, Lynley has to think out where his future lies ? with the police, or managing his own property?\n\nEpisode 3 - The Seed Of Cunning\n\nLynley and Havers investigate the killing of a porter at the House of Lords. At first it looks as if the murder may be connected to the dead man&amp;#039;s gambling debts, but then a senior clerk is also murdered, with evidence of a conspiracy involving stolen test reports on a new missile system. Havers traces the missing documents, but then she finds she and Lynley are both being followed. Havers and Lynley are being followed, and have to work out who would benefit from the suppression of the test report.\n\nEpisode 4 - The Word Of God\n\nThe frozen body of a man is found on a meat truck in London&amp;#039;s Smithfield Market, and on the body are a forged British passport and an Arabic manuscript on a page of vellum. The dead man appears to be an illegal immigrant - but was his death accidental? The manuscript turns out to be a hugely valuable page from an ancient copy of the Koran. Lynley finds himself locking horns with DI Brennan from the immigration department?","torrent":{"xt":"urn:btih:03353d28f36d8f66121b46769dbfcbeeec8714f3","amp;dn":"The+Inspector+Lynley+Mysteries+-+Series+4+%282005%29+%5B+TVRip+%28XVID%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03353d28f36d8f66121b46769dbfcbeeec8714f3","infoHashBuffer":{"type":"Buffer","data":[3,53,61,40,243,109,143,102,18,27,70,118,157,191,203,238,236,135,20,243]},"announce":[],"urlList":[]}}