{"title":"Symphony of Eternity v1.0.9 Android","uid":6832580,"size":23679247,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:0403ede28b8aab91ea401679d6095c5cc3bd5114&amp;dn=Symphony+of+Eternity+v1.0.9+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":-1,"time":1321917653,"description":"Symphony of Eternity v1.0.9 \nRequirements: Android 1.6 and up\nOverview: Symphony of Eternity, a role-playing game for Android, boasts an gripping story, quirky characters, and freewheeling combat.\n\n\n\nWhere the Symphony of Eternity Begins\nIn this epic RPG, you follow the adventures of a gallant young man and his golem companion as they roam the world in search of a legendary weapon. One day the pair rescues a solitary girl from a band of bloodthirsty monsters. Explaining that she is of royal blood and the sole survivor of a treacherous palace coup, the mysterious princess opts to join her rescuers on their journey for the magic weapon.\n\nDiscover how their destinies are intertwined.\n\nCharacters and Combat\nIf you enjoy old school computer role-playing games such as Might and Magic, Symphony of Eternity should be your next sojourn. The game's combination of turn-based gameplay with an auto-battle feature makes for smooth, simple, and freewheeling combat. You can control every move from the touch screen, so it's easy to stay focused on the game.\n\nQuirky, comical, and emotional characters make appearances with their own purpose in the story. Customize characters with different gear or offensive and defensive skills based on total merit points. Nurture your character to your preference by allocating points to desired skills. If you would like to increase attack power or critical strike rate, you can--among many more skill options.\n\nGraphically Stunning\nSymphony of Eternity features high quality WVGA graphics, and also supports output to a high-definition monitor. It's easy to immerse yourself in this game's beautifully-rendered world.\n\nProduct Features\nImmerse yourself in a large role-playing world\nCustomize your characters' strengths and powers\nPlay on a high-definition monitor\n\nWhat's in this version:\nTrouble in older Android OS is solved.","torrent":{"xt":"urn:btih:0403ede28b8aab91ea401679d6095c5cc3bd5114","amp;dn":"Symphony+of+Eternity+v1.0.9+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0403ede28b8aab91ea401679d6095c5cc3bd5114","infoHashBuffer":{"type":"Buffer","data":[4,3,237,226,139,138,171,145,234,64,22,121,214,9,92,92,195,189,81,20]},"announce":[],"urlList":[]}}