{"title":"Problem Drinkers :Alcoholics Anonymous","uid":4874958,"size":207876096,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:0455d475f1029b9137543b8de56e60abeaf6f2c2&amp;dn=Problem+Drinkers+%3AAlcoholics+Anonymous&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1241076289,"description":"March of Time - Problem Drinkers - Alcoholics Anonymous\n\nXvid 624*416, 20 minutes\n\nThe March of Time was a newsreel that was shown in movie theaters from 1935 - 1951. It was prepared by Time, Inc. as the idea of executive Roy Edward Larsen. It was launched in over 500 theaters and was an immediate success with audiences, but because of its high production costs (estimated at $50,000 per episode, which were released about one per month), was a money loser. It was ultimately ended when the widespread adoption of television and daily news shows obliviated the newsreel format.\n\nThis clip was released in 1946. The March of Time worked closely with the New York office of AA in the production of this episode. \n\n&quot;The March of Time is in the process of making a documentary film on alcoholism, in which Alcoholics Anonymous is to play a large part. The film, said a March of Time official, will probably not be ready for release for several months to come. Prior to the release they will notify the Central Office, which in turn will inform all A.A. groups in time to catch the picture immediately it is out.&quot;\n\n&quot;The Group in Ann Arbor, Mich., is one of many cooperating with theaters and newspapers during the showing of the March of Time feature, &quot;Problem Drinkers,&quot; the first public film record of A.A. work. Stories in Ann Arbor newspapers about the movie refer interested readers to the local Group for further information and help. . . . Incidentally, Westbrook Van Voorhis, the &quot;voice&quot; in MOT films, recently spoke about &quot;Problem Drinkers&quot; to the Cleveland Advertising Club.&quot;\t","torrent":{"xt":"urn:btih:0455d475f1029b9137543b8de56e60abeaf6f2c2","amp;dn":"Problem+Drinkers+%3AAlcoholics+Anonymous","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0455d475f1029b9137543b8de56e60abeaf6f2c2","infoHashBuffer":{"type":"Buffer","data":[4,85,212,117,241,2,155,145,55,84,59,141,229,110,96,171,234,246,242,194]},"announce":[],"urlList":[]}}