{"title":"Stan Ridgway - Anatomy  [1999]  [Robbie60] [FLAC]","uid":6232264,"size":319993081,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04a759003af2bba774f9965f4c74a9d10a1569b4&amp;dn=Stan+Ridgway+-+Anatomy++%5B1999%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299750439,"description":"Stan Ridgway\nAnatomy\n\n\nLabel: UltraModern/New West\nReleased: 1999\nSource: Original CD \nSize Torrent: 305 MB\nFormat: FLAC\n\n\n\n\n\n\nOne of the most unique, if misunderstood, talents to emerge from the vaunted 1980s Los Angeles punk/new-wave era, Stan Ridgway arguably owes more than most to the art-rock and modern jazz which crucially informed that scene. He's shrugged off MTV's stereotyping of his former band Wall of Voodoo to forge a rich, if stubbornly independent, body of solo work, freely retooling his sound and viewpoint along the way. Black Diamond, his 1995 outing (and one of the best, if sorely underappreciated, singer-songwriter albums of the '90s) placed Ridgway in a spare acoustic setting far removed the propulsive synth-sense of The Big Heat, his expressive baritone taking on a new warmth and range. Anatomy is an attempt to move both forward and reconcile the various aspects of his previous work. The stirring, elegiac opener &quot;Mission Bell&quot; adds depth and dimension to Black Diamond's tack, while &quot;Train of Thought,&quot; &quot;Susie Before Sunrise,&quot; and &quot;Valerie is Sleeping&quot; supplant Ridgway's trademark seamy-side-of-life storytelling with more personal--if oblique--observations, set with confidence against music that freely mixes electronics, acoustic guitar, and his plaintive harmonica. Three surprisingly varied instrumentals cue listeners that Ridgway now splits his time between songwriting and film scoring. Ridgway is a true musical rebel, but one with a rich sense of history and no time for the cheap encumbrances of fashion. Jerry McCulley \n\n\n\nPersonnel\n\nStan Ridgway - guitars, keyboards, harmonica, vocals \n\nDavid Sutton - electric and acoustic bass \n\nPietra Wexstun - keyboards, vocals, whip-snag ocilators \n\nIvan Knight - drums and percussion, surfing tips \n\nRick King - twang guitars and merlot \n\nLarry Grennan - electronics and audio opinions \n\nMr Mickey - prayers and incense \n\nJerome &quot;the lip&quot; Bangote -trumpet, flugelhorn \n\nAdrid Frid - harp, dulmicer \n\nJeff Stooger - recorder, stoopid flute \n\nTommy Arizona - pedal steel guitar \n\nBart Funsten - studio assistance and newspaper \n\nJackie &quot;teak&quot; Lazar - old show-biz stories &amp; woodburner\n\n\n\nTrack Listing\n\n1.Mission Bell (5:02)\n2.Deep Blue Polka Dot (4:37)\n3.Train of Thought (4:14)\n4.Murray's Steakhouse Story (1:06)\n5.Susie Before Sunrise (4:02)\n6.Sweet Pig Alley (1:12)\n7.Valerie Is Sleeping (3:03)\n8.Mickey the Priest (2:19)\n9.Mama Had a Stove (3:39)\n10.Whistle for Louise (4:26)\n11.Picasso's Tear (4:17)\n12.Sixteen Tons (9:20)\n\n\n1. Mission Bell \n&quot;I was driving from L.A. to El Paso and I stopped to gas up and I saw an old church deserted and empty but the bell in the tower was ringing slowly about every half a minute. Like fate. No one was around and I couldn't see anybody on the property at all. And it just one ring. It seemed desolate and not much solace for anyone with a strictly religious rule book. That was the inspiration. God was a lonely guy. And so were we all.&quot; \n\n2. Deep Blue Polka Dot\n&quot;I was plastered at a friends house. Everyone had all ready gone to bed and I just kept going ya know...They had an old water soaked piano that I was pawing at about 4 am and this came out. I felt pretty spent and worn out. Kinda old and wasted. That night we'd talked about getting old and what it meant. Some said it didn't mean a thing. I was more on the finite time line rap. And feeling like I'd past my mid point. 40 something and counting. My middle passage, I kinda started to fashion a funeral dirge for middle age. Take it kids... its all yours.....&quot;litz.com, and on my pal Wayne Kramer's &quot;Beyond Cyberpunk&quot; CD, a compilation of great music from the site. \n\n3. Train Of Thought\n&quot;When I think about my past and memories, a lot gets hazy and hard to remember exactly. Things get jumbled and why you thought you did something is hard to recall and why. Is it what happened to me or just what I thought I wanted to happen? Hard to tell without a witness. And sometimes they disappear after time. History has a way of rolling over all us. And then we all get lost.&quot;\n\n4. Murray's Steakhouse Story\n&quot;A piece with no words. That's a relief. Murray was guy my family knew in Barstow that always told sad stories about life. He owned a hardware store so I don't really know why I made it a steakhouse....maybe I still like meat or somethin'...&quot;\n\n5. Susie Before Sunrise\n&quot;Shame in a life can make you do shameful things sometimes. You punish yourself to feel the pain you think you deserve for all the things you perceive you've failed at.. Or it all just makes you move far away from where the shame came from. Best to pack your bag, cut your loses and get out before the sun comes up. Sometimes you just have to start over. Someone call John Bradshaw....&quot;\n\n6. Sweet Pig Alley \n&quot;An extrapolation on events past and present, culminating in a drastic decision with untold consequences. Well...what did you expect? I love the trumpet here. It makes me feel like beating myself up...&quot; \n\n7. Valerie Is Sleeping \n&quot;Jealousy and denial are fascinating subjects for writing a story. People can think it was someone else's idea and their motivation outside themselves for personal acts of violence or revenge. Or maybe I just wish I'd been a private detective with an office on Venice and Sawtelle....crime is an American way of life.&quot;\n\n8. Mickey The Priest \n&quot;Being a priest ain't all its cracked up to be, it seems. I know a few and all that endless communion and confession can ultimately converge into just plain commotion. This is a soundtrack for that inner argument of the soul. Thanks Mickey...and let it roll.&quot;\n\n9. Mama Had A Stove\n&quot;My family have some roots in the south and its kinda complicated to explain. And once when I was in New Orleans, I took a trip on a big river paddle boat up the Mississippi. The boat had a big 'ol steam calliope 'a playing while we trolled up the muddy, but it was pretty rusted and out of tune. It was a gray kinda day and the clouds looked like big rain was coming. And as I sat down on the deck and dipped my toes in the water feeling for fish, I could just see and kinda imagine... Tom Sawyer and Huck and Joe and even Mark Twain on the shore waving at me... but along the way... with them... there were some others I hadn't counted on. Relatives? Kinfolk? Waving back and calling me to shore to join them. The ship sailed on and I went to the bar and ordered a pim's cup...a person's family is like a hand they get delt in poker. Except you don't get to fold, only bluff.&quot;\n\n10. Whistle For Louise\n&quot;I keep going back to the desert even though I find it to be a god forsaken place. For a while, I lived in a little tin shack outside of Barstow. It had a sink and a bathroom but that was about it. I loved it. There was a cafe near by where I got everything I needed. Some say to find yourself you gotta lose yourself first. The deserts a good place for that. This was inspired by a habit that I've since given up and people that got caught up in it after I left. We had a good time though, while it lasted. I still love the dry wind and the heat of the place though. When pressed...I still say I miss it. When held to reason...I'm better off staying away.&quot;\n\n11. Picasso's Tear\n&quot;Back a few years, a downtown loft space was a place where I hung for a while. No trees. No grass. Concrete and steel. I had some friends down there and we all had alot of ideas about alot of things. And we were working on our art night and day. Big, big plans. It was great for a while until reality exploded into the picture and then... it had to be re-framed. We had alot of good things happen though, and we still talk about how we're going to get the other stuff we didn't finish.. done. We hope. If we live so long. &quot;\n\n12. 16 Tons \n&quot;A song I've sung for a while now. My Dad had this record and he and I used to sing along together. He was in the mining business and always told me stories about tunnels and dirt. I'm still fascinated by digging underground and this song is an attempt at getting at that feeling. It's also a trip to the &quot;devil's coal mine&quot;. By the great fingerpicker and coal miner's son, Merle Travis. And &quot;what do ya get&quot;.... \n","torrent":{"xt":"urn:btih:04a759003af2bba774f9965f4c74a9d10a1569b4","amp;dn":"Stan+Ridgway+-+Anatomy++%5B1999%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04a759003af2bba774f9965f4c74a9d10a1569b4","infoHashBuffer":{"type":"Buffer","data":[4,167,89,0,58,242,187,167,116,249,150,95,76,116,169,209,10,21,105,180]},"announce":[],"urlList":[]}}