{"title":"Suspicious Minds: Why We Believe Conspiracy Theories (2015)","uid":13037501,"size":1161518,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04c6cbca1e73fe7b2a34dcc25745351afb1eea4f&amp;dn=Suspicious+Minds%3A+Why+We+Believe+Conspiracy+Theories+%282015%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1450492687,"description":"Suspicious Minds: Why We Believe Conspiracy Theories \r\n\r\nepub\r\n\r\n\r\n\r\n We're all conspiracy theorists. Some of us just hide it better than others.\r\n\r\n Conspiracy theorists do not wear tin-foil hats (for the most part). They are not just a few kooks lurking on the paranoid fringes of society with bizarre ideas about shape-shifting reptilian aliens running society in secret. They walk among us. They are us.\r\n\r\n Everyone loves a good conspiracy. Yet conspiracy theories are not a recent invention. And they are not always a harmless curiosity. In Suspicious Minds, Rob Brotherton explores the history and consequences of conspiracism, and delves into the research that offers insights into why so many of us are drawn to implausible, unproven and unproveable conspiracy theories. They resonate with some of our brain's built-in quirks and foibles, and tap into some of our deepest desires, fears, and assumptions about the world.\r\n\r\n The fascinating and often surprising psychology of conspiracy theories tells us a lot – not just why we are drawn to theories about sinister schemes, but about how our minds are wired and, indeed, why we believe anything at all. Conspiracy theories are not some psychological aberration – they're a predictable product of how brains work. This book will tell you why, and what it means.\r\n\r\n Of course, just because your brain's biased doesn't always mean you're wrong. Sometimes conspiracies are real. Sometimes, paranoia is prudent","torrent":{"xt":"urn:btih:04c6cbca1e73fe7b2a34dcc25745351afb1eea4f","amp;dn":"Suspicious+Minds%3A+Why+We+Believe+Conspiracy+Theories+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04c6cbca1e73fe7b2a34dcc25745351afb1eea4f","infoHashBuffer":{"type":"Buffer","data":[4,198,203,202,30,115,254,123,42,52,220,194,87,69,53,26,251,30,234,79]},"announce":[],"urlList":[]}}