{"title":"Phish - 1998 Island Tour. LivePhish SBD","uid":4930003,"size":1366644762,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:04d80eff335699d2337bbf2cb9b149f2ea949951&amp;dn=Phish+-+1998+Island+Tour.+LivePhish+SBD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TJC12TJC","files":73,"time":1244003569,"description":"Phish - 1998 Island Tour LivePhish\n\nEnjoy. TJC\n\n\nThe Island Tour by Kevin Shapiro \n\nToward the end of winter 1998, Phish began preparing to record Story Of The Ghost, their first studio album since 1996's Billy Breathes. The band gathered alone for pre-production recording and practice sessions in a rented farmhouse in rural Moscow, Vermont. Using a four-wheel drive vehicle to navigate the driveway during mud season, they practiced and recorded the beginnings of many new songs like Shrine, Roggae, Shafty (Olivia's Pool, funkified), Frankie Says, What's The Use, Fikus, Birds of a Feather, Meat, the Meatstick and My Left Toe. \n\nSoon after this first of two &quot;Ghost Meat&quot; sessions, the band decided to play some live shows in the northeast. The Island Tour was quickly scheduled and the result was standout shows at once extraordinarily risky, playful and emotive. With little time to warm up, the band hit the stage running with two shows at Nassau Coliseum immediately followed by two at Providence Civic Center. The four nights-in-a-row were a whirlwind of energy with each set building on the last to a funky crescendo that left the band headed back to work on Story Of The Ghost with an electric swagger. All this came at an exciting time for Phish. Plans were in progress to complete The Bittersweet Motel documentary, work had begun on the band's third major summer's-end festival, Lemonwheel and Trey was just weeks away from his first and only performance with his second one-off solo act, 8 Foot Fluorescent Tubes. \n\nHighlights of these shows are too many to list in detail and will be rediscovered time and again listening to these soundboard recordings. Even the Cliff's Notes are lengthy and are covered at phish.com in the April, 1998 installment of This Month In Phish History. Worthy of extra mention from April 2nd is Stash, with a beautiful, sometimes dark jam that erupted into an improvised staccato melody that highlighted the first set and perhaps the entire outing. After ending set one on a high note &quot;for the sake of contrast and composition,&quot; Phish launched into set two, which featured, among other gems, the first Birds of a Feather. Wolfman's Brother &gt; Sneakin' Sally Thru the Alley ended in a transcendent jam that resolved into the first Frankie Says. A deep space, depraved Twist jam is another very high point of the opening night. \n\nThe April 3rd show blasted off with Mike's Song and an explosively funky Weekapaug Groove, which featured teases of Mozambique. Set two yielded multiple climaxes including Nassau Jam out of Roses Are Free and a breathtaking Piper. The rest of this spectacular set from Run Like An Antelope through the encore is lovingly associated with longtime crew-member Pete Carini - &quot;Carini's gonna get you.&quot; The show ended with a three-song encore capped by a unique Tweezer Reprise. This was one of few times Tweezer Reprise was played before or without its partner Tweezer and its placement created a perfect puzzler to carry to the next island. \n\nYou can hear the band's excitement during soundcheck on April 4th and puzzlement quickly turned to understanding as set one and Phish's triumphant return to Providence commenced with an impressive Tweezer &gt; Taste. Other major highlights of this show include set two's Birds of a Feather &gt; 2001 (Also Sprach Zarathustra) &gt; a very funky Brother or two. A last round of major musical achievements from this show began with Ghost, which led into a heavy jam that included a tease of Can't Turn You Loose before melting into a show-closing trifecta of The Lizards followed by David Bowie and Harry Hood encore. \n\nThe Island Tour tradition of bold openers continued April 5th with Oh Kee Pah Ceremony &gt; You Enjoy Myself. The rest of this enormous set featured notable segues which connected Theme From The Bottom &gt; McGrupp and the Watchful Hosemasters &gt; Bathtub Gin &gt; Cities &gt; Sparkle &gt; Split Open and Melt. Set two saw Shafty's debut as well as the exquisite funkfest that encompassed Maze &gt; Shafty &gt; Possum &gt; Cavern. Trey recognized the depth of the funky theme when he thanked the crowd and invited those who were up to it to stick around and dance to the funk. Needless to say, nobody left. \n\nImmediately after Island Tour, the band returned to Vermont for another pre-production session known as &quot;Ghost Meat II.&quot; By 4/20, Phish was set up at Bearsville Studios and at work on Story of the Ghost, which was released in October. \n","torrent":{"xt":"urn:btih:04d80eff335699d2337bbf2cb9b149f2ea949951","amp;dn":"Phish+-+1998+Island+Tour.+LivePhish+SBD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04d80eff335699d2337bbf2cb9b149f2ea949951","infoHashBuffer":{"type":"Buffer","data":[4,216,14,255,51,86,153,210,51,123,191,44,185,177,73,242,234,148,153,81]},"announce":[],"urlList":[]}}