{"title":"Gnidrolog - In Spite Of Harry's Toenail 1972 (Rare UK Prog)","uid":3442378,"size":164900810,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0517c7fd2dd7d01e852d5ff7e3fdc458c54f494b&amp;dn=Gnidrolog+-+In+Spite+Of+Harry%5C%27s+Toenail+1972+%28Rare+UK+Prog%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"buzzard","files":15,"time":1139505894,"description":"Gnidrolog\n[IMG]http://img208.imageshack.us/img208/1704/live1yb.jpg[/IMG]\n\n GNIDROLOG are one of the more overlooked bands that took part in the progressive rock explosion in Britain around 1971-73. Intricate band, with an ecletic music that is very hard to categorize. Their music is a blend of blusy prog, with horn instruments, and intense vocals on top of it. They might appeal to GENTLE GIANT, JETHRO TULL and VDGG fans.\n\nPersonnel:\nPETER COWLING \tbs, cello \tA \tB\nCOLIN GOLDRING \tgtr, vcls, sax \tA \tB\nSTEWARD GOLDRING \tgtr \tA \tB\nNIGEL PEGRUM \tdrms, flute, oboe \tA \tB\nJOHN EARLE \tvcls, wind \t\tB\nCHARLOTTE FRENCH \tpiano \t\tB\n \n\nALBUMS:\n1(A) \tIN SPITE OF HARRY&amp;#039;S TOENAIL \t(RCA SF 8261) \t1972 R1\n2(B) \tLADY LAKE \t(RCA SF 8322) \t1972 R2\n\nNB: (2) reissued in Korea (Si-Wan SRML 1022) 1997. There&amp;#039;s also a Live 1972 CD (Audio Archives AACD 032) 1999.  \n\nThese albums of progressive rock are sometimes dramatic, often disjointed, but in places contain some interesting and uncommercial music. This is epitomized by tracks like Long Live Man Dead on the first album, which also contains some pleasant woodwind accompaniment. As one might expect, they did not sell well and have become quite rare.\nThe Goldrings later did session work, as did Pegrum (for John Otway among others) and Earle. Aside from doing session work, Cowling was later a member of The Pat Travers Band. Pegrum had a spell in Steeleye Span and the Ben Markus Band who had an album Nocturn Gate (Ooze 2002 BA) 1983, which he also produced.\nA fourth album, Gnosis, with newly written material, has recently been released.\n\nGnidrolog - In Spite Of Harry&amp;#039;s Toenail \n[IMG]http://img221.imageshack.us/img221/7057/gnidrolog12sx.jpg[/IMG]\n\n\nsize:        157 mb\nbitrate:     320\n\nIIn Spite of Harry&amp;#039;s Toenail contains many of the same traits as its follow up, the masterful Lady Lake. Colin Goldring&amp;#039;s dark, demanding vocal delivery, which commands attention in much the same way that Peter Hammill&amp;#039;s does. Alongside this are the group&amp;#039;s complex, multi-instrumentalist talents, lending a Gentle Giant-like feel to many of the pieces. Cello, saxophone and various wind instruments abound, along with the searing guitar of Stewart Goldring. This album is definitely a grower however, unlike the relatively immediacy and great songwriting of Lady Lake. In Spite of Harry&amp;#039;s Toenail is a denser, darker, heavier and more complex beast.\n\nThe two part &quot;Long Live Man Dead&quot; is, to put simply, an utter classic. This cut utterly smokes, with savage guitar riffs from Stewart Goldring to accompany a great vocal line and a powerful, percussive attack as the song shifts through its many phases. &quot;Snails&quot; is simply frenetic, building up into a closing climax of pure chaos and crashing instruments. &quot;Time and Space&quot; is actually quite pretty through its initial verses, but builds into densely orchestrated chaos later in the song. The closing title epic is another major highlight, heavy, complex, emotional and aggressive, like the rest of the album.\n\nThis is certainly a great album, but definitely tougher to get into than Lady Lake. I would suggest that one start there first before moving onto their first album. In Spite of Harry&amp;#039;s Toenail is ambitious, complex and energetic, and is just as often viewed as the better of the two albums. Personally, I see Lady Lake as the more refined, mature work, with a greater song writing grasp, making it the preferable entry point for beginning to enjoy this great band\n\nTrack title\n1. Long Live Man Dead\n2. Skull\n3. Peter \n4. Snails\n5. Time and Space \n6. Who Spoke \n7. Goodbye-Farewell-Adieu\n8. Harry&amp;#039;s Toenail\n\nBonus Tracks:\n9. Smokescreen (1969) \n10. Saga of Smith and Smyth (1969)\n11. My Room (1971) \n12. Saga of Smith and Smyth (1971)\n\nColin Goldring - Lead vocals, Guitars, Recorders, Tenor Sax, Horn, Harmonica\nStewart Goldring - Lead guitar, Vocals\nPeter Cowling - Bass, Cello\nNigel Pergum - Percussion, Flute, Oboe, Piano\n\nAudio Archives AACD031","torrent":{"xt":"urn:btih:0517c7fd2dd7d01e852d5ff7e3fdc458c54f494b","amp;dn":"Gnidrolog+-+In+Spite+Of+Harry%5C%27s+Toenail+1972+%28Rare+UK+Prog%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0517c7fd2dd7d01e852d5ff7e3fdc458c54f494b","infoHashBuffer":{"type":"Buffer","data":[5,23,199,253,45,215,208,30,133,45,95,247,227,253,196,88,197,79,73,75]},"announce":[],"urlList":[]}}