{"title":"Elizabeth I and Mary Queen of Scots (Unabridged)","uid":4614069,"size":357636090,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:056733d134c6a38b84b9151d68c3baf8996efcd6&amp;dn=Elizabeth+I+and+Mary+Queen+of+Scots+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"sheila6","files":17,"time":1230745026,"description":"Audio Books : Misc. Educational : Other quality : English\n\n\n\nAuthor Jane Dunn\n\nRead by Donada Peters\n\nDuration: 19:51:51\n\n\n\nThe first dual biography of two of the world's most remarkable women - Elizabeth I of England and Mary Queen of Scots - by one of Britain's &quot;best biographers&quot; (The Sunday Times). \n\nIn a rich and riveting narrative, Jane Dunn reveals the extraordinary rivalry between the regal cousins. It is the story of two queens ruling on one island, each with a claim to the throne of England, each embodying dramatically opposing qualities of character, ideals of womanliness (and views of sexuality) and divinely ordained kingship. \n\nAs regnant queens in an overwhelmingly masculine world, they were deplored for their femaleness, compared unfavourably with each other and courted by the same men. \n\nBy placing their dynamic and ever-changing relationship at the centre of the book, Dunn illuminates their differences. \n\nElizabeth, inheriting a weak, divided country coveted by all the Catholic monarchs of Europe, is revolutionary in her insistence on ruling alone and inspired in her use of celibacy as a political tool - yet also possessed of a deeply feeling nature. \n\nMary is not the romantic victim of history but a courageous adventurer with a reckless heart and a magnetic influence over men and women alike. Vengeful against her enemies and the more ruthless of the two queens, she is untroubled by plotting Elizabeth's murder. \n\nElizabeth, however, is driven to anguish at finally having to sanction Mary's death for treason.","torrent":{"xt":"urn:btih:056733d134c6a38b84b9151d68c3baf8996efcd6","amp;dn":"Elizabeth+I+and+Mary+Queen+of+Scots+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056733d134c6a38b84b9151d68c3baf8996efcd6","infoHashBuffer":{"type":"Buffer","data":[5,103,51,209,52,198,163,139,132,185,21,29,104,195,186,248,153,110,252,214]},"announce":[],"urlList":[]}}