{"title":"Nirvana - Incesticide (1992) [LOSSLESS FLAC][Tntvillage]","uid":5311935,"size":320967814,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0577264c2898f4b22cef54a98e36d9aa4a64dc8c&amp;dn=Nirvana+-+Incesticide+%281992%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RDaneel20","files":19,"time":1264593059,"description":"Nirvana - Incesticide (1992) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\n\nNirvana - Incesticide\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: Incesticide\nYears: 1992\nGenre: Grunge\nProduction: Geffen - Sub Pop\n\n\n\n[::Tracklist::]\n\n\n\n1. Dive - 3:56\n2. Sliver - 2:16\n3. Stain - 2:41\n4. Been A Son - 1:55\n5. Turnaround - 2:19\n6. Molly's Lips - 1:54\n7. Son Of A Gun - 2:48\n8. (New Wave) Polly - 1:48\n9. Beeswax - 2:50\n10. Downer - 1:44\n11. Mexican Seafood - 1:55\n12. Hairspray Queen - 4:13\n13. Aero Zeppelin - 4:41\n14. Big Long Now - 5:04\n15. Aneurysm - 4:36\n\n\n\n\n\n[::Review::]\n\nNirvana was an American rock band that was formed by singer/guitarist Kurt Cobain and bassist Krist Novoselic in Aberdeen, Washington in 1987. Nirvana went through a succession of drummers, the longest-lasting being Dave Grohl, who joined the band in 1990.\nWith the lead single &quot;Smells Like Teen Spirit&quot; from the band's second album Nevermind (1991), Nirvana entered into the mainstream, bringing along with it a subgenre of alternative rock called grunge. Other Seattle grunge bands such as Alice in Chains, Pearl Jam, and Soundgarden also gained popularity, and as a result, alternative rock in general became a dominant genre on radio and music television in the United States during the early-to-mid-1990s. As Nirvana's frontman, Kurt Cobain found himself referred to in the media as the &quot;spokesman of a generation&quot;, with Nirvana the &quot;flagship band&quot; of Generation X. Cobain was uncomfortable with the attention and placed his focus on the band's music, believing the band's message and artistic vision to have been misinterpreted by the public, challenging the band's audience with its third studio album In Utero (1993).\nNirvana's brief run ended with Cobain's death in April 1994, but the band's popularity continued in the years that followed. In 2002, &quot;You Know You're Right&quot;, an unfinished demo from the band's final recording session, topped radio playlists around the world. Since their debut, the band has sold over twenty-five million albums in the US alone, and over fifty million worldwide.\nIncesticide is a compilation album by the American grunge band Nirvana. Incesticide consists of demos, outtakes, and radio broadcast recordings. At the time, all of the material on Incesticide was circulating within fan communities (albeit in lower quality). It was widely reported in the music press that the band wanted to offer fans a higher-quality alternative but in the book Cobain Unseen, Charles R. Cross reveals that Kurt Cobain agreed to the release of this compilation because he was allowed complete control over the album's artwork. The album was released on December 14, 1992 in Europe, and December 15, 1992 in the U.S. Incesticide debuted at fifty-one and eventually reached number thirty-nine on the Billboard 200.\nIncesticide was released on December 14, 1992 in the United Kingdom, and on December 15, 1992 in the United States. The record label, Geffen, decided against heavily promoting the album, possibly to avoid a &quot;Nirvana burnout&quot; as the band had released Nevermind and four singles in the preceding fifteen months. Despite this lack of promotion and being a collection of old material, Incesticide debuted at number 51 in the Billboard 200 and sold 500,000 copies in two months. The cover art was painted by Cobain, who is credited as Kurdt Kobain in the liner notes. The rubber duck seen on the album's back cover also belonged to Cobain.\nThe first several pressings of the album contained liner notes written by Cobain. Versions of the album containing the liner notes by Cobain could be found at record stores as late as 1998. Initial copies in the US and Canada also contained a &quot;Parental Advisory: Explicit Lyrics&quot; sticker. ","torrent":{"xt":"urn:btih:0577264c2898f4b22cef54a98e36d9aa4a64dc8c","amp;dn":"Nirvana+-+Incesticide+%281992%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0577264c2898f4b22cef54a98e36d9aa4a64dc8c","infoHashBuffer":{"type":"Buffer","data":[5,119,38,76,40,152,244,178,44,239,84,169,142,54,217,170,74,100,220,140]},"announce":[],"urlList":[]}}