{"title":"Crime Scene to Court - The Essentials of Forensic Science 2nd ed","uid":6649804,"size":33688317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05c3d74c3c97873b1d920f93ad6c256eedfd604a&amp;dn=Crime+Scene+to+Court+-+The+Essentials+of+Forensic+Science+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315094648,"description":"Forensic science has been variously described as fascinating, challenging and even frightening. If you have only a vague concept of what forensic science is, this book will provide the answer. Aimed at non-scientists, or those with limited scientific knowledge, Crime Scene to Court covers all three main areas of an investigation where forensic science is practised, namely the scene of the crime, the forensic laboratory and the court. Coverage includes details of how crime scene and forensic examinations are conducted in the United Kingdom, the principles of crime scene investigations and the importance of this work in an investigation, and courtroom procedures and the role of the expert witness. The latest methods and techniques used in crime scene investigation and forensic laboratories are reported, cases are presented to illustrate why and how examinations are performed to generate forensic evidence and there is a bibliography for each chapter which provides further material for those readers wishing to delve deeper into the subject. This revised and updated edition also includes coverage on changes in professional requirements, the latest developments in DNA testing and two new chapters on computer based crimes and Bloodstain Pattern Analysis. Ideal for those studying forensic science or law, the book is intended primarily for teaching and training purposes. However, anyone with a role in an investigation, for example police, crime scene investigators or indeed those called for jury service, will find this text an excellent source of information. \n\n\n\n# Paperback: 470 pages\n# Publisher: Royal Society of Chemistry; 2nd Revised edition edition (1 July 2004)\n# Language English\n# ISBN-10: 0854046569\n# ISBN-13: 978-0854046560","torrent":{"xt":"urn:btih:05c3d74c3c97873b1d920f93ad6c256eedfd604a","amp;dn":"Crime+Scene+to+Court+-+The+Essentials+of+Forensic+Science+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c3d74c3c97873b1d920f93ad6c256eedfd604a","infoHashBuffer":{"type":"Buffer","data":[5,195,215,76,60,151,135,59,29,146,15,147,173,108,37,110,237,253,96,74]},"announce":[],"urlList":[]}}