{"title":"ConvertXtoDVD 6.0.0.27 + Patch","uid":13577401,"size":52503532,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:065ce798f6f51320e10ff23e30b9acc5fa2ba031&amp;dn=ConvertXtoDVD+6.0.0.27+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rubberboy37","files":1,"time":1455725732,"description":"Creating DVD's is quite a common undertaking nowadays and perhaps this is why there are lots of applications designed to help users in this respect. One of the more and the best populat utlities of this kind is ConvertXtoDVSD and, as it's name suggests, it can convert video's to DVD format.\r\n\r\n\r\n\r\nThe software comes with an eay to use interface that makes all the functions available with one or two clicks and it is not cluttered by may buttons, tabs or menu's. A great thing about this tool is that it supports not only DVD's but also BAlu-Ray discs for both input and output.\r\n\r\n\r\n\r\nWith ConvertXtoDVD you can edit the audio streams, subtitles and disc chapters as well. If you want to check out the modifications of the work in progress, you can use the preview windows on the right side of the main menu.\r\n\r\n\r\n\r\nThere are many menu templates you can choose from and make the DVD look more modern or more classic just as easy. More detailed settings allow you to configure the root menu parameters, including background audio, video or image, the chaper menu and many more.\r\n\r\n\r\n\r\nWhen it comes to the supported file types and sources, ConvertXtoDVD offers a variety of options. It can handle AVI, MKV, DivX,  XviD, MPEG4, MOV, DV, WMV, WMV HD and Video_TS while the input can come from digital video camera's, capture cards, TV or satellite.\r\n\r\n\r\n\r\nIn case you don't want to burn the data to disc, there's always the possibility to save the DVD structure to a folder on yiour hard drive or make and ISO image. ConvertXtoDVD can create disc's in both PAL and NTSC region formats, so the compatibility is ensured for all DVD players out there.\r\n\r\n\r\n\r\nYou can even add .srt subtitles into a film to burning on disc.\r\n\r\n\r\n\r\nAll in all, the application is indeed one that deserves at least a try. Thanks to a solid feature pack, easy to use and quick in processing, ConvertXtoDVSD remains one of the best choices in it's category.\r\n\r\n\r\n\r\nChangelog (Released February 16th 2016):\r\n\r\n- 0010852: [Feature Request] new open style theme: with only still images rather than video thumbnails (felicia) - resolved.\r\n\r\n\r\n- 0011184: [Bug] menu editor - text editor inaccurately says that text does not fit (felicia) - resolved.\r\n\r\n\r\n- 0011182: [Bug] access violation when seeking in menu preview in simulator mode while playing titleset (cedric) - resolved.\r\n\r\n\r\n- 0010995: [Feature Request] improve compatibility with old (v5) menu templates (felicia) - resolved.\r\n\r\n\r\n- 0010919: [Information] display of processing percent of structure &quot;series&quot; show greater than 100% , i.e. 157% (felicia) - resolved.\r\n\r\n\r\n- 0010858: [Information] When menus are being rendered, we get a value higher than 100% on the processing of the render (Series Template) (felicia) - resolved","torrent":{"xt":"urn:btih:065ce798f6f51320e10ff23e30b9acc5fa2ba031","amp;dn":"ConvertXtoDVD+6.0.0.27+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065ce798f6f51320e10ff23e30b9acc5fa2ba031","infoHashBuffer":{"type":"Buffer","data":[6,92,231,152,246,245,19,32,225,15,242,62,48,185,172,197,250,43,160,49]},"announce":[],"urlList":[]}}