{"title":"world History","uid":5038517,"size":69952724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0799a5fb78ae7016f45b8730436baeb262635a28&amp;dn=world+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pirumyan","files":1,"time":1249249852,"description":"This is books regarding the history of many countries. The list is below. Hope you guys will like it. Please continue providing feedback.\n\nHistory\nGreece \nEdward Bulwer-Lytton \nAthens: Its Rise and Fall \nDemosthenes \nOynthiacs and Phillipics \nGodsworthy Lowes Dickinson \nThe Greek View of Life \nHerodotus, translated by by G. C. Macaulay \nVolume 1 \nVolume 2 \nCharles Kingsley \nAlexandria and Her Schools, lectures \nThucydides \nThe Peloponnesian War \nMarcius Willson and Robert Willson \nMosaics of Grecian History \nXenophon (13 books, 3.1 Mbytes) translated by H. G. Dakyns \nAgesilaus \nAnabasis \nApology (very short) \nCavalry General \nCyropaedia \nEconomist \nHellenica \nHiero \nHorsemanship \nMemorabilia \nPolity \nRevenues \nSportsman \nSymposium \nBabylon and Assyria (3 books) \nAssyrian Historiography by Albert Olmstead \nThe Babylonian Story of the Deluge by E.A. Wallis Budge \nThe Religion of Babylonia and Assyria by Theophilus Pinches \nLegends of Babylon and Egypt by Leonard King \nPhoenicia (1 book) \nHistory of Phoenicia by George Rawlinson \nRome \nThomas de Quincey \nThe Caesars \nEdward Gibbon (6 books, 6.6 Mbytes) \nFall of the Roman Empire \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nVolume 5 \nVolume 6 \nArthur Gilman \nThe Story of Rome form the Earliest Times to the End of the Republic \nJohn Lord \nThe Old Roman World \nMarcus Annaeus Lucanus \nPharsalia \nTheodor Mommsen (6 books, 6.8 Mbytes) \nRoemische Geschichte (Roman History, in German) \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nVolume 5 \nVolume 8 (6-7 not yet available) \nRobert Pennel \nAncient Rome from the Earliest Times Down to 476 AD \nSuetonius \nLives of the 12 Caesars and Lives of Grammarians, Rhetoricians, and Poets \nBoth Greece and Rome \nPlutarch \nEssays and Miscellanies \nLives, translated by A.H. Clough, includes 50 biographies, 23 Greek, 23 Roman, 2 others; originally published in 5 volumes \nByzantine Empire \nInstitutes of Justinian, translated by J.B. Moyle history/ancient/institutes of justinian.txt \nAustralian History (17 books)\nAn Address to the Inhabitants Of The Colonies, established in New South Wales And Norfolk Island in 1792 by Richard Johnson (short) \nThe Art of Living in Australia by P.E. Muskett \nAustralia Twice Traversed. The Romance of Exploration, Being a Narrative Compiled from the Journals of Five Exploring Expeditions into and Through Central South Australia and Western Australia from 1872 to 1876 by \nErnest Giles \nAustralian Legendary Tales, Folk Lore of the Noongahburrahs as told to the Piccaninnies, collected by Mrs. K. Langloh Parker \nAustralian Search Party by Charles Henry Eden \nEarly Australian Voyages by John Pinkerton \nThe Euahlayi Tribe--A Study of Aboriginal Life in Australia by Mrs. K. Langloh Parker \nThe Expedition to Botany Bay by Watkin Tench \nJournal of an Overland Expdition in Australia 1844-1845 by Ludwig Leichhardt \nJournals of an Expedition of Discovery into Central Australia by Edward Eyre \nJournals of Two Expeditions into the Interior of New South Wales by John Oxley \nA Lady's Visit to the Gold Diggings of Australia in 1852-53, by Mrs. Charles (Ellen) Clacy \nNarrative of the Overland Expedition of the Messrs. Jardine by Frederick Byerley \nThe Settlement at Port Jackson by Watkin Tench \nSuccessful Exploration through the Interior of Australia by William John Wills \nTwo Expeditions into the Interior of Southern Australia During the Years 1828-1831 by Charles Sturt \nVolume 1 \nVolume 2 \nBritish History\nThe Anglo-Saxon Chronicle (c. 890) translated by James Ingram \nA Child's History of England by Charles Dickens \nThe Corporation of London: Its Rights and Privileges by William Allen \nDiary and Letters of Madame d'Arblay \nvolume 1, 1778-1787 \nvolume 2, 1787-1792 \nEminent Victorians by Lytton Strachey \nEngland Under the Tudors by Arthur Innes \nThe Evoluton of an Empire: a Brief Historical Sketch of England by Mary Parmele \nThe Great Boer War by Arthur Conan Doyle \nHistory Of The Britons (Historia Brittonum) c. 800 AD, by Nennius, Translated by J. A. Giles \nThe History of England from the Accession of James II by Thomas Babbington, Lord Macaulay \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nVolume 5 \nHistory of King Charles II of England by Jacob Abbott \nThe History of England by A.F. Pollard \nHistory of James II by Charles James Fox \nIndian Frontier Policy by General Sir John Adye \nInns and Taverns of Old London by Henry Shelley \nLandholding in England by Joseph Fisher \nLife of the Edward Earl of Clarendon [17th century] volume 2 by Henry Craik \nLife of Horatio Lord Nelson by Robert Southey \nLife of Her Most Gracious Majesty the Queen [Victoria], Volume 2, by Sarah Tyler \nMemoirs of Lady Fanshawe \nQueen Victoria by Lytton Strachey \nQueen Victoria, Her Girlhood and Womanhood by Grace Greenwood \nReminiscences of Captain Gronow by Captain Rees Howell Gronow, Formerly of the Grenadier Guards, and \nM.P. for Stafford: being Anecdotes of the camp, the court, and the clubs, at the close of the last war with France. \nRelated by himself. \nSelections, Speeches and Writings of Edmund Burke \nShort History of Wales by Owen M. Edwards \nSpeech on Conciliation with America by Edmund Burke \nSpeeches and Questions of Public Policy, Volume 1, by John Bright \nTen Englishmen of the Nineteenth Century by James Richard Joy \nTravels in England in 1782 by Charles Moritz \nWilliam Ewart Gladstone by James Bryce \nWilliam the Conqueror by E.A. Freeman \nYoung Folk's History of England by Charlotte Yonge \nIrish History \nThe Irish Race in the Past and the Present by Rev. Aug. J. Thebaud \nLife of St. Declan of Ardmore, translated from the Irish by Rev. P. Power \nA Popular History of Ireland by Thomas D'Arcy McGee \nWelsh History \nDescription of Wales by Giraldus Cambrensis \nItinerary of Baldwin in Wales by Giraldus Cambrensis \nWild Wales: Its People, Language, and Scenery by George Borrow \nCanadian History (25 books)\nThe British North America Act 1857 \nCanada and the States by E.W. Watking \nThe Canadian Dominion by Oscar Skelton \nCharter and Supplemental Charter of the Hudson's Bay Company (short) \nChronicles of Canada, Edited by George M. Wrong and H. H. Langton, In thirty-two volumes \nVolume 1, the Dawn of Canadian History: a Chronicle of Aboriginal Canada  by Stephen Leacock \nVolume 2, the Mariner of St. Malo, a Chronicle of the Voyages of Jacques Cartier by Stephen Leacock \nVolume 3, the Founder of New France by Charles Colby \nVolume 4, the Jesuit Missions: a Chronicle of the Cross in the Wilderness by Thomas Guthrie Marquis \nVolume 5, the Seigneurs of Old Canada: a Chronicle of New-World Feudalism by William Bennett Munro \nVolume 6, the Great Intendant: A Chronicle of Jean Talon in Canada 1665-1672 by Thomas Chapais \nVolume 7, the Fighting Governor: a Chronicle of Fronteac by Charles Colby \nVolume 8, the Great Fortress, Louisburg 1720-1760 by William Wood \nVolume 9, the Acadian Exiles by Arthur Doughty \nVolume 10, the Passing of New France by William Wood \nChignecto Isthmus: First Settlers by Howard Trueman \nThe Conquest of New France, a Chronicle of the Colonial Wars by George Wrong \nCount Frontenac and New France Under Louis XIV by Francis Parkman \nFour Canadian Highwaymen by Edmund Collins \nIntellectual Development of the Canadian People by John Bourinot \nA Lady's Life on a Farm in Manitoba by Mrs. Cecil Hall \nLegends of Vancouver by E. Pauline Johnson \nLife in Canada 50 Years Ago by Caniff Haight \nThe Lure of the Labrador Wild by Dillon Wallace \nOfficial Report of the Exploration of the Queen Charlotte Islands \nOver the Border: Acadia by Eliza Chase \nOwindia, A True Tale of the MacKenzie River Indians by Charlotte Bompas (short) \nPioneers of France in the New World by Francis Parkman \nTreaties of Canada with the Indians of Manitoba and the Northwest Territories by Alexander Morris \nA Trip to Manitoba by Mary Fitzgibbon \nTwo Months in the Camp of Big Bear by Theresa Gowandlock and Theresa Delaney \nVoyages of Samuel de Champlain \nVolume 1 \nVolume 2 \nVolume 3 \nWhy and How: as Handbook for the USe of the WCT Unioins in Canada by Addie Chisholm \nA Woman's Way Through Unknown Labrador: An Account of the Exploration of the Nascaupee and George Rivers by Mrs. Leonidas Hubbard, Junior \n \nChinese History (16 books)\nA Bit of Old China by Charles Warren Stoddard (short) \nAmong the Tibetans by Isabella Bird \nAncient China Simplified by Edward Harper Parker \nThe Book of Tea by Kakuzo Okakura \nChina by Demetrius Boulger \nChina and the Manchus by Herbert Giles \nThe Chinese Boy and Girl by Isaac Taylor Headland \nChinese Sketches by Herbert Giles \nThe Civilization of China by Herbert Giles \nCourt Life in China by Isaac Taylor Headland \nDiary of a Pedestrian in Cashmere and Tibet by Captain Knight \nThe Fight for the Republic in China by L. Putnam Weale \nNew Forces in Old China by Arthur Judson Brown \nA Record of Buddhistic Kingdoms, Being an Account by the Chinese Monk Fa-Hien of his Travels in India and Ceylon (A.D. 399-414) in Search of the Buddhist Books of Discipline \nReligions of Ancient China by Herbert Giles \nSeven Maids of Far Cathay. Being English Notes from a Chinese Class Book \nTea Leaves by Francis Leggett and Company \nDanish History (1 book)\nThe Danish History, Books I-IX by Saxo Grammaticus (&quot;Saxo the Learned&quot;) fl. Late 12th - Early 13th Century A.D. \nExploration in Africa, Asia, Antarctica, the Arctic, and the South Pacific (31 books)\nRoald Amundsen \nThe South Pole \nVolume 1 \nVolume 2 \nSamuel White Baker \nThe Albert N'Yanza, Great Basin of the Nile And Explorations of the Nile Sources \nCyprus as I Saw It in 1879 \nEight Years' Wanderings in Ceylon \nIn the Heart of Africa \nNile Tributaries of Abyssinia and the Sword Hunters of the Hamran Arabs \nThe Rifle and the Hound in Ceylon \nIsabella Bird \nHawaiian Archipelago \nRichard Burton \nFirst Footsteps in East Africa \nThe Land of Midian \nVolume 1 \nVolume 2 \nThe Life of Sir Richard Burton by Thomas Wright \nThe Kasidah of Haji Abdu El-Yezdi, translated by Richard Burton \nwithout accents \nwith accents \nPersonal Narrative of a Pilgrimage to Al-Madinah and Meccah \nVolume 1 \nVolume 2 \nTwo Trips to Gorilla Land and the Cataracts of the Congo \nVolume 1 \nVolume 2 \nAndrew Carnegie \nRound the World \nWinston Churchill (American cousin of Sir Winston Churchill) \nThe River War: An Account of the Reconquest of the Sudan \nMarquess of Dufferin (1 book) \nLetters from High Latitudes, Being some account of a voyage in 1856 of the schooner yacht &quot;Foam&quot; to Iceland, Jan Meyen, and Spitzbergen, by the \nWilliam Gilder \nSledging in the Arctic in Quest of the Franklin Records \nRichard Hakluyt (3 books) \nThe Discovery of Muscovy \nVoyager's Tales \nVoyages in Search of the Northwest Passage \nJ.D. Hooker \nHimalayan Journals \nMary Kingsley \nTravels in West Africa \nDavid Livingstone (3 books, 3.3 Mbytes) \nHow I Found Livingstone by Henry Stanley \nMissionary Travels and Researches in South Africa \nA Popular Account of Dr. Livingstone's Expedition to the Zambesi and its Tributaries and the Discovery of Lakes Shirwa and Nyassa 1858-1864 \nSir Douglas Mawson \nThe Home of the Blizzard (about Australian expedition to Antarctica 1911-1914) \nMungo Park \nTravels in the Interior of Africa \nVolume 1 \nVolume 2 \nJohn Patteson \nThe Life of John Coleridge Patteson, Missionary Bishop of the Melanesian Islands by Charlotte Yonge \nSir Walter Raleigh (1 book, 200 Kbytes) \nThe Discovery of Guiana \nScott \nThe Voyages of Captian Scott by Charles Turley \nErnest Thompson Seton \nThe Arctic Prairies: a Canoe Journey \nErnest Shackleton (1 book, 800 Kbytes) \nSouth: the Story of Shackleton's Last Expedition 1914-1917 \nJohn Hanning Speke (1 book, 1.1 Mbytes) \nThe Discovery of the Source of the Nile \nWalter Traprock (1 book, 140 Kbytes) \nThe Cruise of the Kawa -- Wanderings in the South Seas \nH. Wilfrid Walker (1 book, 300 Kbytes) \nWanderings Among South Sea Savages And in Borneo and the Philippines \nFrench History\nCrusades (1 book, 290 Kbytes) \nChronicle of the Fourth Crusade by Geoffrey de Villehardouin \nJoan of Arc (3 books, 1.4 Mbytes) \nJeanne d'Arc: Her Life and Death by Mrs. Oliphant \nPersonal Recollections of Joan of Arc by Mark Twain \nVolume 1 \nVolume 2 \nAncien Regime (52 books, 7.5 Mbytes) \nAncien Regime, lectures by Charles Kingsley \nMemoirs of Marguerite de Vaolis, Queen of Navarre, Written by Herself, Being Historic Memoirs of the Courts of France and Navarre (3 volumes in one file) \nMemoirs of Jean Francois Paul de Gondi, Cardinal de Retz, Written by Himself, Being Historic Court Memoirs of the Great Events during the Minority of Louis XIV. and the Administration of Cardinal Mazarin. (4 volumes in one file) \nMemoirs of Madame La Marquise de Montespan Written by Herself, Being the Historic Memoirs of the Court of Louis XIV (7 volumes in one file) \nMemoirs of the Court of Louis XIV and of the Regency, Being the Secret Memoirs of the Mother of the Regent, Madame Elizabeth-Charlotte of Bavaria, Duchesse d'Orleans (4 volumes in one file) \nMemoirs of Louis XIV and His Court and of the Regency by the Duck of Saint-Simon (15 volumes in one file) \nMemoirs of Louis XV and XVI Being Secret Memoirs of Madame du Hausset,  Lady's Maid to Madame \nde Pompadour, and of an unknown English Girl and the Princess Lamballe (7 volumes in one file) \nMemoirs of Marie Antoinette by Madame Campan, first lady in waiting to the queen (7 volumes in one file) \nOrigins of Contemporary France, Volume 1, The Ancient Regime by Hippolyte Taine \nBook 1 \nBook 2 \nBook 3 \nBook 4 \nBook 5 \nFrench Revolution (14 books, 5 Mbytes) \nThe French Revolution by Thomas Carlyle \nVolume 1 \nVolume 2 \nVolume 3 \nOrigins of Contemporary France, Volume 2, The French Revolution Volume 1 by Hippolyte Taine \nBook 1 \nBook 2 \nBook 3 \nOrigins of Contemporary France, Volume 3, The French Revolution Volume 2 by Hippolyte Taine \nBook 1 \nBook 2 \nBook 3 \nOrigins of Contemporary France, Volume 4, The French Revolution Volume 3 by Hippolyte Taine \nBook 1 \nBook 2 \nBook 3 \nBook 4 \nBook 5 \nNapoleon \nMemoirs of Court of St. Cloud by Stewarton (7 volumes in one file) \nThe Memoirs of Napoleon Bonaparte by Louis Antoine Fauvelet de Bourrienne, his private secretary, edited by R.W. Phipps (16 volumes, 2.8 Mbytes, in a single file) \nNapoleon Bonaparte by John Abbott \nRecollections of the Private Life of Napoleon by Constant, Premier Valet de Chambre, translated by Walter Clark (12 volumes, 1.7 Mbytes in a single file) \nOrigins of Contemporary France, Volume 5, The Modern Regime/Napoleon Volume 1 by Hippolyte Taine \nBook 1 \nBook 2 \nBook 3 \nBook 4 \nBook 5 \nBook 6 \n19th Century \nFiat Money Inflation in France by Andrew Dickinson White \nIn the Courts of Memory 1858-1875 from Contemporary Letters by L. De Hegermann-Lindencrone \nMemoirs of Prince de Joinville (translated by Lady Mary Cord) \nGeneral \nWorld's Best Histories: France by M. Guizot and Madame Guizot de Witt \nGerman History\nThe Story of Siegfried by James Baldwin \nHistory of Friedrich II of Prussia by Thomas Carlyle \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nVolume 5 \nVolume 6 \nVolume 7 \nVolume 8 \nVolume 9 \nVolume 10 \nVolume 11 \nVolume 12 \nVolume 13 \nVolume 14 \nVolume 15 \nVolume 16 \nVolume 17 \nVolume 18 \nVolume 19 \nVolume 20 \nVolume 21 \nAppendix \nHistory of the Thirty Years' War, Volume 1 by Friedrich Schiller \nLife and Adventures of Baron Trenck by Baron Trenck (circa Friedrich II) \nVolume 1 \nVolume 2 \nSecrets of the German War Office by Armgaard Graves \nGreek (modern)\nA Smaller History of Greece by William Smith \nIcelandic\nAn Icelandic Primer by Henry Sweet (.pdf file) \nVisit to Iceland and the Scandinavian North by Madame Ida Pfeiffer \nIndian History\nA Record of Buddhistic Kingdoms, Being an Account by the Chinese Monk Fa-Hien of his Travels in India and Ceylon (A.D. 399-414) in Search of the Buddhist Books of Discipline \nA Forgotten Empire: Vijayanagar; A Contribution to the History of India by Robert Sewell \nThe Fall of the Moghul Empire of Hindustan, by H. G. Keene \nFrom the Caves and Jungles of Hindostan by Helena Blavatsky \nIndian Frontier Policy by General Sir John Adye \nHistory of Israel\nJosephus \nAgainst Apion \nAntiquities of the Jews \nPart 1 \nPart 2 \nPart 3 \nPart 4 \nPart 5 \nPart 6 \nPart 7 \nExtract from the Greeks Concerning Hades (short) \nLife of Flavius Josephus \nWars of the Jews \nPart 1 \nPart 2 \nPart 3 \nPart 4 \nPart 5 \nPart 6 \nPart 7 \nLegends of the Jews by Louis Ginzberg, translated from German by Henrietta Szold (2 books) \nVolume 1 \nVolume 2 \nProlegomena to the History of Israel by Julius Wellhausen, translated from German by J. Sutherland Black and Allan Menzies \nItalian History\nAutobiography of Benevenuto Cellini \nThe Civilization of the Renaissance in Italy by Jacob Burckhardt \nGiordano Bruno by Walter Pater (short) \nKnights of the Arts: Stories of the Italian Painters by Amy Steedman \nLife of Cesare Borgia by Rafael Sabatini \nNiccolo Machiavelli \nDescription of the Methods Adopted by the Duke Valentino when Murdering Vitellozzo Vitelli, Oliverotto da Fermo, the Signor Pagolo, and the Duke di Gravina Orsini (short) \nThe History of Florence \nLife of Castruccio Castracani of Luccai (short) \nJapanese\nThe Book of Tea by Kakuzo Okakura \nConstitution of Japan 1889 (short) \nConstitution of Japan 1946 (short) \nJapan: an Attempt at Interpretation by Lafadio Hearn \nKwaidan by Lafcadio Hearn \nNoto, an Unexplored Corner of Japan by Percival Lowell \nLatin American History\nChristopher Columbus by Filson Young \nChristopher Columbus by Mildred Stapley \nHistory of the Conquest of Peru by William Prescott \nVanished Arcadia: Being Some Account of the Jesuits in Paraguay 1607 to 1767 by R.B. Cunninghame Graham \nTramping Through Mexico, Guatemala, and Honduras by Harry Franck \nHistory of the Netherlands\nJohn Lothrop Motley \nRise of the Dutch Republic 1555-66 (10 volumes in one file) \nRise of the Dutch Republic 1566-74 (11 volumes in one file) \nRise of the Dutch Republic 1574-84 (11 volumes in one file) \nHistory of the United Netherlands 1584-86 (10 volumes in one file) \nHistory of the United Netherlands 1586-89 (11 volumes in one file) \nHistory of the United Netherlands 1590-99 (11 volumes in one file) \nHistory of the United Netherlands 1600-1609 (11 volumes in one file) \nThe Life of John of Barneveld 1609-1615 \nThe Life of John of Barneveld 1614-1623 \nHistory of the Revolt of the Netherlands by Frederick Schiller \nNorwegian History\nThe Early Kings of Norway by Thomas Carlyle \nHeimskringla or The Chronicle of the Kings of Norway by Snorri Sturlson (c.1179-1241) \nPhilippine History\nThe Bontoc Igorot [in the Philippines] by Albert Ernest Jenks \nHistory of the Philippine Islands, volumes 1 and 2, by Antonio Morga \nLineage, Life, and Labors of Jose Rizal, Philippine Patriot by Austin Craig \nA Study in Tinguian Folklore by Fay-Cooper Cole \nWanderings Among South Sea Savages And in Borneo and the Philippines  by H. Wilfrid Walker \nRussian History\nThe Crisis in Russia by Arthur Ransome \nThe Discovery of Muscovy by Richard Hakluyt \nFrom October to Brest-Litovsk by Leon Trotsky \nRussia by Donald MacKenzie Wallace \nRussia in 1919 by Arthur Ransome \nSouth African History (see also Exploration)\nThe Great Boer War by Arthur Conan Doyle \nNative Life in South Africa by Solomon Tshekisho Plaatje \nSpanish History\nChristopher Columbus by Mildred Stapley \nChristopher Columbus by Filson Young \nHistory of the Reign of Ferdinand and Isabella by William Prescott \nVolume 1 \nVolume 2 \nVolume 3 \nHistory of the Conquest of Peru by William Prescott \nUS History\nColonial period \nChristopher Columbus by Mildred Stapley \nChristopher Columbus by Filson Young \nThe Voyage of the Verazzano by Henry Murphy \nA Briefe and True Report of the New Found Land of Virginia by Thomas Hariot \nEuropean Background of American History 1300-1600 by Edward Potts Cheyney \nThe Mayflower Compact 1620 (short) \nFundamental Orders of 1639 (short) \nThe Whole History of Grandfather's Chair or True Stories form New England History 1620-1808 by Nathaniel Hawthorne \nThe Mayflower and Her Log, July 15, 1620 - May 6, 1621, Chiefly from Original Sources, by Azel Ames \nNarrative of New Netherland ed. by J.F. Jameson \nOriginal Narratives of Early American History \nPioneers of France in the New World by Francis Parkman \nPioneers of the Old South by Mary Johnston \nFirst Thanksgiving Proclamation 1676 (short) \nThe Conquest of the Old Southwest: The Romantic Story of the Early Pioneers into Virginia, The Carolinas, Tennessee, and Kentucky 1740-1790, by Archibald Henderson \nA Half-Century of Conflict, volume 2, by Francis Parkman \nThe Jesuits in North America in the 17th Century by Francis Parkman \n \nRevolution \nAdventures of Colonel Daniel Boone by John Filson (short) \nAutobiography of Benjamin Franklin \nDiary and Letters of Madame d'Arblay volume 1, 1778-1787 \nThe Emancipation of Massachusetts by Brooks Adams \nJames Otis the Pre-Revolutionist by John Clark Ridpath \nThe Life of Francis Marion by W. Gilmore Simms \nThe Life of General Francis Marion by Mason Locke Weems \nSketch of the Life of General Francis Marion by William Dobein James \nSpeech on Conciliation with America by Edmund Burke \nThomas Paine \nThe Age of Reason \nThe American Crisis \nCommon Sense \nThe Rights of Man \nOriginal Writings of Samuel Adams \nVolume 2 of 4 \nVolume 3 of 4 \nVolume 4 of 4 \nGeorge Washington \nThe Life of George Washington, Volume 1, by Washington Irving \n \nEarly Republic \n\nThe American Republic by O.A. Brownson \nAmerican Pioneers and Patriots: David Crockett: His Life and Adventures by John Abbott \nAutobiography of Ma-ka-tai-me-she-kia-kiak or Black Hawk by Black Hawk (re: Black Hawk War of 1832) \nDemocracy in America by Alexis de Tocqueville \nVolume 1 \nVolume 2 \nThe Federalist Papers \nThe Death of the Federalist Party by Richard Seltzer \nFormation of the Union 1750-1829 by Albert Hart \nJefferson \nAutobiography of Thomas Jefferson \nJefferson and His Colleagues, a Chronicle of the Virginia Dynasty by Allen Johnson \nThomas Jefferson by Edward S. Ellis \nThe Life and Adventures of Major Roger Sherman Potter by Pheleg van Trusedale \nThe Life of George Washington, Volume 1, by Washington Irving \nLog-Cabin Lady by anonymous \nJohn Marshall And The Constitution, A Chronicle Of The Supreme Court by Edward S. Corwin \nMinnesota and Dacotah: in letters descriptive of a tour through the northwest in the autumn of 1856 by C.C. Andrews \nOn Nullification and the Force Bill, speech by John C. Calhoun, February 15, 1833 (short) \nOn the Expunging Resolution, speech by Thomas Hart Benton, January 12, 1837 (short) \nOn the Expunging Resolutions, speech by Henry Clay, January 16, 1837 (short) \nOrations by John Quincy Adams \nRise of the New West, 1819-1829 by Frederick Jackson Turner \nOn the Seminole War, speech by Henry Clay, January 19, 1819 (short) \nThe Journals of Lewis and Clark \nThe Oregon Trail by Francis Parkman \nThe Star-Spangeled Banner by John Carpenter (short) \nWebster's March 7 Speech and Secession (1850) \n \nCivil War \nLincoln \nAbraham Lincoln by James Russell Lowell (short) \nThe Boys' Life of Abraham Lincoln by Helen Nicolay \nThe Life of Stephen A. Douglas by William Gardner \nLife of Abraham Lincoln by Henry Ketcham \nLincoln; An Account of His Personal Life, Especially of Its Springs of Action as Revealed and Deepened by the Ordeal of War by Nathaniel Wright Stephenson \nLincoln's Yarns and Stories: A Complete Collection of the Funny and Witty Anecdotes that made Abraham Lincoln Famous as America's Greatest Story Teller, With Introduction and Anecdotes By Colonel Alexander K. McClure \nOur American Cousin, a drama, in 3 acts, by Tom Taylor. Abraham Lincoln was watching this play when he was assassinated. \n(Act III, halfway through Scene 2.) \nWritings of Abraham Lincoln \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nVolume 5 \nVolume 6 \nVolume 7 \nAndersonville: a Story of Rebel Military Prisons by John McElroy \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nThe Army of the Cumberland by Henry Cist \nThe Campaign of Chancellorsville by Theodore Dodge \nCaptains of the Civil War: a Chronicle of the Blue and the Gray by William Wood \nMemoirs of General William T. Sherman \nVolume 1 \nVolume 2 \nThe Great Conspiracy, a History of the Civil War by John Logan \nMilitary Reminiscences of the Civil War by Jacob Cox \nVolume 1 \nVolume 2 \nThe Contest in America (short) John Stuart Mill \nThe Life, Crime, and Capture of John Wilkes Booth by George Alfred Townsend \nOn the Trail of Grant and Lee by Frederick Trevor Hill \nPersonal Memoirs of Ulysses S. Grant \nVolume 1 \nVolume 2 \nPersonal Memoirs of Philip Henry Sheridan \nVolume 1 \nVolume 2 \nRecollections and Letters of General Robert E. Lee by his son Captain Robert E. Lee \nSpeeches of the Honorable Jefferson Davis 1858 \nAfter Civil War \nThe Agrarian Crusade by Solon J. Buck \nAmerica Through the Spectacles of an Oriental Diplomat by Wu Tingfang \nEditorials from the Hearst Newspapers by Arthur Brisbane \nThe Education of Henry Adams by Henry Adams \nFour Months in a Sneak-Box: a Boat Voyage Down the Ohio and Mississippi Rivers 1874-75 by Nathaniel Bishop \nThe Gatlings at Santiago by John Parker \nHistory of the Impeachment of Andrew Johnson by Edmund G. Ross \nHistory of the Donner Party by C.F. McGlashan \nHow Members of Congress are Bribed. An Open Letter. A Protest and a Petition. From a Citizen of California to the United States Congress \nby Joseph H. Moore. (short) \nLetters to His Children by Theodore Roosevelt \nMemoir of the Proposed Territory of Arizona by Sylvester Mowry \nMy Memories of 80 Years by Chauncey Depew \nObservations of a Retired Veteran by Henry Tinsley \nOn Being Human (short) by Woodrow Wilson \nOur War with Spain for Cuba's Freedom by T. White \nPhineas T. Barnum by Joel Benton \nThe Progressive Democracy of James M. Cox by Charles Morris \nThe Sequel to Appomatox: a Chronicle of the Reunion of the States by Walter Lynwood Fleming \nTheodore Roosevelt by Edmund Lester Pearson \nTheodore Roosevelt: an Intimate Biography by William Thayer \nThiry-one Years on the Plains and in the Mountains by William F. Drannan \nWhen a Man Comes to Himself (short) by Woodrow Wilson \nWoman on the American Frontier by William Fowler \nNative American \nAboriginal America  by Jacob Abbott \nAlgonquin Legends of New England by Charles Leland \nAutobiography of Ma-ka-tai-me-she-kia-kiak or Black Hawk by Black Hawk (re: Black Hawk War of 1832) \nConstitution of the Iroquois Nations (short) \nAbout the Iroquois Constitution (short) \nIndian Games, an historical research by Andrew Davis \nIntroduction to the Mortuary Customs of North Americna Indians \nMyths and Legends of California and the Old Southwest by Katharine Berry Judson \nMyths and Legends of the Sioux by Marie L. McLaughlin \nOld Indian Legends, by Zitkala-Sa \nThe Problem of Ohio Mounds Cyrus Thomas \nSequoyah (from Harper's New Monthly) (short) \nTreatise on the Six-Nation Indians by James Bovell MacKenzie \nBlack History \nArmy Life of a Black Regiment by Thomas Higginson \nThe Black Experience in America by Norman Coombs \nThe Future of the Colored Race in America by William Aikman (written during the Civil War) (short) \nFrederick Douglass \nMy Bondage and My Freedom \nMy Escape from Slavery (short) \nNarrative of the Life of Frederick Douglass \nReconstruction \nThe Conservation of Races (short) by W.E.B. Du Bois \nThe Souls of Black Folk by W.E.B. Du Bois \n \nHistorical Documents (all short, except Inaugural Addresses, State of the Union Speeches, and Roosevelt's Fireside Chat, which are book-length) \nRevolution \nCharlotte Town Resolves 1775 \nDeclaration of the Causes and Necessity of Taking Up Arms 1775 \nDeclaration of Independence 1776 \nVirginia Declaration of Rights 1776 \nDeclaration and Resolves of First Continental Congress 1777 \nParis Peace Treaty 1783 \nArticles of Confederation \nAnnapolis Convention 1786 \nArticles of Confederation \nNorthwest Ordinance 1787 \nConstitution \nLetter Transmitting the Constitution 1787 \nConstitution 1787 \nBill of Rights \nAmendments to the Constitution \nEarly Republic \nProclamation of Neutrality 1793 \nTreaty of Greenville 1795 \nWashington's Farewell Address 1796 \nThe Monroe Doctrine 1823 \nCivil War \nThe Emancipation Proclamation 1862 \nLincoln's Gettysburg Address 1863 \nAfter the Civil War \nFirst Open Door Note 1899 \nWorld War II \nAtlantic Charter 1941 \nCairo Conference 1943 \nCasablanca Conference 1943 \nCombat Chronology of US Army Air Forces \nDecember 1942 \nJanuary 1943 \nFebruary 1943 \nMarch 1943 \nApril 1943 \nDeclaration of War on Germany 1941 \nDeclaration of War on Japan 1941 \nDocuments Relevant to France's Response to Germany's Invasion of Poland 1939 \nDocuments Relevant to Germany's Invasion of Poland 1939 \nDocuments Relevant to Great Britain's Response to Germany's Invasion of Poland 1939 \nDocuments Relevant to the Alliance of German, Japan, and Italy \nDocuments Relevant to the Japanese Attack on Pearl Harbor 1941 \nFranklin Delano Roosevelt's Fireside Chats \nFour Freedoms Speech, January 1941 \nGerman Surrender Documents 1945 \nHemispheric Defense 1940 \nJapanese Surrender Documents 1945 \nLend Lease Act 1941 \nMoscow Conference 1943 \nNeutrality Act of 1937 \nNeutrality Act of 1939 \nSoviet-Japanese Neutrality \nSpeech to Congress Regarding the Bombing of Pearl Harbor \nStatement on North African Policy 1942 \nYalta Conference 1945 \nAfter World War II \nU2 Incident 1960 \nViet Nam War \nStatement of Viet Nam Veterans Against the War 1971 \nTonkin Gulf Incident 1964 \nTwo Letters to Ngo Dinh Diem 1954 1961 \nWhite Paper on Viet Nam 1965 \nGeneral \nInaugural Address of George W. Bush 2001 \nInaugural Addresses of U.S. Presidents from Washington to Clinton 1789-1997 (book length) \nState of the Union Speeches 1790-2002 \nSpecial Topics \nCalifornia \nCalifornia 1849-1913 by L. H. Woolley \nCalifornia's 1909 Legislature by Franklin Hichborn \nCalifornia and Californians by David Starr Jordan (short) \nCalifornia Romantic and Resourceful by John Davis \nThe Famous Missions of California by William Henry Hudson \nLegends of San Francisco by George Caldwell \nStarr King in California by William Simmonds \nSan Francisco \nThe City that Was: a Requiem of Old San Francisco by Will Irwin (short) \nThe March of Portola and hte Discovery of the Bay of San Francisco by Zoeth Eldredge \nPalaces and Courts of the Exposition [in San Francisco] by Juliet James \nSan Francisco During the Eventful Days of April, 1906 by James Stetson (short) \nA Sketch of the Causes, Operations, and Results of the San Francisco Vigilance Committee of 1856 (short) by Sephen Webb \nSome Cities and San Francisco and Resurgam by Hubert Howe Bancroft (short) \nThe Vigilance Committee [of San Francisco] of '56 by James O'Meara \nVignettes of San Francisco by Almira Bailey \nArmy Letters from an Officer's Wife by Frances Roe \nCivil Government for Common Schools (New York State) by Henry Northam \nCivil Government of Virginia by William Fox \nCommunity Civics and Rural Life by Arthur Dunn \nAn Essay on the American Contribution to the Democratic Idea by Winston Churchill (American cousin of Sir Winston Churchill) \nFires and Firemen by anonymous, from the Eclectic Magazine of Foreign Literature, Science, and Art 1855 \nGreat Riots of New York 1712 to 1873 by J. T. Headley \nHero Tales from American History by Henry Cabot Lodge and Theodore Roosevelt \nMyths and Legends of Our Own Land by Charles Skinner \nSchool History of North Carolina by John Moore \nThe Old Merchant Marine, a Chronicle of American Ships and Sailors by Ralph Paine \nA Parody Outline of History, Wherein may be found a curiously irreverent treatment of American Historical Events, Imagining them as they would be narrated by American's most characteristic contemporary authors, by Donald Stewart \nThe True Citizen: How to Become One by W.F. Markewick and W.A. Smith \nGeneral \nCanada and the States by E.W. Watking \nThe United States of America, part 1 by Edwin Sparks \nA Brief History of the United States by Barnes and Company \nA Brief History of the United States by John Bach McMaster \nHistory of the United States form 1492-1910, Volume 1, by Julian Hawthorne \nWorld History, including the First World War\nAt Sulva Bay, being the notes and sketches of scenes, characters and adventures of the Dardanelles Campaign, made by John Hargrave, while serving with the 32nd Field Ambulance, X Division, Mediterranean Expeditionary Force, during the Great War \nBeacon Lights of History \nVolume 3 Part 1 -- The Middle Ages \nVolume 3 Part 2 -- Renaissance and Reformation \nThe Coming of the Friars [about Medieval times] by Augustus Jessopp \nDefenders of Democracy by the Militia of Mercy \nThe Expansion of Europe: the Culmination of Modern History by Ramsay Muir \nFamous Affinities of History: the Romance of Devotion by Lyndon Orr \nVolume 1 \nVolume 2 \nVolume 3 \nVolume 4 \nFamous Men of the Middle Ages by John Haaren and A.B. Poland \nThe Fifteen Decisive Battles of The World From Marathon to Waterloo, by Sir Edward Creasy \nGeneral History for Colleges and High Schools by P.V.N. Meyers \nHeroes and Hero Worship by Thomas Carlyle \nHistorical Lectures and Essays by Charles Kingsley \nHistory of Modern Europe 1792-1878 by C.A. Fyffe \nA History of The Nations and Empires Involved and a Study of the Events Culminating in The Great Conflict [First World War] by Logan Marshall \nThe Idea of Progress: an Inquiry into its Origins and Growth by J.B. Bury \nLittle Journeys to the Homes of Great Reformers, volume 9 by Elbert Hubbard \nMedieval Europe by H.W.C. Davis \nMedieval Lore from Bartholomew Anglicus by Robert Steele \nA Political and Social History of Modern Europe 1500-1815, volume 1 by Carlton Hayes \nThe Ruins or Meditation on the Revolutions of Empires and the Law of Nature by C.F. Volney \nSong and Legend from the Middle Ages by William and Porter McClintock \nTales of War [WW1] by Lord Dunsany \nA Traveller in War-Time [WW1] Winston Churchill (American cousin of Sir Winston Churchill) \nWho Was Who: 5000 BC to 1914 edited by Irwin Gordon \n","torrent":{"xt":"urn:btih:0799a5fb78ae7016f45b8730436baeb262635a28","amp;dn":"world+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0799a5fb78ae7016f45b8730436baeb262635a28","infoHashBuffer":{"type":"Buffer","data":[7,153,165,251,120,174,112,22,244,91,135,48,67,107,174,178,98,99,90,40]},"announce":[],"urlList":[]}}