{"title":"Girl - Yeah Right! [DVDRip] [2003] [DrD]","uid":8032970,"size":750793764,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07c11995a18b6871cf5d004c5775b8a798434f08&amp;dn=Girl+-+Yeah+Right%21+%5BDVDRip%5D+%5B2003%5D+%5BDrD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1358460839,"description":"~:: DETAILS ::~\n:: NAME ::\n Girl - Yeah Right!\n:: COUNTRY ::\n USA\n:: CATEGORY ::\n Movie, Sport, Skateboarding\n:: LENGTH ::\n 01:11:47\n:: DIRECTOR ::\n Ty Evans and Spike Jonze\n:: FORMAT ::\n MPEG 352x240 DVDRip\n:: RELEASE ::\n 2003\n\n:: SUMMARY ::\n From Wikipedia: &quot;A short prologue pays tribute to skater Keenan Milton, who died in 2001. Milton was part of Chocolate Skateboards team, a subset of Girl Skateboards.\n\n The introduction credits for the video feature a unique series of shots in ultra-slow motion, filmed with Jonze's personal camera that is capable of shooting 100 frames per second. The camera is low to the ground and very close to the skateboarder as various flip tricks are completed.\n\n Although Yeah Right features mainly skateboarding, there are many special effects used. There are several different scenes in between skaters' parts which make use of green screen technology like the &quot;invisible skateboards&quot; bit and other camera effects such as the &quot;magic board&quot; and the &quot;Skatetrix&quot; bits.\n\n A cameo is made by Owen Wilson. He is in a parking lot with Rick Howard, Eric Koston and Mike Carroll preparing to perform a trick on a handrail. By framing the camera very carefully, it appears that Wilson attempts the extremely difficult trick (a backside bluntslide). However, while the camera was facing the opposite direction for a moment, Wilson had slipped out of the frame and is replaced by Eric Koston who is wearing a wig and matching clothes. Koston performs the trick down the staircase and Wilson reappears in the shot after Koston lands to make it look like he completed the trick.&quot;\n\n The following torrent contains a copy of Girl's &quot;Yeah Right&quot; video featuring the skating talents of: Keenan Milton, Brandon Biebel, Brian Anderson, Marc Johnson, Chico Brenes, Jesus Fernandez, Daniel Castillo, Chris Roberts, Richardo Carvalho, Scott Johnston, Richard Mulder, Kenny Anderson, Mike York, Justin Eldridge, Gino Lannuci, Rob McKinley, Guy Mariano, Rudy Johnson, Tony Ferguson, Jeron Wilson, Rick Howard, Paul Rodriguez, Jereme Rogers, Mike Carroll, Rick McCrank, and Eric Koston.\n\n These skate video torrents can be hard to keep alive. So please, if you download and enjoy this torrent, SEED FOR AS LONG AS YOU CAN!","torrent":{"xt":"urn:btih:07c11995a18b6871cf5d004c5775b8a798434f08","amp;dn":"Girl+-+Yeah+Right%21+%5BDVDRip%5D+%5B2003%5D+%5BDrD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07c11995a18b6871cf5d004c5775b8a798434f08","infoHashBuffer":{"type":"Buffer","data":[7,193,25,149,161,139,104,113,207,93,0,76,87,117,184,167,152,67,79,8]},"announce":[],"urlList":[]}}