{"title":"Le Wood Anal Hazing Crew vol. 4 (2013) [DvdRip].mp4","uid":9194675,"size":1557327683,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:082828c0630735a2ee137fd0b4fe4b5d32371f58&amp;dn=Le+Wood+Anal+Hazing+Crew+vol.+4+%282013%29+%5BDvdRip%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"FluxXxu","files":-1,"time":1384460544,"description":"\nLe Wood Anal Hazing Crew vol. 4 (2013) [DvdRip].mp4\n\n\nScreens\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=25818959243761041758.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=25818959243761041758.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=85817254500685693279.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=85817254500685693279.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://postimg.net/viewerr1.php?file=10248384075916527404.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.net/viewerr1.php?file=10248384075916527404.jpg&lt;/a&gt;\n\n\nCast\n\nCameron Canada, Francesca Le, Jodi Taylor, Mark Wood, Mia Gold, Zoey Monroe\n\n\nDescription\n\n&quot;When couples porn is mentioned, the LeWood production team does not come to mind. That's because the real-life partnership of lovely, American Latina MILF Francesca Le and her well-hung husband, Mark Wood, makes the total opposite of nice, safe, pretty adult movies. These kinky perverts like their sex anal, hard-core, dangerous and raw! In The Le Wood Anal Hazing Crew #4, Mark and Francesca dish out a harsh brand of sexual punishment to several pretty young things, with slapping, choking, face fucking and nasty ass-to-mouth discipline leaving the girls dazed and wrecked. Our sinister swingers run the pep program at the local college. Cheerleader Zoey Monroe's routine is pretty weak, but the frisky blonde agrees to submit to the LeWood crew's ferocious (anal) hazing ritual to get placed on the squad. Mark stuffs both ladies rectums with throbbing meat and face-fucks them ass-to-mouth. Once Zoey's been anally defiled, the new star cheerleader takes a messy load in her hungry mouth. Luscious redhead Jodi Taylor causes offense, implying that Mark and Francesca are old-fashioned and sexually behind the times. They teach her a filthy lesson about the older generation, spanking Jodi's fleshy ass, gagging her on Mark's big boner and sodomizing her until she's a hot, sweaty, sperm-soaked mess. When they discover that school slut Cameron Canada has been sexting their daughter's boyfriend, the couple confronts the blonde tramp, but Cameron won't budge. So Francesca grabs the disrespectful student by her hair and shoves her head down on Mark's prick; soon she's getting viciously drilled, choked and made to worship the angry MILF's pretty bare feet! Finally, cute and clumsy Mia Gold gets painful payback for breaking Francesca's fine china. The older woman spanks the careless slut's soft ass cheeks. Mark brutally sodomizes their tenant until Mia's mouth is filled with hot spunk. The DVD has 17 minutes of tease and interviews with the slutty cast. For the most ruthless backdoor mentoring, see The Le Wood Anal Hazing Crew #4. Sometimes, two wrongs do make a right!&quot;\n\n\nTags\n\nHardcore, XxX, Hot, Cumshot, Blowjob, Feature, Anal, Threesome\n\n\nResolution\n\n720x404\n  \n\nDuration\n\n02:29:05\n   \n\t\nSize\n\n1.45 GB\n      \n\n\n","torrent":{"xt":"urn:btih:082828c0630735a2ee137fd0b4fe4b5d32371f58","amp;dn":"Le+Wood+Anal+Hazing+Crew+vol.+4+%282013%29+%5BDvdRip%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082828c0630735a2ee137fd0b4fe4b5d32371f58","infoHashBuffer":{"type":"Buffer","data":[8,40,40,192,99,7,53,162,238,19,127,208,180,254,75,93,50,55,31,88]},"announce":[],"urlList":[]}}