{"title":"Sunday's Best - The Californian (2002) [FLAC]","uid":9268933,"size":329660210,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:082a0b116a438f35c1fe60d9804d3c72e791579a&amp;dn=Sunday%27s+Best+-+The+Californian+%282002%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1385742653,"description":"\n  Sunday's Best - The Californian (2002) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 The Try\n  02 The Californian\n  03 Don't Let It Fade\n  04 The Salt Mines of Santa Monica\n  05 If We Had It Made\n  06 Our Left Coast Ambitions \n  07 Without Meaning\n  08 Beethoven St.\n  09 Brave, but Brittle...\n  10 Los Feliz Arms\n\n  If there is ever some sort of indie rock awards, someone please make sure Sunday's Best vocalist Ed Reyes gets a nomination for best vocals. No doubt it's easy to overlook, but to a large degree Reyes' tone and melody help carry the L.A. quartet on their sophomore LP for Polyvinyl Records. The music on The Californian is even more stripped down and simplistic than their debut full-length, Poised to Break. Thankfully Reyes has such a heavenly voice, for just about any other vocalist would surely find a way to ruin these pop songs. Sunday's Best has definitely matured, slowing things down and seeming content with good songwriting and hooks galore instead of the dual guitar wankerings and yelling vocals seen on their past works. \n\n  The story behind the album involves lineup changes, divorce, drug abuse and recovery, and everything that comes along with it. That being said, it's easy to understand that there are a few dark undertones on some of the tunes (&quot;Don't Let It Fade,&quot; &quot;The Salt Mines of Santa Monica,&quot; etc.). It's all pretty subtle, but The Californian is one of those pleasant indie pop albums that will fly under the radar with many, but surely deserves a listen by all. And although this theory hasn't been tested, The Californian is most likely a great summer driving record, as is typical of the best indie pop albums. While the front of the album seems to be a bit stronger than the latter half, both parts chime in with the acknowledgement of strong music written well and executed with the capability that only comes with great maturity.","torrent":{"xt":"urn:btih:082a0b116a438f35c1fe60d9804d3c72e791579a","amp;dn":"Sunday%27s+Best+-+The+Californian+%282002%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082a0b116a438f35c1fe60d9804d3c72e791579a","infoHashBuffer":{"type":"Buffer","data":[8,42,11,17,106,67,143,53,193,254,96,217,128,77,60,114,231,145,87,154]},"announce":[],"urlList":[]}}