{"title":"NBA JAM by EA SPORTS v01.00.25 APK + SD DATA","uid":7123383,"size":267918916,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:087f91b04d49b00d4c84f6e845c8518d93fe58c3&amp;dn=NBA+JAM+by+EA+SPORTS+v01.00.25+APK+%2B+SD+DATA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nico2001","files":-1,"time":1332441353,"description":"BOOMSHAKALAKA!!!!\nJam with your favorite stars from all 30 NBA teams in over-the-top, high-flying, 2-on-2 arcade basketball just like you remember it - and like you've never seen before!\n\n** NBA JAM is a larger-than-life game (300MB+), so we strongly recommend connecting to WiFi before downloading. Trust us, this Jam is worth the wait.**\n\nPLAY NOW! PLAY CLASSIC! PLAY HEAD-TO-HEAD AGAINST A FRIEND!\n3 modes of play let you ball the way you want:\n* Play Now - Select a team and jump right into the ballgame.\n* Classic Campaign - Defeat all other teams to win the championship, and unlock legends, hidden players, and outrageous cheats.\n* Local Multiplayer - Go big head 2 big head against a friend via local WiFi or Bluetooth\n\nYOU'RE ON FIRE - ON ANDROID!\nIf you're from the Old School, you'll feel the '90s nostalgia while you play the hottest arcade sports game on the Android Market. Featuring the voice of Tim Kitzrow (the original NBA JAM play-by-play announcer), you'll hear all the classic catchphrases plus a few new ones. This JAM is all about boomshakalaka- and beyond!\nGo to the hole. Go strong. Go for the monster jam. KABOOM!\nDiscover more games from EA like FIFA 12 by EA SPORTS, The Sims FreePlay, and Real Racing 2. See all our games for Android now!\n\nBe the first to know! Get inside EA info on great deals, plus the latest game updates, tips, and more!\nVISIT US: ea.com\n\n","torrent":{"xt":"urn:btih:087f91b04d49b00d4c84f6e845c8518d93fe58c3","amp;dn":"NBA+JAM+by+EA+SPORTS+v01.00.25+APK+%2B+SD+DATA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087f91b04d49b00d4c84f6e845c8518d93fe58c3","infoHashBuffer":{"type":"Buffer","data":[8,127,145,176,77,73,176,13,76,132,246,232,69,200,81,141,147,254,88,195]},"announce":[],"urlList":[]}}