{"title":"R.E.M. - Monster (1994) WMA320","uid":6153660,"size":129274433,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08c79105d635ceb69f83e0609e1df353f3caf314&amp;dn=R.E.M.+-+Monster+%281994%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296963925,"description":"I don't normally write reviews for discs as over-reviewed as this one (109 reviews and counting), but I thought I might be able to offer a different perspective on this album, seeing as how my two favorite REM albums are 'Monster' and 'Murmur', and I find 'Green' unlistenable! This may put me in a special group of REM fans...so let me explain why I love this album so!\nIf 'Automatic' was the first sign that REM was breaking out of the pretentious, chirpy, god-awful bubble gum of 'Green' and 'Out Of Time' by becoming more serious and austere (albeit extremely low-energy), then 'Monster' finished REM's re-emergence as a newer, better-than-ever and extremely hard-rocking ensemble. Gone are any additional instruments (strings, brass, mandolins, etc.), this is just the four REM dudes rocking their socks off. They also seem to be enjoying the new energy level, and that sense of enthusiasm permeates the album. \n\nFor you gloom n' doom fans (me too!) there are still the tormented 'Let Me In' and the wistful and countrified 'Strange Currencies', also the ethereal raga-rock of 'You'. But this album is mostly about the rockers. From 'What's The Frequency, Kenneth?&quot; on, this CD never lets up the loud, buzzing and partified atmosphere. I also like how Stipe sings in a variety of voices, falsetto on 'Tongue', and a Gordon Lightfoot-esque growl for 'Crush With Eyeliner'. Other faves are 'I Took Your Name' and the chugging 'Circus Envy'. The only tune I'm not 100 percent behind is 'King Of Comedy', although it has great lyrics, it's a wee bit grating.\n\nAll in all, if you like REM, AND you like to rock, pick this one up. Used, it's often cheaper than any other album by them (probably due to most fans wanting to hear 'Losing My Religion' redone another 1000 times...). \n\nby winkingtiger &quot;;oD&quot;\n\nTRACKLIST:\n\n01 - What's The Frequency, Kenneth.wma                           \n02 - Crush With Eyeliner.wma                                     \n03 - King Of Comedy.wma                                          \n04 - I Don't Sleep, I Dream.wma                                  \n05 - Star 69.wma                                                 \n06 - Strange Currencies.wma                                      \n07 - Tongue.wma                                                  \n08 - Bang And Blame.wma                                          \n09 - I Took Your Name.wma                                        \n10 - Let Me In.wma                                               \n11 - Circus Envy.wma                                             \n12 - You.wma          \n\nWMA 320Kbps 44100Hz STEREO\n\nDEDICATED TO azza1969","torrent":{"xt":"urn:btih:08c79105d635ceb69f83e0609e1df353f3caf314","amp;dn":"R.E.M.+-+Monster+%281994%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c79105d635ceb69f83e0609e1df353f3caf314","infoHashBuffer":{"type":"Buffer","data":[8,199,145,5,214,53,206,182,159,131,224,96,158,29,243,83,243,202,243,20]},"announce":[],"urlList":[]}}