{"title":"Individuals and Identity in Economics","uid":7318993,"size":1491312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08caa06d26de66baee64b3abfcc8b62bda9d7b7f&amp;dn=Individuals+and+Identity+in+Economics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chami1988","files":-1,"time":1338569747,"description":"English | 2010 | ISBN: 0521173531 | PDF | 270 page\n\n\nThis book examines the different conceptions of the individual that have emerged in recent new approaches in economics, including behavioral economics, experimental economics, social preferences approaches, game theory, neuroeconomics, evolutionary and complexity economics, and the capability approach. These conceptions are classified according to whether they seek to revise the traditional atomist individual conception, put new emphasis on interaction and relations between individuals, account for individuals as evolving and self-organizing, and explain individuals in terms of capabilities.\nThe method of analysis uses two identity criteria for distinguishing and re-identifying individuals to determine whether these different individual conceptions successfully identify individuals. Successful individual conceptions account for sub-personal and supra-personal bounds on single individual explanations. The former concerns the fragmentation of individuals into multiple selves; the latter concerns the dissolution of individuals into the social. The book develops an understanding of bounded individuality, seen as central to the defense of human rights.","torrent":{"xt":"urn:btih:08caa06d26de66baee64b3abfcc8b62bda9d7b7f","amp;dn":"Individuals+and+Identity+in+Economics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08caa06d26de66baee64b3abfcc8b62bda9d7b7f","infoHashBuffer":{"type":"Buffer","data":[8,202,160,109,38,222,102,186,238,100,179,171,252,200,182,43,218,157,123,127]},"announce":[],"urlList":[]}}