{"title":"James Patterson and Maxine Paetro - Private #1 Suspect (2012)","uid":6997194,"size":505638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09121ebb70b4a894b704da31bc6bb4b7f32a2832&amp;dn=James+Patterson+and+Maxine+Paetro+-+Private+%231+Suspect+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Spetses","files":-1,"time":1327883946,"description":"Unsolvable cases\n\nSince former Marine Jack Morgan started Private, it has become the world's most effective investigation firm--sought out by the famous and the powerful to discreetly handle their most intimate problems. Private's investigators are the smartest, the fastest, and the most technologically advanced in the world--and they always uncover the truth.\n\nImpossible murders\n\nWhen his former lover is found murdered in Jack Morgan's bed, he is instantly the number one suspect. While Jack is under police investigation, the mob strong-arms him into recovering $30 million in stolen pharmaceuticals for them. And the beautiful manager of a luxury hotel chain persuades him to quietly investigate a string of murders at her properties. \n\n\n\n\nAbout the Author\nJames Patterson has had more New York Times bestsellers than any other writer, ever, according to Guinness World Records. Since his first novel won the Edgar Award in 1977, James Patterson's books have sold more than 230 million copies. He is the author of the Alex Cross novels, the most popular detective series of the past twenty-five years, including Kiss the Girls and Along Came a Spider. Mr. Patterson also writes the bestselling Women's Murder Club novels, set in San Francisco, and the top-selling New York detective series of all time, featuring Detective Michael Bennett. He writes full-time and lives in Florida with his family.\n\nMaxine Paetro is the author of three novels, two works of nonfiction, and the coauthor of seven books with James Patterson. She lives in New York with her husband.","torrent":{"xt":"urn:btih:09121ebb70b4a894b704da31bc6bb4b7f32a2832","amp;dn":"James+Patterson+and+Maxine+Paetro+-+Private+%231+Suspect+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09121ebb70b4a894b704da31bc6bb4b7f32a2832","infoHashBuffer":{"type":"Buffer","data":[9,18,30,187,112,180,168,148,183,4,218,49,188,107,180,183,243,42,40,50]},"announce":[],"urlList":[]}}