{"title":"Electrelane - The Power Out [2004]","uid":3540660,"size":65797504,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:09a475d8c0553cfbc7c9b8f00fcfbaa4ae50a519&amp;dn=Electrelane+-+The+Power+Out+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BloodyWalls","files":11,"time":1161044893,"description":"Review\tby Heather Phares\n\nElectrelane&amp;#039;s second album, The Power Out, is also their debut for the esteemed, arty British label Too Pure, the perfect home for a band that resembles so many of the imprint&amp;#039;s other acts. The similarities appear early on, with the Stereolab-eqsue motorik and French vocals that drive &quot;Gone Under Sea,&quot; the wobbly-yet-charming singing on &quot;Birds&quot; that recalls Pram&amp;#039;s Rosie Cuckston, and the intricate interplay of guitars and keyboards on every track that bring to mind th&amp;#039; Faith Healers (and their later incarnation, Quickspace). But these similarities are far from derivative; instead, on The Power Out, Electrelane feel like they&amp;#039;re in the tradition of these other messy, angular, decidedly British art-punk bands, so much so that it&amp;#039;s hard to imagine the band on any other label (with all due respect to Mr. Lady, who released Electrelane&amp;#039;s debut, Rock It to the Moon). But even though the group perfectly defines the way that so many British art-school bands have sounded since the late &amp;#039;70s, in Electrelane&amp;#039;s hands it still seems fresh. The Power Out also seems fresher than Rock It to the Moon, perhaps because, paradoxically, it&amp;#039;s more focused than their debut. That&amp;#039;s a relative term, though; the noodly, jam-based feel that dominated Rock It to the Moon is still here, particularly on The Power Out&amp;#039;s more rock-based songs such as &quot;Take the Bit Between Your Teeth&quot; and the closing instrumentals, &quot;Only One Thing Is Needed&quot; and &quot;You Make Me Weak at the Knees.&quot; But overall, the songs are more concise here, giving songs like &quot;On Parade&quot; and the lovely &quot;Enter Laughing&quot; an immediate, if not exactly poppy, feel. The band finds different ways to channel the ambitions it so boldly displayed on Rock It to the Moon: &quot;Oh Sombra!&quot; is an eerie, passionate song fashioned from a sonnet from Spanish poet Juan Boscan, and &quot;This Deed&quot; borrows a line from Nietzsche to fit its appropriately dramatic air. Most striking of all is &quot;The Valleys,&quot; a choral rock piece that features Chicago A Cappella and Verity Sussman&amp;#039;s arresting vocals, and attains a ceremonial, spiritual grandeur that hasn&amp;#039;t been seen in many rock records save the Microphones&amp;#039; Mount Eerie. The Power Out manages to be unique without being a radical departure, and it augurs more good things for Electrelane&amp;#039;s stint with Too Pure. \n &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:zfxvad7kq8w8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:zfxvad7kq8w8&lt;/a&gt;","torrent":{"xt":"urn:btih:09a475d8c0553cfbc7c9b8f00fcfbaa4ae50a519","amp;dn":"Electrelane+-+The+Power+Out+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a475d8c0553cfbc7c9b8f00fcfbaa4ae50a519","infoHashBuffer":{"type":"Buffer","data":[9,164,117,216,192,85,60,251,199,201,184,240,15,207,186,164,174,80,165,25]},"announce":[],"urlList":[]}}