{"title":"Andrews Sisters - 129 Songs","uid":4766388,"size":486135228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a2d24838536a9b77c3f3f0460581655f5fe724f&amp;dn=Andrews+Sisters+-+129+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tamroi","files":130,"time":1236885604,"description":"The Andrews Sisters were the most successful female vocal group of the first half of the 20th century in the U.S. One source lists 113 singles chart entries by the trio between 1938-1951, an average of more than eight per year. They boasted an exuberant, close-harmony style well-suited to cheery novelty songs, and their intricate vocal arrangements and rhythmic ability mirrored the sound of the swing bands that constituted their chief competition in their heyday. But, in a sense, they had no competition. No other female vocal group, and very few male ones, came close to their success from the late '30s to the early '50s, an era when first big bands and then solo singers dominated popular music. Their reign is all the more remarkable given that they swam against the current of contemporary music trends while making it seem effortless. For the most part, the Andrews Sisters did not focus on romantic material, but rather sang upbeat songs, often borrowed from other cultures. Although they were well-established by the time the U.S. entered World War II, their optimistic tenor made them perfect boosters of the war effort, and in later years they remained closely identified with the war years, remembered as wearing military uniforms and singing their signature song, &quot;Boogie Woogie Bugle Boy.&quot; - AMG","torrent":{"xt":"urn:btih:0a2d24838536a9b77c3f3f0460581655f5fe724f","amp;dn":"Andrews+Sisters+-+129+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2d24838536a9b77c3f3f0460581655f5fe724f","infoHashBuffer":{"type":"Buffer","data":[10,45,36,131,133,54,169,183,124,63,63,4,96,88,22,85,245,254,114,79]},"announce":[],"urlList":[]}}