{"title":"Sade - Smooth Operator [Bananas tv show 1984].VOB","uid":6279377,"size":146595840,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0af2cfd64ca686a5353fd0c4b3fe6fc82794f190&amp;dn=Sade+-+Smooth+Operator+%5BBananas+tv+show+1984%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1301382234,"description":"Sade - Smooth Operator [Bananas tv show 1984].VOB\n\n\nVery HQ Bananas tv show promo music video from an outstanding and very rare 1980's tv show from Germany, broadcasted from 1981 to 1984, this is practically unknown in America, but this show has very well known artists of the 1980's.\n\nThe rarity of this show is that, all the appearances of very well known guests are a whole new promo music video production that easly could be considered as never seen before videos or second versions of several classic 80's videos.\n\n&quot;Smooth Operator&quot; is a song by the English group Sade, released as the fourth and final single from their debut album Diamond Life (1984). It was released (in both the U.S. and the UK) as a 7&quot; single with &quot;Spirit&quot; as its B-side, and as a 12&quot; maxi single with &quot;Smooth Operator&quot; and &quot;Red Eye&quot; on side A and &quot;Spirit&quot; on side B. In the U.S. it was the follow-up to &quot;Hang on to Your Love&quot;.\n\nThis was Sade's first Top Ten hit in the U.S., peaking at number five on the Billboard Hot 100 chart for two weeks in May 1985. The song spent thirteen weeks in the Top Forty, and also topped the Billboard Adult Contemporary chart for two weeks. Although &quot;Your Love Is King&quot; remains Sade's biggest hit in the UK to date, &quot;Smooth Operator&quot; is the band's breakthrough hit on the U.S. charts, and their most successful single internationally.\n\nRay St. John, who co-wrote &quot;Smooth Operator&quot; with Sade Adu, was previously a member of Adu's former band Pride, although he was not a member of the band Sade. The pair co-wrote the song in 1982 while still members of Pride, yet did not get around to recording it because St. John left Pride shortly after Sade joined. St. John later went on to play guitar with the band Halo James, which scored a UK Top Ten hit with &quot;Could Have Told You So&quot; in February 1990.\n\n&quot;Smooth Operator&quot; is about a fashionable man who lives a jet-set lifestyle. He is popular with women and breaks many hearts. The lyrics &quot;Coast to Coast/LA to Chicago/Western Male/Across the North and South to Key Largo/Love for sale&quot; imply that he uses women to sustain himself. It is also clear that he does not return the affections of these women, as Adu sings near the end, &quot;His heart is cold.&quot;\n(video has a semi-transparent white &quot;festival&quot; logo at the top right)\n\n\n     &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Smooth_Operator&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Smooth_Operator&lt;/a&gt; \n       &lt;a href=&quot;\nhttp://bayimg.com/CaeApaaDl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/CaeApaaDl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 9641kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:07\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated January 31, 2011\n\n*Media Player Classic Home Cinema*          &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:0af2cfd64ca686a5353fd0c4b3fe6fc82794f190","amp;dn":"Sade+-+Smooth+Operator+%5BBananas+tv+show+1984%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0af2cfd64ca686a5353fd0c4b3fe6fc82794f190","infoHashBuffer":{"type":"Buffer","data":[10,242,207,214,76,166,134,165,53,63,208,196,179,254,111,200,39,148,241,144]},"announce":[],"urlList":[]}}