{"title":"No Greater Ally: The Untold Story of Poland's Forces in World Wa","uid":11433169,"size":14611165,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b1caf45705e35659ab3614dfa303526ad8cb68b&amp;dn=No+Greater+Ally%3A+The+Untold+Story+of+Poland%27s+Forces+in+World+Wa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1415735747,"description":"There is a chapter of World War 2 history that remains largely untold: the story of the fourth largest Allied military of the war, and the only nation to have fought in the battles of Leningrad, Arnhem, Tobruk and Normandy. This is the story of the Polish forces during the Second World War, the story of millions of young men and women who gave everything for freedom and in the final victory lost all. In a cruel twist of history, the monumental struggles of an entire nation have been largely forgotten, and even intentionally obscured. \nAvailable for the first time in paperback, No Greater Ally redresses the balance, giving a comprehensive overview of Poland's participation in World War 2. Following their valiant but doomed defense of Poland in 1939, members of the Polish armed forces fought with the Allies wherever and however they could. With previously unpublished first-hand accounts, information never before seen in English, and rare photographs, this title provides a detailed analysis of the devastation the war brought to Poland, and the final betrayal when, having fought for freedom for six long years, Poland was handed to the Soviet Union","torrent":{"xt":"urn:btih:0b1caf45705e35659ab3614dfa303526ad8cb68b","amp;dn":"No+Greater+Ally%3A+The+Untold+Story+of+Poland%27s+Forces+in+World+Wa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b1caf45705e35659ab3614dfa303526ad8cb68b","infoHashBuffer":{"type":"Buffer","data":[11,28,175,69,112,94,53,101,154,179,97,77,250,48,53,38,173,140,182,139]},"announce":[],"urlList":[]}}