{"title":"Renegade Rapport - Joseph Matthew (Thundercat)","uid":3995570,"size":38284399,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0dc1866033d17cf98db6ea1fe48a5be7b025d48b&amp;dn=Renegade+Rapport+-+Joseph+Matthew+%28Thundercat%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kakko11","files":45,"time":1201294123,"description":"The REAL benefit of Renegade Rapport is that you are actually able to take the rapport you create, and lead it towards sex and seduction! And it all progresses in a very slick, natural way. No memorization! No gimmicks! No routines!\n\nHere?s some of what you?ll learn in the Renegade Rapport course...\n\nHow to instantly create deep rapport with a woman within minutes when you first meet her (and in some cases, BEFORE you even meet her!).\nHow to quickly and easily initiate rapport with anyone you want.\nHow to establish rapport fast.\nHow to know if you really have rapport or not.\nWhat to talk about with women exactly to build rapport.\nHow to &quot;transition&quot; into rapport, step by step.\nHow to keep rapport going throughout the encounter.\nHow to create rapport in a way that&amp;#039;s effortless and hard to detect.\nHow to create rapport without asking a lot of boring &quot;interview&quot; type questions.\nHow to create rapport - even if you&amp;#039;re painfully shy.\nWhy it&amp;#039;s just as easy to gain rapport with super-hot women as it is with average women?\nHow your environment affects rapport building - and how to avoid it&amp;#039;s pitfalls.\nHow to keep rapport with a woman you&amp;#039;ve been with for a long time, and even strengthen it if need be.\nHow you can actually use rapport to know what kind of a girl you are interacting with (this will help you spot &quot;crazy bitches&quot; from a mile away!).\nHow to use rapport to avoid the biggest frustration guys have when it comes to picking up women - Flaking!\nHow to gain rapport without coming off as needy or phony\nHow to use rapport to change a girl&amp;#039;s emotional state from a cold fish to one of intense lust and attraction.\nWhy you can&amp;#039;t have attraction without rapport.\nHow to move the interaction towards seduction once in rapport.\nHow to create rapport when you encounter a group, especially if one or more of them &quot;challenge&quot; you. \nThe exact mindset you should have when talking to a girl you&amp;#039;re interested in.\nHow to build strong rapport with a woman you feel is WAY out of your league.\nHow to build rapport without coming across as being a jerk.\nHow to &quot;rebuild&quot; rapport with women whom you had a failure in building rapport with before.\nHow to keep a woman interested in you while dating so that she doesn&amp;#039;t feel the need for male attention elsewhere.\nHow, and at what point, to shift the vibe to a sexual one when building rapport.\nThe stages of rapport a woman will go through, and the indicators for each.\nHow to initiate and build rapport anywhere - even in a loud and noisy bar or club.\nThe exact things women like to talk about when building rapport.\nGetting past the initial &quot;coldness&quot; when dealing with women.\nHow to make someone feel like they&amp;#039;ve known you for a long time within a few minutes.\nHow to tell if you have rapport.\nHow to gain rapport without falling into the &quot;Let&amp;#039;s Just Be Friends&quot; category.\nAnd much more...\n &lt;a href=&quot;\nhttp://www.renegaderapport.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.renegaderapport.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:0dc1866033d17cf98db6ea1fe48a5be7b025d48b","amp;dn":"Renegade+Rapport+-+Joseph+Matthew+%28Thundercat%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dc1866033d17cf98db6ea1fe48a5be7b025d48b","infoHashBuffer":{"type":"Buffer","data":[13,193,134,96,51,209,124,249,141,182,234,31,228,138,91,231,176,37,212,139]},"announce":[],"urlList":[]}}