{"title":"Weather Report - 08:30 TQMP","uid":5220552,"size":481591241,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0e6f5b55d63393ae46a9b1bd545169301638b543&amp;dn=Weather+Report+-+08%3A30+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"zootallure","files":28,"time":1260912058,"description":"Not my rip, but requested from a friend, so all the credits goes to the original ripper.\n\nHere it is, Breezin!\n\n\nWeather Report is generally regarded as the greatest jazz-fusion band of all time, with the biggest jazz hit (&quot;Birdland&quot;) from the best jazz-fusion album (1977's Heavy Weather). But the group's studio mastery sometimes overshadows the fact that it was also a live juggernaut -- so don't overlook the outstanding live and studio album from 1979, 8:30. This was a rare quartet version of Weather Report, with co-leaders in keyboardist Joe Zawinul and saxophonist Wayne Shorter. The bassist was the inimitable Jaco Pastorius, the drummer a young Peter Erskine. Pastorius is otherworldly on early gems like &quot;Black Market,&quot; the breakneck &quot;Teen Town,&quot; and his solo showcase, &quot;Slang&quot; (in which he quotes Jimi Hendrix' &quot;Third Stone From the Sun&quot;). Shorter is most involved on the CD's slower pieces like &quot;A Remark You Made,&quot; &quot;In a Silent Way,&quot; and his own solo piece, &quot;Thanks for the Memory&quot;; Zawinul and Erskine shine on the swinging version of &quot;Birdland&quot; and roller coaster ride of &quot;Badia/Boogie Woogie Waltz Medley.&quot; Four studio tracks (composing what was side four of the original album version) close 8:30 with a flourish -- and some surprises. Pastorius duets on drums with Zawinul on the brief title track, then plays double drums with Erskine (as Erich Zawinul plays percussion) on the playful &quot;Brown Street.&quot; Zawinul then throws a curve with &quot;The Orphan,&quot; dueting with Shorter as ten members of the West Los Angeles Christian Academy Children's Choir chant harmonies. The saxophonist gets in the last word, though, with his burning composition &quot;Sightseeing&quot; -- on which he plays unison lines with Zawinul over Pastorius' rare walking bassline and Erskine's most aggressive drumming. A future jazz standard ending one of this band's standard-setting CDs. \n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:    &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t\t\t","torrent":{"xt":"urn:btih:0e6f5b55d63393ae46a9b1bd545169301638b543","amp;dn":"Weather+Report+-+08%3A30+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e6f5b55d63393ae46a9b1bd545169301638b543","infoHashBuffer":{"type":"Buffer","data":[14,111,91,85,214,51,147,174,70,169,177,189,84,81,105,48,22,56,181,67]},"announce":[],"urlList":[]}}