{"title":"Confound The Critics - Bodie Hodge","uid":11734740,"size":8653793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0eb352b56ef7f538fed618a7374eff851699e23e&amp;dn=Confound+The+Critics+-+Bodie+Hodge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1425519638,"description":"Ever been asked, ?Can God create a rock so heavy that He cannot lift it?? Your reply is a great opportunity to help someone receive a clearer understanding of who God is and perhaps even help lead him or her to Christ. Insights like this are what make this book so unique compared to other resources. These are real responses to real people, designed to provide information that will make aggressive critics take a step back, consider the truth, and perhaps learn about God along the way!\n\nCan be enjoyed by anyone from skeptics to Christians to scholars\nReplies to actual attacks from email, articles, blogs, debate boards, and other sources\nAs a Christ follower, you will learn how to respond to those critics we all have in our lives.\n\nWhether you want to witness more effectively or give someone seeking truth a resource that will help, Confound the Critics is the perfect choice! And that big rock question? Make sure they are asking about the God of the Bible and then remind them God isn?t bound to the laws - like gravity - of the universe He created!\n\n\nAbout the author:\nMr. Bodie Hodge attended Southern Illinois University at Carbondale and received a B.S. and M.S. in mechanical engineering. His specialty was a subset of mechanical engineering based in advanced materials processing, particularly starting powders. Currently, Bodie is a speaker, writer, and researcher for Answers in Genesis USA. He is the author of The Fall of Satan and co-author of Dragons: Legends &amp; Lore of Dinosaurs","torrent":{"xt":"urn:btih:0eb352b56ef7f538fed618a7374eff851699e23e","amp;dn":"Confound+The+Critics+-+Bodie+Hodge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0eb352b56ef7f538fed618a7374eff851699e23e","infoHashBuffer":{"type":"Buffer","data":[14,179,82,181,110,247,245,56,254,214,24,167,55,78,255,133,22,153,226,62]},"announce":[],"urlList":[]}}