{"title":"NeWest Smart Photo Import v2.2.2","uid":15692493,"size":5744077,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0f15eb361a8444be3d6dee4e6e41c2c8bd5e0c25&amp;dn=NeWest+Smart+Photo+Import+v2.2.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LxByte","files":1,"time":1472418523,"description":"NeWest Smart Photo Import v2.2.2\r\n\r\nSort the Chaos in your picture files!\r\n\r\nEver experienced that uncomfortable feeling of having your picture files spread all-over your PC, with meaningless names and in highly unorganized fashion?\r\n\r\nUnique in its conception, Smart Import is a Digital Media Importer and Sorter that can assist you in the task of organizing your digital shots.\r\nThe software can perform different tasks, the primary of which is taking photos and videos from your camera or other device (PC Drive, flash, memory cards etc..), and copying/moving them to a chosen destination, while performing  an automatic rename by subject, date or other criteria. It also creates all the specified folder structure, by the criteria you choose.\r\n\r\nYou can choose to organize and rename files by subject, description, date.\r\n\r\nSmart Import browser can display all common picture formats and a very great number of Raw Formats. You can preview, edit and annotate the pictures. During the import operation the program can correct automatically the orientation of the pictures using the Exif information of the files.\r\n\r\nAnother task is reorganizing your existing archive of files on your pc. You can just drag-drop your existing files and folders from windows explorer into Smart Import browser and then reorganize them, by choosing your criteria and moving the files to the better destinations of your choice.\r\n\r\nNot only pictures. Smart Import can reorganize all types of media. You can also apply the reorganizing to non-media formats such as text documents and any format of your choice.\r\n\r\nLoads Fast, Start Viewing your pictures Immediately!\r\nVery Easy to use once you familiarize with its interface.\r\nSupports over 150 digital camera RAW formats. (Click here for the list)\r\nHas File lossless Rotation options with automatic detection\r\nOffers a very comfortable browser with shell capabilities.\r\nHas Undo option to cancel the last import operation\r\nLets you preview how the files will be imported / copied. You can click on each import item and instantly check the file to which it belongs in the browser\r\nOffers flexibility in file renaming and in folder creation. Can create automatically indented folders for each Year/ Month and day of the shot\r\nLets you convert files  into another graphics format.\r\nFinally you can print your picture collections, just like an album, including most important file and exif information.\r\n\r\nOfficial Website: http://www.nwspro.com/products/smart-photo-import.html","torrent":{"xt":"urn:btih:0f15eb361a8444be3d6dee4e6e41c2c8bd5e0c25","amp;dn":"NeWest+Smart+Photo+Import+v2.2.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f15eb361a8444be3d6dee4e6e41c2c8bd5e0c25","infoHashBuffer":{"type":"Buffer","data":[15,21,235,54,26,132,68,190,61,109,238,78,110,65,194,200,189,94,12,37]},"announce":[],"urlList":[]}}