{"title":"The Settlers 7 Deluxe Gold Edition [MULTI]","uid":8200386,"size":6829364089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f4ce24431e20a57b8eeddce14299618daddfd58&amp;dn=The+Settlers+7+Deluxe+Gold+Edition+%5BMULTI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gatasalvaje","files":-1,"time":1362000518,"description":"The Settlers 7 - Los Caminos del Reino Deluxe Gold Edition [MULTI]\n\nPlatform: PC | ISO | 6.3 GB | Medicina Incl | Languages: German, Spanish, French, German, Italian, Dutch, Polish | Developer: Blue Byte | Publisher: Ubisoft | Genre: Strategy, Real Time, Management and thematic (Fantasy ) | Released: 10 Mar 2011 | Pegi: +12\n \nDescription\nChoose your own path to victory in The Settlers 7: Paths to a Kingdom â„¢, the long awaited sequel to the award-winning strategy game. Embark on an exciting quest to create, build and manage your kingdom in the most innovative and customizable version ever created, and not get tired of playing!\n\nImmerse yourself in a captivating story ...\nUnravel an intriguing story and unexpected as you play. Beat your enemies along the ground, your goal is to conquer a kingdom formidable. Defeat ruthless kings, hostile lords and dark knights on your race to victory. Discover hidden traitors in your way and makes enemies into allies to pave the way to victory.\n\nExperience a Vast and Beautiful Kingdom\nA beautiful, colorful world awaits you with a level of detail never seen before!. A prosperous kingdom settlers are lively captivate you from the first moment.\n\nBuilds, develops and manages Your Emerging Domain\nEnjoy a production system construction and deep, rich as they give life to your kingdom of fortified towns, small villages and productive settlers. Making critical decisions as you extend your kingdom. Should you optimize your production chains, build transport systems, construct new buildings or increase worker efficiency?. Each of your decisions is a crucial step towards victory or defeat.\n\nSpecial Issue\nThe Deluxe Gold Edition includes:\n\n13 exclusive maps: 6 multiplayer maps and 7 single player campaigns\nA dozen new buildings. Including the Crypt, Order of Knights and Mina Infernal\nMore than 30 new locations. Including Field of Mandrakes, Treasure Island and Pilgrimage\nCastle forge elements allowing players to make their cities unique and customize their castles: 1 gate, 2 windows, 1 spring, 1 balcony and 1 gargoyle\n System Requirements\nOS: Windows XP, Windows Vista, Windows 7\nProcessor: Intel Pentium 4 2 GHz / AMD XP 2600 + or higher (Intel Core 2 Duo / AMD Athlon 64 X2 recommended)\nMemory: 2 GB (4 GB recommended)\nGraphics: DirectX 9.0c compatible with 256 MB, with support for Shader 3.0 (512 MB recommended) (* see supported list)\nDirectX Â®: DirectX 9.0c\nHard Drive: 8 GB of free space\nSound: DirectX 9.0c compatible\nPeripherals Supported: Mouse and keyboard compatible with Windows\nInternet: Internet connection with 128 kbps anche band Rise or more\nSupported Graphics Cards at Time of Release:\n\n\nFamily nVidia GeForce 7900/8/9 / GT / GTS / GTX\nFamily ATI Radeon X1900 / HD 2000 / HD 3000 / HD 4000 / HD 5000","torrent":{"xt":"urn:btih:0f4ce24431e20a57b8eeddce14299618daddfd58","amp;dn":"The+Settlers+7+Deluxe+Gold+Edition+%5BMULTI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f4ce24431e20a57b8eeddce14299618daddfd58","infoHashBuffer":{"type":"Buffer","data":[15,76,226,68,49,226,10,87,184,238,221,206,20,41,150,24,218,221,253,88]},"announce":[],"urlList":[]}}