{"title":"King of Fighters - Maximum Impact + Bonus Disc [Ntsc], Ps2","uid":5491910,"size":3160439864,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0fb1abcd3ca5ed6a1dd105dcabd764bec8933ca1&amp;dn=King+of+Fighters+-+Maximum+Impact+%2B+Bonus+Disc+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1271071094,"description":"King of Fighters - Maximum Impact + Bonus Disc for the Ps2          \n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        3D Fighting\nRating:        T (Teen)\nRel. Date      10/12/2004\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Both Game &amp; Bonus Disc were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes: This torrent contains the main ps2 game and behind the scenes Bonus\n               Disc. The Bonus Disc is a DVD5 NTSC Movie including game info and \n               interviews of the People that made the game. The Bonus disc can be\n               played in your Dvd Player, your Ps2, or computer DVD Player. For \n               the bonus disc you don't need a modded Ps2 to watch, but you do \n               need a modded ps2 (or Swap Magic) to play the game however.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nThe Addis gang, which has long controlled Southtown, has been struck a major blow. Their leader, Fate, has been killed by Duke, leader of the newfound Mephistopheles gang. The subsequent warfare between the two gangs has decimated Southtown. In the midst of all this chaos, a new fighting tournament has begun, with claims that it is being sponsored by the Metatron Foundation charity. Twenty fighters step up to the challenge.\n\nKOF: Maximum Impact - Maniax is the first 3D iteration of the venerable King of Fighters series. The game features fourteen returning characters:\n\n* Athena Asamiya \n* Clark Steel \n* Iori Yagami \n* K' \n* Kyo Kusanagi \n* Leona Heidern \n* Mai Shiranui \n* Maxima \n* Ralf Jones \n* Rock Howard \n* Ryo Sakazaki \n* Seth \n* Terry Bogard \n* Yuri Sakazaki \n\nSix new combatants are also available:\n\n* Alba Meira \n* Chae Lim \n* Duke \n* Lien Neville \n* Mignon Beart \n* Soiree Meira \n\nMaximum Impact also features four distinct modes of play:\n\n* Story Mode - Choose a fighter and guide them through a series of fights in the\n  tournament. \n\n* Versus Mode - Face off against an opponent in a 1-vs-1 or 3-vs-3 team match. \n\n* Mission Mode - Go through a series of missions with unique setups and goals in \n  an attempt to unlock additional game features. \n\n* Time Attack Mode - Face the clock as you race to defeat a string of opponents. \n\n\nAs an added bonus this ps2 version comes with a bonus dvd with making-of videos and behind the scenes interviews.\n\n\nFeatures:\n\n* First ever 3D KOF title, developed specifically for the PlayStation 2.\n\n* Extreme 1 on 1 fighting to the max! \n\n* Five exciting modes of play featuring Story Mode, VS Battle, Survival, Practice \n  and Training.\n\n* Over 16 incredible SNK characters featuring returning favorites and all new\n  characters to the franchise.\n\n* Enhanced character movement with the all new sideways feature and 4 different \n  jump moves.\n\n* Spectacular combo moves specific to each character to inflict massive damage.\n\n* Attack your opponent and send them airborne with the new Knock Back Attach \n  feature.\n\n\n\nGame Pics Included.\n\n\nBurn both Ps2 Game and Bonus Disc with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype both Game &amp; Movie to DVD-ROM.\n\n(If your Mod-Chip or Ps2 doesn't support DVD+R, &amp; also If your DVD Player \n doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:0fb1abcd3ca5ed6a1dd105dcabd764bec8933ca1","amp;dn":"King+of+Fighters+-+Maximum+Impact+%2B+Bonus+Disc+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb1abcd3ca5ed6a1dd105dcabd764bec8933ca1","infoHashBuffer":{"type":"Buffer","data":[15,177,171,205,60,165,237,106,29,209,5,220,171,215,100,190,200,147,60,161]},"announce":[],"urlList":[]}}