{"title":"Star_Ruler_v1.0.7.0-VACE","uid":6299323,"size":125565737,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:10536af44caadefc0f5bb67f23371f76da41d420&amp;dn=Star_Ruler_v1.0.7.0-VACE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MAFIAA.","files":28,"time":1302103492,"description":"-      Game Type...: Strategy          # of Disks.: 26  4.77MB  /  /\n&quot;      Released....: April 06th, 2011  Protection.: Money        /  /  7\n..' .' .'\n\n.----------------------------- r e l e a s e info\n\n-  Ever wanted to rule the galaxy? Now's your chance\n'\nTake command of a vast interstellar empire and  safeguard  your species\n.  from total extinction. Prove your species' ingenuity through a deep and\nintricate combat system  where  anything (from individual components on\n.  ships to the stars themselves) is a target of opportunity\n.\n.  Utilize your silver tongue to twist other Empires into submitting under\n:  your galaxy-class wit with a complex and full-featured diplomacy system\nor wheel-and-deal your way to supremacy\n\nResearch  deadly  new  weapons, new  engines,  shields, and more with a\nresearch web whose contents are shuffled with every game\n\nExplore vast  interstellar  phenomenae such as black holes and asteroid\nbelts and exploit them for yourself or destroy them to deny  your foes\n\nMatch your wits with up to 10 online or LAN-linked opponents,  save the\ngame when dawn breaks, and boot it back up at dusk. It isn't over until\nyou say it is\n\nMod the game to  suit  your playstyle  Your weapons,  your ships, your\nrules.  Almost  the  entire  game can be modified  entirely  through an\neditor as simple as notepad. Easily add new models and particle effects\nto the game with a robust set of out-of-the-box developer tools.\n\nFeatures\n\nVast, Procedurally Generated Galaxies:  Choose  however  many systems\nyou desire limited only by the speed of your CPU. Rich, diverse planets\nwhose type, size, number of moons and other characteristics  vary makes\nevery game unique\nIntricate Ship Design  and  Exciting  Combat:  Massive  ship  battles\nfought in real-time with particle effects and  directional  damage with\nfull simulated Newtonian physics.  Individual  ship  components  can be\ncompromised, destroyed, disabled, repaired and renovated\nUnique  Research  System:  Explore  a web-like  research  system with\nunexpected discovereies around every turn. Choose between a structured,\nstatic web or a highly varied web each game\nEasy  to  Use Interface Complex Gameplay: Govern your planets with a\nsimple, yet  powerful  interface  to customize  the  behavior  of  your\nworlds.  Customize  the GUI  via scripting to add new windows or change\nexisting interface behavior\nEngaging AI Opponents:  Choosen  from  various  levels of difficulty,\nwith  optional 'cheating'  AIs.  AIs  will adapt their ship designs and\nstrategies to counter yours\nExtensive  Modding  Support:  Modify  data  files  and scripts in any\neditor. Use developer tools to create particle  effects  and  configure\nimported models.  Smart  use  of  AngelScript  allows  users  to create\nentirely new game modes, gameplay and online experiences\nMultiplayer:  Co-Op,  Team  and  Free-For-All:  Play  with  as  many\ncompetitors  as  your  server  can  manage,  with  drop-in-drop-out\ncompatibility  over  LAN or Internet.  Multiplayer  games can be saved,\nplayed in single-player, and then brought back into multiplayer.\nOriginal Soundtrack by Artem Bank.\n\n..--''&quot;&quot;      .\n.-----------------'------ r e l e a s e notes\ni  i\n1# Unzip, Unrar manually.\n2# Run setup.bat, after thats done hit StarRuler.exe to play\n3# Have phun\n\nRipped: Nothing\n\nNotes : This game require OpenAL and Microsoft Visual C 2008 &amp; 2010\nRedistributable, if you need you can find on redist folder.\n\nRead changes.txt to see the full changelog.\n","torrent":{"xt":"urn:btih:10536af44caadefc0f5bb67f23371f76da41d420","amp;dn":"Star_Ruler_v1.0.7.0-VACE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10536af44caadefc0f5bb67f23371f76da41d420","infoHashBuffer":{"type":"Buffer","data":[16,83,106,244,76,170,222,252,15,91,182,127,35,55,31,118,218,65,212,32]},"announce":[],"urlList":[]}}