{"title":"Evolucion - Richard Dawkins (ePub)","uid":6991307,"size":21216379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1082368a84f3f810a8f86cff1257243cb7fff931&amp;dn=Evolucion+-+Richard+Dawkins+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"betatron","files":-1,"time":1327712035,"description":"Cuando se habla de la Ã‚Â«TeorÃƒÂ­a de la EvoluciÃƒÂ³nÃ‚Â» Ã‚Â¿a quÃƒÂ© nos estamos refiriendo exactamente? Ã‚Â¿Se trata de una hipÃƒÂ³tesis acerca de la presencia del ser humano sobre la tierra? Ã‚Â¿Se trata de una explicaciÃƒÂ³n del origen de la vida? Ã‚Â¿Se trata de una explicaciÃƒÂ³n acerca del por quÃƒÂ© de la variabilidad de las especies? La TeorÃƒÂ­a de la EvoluciÃƒÂ³n es una teorÃƒÂ­a probada que explica tanto el origen de la vida, como la variabilidad de las especies animales y la presencia del ser humano sobre el planeta, a partir de un factor central: la selecciÃƒÂ³n natural no aleatoria.La hipÃƒÂ³tesis de la selecciÃƒÂ³n natural fue presentada como una hipÃƒÂ³tesis por primera vez por Charles Darwin, principalmente en su libro El origen de las especies, de cuya publicaciÃƒÂ³n se cumplen 150Ã‚Âº aÃƒÂ±os en 2009. La hipÃƒÂ³tesis planteada por Darwin hacÃƒÂ­a referencia a la selecciÃƒÂ³n natural de los ejemplares mÃƒÂ¡s aptos para la supervivencia de una especie determinada, de manera que esas caracterÃƒÂ­sticas de los mÃƒÂ¡s aptos fueran transmitidas a su descendencia, siendo este el motivo ÃƒÂºltimo de los cambios morfolÃƒÂ³gicos de las especies animales a favor de unas mayores posibilidades de supervivencia.Richard Dawkins nos ofrece en este libro una brillante y exhaustiva exposiciÃƒÂ³n acerca de la investigaciÃƒÂ³n desarrollada desde los tiempos del propio Charles Darwin hasta nuestros dÃƒÂ­as. El avance de la investigaciÃƒÂ³n biolÃƒÂ³gica, asÃƒÂ­ como la genÃƒÂ³mica y las nuevas tecnologÃƒÂ­as han permitido verificar y confirmar las ideas expuestas por Charles Darwin desde los niveles que llamarÃƒÂ­amos Ã‚Â«macroÃ‚Â», y que podrÃƒÂ­an englobar los ecosistemas y las criaturas vivas que en ellas se encuentran, hasta el nivel Ã‚Â«microÃ‚Â», el ADN, verdadero Ã‚Â«libro de la vidaÃ‚Â», individual y colectiva, en el estÃƒÂ¡n registrados todos los estadios de la evoluciÃƒÂ³n biolÃƒÂ³gica desde los orÃƒÂ­genes hasta los individuos actuales.","torrent":{"xt":"urn:btih:1082368a84f3f810a8f86cff1257243cb7fff931","amp;dn":"Evolucion+-+Richard+Dawkins+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1082368a84f3f810a8f86cff1257243cb7fff931","infoHashBuffer":{"type":"Buffer","data":[16,130,54,138,132,243,248,16,168,248,108,255,18,87,36,60,183,255,249,49]},"announce":[],"urlList":[]}}