{"title":"Seven Ways From Sundown (Western) {Audie Murphy} [1960]","uid":7933117,"size":757115880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:10a10add4c6e881b9da82fa4f5af0bfabd778bf2&amp;dn=Seven+Ways+From+Sundown+%28Western%29+%7BAudie+Murphy%7D+%5B1960%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alien99","files":-1,"time":1355766416,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0054296/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0054296/&lt;/a&gt;\n\nStoryline\n\nAudie Murphy is again the kid who puts on a badge to catch the bad guy, skillfully played by Barry Sullivan. On the way back to town the two develop a curiously close relationship - Sullivan passes up several chances to get away - but in the end Sullivan &quot;asks for it&quot; and Murphy obliges.\n\nUser Review\n\n\nI will not take up space by reviewing what other Viewer's comments have already unanimously echoed -- this is a greatly overlooked and EXCELLENT Western 60's film (as are quite a few of AUDIE MURPHY's films). What I ask of UNIVERSAL DVD Productions is to .... PLEASE WAKE UP ... and to please release some of AUDIE MURPHY's films onto DVD! Did you know that almost NONE of his films have ever even been released onto VHS ... or ... DVD!! How absurd!! The ONLY times I have ever been able to even see these films were (recently) on TMC (a GREAT Channel!!) and several years ago on AMC (before they &quot;sold out&quot; to the Corporate conglomerates and SAVAGELY BUTCHERED their films with gross &quot;commercialization&quot; -- which is pretty SAD for a Company that boasted and prided itself in FILM RESTORATION and PRESERVATION!!). Here are a few of AUDIE's FINE Western titles which I offer to UNIVERSAL for consideration: SEVEN WAYS FROM SUNDOWN, HELL BENT FOR LEATHER, GUNS OF FORT PETTICOAT, COLUMN SOUTH, and RIDE CLEAR OF DIABLO. Thankfully, at least a few of his films ARE available on DVD ... and you should check them out or buy them -- you will NOT be disappointed: DUEL AT SILVER CREEK, NIGHT PASSAGE (with JAMES STEWART!), and NO NAME ON THE BULLET. These films can stand right up there and beside any of the other Classic Western Films!! Thanks for reading. ","torrent":{"xt":"urn:btih:10a10add4c6e881b9da82fa4f5af0bfabd778bf2","amp;dn":"Seven+Ways+From+Sundown+%28Western%29+%7BAudie+Murphy%7D+%5B1960%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10a10add4c6e881b9da82fa4f5af0bfabd778bf2","infoHashBuffer":{"type":"Buffer","data":[16,161,10,221,76,110,136,27,157,168,47,164,245,175,11,250,189,119,139,242]},"announce":[],"urlList":[]}}