{"title":"Madeleine L'Engle 3 of 5 - A Swiftly Tilting Planet [1978]","uid":8289217,"size":421844393,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:10bd04373e2b6b901369b834812669d746db1c5f&amp;dn=Madeleine+L%27Engle+3+of+5+-+A+Swiftly+Tilting+Planet+%5B1978%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1364002144,"description":"Unabridged. 192 kbps\nRead by Madeleine L'Engle herself. \nPublished by: Listening Library\n\nIn this companion volume to A Wrinkle In Time (Newbery Award winner) and A Wind In The Door fifteen-year-old Charles Wallace and the unicorn Gaudior undertake a perilous journey through time in a desperate attempt to stop the destruction of the world by the mad dictator Madog Branzillo. They are not alone in their quest. Charles Wallace's sister, Meg--grown and expecting her first child, but still able to enter her brother's thoughts and emotions by &quot;kything&quot;--goes with him in spirit.\n\nBut in overcoming the challenges, Charles Wallace must face the ultimate test of his faith and will, as he is sent within four people from another time, there to search for a way to avert the tragedy threatening them all. \n\nAmazon.com Review\n\nFifteen-year-old Charles Wallace Murry, whom readers first met in A Wrinkle in Time, has a little task he must accomplish. In 24 hours, a mad dictator will destroy the universe by declaring nuclear war--unless Charles Wallace can go back in time to change one of the many Might-Have-Beens in history. In an intricately layered and suspenseful journey through time, this extraordinary young man psychically enters four different people from other eras. As he perceives through their eyes &quot;what might have been,&quot; he begins to comprehend the cosmic significance and consequences of every living creature's actions. As he witnesses first-hand the transformation of civilization from peaceful to warring times, his very existence is threatened, but the alternative is far worse.\n\nThe Murry family, also appearing in A Wind in the Door and Many Waters, acts as a carrier of Madeleine L'Engle's unique message about human responsibility for the world. Themes of good versus evil, time and space travel, and the invincibility of the human spirit predominate. Even while she entertains, L'Engle kindles the intellect, inspiring young people to ask questions of the world, and learn by challenging. \n- Emilie Coulter\n\nThis is the third book in the Time Quartet series by Madeleine L'Engle.\n\n00 - Outro\n01 - Chapter 01 - In This Fateful Hour\n02 - Chapter 02 - All Heaven With Its Power\n03 - Chapter 03 - The Sun With Its Brightness\n04 - Chapter 04 - The Snow With Its Whiteness\n05 - Chapter 05 - The Fire With All The Strength It Hath\n06 - Chapter 06 - The Lightning With Its Rapid Wrath\n07 - Chapter 07 - The Winds With Their Swiftness\n08 - Chapter 08 - The Sea With Its Deepness\n09 - Chapter 09 - The Rocks With Their Steepness\n10 - Chapter 10 - The Earth With Its Starkness\n11 - Chapter 11 - All These I Place\n12 - Chapter 12 - Between Myself and the Powers of Darkness\n13 - Outro","torrent":{"xt":"urn:btih:10bd04373e2b6b901369b834812669d746db1c5f","amp;dn":"Madeleine+L%27Engle+3+of+5+-+A+Swiftly+Tilting+Planet+%5B1978%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10bd04373e2b6b901369b834812669d746db1c5f","infoHashBuffer":{"type":"Buffer","data":[16,189,4,55,62,43,107,144,19,105,184,52,129,38,105,215,70,219,28,95]},"announce":[],"urlList":[]}}