{"title":"BlitzMax-DVT","uid":10617790,"size":8559582,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:10e19c1d9504518b47bbc00c244194901ae699b2&amp;dn=BlitzMax-DVT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pappons","files":3,"time":1406143684,"description":"BlitzMax is the new, next generation game programming language from Blitz Research. BlitzMax retains the BASIC roots of Blitz3D and BlitzPlus, but adds a ton of cool new features and abilities.\n\nEnhanced BASIC language\n\nBlitzMax is BASIC...but with a few twists, including:\nFunction pointers\nFully dynamic arrays\nInheritance and polymorphism\n'By reference' function parameters\nByte, Short, Int, Long, Float and Double numeric data types\nArray and string slicing\nFlexible 'collection' system for dealing with linked lists etc\nLow level pointer handling\nUTF16 strings\nThe ability to 'Incbin' binary data and access it as easily as if it were a regular file\nExternal language support for interfacing with C/C++/ObjectiveC or assembly code\n\nMultiplatform support\n\nBlitzMax has been designed from the ground up for multiplatform support, and BlitzMax programs can be compiled for Windows, MacOS X and Linux. The BlitzMax license is 'all in one' - buy BlitzMax once and run your programs on all three platforms!\n\nModular design\n\nBlitzMax is largely based around the idea of modules, collections of commands stored in special files. You can add your own modules to the system, allowing you to cleanly reuse code in your own projects. Modules are also a great way to distribute libraries of commands, and Blitz Research have many weird and wonderful modules lined up for future release!\n\nEasy to use 2D command set\n\nBlitzMax includes the Max2D module which contains a set of very easy to use 2D commands. On MacOS X and Linux, Max2D uses the OpenGL API, while on Windows PCs you have the option of using either the OpenGL or DirectX APIs. Both OpenGL and DirectX use 3D hardware to draw graphics to the screen, allowing for advanced effects such as realtime blending, rotation and scaling.\n\nIntelligent build system\n\nBlitzMax allows you to split a project up into multiple source files which can be pre-compiled to massively reduce development time. This process is handled automatically by the included BMK ('Blitz make') utility and is completely transparent to the developer.\n\nIDE and Debugger\n\nThe BlitzMax package includes an 'integrated development environment' (IDE), which is used to enter your programs, and a debugger for tracking down bugs.\n\nDirect OpenGL support\n\nThanks to the OpenGL module, you can use BlitzMax for direct OpenGL programming. Writing an OpenGL program is now as simple as:\nGLGraphics 640,480\n\nWhile Not KeyHit( KEY_ESCAPE )\n\n\tglClear GL_COLOR_BUFFER_BIT\n\n\tglBegin GL_TRIANGLES\n\tglVertex2i 0,1\n\tglVertex2i 1,-1\n\tglVertex2i -1,-1\n\tglEnd\n\n\tFlip\n\nWend\nIn addition, a module based on the popular 'Glew' library provides support for all OpenGL extensions.\n\nTons of source code included\n\nMost BlitzMax modules are written in...BlitzMax! When you buy BlitzMax, you will receive the source code to all the BlitzMax modules, allowing advanced users the opportunity to enhance the BlitzMax system, or tweak it for their own needs.\n","torrent":{"xt":"urn:btih:10e19c1d9504518b47bbc00c244194901ae699b2","amp;dn":"BlitzMax-DVT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10e19c1d9504518b47bbc00c244194901ae699b2","infoHashBuffer":{"type":"Buffer","data":[16,225,156,29,149,4,81,139,71,187,192,12,36,65,148,144,26,230,153,178]},"announce":[],"urlList":[]}}