{"title":"Spijkerhoek.(1989&amp;ndash;1993).Seizoen.06.(3xDvd5).Hollands.Glori","uid":11405243,"size":14061491296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:11074d97dec2d8e78d43e69b21fd1b15c6e639ec&amp;dn=Spijkerhoek.%281989%26ndash%3B1993%29.Seizoen.06.%283xDvd5%29.Hollands.Glori&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hendriknld","files":40,"time":1415471006,"description":"Spijkerhoek\n\nSpijkerhoek was een Nederlandse dramaserie op Veronica vanaf eind jaren '80 en begin jaren '90.\nDe serie Spijkerhoek werd de eerste twee seizoenen uitgezonden door de toenmalige publieke omroep Veronica. Vanaf 1990 - het derde seizoen - wordt de serie uitgezonden door RTL 4. Door Spijkerhoek zijn vele acteurs en actrices bekend geworden in Nederland. Vele buitenopnamen voor Spijkerhoek zijn opgenomen in het historische Amersfoort op de Appelmarkt, de Groenmarkt en op meerdere historische plekken in deze stad. In seizoen 3 en 4 vonden de opnamen plaats aan een drukke weg in Bussum. Zo was het appartementengebouw waar het personage Gerard Verlinden woonde, de huidige openbare bibliotheek in Bussum. De laatste twee seizoenen (5 en 6) vonden voor een groot deel weer plaats in Amersfoort.\nHet appartement van Gerard Verlinden in seizoen 1, 2, 5 en 6 is het voormalig gebouw van de Rijksdienst voor Bodemkundig Onderzoek aan de Muurhuizen/Kerkstraat en grenst aan de Appelmarkt. Tegenwoordig zijn diverse culturele instellingen gevestigd in dit gebouw. Het gebouw heet de Stad van Cahen.\nSpijkerhoek was in de jaren '80 en '90 van de 20e eeuw een kijkcijferhit. Meer dan twee miljoen mensen zaten elke week voor de buis om de belevenissen van onder meer Patty Starrenburg, Gerard Verlinden, Tony Beymer en Willy van de Akker te zien.\nSpijkerhoek was de allereerste serie in Nederland waarin drugs, seks en alcoholverslavingen te zien waren","torrent":{"xt":"urn:btih:11074d97dec2d8e78d43e69b21fd1b15c6e639ec","amp;dn":"Spijkerhoek.%281989%26ndash%3B1993%29.Seizoen.06.%283xDvd5%29.Hollands.Glori","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11074d97dec2d8e78d43e69b21fd1b15c6e639ec","infoHashBuffer":{"type":"Buffer","data":[17,7,77,151,222,194,216,231,141,67,230,155,33,253,27,21,198,230,57,236]},"announce":[],"urlList":[]}}