{"title":"The Cannonball Adderley Quintet - At the Lighthouse (1960) [Jazz","uid":5190589,"size":129150814,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:111f4399a82da9f8ccd03a201c93ada010a98822&amp;dn=The+Cannonball+Adderley+Quintet+-+At+the+Lighthouse+%281960%29+%5BJazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":16,"time":1259626783,"description":"The Cannonball Adderley Quintet - At the Lighthouse\nYear: 1960 (Riverside)\nLabel: Capitol Jazz (24-bit SBM, 2001)\nTotal time: 53:01\nQuality: 320 kbps\n\nThis is a fine all-around set from the Cannonball Adderley Quintet of 1960 with the altoist/leader, cornetist Nat Adderley, pianist Victor Feldman, bassist Sam Jones and drummer Louis Hayes.  The fifth of seven LPs reissued by Orrin Keepnews and taken from Adderley's Riverside years finds his band in top form on the original version of &quot;Sack O' Woe,&quot; a previously unissued &quot;Our Delight,&quot; Jimmy Heath's &quot;Big 'P'&quot; and &quot;Blue Daniel&quot; among others.  It's a strong introduction to the music of this classic hard bop group. ~ Scott Yanow, AMG\n\nAt The Lighthouse is another of the Adderley albums originally recorded on Riverside but taken by Adderley when he left the company for Capitol in 1963.  For a time it was available in the 1990s on Landmark records, producer Orrin Keepnews's label, but this is its first CD release in Britain.  On an album with already generous playing time by vinyl standards, there is an extra track, a workout on Tadd Dameron's &quot;Our Delight&quot;.  That apart, this was a popular record in its day, bringing to Adderley's fans their first recordings by the quintet of &quot;Work Song&quot; and &quot;Sack O'Woe&quot;, two of their biggest early hits.  (&quot;Work Song&quot; first appeared on brother Nat's eponymous Riverside album just before this).  Cannon is his usual imperious self, that beautiful, buoyant tone helping his improvisations glide along.  Nat, as always, is less perfect but more fiery, giving the partnership his own special sensibility.  The superb bass and drums of Sam Jones and Louis Hayes is given a special lift by the new arrival of Victor Feldman on piano.  The audience is quiet (hooray!), Cannon is urbane in his announcements and the recording quality is, for its age, spot-on. ~ Keith Shadwick\n\nPersonnel:\nCannonball Adderley (Alto Saxophone) \nNat Adderley (Cornet) \nVictor Feldman (Piano) \nSam Jones (Double Bass) \nLouis Hayes (Drums) \n\nThe Cannonball Adderley Quintet - At the Lighthouse Tracks:\n01  Sack O' Woe (Julian Adderley) 10:44\n02  Big &quot;P&quot; (Jimmy Heath) 5:54 \n03  Blue Daniel (Frank Rosolino) 7:30 \n04  Azule Serape (Victor Feldman) 9:29 \n05  Exodus (Victor Feldman) 7:40 \n06  What Is This Thing Called Love? (Coler Porter) 4:48 \n07  Our Delight (Tadd Dameron) 6:53","torrent":{"xt":"urn:btih:111f4399a82da9f8ccd03a201c93ada010a98822","amp;dn":"The+Cannonball+Adderley+Quintet+-+At+the+Lighthouse+%281960%29+%5BJazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111f4399a82da9f8ccd03a201c93ada010a98822","infoHashBuffer":{"type":"Buffer","data":[17,31,67,153,168,45,169,248,204,208,58,32,28,147,173,160,16,169,136,34]},"announce":[],"urlList":[]}}