{"title":"Oxford Handbook Of General Practice (2nd Edition)","uid":7955643,"size":12465092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:113f17033e607bfe4418691b97f08fd9731c8b8e&amp;dn=Oxford+Handbook+Of+General+Practice+%282nd+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"shafi3803","files":-1,"time":1356416567,"description":"Oxford Handbook of General Practice (Oxford Medical Handbooks) \n\nGeneral Information\nPublication Date: 17 Dec 2009 \n ISBN-10: 0199236100 \n ISBN-13: 978-0199236107 \n Edition: 3\n\nBook Description\nThe Oxford Handbook of General Practice has been a lifeline for busy GPs since the first edition published in 2002. Covering the whole of general practice, with hands-on advice from experienced practitioners, this essential handbook provides rapid access to information to help with any day-to-day problems which might arise in general practice. \n\nThe new third edition takes into account the significant changes in primary care since publication of the second edition in 2005. Written in line with the new GP curriculum, the authors have provided new material on the GP contract, foundation level doctors in general practice, and training for general practice. \n\nAll chapters have been completely revised and updated throughout, with input from a team of specialist reviewers and contributors. The chapter on child health has been radically updated and specific chapters have now been dedicated to pregnancy and contraception/sexual health. The handbook also includes quick reference practical management boxes for paediatric and elderly patients, a plate section of colour images, and reference to online guidelines and resources. \n\nRevised to include the latest guidelines and management practices, this authoritative handbook is critical reading for all those working in general practice.\n","torrent":{"xt":"urn:btih:113f17033e607bfe4418691b97f08fd9731c8b8e","amp;dn":"Oxford+Handbook+Of+General+Practice+%282nd+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"113f17033e607bfe4418691b97f08fd9731c8b8e","infoHashBuffer":{"type":"Buffer","data":[17,63,23,3,62,96,123,254,68,24,105,27,151,240,143,217,115,28,139,142]},"announce":[],"urlList":[]}}