{"title":"PBS Special - Terry Jones: The Story of 1 (2005.TVRip.SoS)","uid":4064463,"size":417306624,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:11603989f990699c5f6d3e5e4625ee25f504da92&amp;dn=PBS+Special+-+Terry+Jones%3A+The+Story+of+1+%282005.TVRip.SoS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alucard--","files":1,"time":1204739507,"description":"Original PBS airing: 2006.03.29 (2005 BBC Production)\n\nThe story of the number one is the story of Western civilization. Terry Jones (&quot;Monty Python&amp;#039;s Flying Circus&quot;) goes on a humor-filled journey to recount the amazing tale behind the world&amp;#039;s simplest number. Using computer graphics, &quot;One&quot; is brought to life, in all his various guises, in STORY OF 1. One&amp;#039;s story reveals how celebrated civilizations in history were achieved, where our modern numbers came from and how the invention of zero changed the world forever - and saved us from having to use Roman numerals today.\n\nHow old is One? A precise answer is impossible, but a notched bone (called the Ishango bone) found in the Congo proves that he&amp;#039;s been around for at least 20,000 years. His life really took off 6,000 years ago, when the Sumerians turned him into a cone-shaped token and then into the first-ever numeric character, invention that made arithmetic - and therefore city life - possible, providing the means to assess wealth, calculate profits and loss, and, perhaps most important, collect taxes.\n\nA thousand years later in Egypt, time-traveler Jones witnesses the first use of &quot;million,&quot; as well as the invention of formal measurement: Egyptians create their own version of one, the cubit. Without the cubit, some of the wonders of the world might have been ... a little less wonderful. STORY OF 1 gives the viewer a glimpse of how a cubit-challenged pyramid would look.\n\nThen it&amp;#039;s on to ancient Greece, where One was held in high regard. However, his biggest fan, Pythagoras, lost his mind studying him, and the renowned Archimedes was so absorbed in diagrams that he lost his life to an invading Roman. The Romans slew One, too; they had no time for theoretical mathematics. In his new incarnation, &quot;I&quot; became a tool for imposing order.\n\nUnwieldy though they were, Roman numerals would dominate Europe for the next 2,000 years. Jones discovers how the numbers we use today eventually managed to supplant them, making it much easier for us to subtract MDCCLVIII from MDCCCXLIV. It all begins in India, where the symbols for one through nine were invented and where Jones tracks down the first use of &quot;zero.&quot; Here, STORY OF 1 takes a romantic turn. In Zero, One found his perfect mate. It was a union that would change the world.\n\nThen it&amp;#039;s on to Baghdad, where Jones discovers that Muslem scholars were smitten with One and Zero - and two through nine as well. The most famous Muslim scholar, Al-Khwarizmi, and his colleagues taught these performing numerals a whole set of new tricks, feats that enabled science, mathematics and astronomy to reach new heights in the Middle East.\n\nThe Indian numbers were a smash hit across the Islamic world before they were finally brought to Europe, where they met fierce resistance. It took 500 years for the battle between Roman and Indian numbers to play out, but by the 16th century, the Indian figures, now commonly called Arabic numerals, finally triumphed - perhaps because Florentine mathematician Fibonacci showed Christian merchants how useful Indian numerals could be, for instance, for calculating profits.\n\nBut the story doesn&amp;#039;t end there. Within a hundred years, German mathematician Gottfried Leibniz invented a binary system, using the Adam and Eve of mathematics, One and Zero. Since then, as the language of computers, this two-digit binary system has come to dominate every part of modern life.\n\n==\nruntime = 56mins\nxvid.640x480.882kbps.mp3.102.vbr\n\nFederal funding for CPB/PBS is going to be cut significantly over the next two years, so if you watch any of these programs, please support your local PBS Station by making a contribution or by purchasing their DVDs. To help speed up future releases, please try to seed this torrent as much as possible. Thanks.\n== ","torrent":{"xt":"urn:btih:11603989f990699c5f6d3e5e4625ee25f504da92","amp;dn":"PBS+Special+-+Terry+Jones%3A+The+Story+of+1+%282005.TVRip.SoS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11603989f990699c5f6d3e5e4625ee25f504da92","infoHashBuffer":{"type":"Buffer","data":[17,96,57,137,249,144,105,156,95,109,62,94,70,37,238,37,245,4,218,146]},"announce":[],"urlList":[]}}