{"title":"Hans Ruiz - Cicciolina packt aus! XXX DVDRip [.avi]","uid":12283570,"size":772359496,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:11a67b9319fd762aaf77b20f25e54481fce0f9fd&amp;dn=Hans+Ruiz+-+Cicciolina+packt+aus%21+XXX+DVDRip+%5B.avi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"feeldabyte","files":1,"time":1440447969,"description":"Screens &amp; Info :\n\n----------------------------------\n  &lt;a href=&quot;\nhttp://imgkiss.com/image/06rd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgkiss.com/image/06rd&lt;/a&gt; &lt;a href=&quot;\nhttp://imgkiss.com/image/0CzR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgkiss.com/image/0CzR&lt;/a&gt;\n\n----------------------------------\n\nPerformers: Cicciolina, Miss Pomodoro, Ebony Ayes, Rocco Siffredi, Roberto Malone\n\nIn the Beate Uhse release 'Dano Donato' is credited and could refer to Rocco Siffredi, but Peter North is also credited and he does not appear.\nFemale credits are Ilona Staller, Josephine Moon and Gjilian Shell. The male and female credited names do not add up to the total number of participants of all gender categories in any case.\nAmori Particolari transessuali is a superb movie with outstanding performances. This title includes everything from anal, DP and group orgies to some brief pee action, creamy facials and quite unusual shemale sex.\nCicciolina is a writer (creator of comic books?) whose books don't sell well anymore. Her publisher (Roberto Malone) requests her to write some erotica. She requires some visual aids which are given to her by Miss Pomodoro sucking him in his office. Now Cicciolina becomes active. She kneels down with her tongue flicking over the tip of his fleshy cock. The two girls continue for a while before Cicciolina turns around and he sinks his dick right into her asshole. When he's ready to cum he unloads in Cicciolina's mouth and she shares the juice with Miss Pomodoro.\nEncouraged by her good start, she goes to visit Rocco. While she does some drawings she starts thinking of sex with him. In her imagination he caresses her with his tongue and an inverted screwdriver. After a short bj he takes her in the standing position and finishes the scene with a nice facial.\nMalone seems to be in a good mood and throws a party in which five girls and Rocco are involved. A black cutie with huge boobs (the American Ebony Ayes) licks a redhead whose tits are also enormous. Cicciolina tries to take two cocks into her mouth and we see Malone fucking Miss Pomodoro in cowgirl position on a sofa. In the end four girls are lying on the ground with their faces close together. Malone and Siffredi then spurt their spunky loads all over them.\nIn the next scene Cicciolina gets surprised by a burglar. He points a pistol to her head and forces his cock into her mouth. Like every fearless porngirl she seems to fancy blowing burglars and he is allowed to drop a small load on her lips and chin.\nMeanwhile Malone continues his orgy. Sitting in a huge bath tub with a cigar between his lips he is spoiled by the black girl and the redhead. The black cutie is taken from behind as Cicciolina arrives and some moments later two transsexuals join the group. One of them gives the other one a blowjob before his asshole is filled by the cock. Cicciolina supports them orally. Malone, who's still fucking the black girl, watches them. Cicciolina sits down on one of the shemales and starts peeing.\nThen she leaves the party and gets substituted by Miss Pomodoro. Malone screws a transsexual from behind while Miss Pomodoro sucks him. They change positions and Malone takes the shemale in reverse cowgirl style. Finally he unloads his creamy cum all over their faces with Miss Pomodoro sucking him clean. Although I'm not into shemale sex (except Sulka) this was a hot scene.\nIn the next scene Rocco has sex with three of the busty girls until he's sucked off by them.\nCicciolina seems to live in danger as she's attacked at her home again, this time by three guys. But we have already learned that she's a tough girl. She even tolerates a double penetration before the guys plaster her face with loads of sticky cum and get some post-cum licking from her.\nThe very last scene brings us some group action in which the whole cast participates. Some blowing, some fucking ... In the end three guys gather around Cicciolina who has already knelt down awaiting their loads. Huge splatters hit her face until she gets totally covered in cum. John Thompson couldn't have done a better job! \n\nPick another one:\n  &lt;a href=&quot;\nhttps://thepiratebay.se/user/feeldabyte/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/feeldabyte/&lt;/a&gt;","torrent":{"xt":"urn:btih:11a67b9319fd762aaf77b20f25e54481fce0f9fd","amp;dn":"Hans+Ruiz+-+Cicciolina+packt+aus%21+XXX+DVDRip+%5B.avi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11a67b9319fd762aaf77b20f25e54481fce0f9fd","infoHashBuffer":{"type":"Buffer","data":[17,166,123,147,25,253,118,42,175,119,178,15,37,229,68,129,252,224,249,253]},"announce":[],"urlList":[]}}