{"title":"UFO Diaries:Travels In The Weird World Of High Strangeness","uid":6877641,"size":2956961,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1219b3794ceebd498c8ea3f15bc3759913a98b9d&amp;dn=UFO+Diaries%3ATravels+In+The+Weird+World+Of+High+Strangeness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1323516676,"description":"A funny, weird and hugely entertaining memoir of travelling around the world in search of UFO landing sights, UFO believers and abductees. Martin Plowman made headlines when he gained a PhD for his studies of Ufology. Dubbed 'Dr Who' by the media, Martin appeared across the media talking about the weird and wonderful world of UFO believers and, even weirder, those people who claim to have been abducted by aliens. In THE UFO DIARIES, Martin tells the story of his journey to uncover the story behind UFOs - first sightings, recent sightings, believers, non-believers, and, strangest of all, the abductees. Told in the style of the best and funniest travel memoirs, The UFO Diaries is a hugely entertaining jaunt around the world in search of UFO landing sights, UFO believers and abductees. Plowman travels first to Roswell, New Mexico, the site of the first UFO sighting, which is now home to the biggest and best UFO museum. He then heads to the Andes, where modern-day UFO 'contactees' - ufologists who wait for aliens to send a message rather than actively recording and collecting UFO reports - have taken root among the high desert valleys of Chile. In Mexico City, he finds that everyone is a believer and UFOs are as common as saints and just as every-day. Back in Australia he travels around the country to meet abductees, confused and often frightened people who are scorned by the Ufologists. Finally he heads to the UK to try to uncover the secrets of crop circles. THE UFO DIARIES is funny, weird and, like its \nsubject, out there.\n\n\nAuthor(s):Martin Plowman\n\nPublisher:Allen &amp; Unwin\n\nDate:2011\n\nFormat: PDF\n\nLanguage: English\n\nISBN10: 1741759811\n\nPages: 320\n\nISBN13: 9781741759815\n","torrent":{"xt":"urn:btih:1219b3794ceebd498c8ea3f15bc3759913a98b9d","amp;dn":"UFO+Diaries%3ATravels+In+The+Weird+World+Of+High+Strangeness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1219b3794ceebd498c8ea3f15bc3759913a98b9d","infoHashBuffer":{"type":"Buffer","data":[18,25,179,121,76,238,189,73,140,142,163,241,91,195,117,153,19,169,139,157]},"announce":[],"urlList":[]}}