{"title":"Adam Lambert - If I Had You  (2nafish)","uid":5639369,"size":162766852,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:12ace1f51dacd9a15f84333bdd8db3c1c50f1858&amp;dn=Adam+Lambert+-+If+I+Had+You++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1277032296,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nFor Your Entertainment is the first official album from Adam Lambert, the American Idol season eight runner-up. It was released on November 23, 2009.\n\nThree singles were released from the album: &quot;For Your Entertainment&quot;, &quot;Whataya Want from Me&quot; and &quot;If I Had You.&quot;\n\nImmediately following his participation on American Idol, Lambert began writing and recording with predominant pop hit makers such as Lady Gaga, Greg Wells, Max Martin, Linda Perry, RedOne, Ryan Tedder, Evan &quot;Kidd&quot; Bogart, Sam Sparro, Kara DioGuardi, Rivers Cuomo and Pink.\n\nOn October 28, Lambert announced that the lead single would be &quot;For Your Entertainment&quot; produced by Dr. Luke. He tweeted, &quot;Debut single is called 'For Your Entertainment' ...&quot; He also confirmed a song called &quot;Soaked&quot; written by Matthew Bellamy of Muse and a song called &quot;Music Again&quot; written by Justin Hawkins of The Darkness, and stated that he co-wrote four of the songs on the album: &quot;Strut&quot;, &quot;Pick U Up&quot;, &quot;Aftermath&quot; and &quot;Broken Open&quot;.\n\nLambert also announced through Twitter that he had collaborated with Lady Gaga. &quot;Yes it's true: I spent yesterday in the studio with the insanely talented and creative Lady Gaga recording a song that she wrote! I love her.&quot;\n\nThe guitar solo on the song &quot;Sleepwalker&quot; was performed by Orianthi.\n\nTo promote the album's release, several songs from the album were performed live on AOL Sessions. Following his controversial performance at the American Music Awards of 2009(AMAs), Lambert was dropped from a few scheduled performances on the American Broadcasting Company (ABC) network, though CBS subsequently invited Lambert for an interview and performance on The Early Show in New York City instead. Lambert then went on a series of promotional interviews and performances to address the controversy, clear up rumours, discus his rapid rise to fame, and promote the album. Interviews included The Ellen DeGeneres Show, The View, and The Oprah Winfrey Show.\n\nOn the March 10, Lambert performed on VH1's &quot;Unplugged&quot;, where he sang stripped-down versions of songs off the album.\n\nDuring the spring of 2010, Lambert will undertake a series of promotional interviews (TV and Radio) in Europe and Asia, to promote the upcoming international release of his album. On June 4, 2010 Lambert began his first US tour in support of the album, entitled The Glam Nation Tour .\n\nAdam Mitchel Lambert (born January 29, 1982) is an American singer, songwriter, and actor from San Diego, California. In May 2009, he finished as the runner-up on the eighth season of American Idol. He is the first openly gay mainstream pop artist to launch a career on a major label in America.\n\nLambert released his debut album, For Your Entertainment, in November 2009, via RCA Records/19 Recordings. The album debuted at number three on the Billboard 200 in December 2009, selling 198,000 copies in the United States in the first week.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:12ace1f51dacd9a15f84333bdd8db3c1c50f1858","amp;dn":"Adam+Lambert+-+If+I+Had+You++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12ace1f51dacd9a15f84333bdd8db3c1c50f1858","infoHashBuffer":{"type":"Buffer","data":[18,172,225,245,29,172,217,161,95,132,51,59,221,141,179,193,197,15,24,88]},"announce":[],"urlList":[]}}