{"title":"head first software development - ora 2008.pdf","uid":6148548,"size":45451905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12eeb209ad30fac8b233968120425eb52f92a25f&amp;dn=head+first+software+development+-+ora+2008.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DLAddict","files":1,"time":1296784744,"description":"head first software development - ora 2008 &lt;a href=&quot;\nhttp://amzn.to/g6Lk5U&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://amzn.to/g6Lk5U&lt;/a&gt;\n\n# Paperback: 496 pages\n# Publisher: O'Reilly Media; 1 edition (January 11, 2008)\n# Language: English\n# ISBN-10: 0596527357\n# ISBN-13: 978-0596527358\n\nEven the best developers have seen well-intentioned software projects fail -- often because the customer kept changing requirements, and end users didn't know how to use the software you developed. Instead of surrendering to these common problems, let Head First Software Development guide you through the best practices of software development. Before you know it, those failed projects will be a thing of the past.\n\nWith its unique visually rich format, this book pulls together the hard lessons learned by expert software developers over the years. You'll gain essential information about each step of the software development lifecycle -- requirements, design, coding, testing, implementing, and maintenance -- and understand why and how different development processes work.\n\nThis book is for you if you are:\n\n* Tired of your customers assuming you're psychic. You'll learn not only how to get good requirements, but how to make sure you're always building the software that customers want (even when they're not sure themselves)\n* Wondering when the other 15 programmers you need to get your project done on time are going to show up. You'll learn how some very simple scheduling and prioritizing will revolutionize your success rate in developing software.\n* Confused about being rational, agile, or a tester. You'll learn not only about the various development methodologies out there, but how to choose a solution that's right for your project.\n* Confused because the way you ran your last project worked so well, but failed miserably this time around. You'll learn how to tackle each project individually, combine lessons you've learned on previous projects with cutting-edge development techniques, and end up with great software on every project.\n\nHead First Software Development is here to help you learn in a way that your brain likes... and you'll have a blast along the way. Why pick up hundreds of boring books on the philosophy of this approach or the formal techniques required for that one? Stick with Head First Software Development, and your projects will succeed like never before. Go on, get started... you'll learn and have fun. We promise.","torrent":{"xt":"urn:btih:12eeb209ad30fac8b233968120425eb52f92a25f","amp;dn":"head+first+software+development+-+ora+2008.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12eeb209ad30fac8b233968120425eb52f92a25f","infoHashBuffer":{"type":"Buffer","data":[18,238,178,9,173,48,250,200,178,51,150,129,32,66,94,181,47,146,162,95]},"announce":[],"urlList":[]}}