{"title":"ImToo AVI to DVD Converter 3.0.31.1012","uid":6436553,"size":11029511,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:132ab5d4c7c31738297ac2bce00cb4fbe617211f&amp;dn=ImToo+AVI+to+DVD+Converter+3.0.31.1012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mamed568","files":4,"time":1306829295,"description":"ImTOO AVI to DVD Converter is a fast and top quality AVI to DVD burner software to convert and burn AVI files to DVD. Other video files are also supported, namely MPEG, MPG, DAT, M2V, VOB. You can burn these video formats to DVD disc, DVD folder or ISO file. ImTOO AVI to DVD Converter also provides you with many DVD authoring features: create a distinctive DVD menu, clip video file freely, adjust video effect, add subtitles and audio tracks, and so on.\nMain Functions\n\n    AVI to DVDBurn AVI to DVD\n    Burn DVD disc and create DVD from video files like AVI, MPEG, MPG, DAT, M2V, VOB.\n    Convert AVI to DVDConvert AVI to DVD Folder or ISO File\n    Convert ISO image file or DVD folder from AVI, MPEG, VOB and any supported videos.\n    AVI to DVD converterCustomize DVD\n    ImTOO AVI to DVD Converter enables you to customize your DVD by creating stunning DVD menu, clipping video, editing video effect, adding subtitles and audio tracks.\n    AVI to DVD formatMultithreading and Multi-Core Processing\n    Burn DVDs with multithreading and multi-core processor by maximizing your CPU speed to get the burning done within moments.\n\nWhat's new\n\n    Regrouped menu templates; added popular menu templates.\n    Added support for the DVD opening film clip.\n    Ability to use a picture or video clip as the menu title miniature.\n    Ability to add and edit multiple soundtracks and subtitles, crop video image, add special effects and watermarks.\n    Ability to preview the original and the edited videos side-by-side for easy comparison.\n    Added support for multi-core CPU processing.\n\nKey Features\n\n    Clip video file and convert only the chosen segments into DVD, ISO or DVD folder.\n    Personalize DVD menu by choosing from preset templates; add music, picture, title or opening clip.\n    Attach watermark (picture or text) to claim rights to your DVD; customize by cropping video size and image effects.\n    Create DVD with multiple subtitles and audio tracks of different languages.\n    Adjust video/audio quality, television standard, video aspect, bit rate, etc.\n    Choose any video clip or use a static picture as the video thumbnail in the DVD menu.\n    Add DVD chapters in each title at specified intervals.\n    Burn DVD with the DVD menu skipped.\n    Support DVD-R, DVD+R, DVD-RW, DVD+RW, DVD+R DL, DVD-R DL, as well as DVD-5/DVD-9.\n    Set an action (hibernate, shutdown, exit or standby) after a task is done to avoid waiting.\n    Allow you to preview video file and take a snapshot of desired video images in the resizable built-in player.\n\n","torrent":{"xt":"urn:btih:132ab5d4c7c31738297ac2bce00cb4fbe617211f","amp;dn":"ImToo+AVI+to+DVD+Converter+3.0.31.1012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"132ab5d4c7c31738297ac2bce00cb4fbe617211f","infoHashBuffer":{"type":"Buffer","data":[19,42,181,212,199,195,23,56,41,122,194,188,224,12,180,251,230,23,33,31]},"announce":[],"urlList":[]}}