{"title":"Gay Warriors: A Documentary History","uid":4711368,"size":3004901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1346cc6d31b1690932f83ecf1cb14521c6ab54bf&amp;dn=Gay+Warriors%3A+A+Documentary+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"timnehguy","files":2,"time":1234033913,"description":"Gay Warriors: A Documentary History from the Ancient World to the Present,\nedited by B. R. Burg (2002)\nPDF, 311 pp.\n\nContents -\n1. The Classical World \n2. Amazons \n3. The Medieval Templars \n4. Eighteenth-Century Warriors \n5. Britain and the Wars against Napoleon \n6. Nineteenth-Century Americans at War \n7. The U.S. Navy after World War I \n8. World War II \n9. The Cold War to the Age of Clinton\n\nQuestions about whether or not gays should serve in the military are slightly off. The reality is that they do and always have. If proof is necessary, these essays on gay and lesbian warriors throughout history is a good starting place. Burg has gathered important materials in the Western tradition from Homer to Clinton, making for a truly fascinating reading on this controversial subject. \n\nCourt-martial proceedings and transcripts from Napoleon's army and the Royal Navy, for example, are quite evocative of their age. More frightening are those relating to the prosecution of the Knights Templars. Each of the nine chapters, written by Berg and other prominent academics, covers a specific historical period (e.g., American Civil War, World Wars I and II) and includes enough contextual information to make it pertinent to academics and accessible to the lay reader. \n\nTwo problems with this book:  Although other societies are covered in the past, as you more toward the present, the emphasis shifts more and more to the USA.  Also, note that this book was published in 2002, so it may seem dated - already!\n\nThis is the last book on gay and lesbian issues that I'll be uploading (until I find some more), so please check my torrents for more reference books on this and a variety of other topics.  And, as always, please seed.","torrent":{"xt":"urn:btih:1346cc6d31b1690932f83ecf1cb14521c6ab54bf","amp;dn":"Gay+Warriors%3A+A+Documentary+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1346cc6d31b1690932f83ecf1cb14521c6ab54bf","infoHashBuffer":{"type":"Buffer","data":[19,70,204,109,49,177,105,9,50,248,62,207,28,177,69,33,198,171,84,191]},"announce":[],"urlList":[]}}