{"title":"Stephen Hunter - Bob Lee Swagger Series 01 - Point of Impact","uid":4850897,"size":87720404,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:135fd9180ed6cd826792806f318218247f6f275c&amp;dn=Stephen+Hunter+-+Bob+Lee+Swagger+Series+01+-+Point+of+Impact&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Joshseane","files":-1,"time":1239868536,"description":"From Publishers Weekly\nBob Lee Swagger, jungle-smart hillbilly and premier shootist, explodes as a thinking man's Rambo when Hunter's ( The Day Before Midnight ) canny plot overcomes the barrage of high-tech ballistics data in this otherwise satisfying thriller. Swagger's sniper kills were legendary in Vietnam until an enemy bullet sent him into seclusion at his home in the Arkansas mountains. Retired Col. Schreck lures him back into &quot;the World&quot; on the pretense that he will be testing new bullets, but instead presses him into his special &quot;Agency&quot; unit. Swagger's job is to predict which site on the president's upcoming speaking tour a professional sniper would choose for an assassination attempt--so Schreck's unit can prevent it. Swagger calls the hit just right but is shot and framed in the assassination by Schreck's men. Only FBI agent and sniper ace Nick Memphis believes that Swagger is innocent. Memphis and Swagger trace the real assassin through the shootist network, making clever use of gun-lore magazines. They take on FBI bureaucrats, Schreck's nasties, Salvadoran death squads and local law agencies to get to the final showdown. While the novel's firearms details may be daunting to non-NRA members, the characters, plot and courtroom finale will leave readers wrung out.\nCopyright 1993 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nFrom Library Journal\nTwo men, one determined to maintain his reclusive life in the Arkansas mountains, the other fiercely dedicated to remaining part of the FBI, are drawn together in an effort to clear their names and stay alive during an intricate cover-up of an unauthorized mercenary maneuver in a Latin American country. Bob Lee Swagger, or Bob the Nailer as he was known in Vietnam, is a sniper par excellence. Because of a war injury, he devotes his time to maintaining his marksmanship and avoiding the outside world. These skills and his loner status make him an ideal target for a pseudogovernmental group planning an assassination as part of the cover-up. Nick Memphis, pursuing an investigation from which he has been warned by his FBI superiors, stumbles onto facts about Swagger that force him to go undercover with him. Tautly written by the author of The Day Before Midnight (Bantam, 1989), the plot makes a number of turns before swooping to a conclusion where patriotism and personal integrity triumph. Recommended for popular fiction collections.","torrent":{"xt":"urn:btih:135fd9180ed6cd826792806f318218247f6f275c","amp;dn":"Stephen+Hunter+-+Bob+Lee+Swagger+Series+01+-+Point+of+Impact","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"135fd9180ed6cd826792806f318218247f6f275c","infoHashBuffer":{"type":"Buffer","data":[19,95,217,24,14,214,205,130,103,146,128,111,49,130,24,36,127,111,39,92]},"announce":[],"urlList":[]}}