{"title":"The Weavers - Together Again","uid":7810498,"size":109914472,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1377ae7d0e25e8d08680bbd05c6acf4943729c92&amp;dn=The+Weavers+-+Together+Again&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sailorsaint","files":15,"time":1352517454,"description":"The Weavers \nTogether Again (1981)\n\nRecorded at Carnegie Hall November 28/29, 1980\n\n\nVinyl &gt; mp3 320cbr\n\n01 Darling Corey\n02 In a Jocular Vein\n03 Get Up and Go\n04 Tomorrow Lies In The Cradle\n05 Wasn't That a Time?\n06 Dark As A Dungeon\n07 Hay una Mujer\n08 Venga Jaleo\n09 Kisses Sweeter Than Wine\n10 When I'm Down For the Count\n11 All Night Long (Paul and Silas)\n12 Something About the Women\n13 We Wish You a Merry Christmas\n14 Wimoweh\n15 Goodnight, Irene / We Wish You a Merry Christmas Reprise\n\nThe Weavers formed in 1948 and broke up in 1953 for political reasons; they reunited in 1955 and stayed together, with shifting personnel, until 1964, when they broke up for personal and professional reasons. \nIn 1980, the original quartet, Pete Seeger, Lee Hays, Fred Hellerman, and Ronnie Gilbert, reunited one last time to commemorate the 25th anniversary of their first reunion in the place they had held that reunion, Carnegie Hall in New York. \nThe two concerts, on November 28 and 29, 1980, were recorded, and Together Again is culled from the shows. Naturally, it features some of the group's old favorites, such as &quot;Goodnight Irene,&quot; &quot;Kisses Sweeter than Wine,&quot; and &quot;Wimoweh.&quot; \nIt also provides some of their international flavor in such selections as &quot;Venga Jaleo.&quot; That is a song dating from the Spanish Civil War, which brings in the group's political element. \n\nIt was inevitable, given that aspect of the Weavers, that they would have at least something to say about the election of the conservative Republican Ronald Reagan as president only weeks earlier, and of course, they do, referring to it in newly added lyrics to Seeger's wry song about aging, &quot;Get Up and Go,&quot; after Hays, still the Weavers' comedian, had alluded to the circumstances in his introductory remarks. &quot;This too shall pass,&quot; he said. &quot;I've had kidney stones, and I know.&quot; \nThe inclusion of the Seeger song (introduced on his 1964 solo album Broadsides: Songs and Ballads) signals the group's desire to feature new material, not just the old warhorses. Hellerman, for example, contributes a lovely song describing a father's wonder about a newborn child, &quot;Tomorrow Lies in the Cradle,&quot; while Gilbert, a supporter of topical folksinger Holly Near, brings in two Near compositions on political themes, &quot;Hay Una Mujer,&quot; about Chilean oppression, and &quot;Something About the Women,&quot; a song for the women's liberation movement. \nThe enraptured audience shares the group's political viewpoint and revels in both the old and new material. Hays, the oldest member at 66 and clearly ailing (he appeared onstage in a wheelchair), nevertheless is the most humorous, and the others leave the stage remarks largely to him. \nHe doesn't have the singing voice he once did, but he was never the best singer in the group, anyway, and the harmonies still work fine. Together Again is a special, one-time effort that puts a bow on a career that had its ups and downs, but produced some wonderful music.","torrent":{"xt":"urn:btih:1377ae7d0e25e8d08680bbd05c6acf4943729c92","amp;dn":"The+Weavers+-+Together+Again","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1377ae7d0e25e8d08680bbd05c6acf4943729c92","infoHashBuffer":{"type":"Buffer","data":[19,119,174,125,14,37,232,208,134,128,187,208,92,106,207,73,67,114,156,146]},"announce":[],"urlList":[]}}