{"title":"Twentynine Palms [2003] [DVDRip] [Xvid]","uid":4175293,"size":730714375,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:13f105b3674afba87f7b0dd89c5a60ff4ecff645&amp;dn=Twentynine+Palms+%5B2003%5D+%5BDVDRip%5D+%5BXvid%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"circlensess","files":3,"time":1210093683,"description":"Twentynine Palms.avi (696.85 megabyte)\n\nDavid, an independent photographer, and Katia, an unemployed woman, leave Los Angeles, en route to the southern California desert, where they search a natural set to use as a backdrop for a magazine photo shoot. They find a motel in the town of Twentynine Palms and spend their days in their sport-utility vehicle, discovering the Joshua Tree Desert, and losing themselves on nameless roads and trails. Frantically making love all the time and almost everywhere, they regularly fight, then kiss and make up, with little else going on in their empty relationship and quite ordinary daily life--until something horrible and hideous brutally puts an end to their trip.\n\nfilm in mix of French, English, slovik,\n\nRozmiar pliku.....: 696 MB (or 713,574 KB or 730,699,776 bytes)\nCzas trwania......: 01:53:21 (170,026 fr)\n\nKodek Video..: XviD\nVideo Bitrate: 699 kb/s\nFPS: 25.000 fps\nRozdzielczo[\u0007...: 560x240 (2.33:1) [=7:3]\n\nKodek Audio..: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 152 kb/s (76/ch, stereo) VBR \nCzestotliwosc probkowania: 48000 Hz\n\nPolish subtitles/tootulky. More subs avilible at:\n &lt;a href=&quot;\nhttp://subtitles.images.o2.cz/d/81630/Twentynine+Palms.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://subtitles.images.o2.cz/d/81630/Twentynine+Palms.html&lt;/a&gt;\n\nIMDB: http://www.imdb.com/title/tt0315110/\n\nThe first great metaphor after 9/11. It scared the hell out of me., 28 May 2004\n\nAuthor: oso_travis from Mexico City \n\nTwentynine Palms. Directed by Bruno Dumont. (Unrated). ****\n\nThe victory of brutality over civilization.\n\nAt a first look &quot;Twentynine palms&quot; is just another trivial film. You might be tempted to think that is &quot;Gerry&quot; going porn and you may say &quot;Come on, Frenchies. Grow up!&quot;. You may think is only sex, sex, sex, and sex with some violence. But analyzing the film more in depth, I found it rather disturbing and fascinating in its sociological and moral context.\n\nBe aware. It is not a film easy to seat through. The first half shows walking around in the desert a la &quot;Gerry&quot;, mixed with some hardcore sex scenes at the pool and at the motel. When the second half starts the film turns into a &quot;lynchean&quot; nightmare. We get to see mean white trash and three-legged dogs. And then the brutal ending, that every likes to talk about, which it seems it was extracted from somebody&amp;#039;s worst nightmare.\n\nBruno Dumont has created a shocking metaphor with this film, shocking in deed. At the beginning of the film we see David getting ready to leave L.A. And then the whole film takes place in the barrel Joshua Tree desert, where the first trivial, then tragic events take place. The desert as a metaphor of the world after 9/11, with all the moral devastation, its raw madness and its social chaos. The world has become a lonely place, where &quot;there&amp;#039;s nothing to understand&quot; and &quot;where we are not alone&quot; according to Katia&amp;#039;s wise words. Nobody in the desert is subjected to anything. Forget morals, ethics and law, and give a new meaning to your life: to satisfy instincts, passions and impulses, doesn&amp;#039;t matter if they are erotic, warring or psychotic. \n\nDumont brings to debate the contrast between civilization and barbarousness. And the thing that is so hopeless, is that barbarousness has triumphed and overcome humanity. It is the victory of brutality over civilization.\n\n10/10.\n","torrent":{"xt":"urn:btih:13f105b3674afba87f7b0dd89c5a60ff4ecff645","amp;dn":"Twentynine+Palms+%5B2003%5D+%5BDVDRip%5D+%5BXvid%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f105b3674afba87f7b0dd89c5a60ff4ecff645","infoHashBuffer":{"type":"Buffer","data":[19,241,5,179,103,74,251,168,127,123,13,216,156,90,96,255,78,207,246,69]},"announce":[],"urlList":[]}}