{"title":"Jason Bourne Janus Reprisal by Freveletti (epub and mobi)","uid":7590348,"size":1446282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13f48085c350da7dd89624570ffeff9c3cad8e26&amp;dn=Jason+Bourne+Janus+Reprisal+by+Freveletti+%28epub+and+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"spanikopita","files":-1,"time":1346523426,"description":"With U.S. intelligence agencies wracked by internal power struggles and paralyzed by bureaucracy, the president was forced to establish his own clandestine group--Covert-One. It is activated only as a last resort, when the threat is on a global scale and time is running out.\n\nTHE JANUS REPRISAL\n\nIt begins with a terrorist attack. Covert-One operative Colonel Jon Smith is attending a conference in The Hague on infectious diseases, together with leading scientists and political figures from around the world. Without warning, the conference hotel is consumed in a bloodbath. Smith is caught in the crossfire and barely escapes . . . but not before discovering a picture of himself and two other targets in the pocket of one of the shooters.\nBut the hotel is not the only location under attack in The Hague. Bombs are going off at the train station, the airport, and the International Criminal Court, where Pakistani warlord Oman Dattar is being held while he's tried for crimes against humanity. In the resulting chaos, the prisoner escapes.\n\nDattar nurses a special hatred for the United States and its allies. With his freedom, and access to a mysterious new weapon, Dattar puts in motion a murderous, ambitious plot to exact his revenge and bring down the West once and for all--unless Covert-One can stop him.\n\n-----\n\nepub and mobi","torrent":{"xt":"urn:btih:13f48085c350da7dd89624570ffeff9c3cad8e26","amp;dn":"Jason+Bourne+Janus+Reprisal+by+Freveletti+%28epub+and+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f48085c350da7dd89624570ffeff9c3cad8e26","infoHashBuffer":{"type":"Buffer","data":[19,244,128,133,195,80,218,125,216,150,36,87,15,254,255,156,60,173,142,38]},"announce":[],"urlList":[]}}