{"title":"Schieber-Holy Land Betrayed(struggle against Zionist)(1987)","uid":4739532,"size":750996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14088be0196132647fbe397f982368a1a967a898&amp;dn=Schieber-Holy+Land+Betrayed%28struggle+against+Zionist%29%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"red_gonzo","files":1,"time":1235487278,"description":"This is Haviv Schieber's shocking book Holy Land Betrayed (1987) which records author's monumental life battle against political Zionism which betrayed the thousand-year dream of a Jewish homeland. Schieber was a Polish Jew who emigrated to Palestine in the 1930s. He was dedicated to the creation of a Jewish state ala The Balfour Declaration but later became disillusioned and dismayed with what he found and experienced in the &quot;Holy Land.&quot; It amounted to nothing less than a betrayal of trust. When Schieber bade &quot;farewell to (his) beloved Holy Land, now occupied by Israel&quot; for the United States after twenty seven years, his opposition to Zionist policies and tactics preceded him. Even in South America, he was hounded from pillar to post. His fearlessly outspoken opposition to the aims of the &quot;Zionist-Marxist thugs&quot; who created and control the Mideast ministate made him many enemies. Though many American Jews agreed with Schieber privately, and acknowledged the truth of his statements, they were afraid to help him. Schieber's blow-by-blow account of the unscrupulous and terror tactics used by the Jewish-controlled immigration authorities in New York in an effort deprive him of his American passport and deport him to Israel, makes enthralling reading. Written just prior to the author's death, Holy Land Betrayed makes you think that it &quot;couldn't happen in America&quot; - but it did! 90 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:14088be0196132647fbe397f982368a1a967a898","amp;dn":"Schieber-Holy+Land+Betrayed%28struggle+against+Zionist%29%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14088be0196132647fbe397f982368a1a967a898","infoHashBuffer":{"type":"Buffer","data":[20,8,139,224,25,97,50,100,127,190,57,127,152,35,104,161,169,103,168,152]},"announce":[],"urlList":[]}}