{"title":"Code Art File 2.0.3 + sn","uid":6374592,"size":2666885,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:163be1a2353fc81f6f0cf08247bae355194bb1f7&amp;dn=Code+Art+File+2.0.3+%2B+sn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"polisdavid","files":-1,"time":1304809674,"description":"Official Web Site: &lt;a href=&quot; http://www.code-line.com/software/artfiles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.code-line.com/software/artfiles/&lt;/a&gt;\n\nThe missing &quot;Collect for Output&quot; feature of AdobeÃ‚Â® IllustratorÃ‚Â® is finally realized, and then some.\n\nArt Files is a stand-alone application that takes the tedious task of collecting Illustrator documents, linked images and fonts for graphics files and turns it into a simple point &amp; click operation. Art Files focuses on gathering just the information you need to get your files packaged up or ready for archiving.\n\nDesigners Crave It\n\nArt Files makes packaging artwork simple. Transform the grueling process of finding linked images and identifying font files into a simple drag &amp; drop process.\n\nBosses Love It\n\nArt Files is a huge productivity boost. Allowing artists to focus on their artwork results in greater efficiency, fewer mistakes and better creative. A happy team, is a productive team.\n\nTechs Embrace It\n\nArt Files is simple to deploy. We provide multi-user licenses as a single serial number. And we can help you with large scale deployments with procedures and packages.\n\nArt Files also has the unique ability to collect several documents at once, saving precious time when only minutes stand between overnighting your artwork to the printer and having to hire a high-price door-to-door courier to meet your deadline. In addition to saving time, this feature also cuts down on disk space by collecting shared images and fonts between documents only once.\n\nArt Files is perfect for production artists or anyone who works with graphics files and needs the portability of sending documents to others for editing or printing. Its simple, straight-forward user-interface is sure to make file collection nightmares a thing of the past.\n\nSystem Requirements:  \n\nIntel Mac OS X.5 and above\nAdobe Illustrator CS3, CS4, and CS5 (Won't work of AI C5.5)\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:163be1a2353fc81f6f0cf08247bae355194bb1f7","amp;dn":"Code+Art+File+2.0.3+%2B+sn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"163be1a2353fc81f6f0cf08247bae355194bb1f7","infoHashBuffer":{"type":"Buffer","data":[22,59,225,162,53,63,200,31,111,12,240,130,71,186,227,85,25,75,177,247]},"announce":[],"urlList":[]}}