{"title":"BBC Harvest 2015 Series 1 1of3 The East 720p x264 AAC HDTV MVGro","uid":12586697,"size":1408260078,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:166d6e5bcd953a49bf62502aa9cdb8c3b81d73f1&amp;dn=BBC+Harvest+2015+Series+1+1of3+The+East+720p+x264+AAC+HDTV+MVGro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":1,"time":1445033792,"description":"Harvest Series 1\r\n\r\nNature Documentary hosted by Philippa Forrester and Gregg Wallace, published by BBC in 2015 - English narration \nhttp://docuwiki.net/images/7/7d/Harvest-Series-1-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\n\r\nHarvest 2015\r\nGregg Wallace, Philippa Forrester and newcomer James Manning cross the country visiting farms that produce world class crops and meeting innovative and pioneering farmers. We'll witness the harvest as it happens up and down the country. Each episode will focus on three different locations in the UK - North, East and West. The team will follow this critical time of year as the nation's farmers find out whether all their hard work has resulted in a successful yield, and show the impact that Britain's harvest can have on the food industry and everyday consumers.\r\n\r\n\r\n1)  East \r\nIn this episode, the team reports from the east of the UK, where pioneering sweetcorn farmer Peter Barfoot has spent decades turning exotic veg into regular British fridge fillers, growing vegetables that many thought couldn't be grown here in Britain. This region's sunny climate and fertile soils has earned it a reputation as the bread-basket of Britain. Also in this episode, Gregg helps out with the winter sugar beet harvest and reveals just how much sugar is produced from our home soil. Philippa finds chillies so hot they need a health warning and visits the Tiptree strawberry fields to try a sweet treat - the Little Scarlet strawberry, used for making a very special jam, a favourite with James Bond. And newcomer to the harvest family, dairy and fruit farmer James Manning, visits a futuristic lettuce farm controlled by robots to see a cutting edge drilling machine that plants seedlings faster than the eye can see.\r\n\r\n2)  North \r\nIn this second episode, the team report from the north of the UK, where the Hay family in Perthshire, Scotland, are anxiously awaiting a dry spell to roll out their combine harvesters. Having recently pulled their last ever potato harvest, the Hays have now switched to cereals, in particular oats, the rising star of British grains. The climate and landscape can make this region notoriously difficult to farm, yet well-watered soil and long daylight hours also help make world-class produce. Gregg visits fruit grower Ross Mitchell, who is taking advantage of Scotland's long summer days to produce world-class blueberries. Philippa meets Robert Doig, a seed potato grower, and learns why Scotland's seed potatoes sell all over the globe. And James Manning visits Robert Craig, a Cumbrian dairy farmer who believes that meticulous attention to the growth of his rye grass can yield premium quality milk.\r\n\r\n3)  West \r\nIn the final episode, the team reports from the west, where three generations of the Thatcher family are about to begin harvesting their cider apples. The rolling countryside of the west of Britain gets more rainfall than the east, which is why these undulating hills and sweeping valleys are so lush - perfect for growing world-famous cider apples. The west is also a land of ingenuity and farming innovation. Gregg meets mushroom mogul Ronnie Monaghan at the largest mushroom farm in Europe where 30 tons are harvested every day. Philippa visits Gloucestershire farmer Jake Freestone's fields of blooming oilseed rape to witness the army of hungry insects he has to contend with. Finally James Manning heads to Shropshire, where Stephen Jones has been painting the countryside vivid yellow - this time with Quinoa, the latest super food to hit Britain.\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/8/8f/Harvest-Series-1-Screen0.jpg \nhttp://docuwiki.net/images/f/fb/Harvest-Series-1-Screen1.jpg \nhttp://docuwiki.net/images/2/23/Harvest-Series-1-Screen2.jpg \nhttp://docuwiki.net/images/8/84/Harvest-Series-1-Screen3.jpg \nhttp://docuwiki.net/images/9/90/Harvest-Series-1-Screen4.jpg \nhttp://docuwiki.net/images/a/a1/Harvest-Series-1-Screen5.jpg \nhttp://docuwiki.net/images/c/c8/Harvest-Series-1-Screen6.jpg \nhttp://docuwiki.net/images/a/a4/Harvest-Series-1-Screen7.jpg \nhttp://docuwiki.net/images/5/57/Harvest-Series-1-Screen8.jpg \nhttp://docuwiki.net/images/e/e8/Harvest-Series-1-Screen9.jpg \nhttp://docuwiki.net/images/7/78/Harvest-Series-1-Screen10.jpg \nhttp://docuwiki.net/images/3/3f/Harvest-Series-1-Screen11.jpg \nhttp://docuwiki.net/images/c/ce/Harvest-Series-1-Screen12.jpg \nhttp://docuwiki.net/images/4/42/Harvest-Series-1-Screen13.jpg \nhttp://docuwiki.net/images/3/39/Harvest-Series-1-Screen14.jpg \nhttp://docuwiki.net/images/4/42/Harvest-Series-1-Screen15.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n\r\n\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: 3012 Kbps\r\n * Video Aspect Ratio: 1280 x 720\r\n * Video Resolution: 1.778 (16:9)\r\n * Audio Codec: AAC LC\r\n * Audio: English\r\n * Audio Bitrate: 160 kb/s VBR 48 KHz\r\n * Audio Channels: Stereo 2\r\n * Run-Time: 59mins\r\n * Framerate: 25 fps\r\n * Number of Parts: 3\r\n * Container Mp4\r\n * Part Size: 1.31 GB\r\n * Source: HDTV\r\n * Encoded by: Harry65\r\n\r\nRelease Notes\r\nMerged English Subtitles\r\n\r\nLinks\r\n------------------------------\r\n\r\n1)  Further Information \nhttp://www.bbc.co.uk/programmes/b06g6czm","torrent":{"xt":"urn:btih:166d6e5bcd953a49bf62502aa9cdb8c3b81d73f1","amp;dn":"BBC+Harvest+2015+Series+1+1of3+The+East+720p+x264+AAC+HDTV+MVGro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"166d6e5bcd953a49bf62502aa9cdb8c3b81d73f1","infoHashBuffer":{"type":"Buffer","data":[22,109,110,91,205,149,58,73,191,98,80,42,169,205,184,195,184,29,115,241]},"announce":[],"urlList":[]}}