{"title":"Jimmy Webb - Words And Music [1970][ FLAC]","uid":8570831,"size":264341248,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16c17ada50f52e1d677e610b89602329edbbe6f0&amp;dn=Jimmy+Webb+-+Words+And+Music+%5B1970%5D%5B+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":10,"time":1371148896,"description":"Artist: Jimmy Webb\nRelease: Words And Music\nReleased: 1970\nLabel: Reprise Records\nCatalog#: RS 6421\nFormat: FLAC / Lossless/vinyl\n[color=blue]Country: US\nStyle:Folk Rock, Pop Rock, Psychedelic Rock\n\n01. Sleepin' In The Daytime\n02. P.F.Sloan\n03. Love Song\n04. Careless Weed\n05. Psalm One-Five-O\n06. Music For An Unmade Movie - Song Seller\n07. Music For An Unmade Movie - Dorothy Chandler Blues\n08. Music For An Unmade Movie - Jerusalem\n09. Three Songs (Let It Be Me, Never My Love, I Wanna Be Free)\n10. Once Before I Die\n\nWords and Music, released in November 1970, was the first album recorded as such by 24-year-old Jimmy Webb (or Jimmy L. Webb, as he was credited on the cover). But he had achieved a measure of fame as a songwriter in the preceding years. His compositions had given him two dozen entries on the Billboard Hot 100 between 1967 and 1970, among them the Top Ten hits &quot;MacArthur Park&quot; (by Richard Harris), &quot;Worst That Could Happen&quot; (by the Brooklyn Bridge), &quot;Wichita Lineman&quot; (by Glen Campbell), &quot;Galveston&quot; (by Campbell), and &quot;Up-Up and Away&quot; (by the 5th Dimension), as well as the much-recorded &quot;By the Time I Get to Phoenix.&quot; (Indeed, the only songwriters more successful on the pop singles chart in 1969 were Kenny Gamble, John Lennon, and Paul McCartney.) These hits, in turn, had made him a favorite of middle-of-the-road pop singers and easy listening artists who covered them. But the late '60s was an era when songwriters largely were singing their own songs, and Webb turned to performing after the unpleasant experience of having some of his demos overdubbed and released without his permission as the 1968 Epic Records LP Jim Webb Sings Jim Webb. The hits recorded by others dwindled in 1970 and he began to hoard his songs for himself, so Words and Music consisted of all new material. Webb deliberately took a less elaborate approach to his music than he and others had taken on his many hits, recording largely alone with guitarist Fred Tackett (who also overdubbed bass, percussion, and trumpet). One could still hear traces of his earlier style here and there, notably the horn chart for the leadoff track, &quot;Sleepin' in the Daytime,&quot; which echoed that of Harris' &quot;MacArthur Park,&quot; and in the sometimes elongated song structures, employing multiple tempos. But the album contained songwriting more concerned with personal expression than craftsmanship. Webb sang in a light, occasionally gruff tenor that revealed his roots in Oklahoma, his renditions far less polished than those of the singers who usually handled his songs, but more technically accomplished than, say, Bob Dylan or Randy Newman, and so perfectly acceptable. He sang about being a songwriter, penning a tribute to fellow Los Angeles writer P.F. Sloan (author of &quot;Eve of Destruction&quot;) and constructing the three-part suite &quot;Music for an Unmade Movie,&quot; which had some caustic and cynical things to say about the marketing of popular music, music critics, and the Los Angeles music scene. Even here, however, he clearly expressed the importance to him of faith, no surprise for the son of a minister, and elsewhere he set the 150th psalm to music. He also expressed his desire to establish himself as an independent entity, even to the point of covering the Monkees song &quot;I Wanna Be Free&quot; (in a medley with the Everly Brothers' &quot;Let It Be Me&quot; and the Association's &quot;Never My Love,&quot; performed as a duet with his sister Susan Webb), and he concluded the album with the forthright &quot;Once Before I Die,&quot; in which he declared, &quot;They'll never make me crawl, and you can write that on the wall.&quot; Thus, despite his success, Webb revealed himself on Words and Music to be an artist in considerable anguish who felt he still had a lot to prove. (&quot;P.F. Sloan&quot; was quickly covered by the Association and later by others; &quot;Song Seller,&quot; also introduced on this album, was covered for a minor chart entry for Paul Revere &amp; the Raiders in 1972; &quot;Love Song&quot; was covered by Glen Campbell in 1979; and R&amp;B/gospel band Revelation recorded both &quot;Jerusalem&quot; and &quot;Psalm 150&quot; on its all-Webb 1975 album Revelation.)","torrent":{"xt":"urn:btih:16c17ada50f52e1d677e610b89602329edbbe6f0","amp;dn":"Jimmy+Webb+-+Words+And+Music+%5B1970%5D%5B+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c17ada50f52e1d677e610b89602329edbbe6f0","infoHashBuffer":{"type":"Buffer","data":[22,193,122,218,80,245,46,29,103,126,97,11,137,96,35,41,237,187,230,240]},"announce":[],"urlList":[]}}