{"title":"The Who - Quadrophenia Live in London - NTSC","uid":10382002,"size":5212529357,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:16c9d8da8a90dd2789af6db0f53ec6da6578d051&amp;dn=The+Who+-+Quadrophenia+Live+in+London+-+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"champigroom","files":11,"time":1403090808,"description":"=====================================\nThe Who - Quadrophenia Live in London\n=====================================\n\nIn 2012/2013, The Who embarked on the Quadrophenia and More Tour, performing their landmark rock opera in its entirety, marking the 40th anniversary of the original 1973 release of this double-album masterpiece. The critically acclaimed and highly successful tour closed at London's Wembley Arena, with the cameras rolling, to record the closing night of this historic anniversary tour.\nFilmed on July 8, 2013, QUADROPHENIA: LIVE IN LONDON DVD features The Who in peak form, performing Quadrophenia from front to back, in its entirety, plus a special set of some of their all-time greatest hits. The film captures the band's dynamic performance in front of their hometown crowd and features blistering performances of 'The Real Me', 'The Punk And The Godfather', 'Doctor Jimmy' and a powerful performance of 'Love Reign O'er Me'. With HD screen backdrops, archival footage and today's advanced technology in sound, QUADROPHENIA: LIVE IN LONDON reunites The Who with bandmates John Entwistle, for '5:15', and Keith Moon for his signature song 'Bell Boy'. In addition to their performance of Quadrophenia, the band tear through classic tracks such as 'Pinball Wizard', 'Who Are You', 'You Better You Bet' 'Baba O'Riley' 'Won't Get Fooled Again' and 'Tea &amp; Theatre', from their 2006 release 'Endless Wire', with the intensity and power only The Who can conjure.\n\n=========\nTracklist\n=========\n\n1. I Am The Sea (Live in London's Wembley Arena)\n2. The Real Me (Live in London's Wembley Arena)\n3. Quadrophenia (Live in London's Wembley Arena)\n4. Cut My Hair (Live in London's Wembley Arena)\n5. The Punk And The Godfather (Live in London's Wembley Arena)\n6. I'm One (Live in London's Wembley Arena)\n7. The Dirty Jobs (Live in London's Wembley Arena)\n8. Helpless Dancer (Live in London's Wembley Arena)\n9. Is It In My Head? (Live in London's Wembley Arena)\n10. I've Had Enough (Live in London's Wembley Arena)\n11. 5:15 (Live in London's Wembley Arena)\n12. Sea And Sand (Live in London's Wembley Arena)\n13. Drowned (Live in London's Wembley Arena)\n14. Bell Boy (Live in London's Wembley Arena)\n15. Doctor Jimmy (Live in London's Wembley Arena)\n16. The Rock (Live in London's Wembley Arena)\n17. Love Reign O'er Me (Live in London's Wembley Arena)\n\nBonus\n-----\n\n18. Who Are You (Live in London's Wembley Arena) (Bonus Performance)\n19. You Better You Bet (Live in London's Wembley Arena) (Bonus Performance)\n20. Pinball Wizard (Live in London's Wembley Arena) (Bonus Performance)\n21. Baba O'Riley (Live in London's Wembley Arena) (Bonus Performance)\n22. Won't Get Fooled Again (Live in London's Wembley Arena) (Bonus Performance)\n23. Tea &amp; Theatre (Live in London's Wembley Arena) (Bonus Performance) \n\n==============\nTechnical data\n==============\n\nSystem : NTSC\nImage : 16/9\n\naudio : ACS 2.0, 5.1, and DTS 6 channels\n\n==========\n\n:)","torrent":{"xt":"urn:btih:16c9d8da8a90dd2789af6db0f53ec6da6578d051","amp;dn":"The+Who+-+Quadrophenia+Live+in+London+-+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16c9d8da8a90dd2789af6db0f53ec6da6578d051","infoHashBuffer":{"type":"Buffer","data":[22,201,216,218,138,144,221,39,137,175,109,176,245,62,198,218,101,120,208,81]},"announce":[],"urlList":[]}}