{"title":"Vitamin B12 - Chemical Aspects, Transport, Cause and Symptoms of","uid":15143345,"size":4975738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16db31a588f2543266e3c1e81a0c7589add965e4&amp;dn=Vitamin+B12+-+Chemical+Aspects%2C+Transport%2C+Cause+and+Symptoms+of&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1467212643,"description":"Vitamin B12 - Chemical Aspects, Transport, Cause and Symptoms of Deficiency, Dietary Sources, and Health Benefits - Elena Mutti (Nova, 2015).pdf\r\n\r\nIn mammals, vitamin B12 (also called cobalamin (Cbl)) is involved in several metabolic pathways and necessary for the proliferation and survival of different cell types. Due to an impaired vitamin uptake, a mild, chronic deficiency of Cbl is quite common in the elderly population as well as vegetarians and vegans. A status of Cbl-deficiency induces several disorders including severe anaemia and a neuropathy, and has horrible consequences in fetal development. Based on the information above, it is very important to analyse all the aspects of Cbl in both chemical and clinical trials. With this book, researchers as well as medical doctors and nutritionists can learn of recent advances and answers to basic questions on chemical structures, delivery systems, and clinical aspects of Cbl function. In the first half, we will learn the importance and new applications of Cbl analogues, as well as the complicate arranging of Cbl transporters and finally the recent frontiers on Cbl epigenetic role. The latter part includes the issues linked to the Cbl-deficient diagnostic examinations, Cbl pharmacological uses and recent advances in foods containing Cbl (concentration, bio-availability and enriched food). Finally, ample space will be left to discuss the effect of Cbl-deficiency, from the early cases to the latest study on Cbl involvement in the immune system and its role in carcinogenesis","torrent":{"xt":"urn:btih:16db31a588f2543266e3c1e81a0c7589add965e4","amp;dn":"Vitamin+B12+-+Chemical+Aspects%2C+Transport%2C+Cause+and+Symptoms+of","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16db31a588f2543266e3c1e81a0c7589add965e4","infoHashBuffer":{"type":"Buffer","data":[22,219,49,165,136,242,84,50,102,227,193,232,26,12,117,137,173,217,101,228]},"announce":[],"urlList":[]}}