{"title":"TV5Monde Canada Plus Grand Que Nature 01of13 Pacific Rim PDTV x2","uid":12489682,"size":491530342,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1736f4311f8202c3440f3eaf35bc62bc73a9a881&amp;dn=TV5Monde+Canada+Plus+Grand+Que+Nature+01of13+Pacific+Rim+PDTV+x2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":1,"time":1443149132,"description":"Canada Plus Grand Que Nature\r\n\r\nTravel Documentary hosted by Patrick Hivon, published by TV5Monde in 2014 - French narration. \nhttp://docuwiki.net/images/8/89/Canada-Plus-Grand-Que-Nature-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\nPatrick Hivon introduces us to the Canadian wilderness. The discovery of these huge expanses punctuated by naturalist guides that enrich our experiences of their knowledge of wildlife and flora. Local personalities also add colour to the content with tales and legends told by the light of a wood fire. It sets out to discover a country and men who have left their mark over time. On foot, by kayak, canoe river or mountain biking, the most suitable means are taken to sample the essence of each region and to soak up its charm. The Canadian scale, a hike between land and sea, rivers and forests, mountains and rivers, sometimes playful, sometimes instructive to us, allows us to love Canada a little more.\r\n\r\n1)  Pacific Rim \r\nThe Pacific Rim National Park offers incredible forest hiking and unobstructed views of the Pacific Ocean. Patrick Hivon sets off to meet birds, whales and fans of the outdoors who he joins on surfing, cycling and hiking activities.\r\n\r\n2)  Jasper \r\nPatrick Hivon visits Jasper National Park, to the east of the Rocky Mountains. After travelling across the Athabasca Glacier on board a one-of-a-kind bus, he learns more about the maintenance of the park and the 52 mammal species that call it home.\r\n\r\n3)  Prince Albert \r\nSaskatchewan and the Prince Albert National Park promise lush forests, an impressive amount of birdlife, lakes offering a range of activities such as canoeing, and two- and four-wheel bikes.\r\n\r\n4)  Pike Lake \r\nPike Lake Provincial Park is great for families and easily accessible. It offers a range of activities for outdoor enthusiasts, including geocaching and forest survival. It is also possible to build a tipi there and become a shepherd or archaeologist.\r\n\r\n5)  Kouchibouguac \r\nBoasting a variety of ecosystems, the Kouchibouguac National Park gives Patrick the chance to visit sand dunes, an island tern colony and a meeting point for seals, practise mountain biking and try cockle fishing.\r\n\r\n6)  Prince Edward \r\nAt Prince Edward Island, Patrick has the chance to go lobster and oyster fishing and to taste smoked salmon. He also visits the house that inspired the novel, 'Anne of Green Gables' and learns to build sand castles.\r\n\r\n7)  Cape Breton \r\nIn Nova Scotia at the Cape Breton Highlands National Park, Patrick travels the famous Cabot Trail from Chéticamp to Ingonish to hear the song of the whales, feed bald eagles, fish salmon and become a sailboat captain.\r\n\r\n8)  Banff \r\nPatrick Hivon explores Banff National Park on skis, in snowshoes, on foot and by canoe to uncover its huge appeal. He also encounters a vast array of resident animals, including wapitis and grizzly bears.\r\n\r\n9)  Killarney \r\nPatrick visits Killarney Provincial Park and meets enthusiasts who take him sailing, kayaking, quadbiking and fishing, have him prepare fish and chips, and join him on picturesque hikes.\r\n\r\n10)  Mille Iles \r\nPatrick visits the one-of-a-kind Thousand Islands National Park. Whether it's on board a kayak or a cruise ship, or to fish or move between islands, any excuse is a good excuse to take to the water. Presented by Patrick Hivon.\r\n\r\n11)  Whistler \r\nLocated around 120 kilometres north of Vancouver in the coastal mountains, Whistler hosted the Vancouver Winter Olympics in 2010. Join Patrick as he enjoys the Olympic experience and sets off to explore the rainforest and meet its residents.\r\n\r\n12)  Mont-Riding \r\nIn Riding Mountain National Park, Patrick goes canoeing on a misty lake, has a real cowboy experience, learns about beekeeping and tries his hand at lacrosse.\r\n\r\n13)  Birds Hill \r\nPatrick visits Birds Hill Provincial Park in Winnipeg and the surrounding area as he tries out ultralight flying, fishing and kitesurfing and embarks on a historic tour of Winnipeg's French-speaking community.\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/c/c1/Canada-Plus-Grand-Que-Nature-Screen0.jpg \nhttp://docuwiki.net/images/6/6a/Canada-Plus-Grand-Que-Nature-Screen1.jpg \nhttp://docuwiki.net/images/4/4b/Canada-Plus-Grand-Que-Nature-Screen2.jpg \nhttp://docuwiki.net/images/d/d1/Canada-Plus-Grand-Que-Nature-Screen3.jpg \nhttp://docuwiki.net/images/c/c5/Canada-Plus-Grand-Que-Nature-Screen4.jpg \nhttp://docuwiki.net/images/d/d1/Canada-Plus-Grand-Que-Nature-Screen5.jpg \nhttp://docuwiki.net/images/8/8b/Canada-Plus-Grand-Que-Nature-Screen6.jpg \nhttp://docuwiki.net/images/c/c5/Canada-Plus-Grand-Que-Nature-Screen7.jpg \nhttp://docuwiki.net/images/4/4f/Canada-Plus-Grand-Que-Nature-Screen8.jpg \nhttp://docuwiki.net/images/7/77/Canada-Plus-Grand-Que-Nature-Screen9.jpg \nhttp://docuwiki.net/images/9/92/Canada-Plus-Grand-Que-Nature-Screen10.jpg \nhttp://docuwiki.net/images/8/8f/Canada-Plus-Grand-Que-Nature-Screen11.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: CRF 22 (~1250Kbps)\r\n * Video Resolution: 832x468\r\n * Video Aspect Ratio: 16:9\r\n * Frame Rate: 25 FPS\r\n * Audio Codec: AAC-LC\r\n * Audio Bitrate: 128Kbps ABR 48KHz\r\n * Audio Channels: 2 (French)\r\n * Run-Time: 51 mins\r\n * Number of Parts: 13\r\n * Part Size: 548 MB (average)\r\n * Source: PDTV\r\n * Subtitles: Merged French and English\r\n\r\nLinks\r\n------------------------------ \nhttp://unis.ca/canada-plus-grand-que-nature","torrent":{"xt":"urn:btih:1736f4311f8202c3440f3eaf35bc62bc73a9a881","amp;dn":"TV5Monde+Canada+Plus+Grand+Que+Nature+01of13+Pacific+Rim+PDTV+x2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1736f4311f8202c3440f3eaf35bc62bc73a9a881","infoHashBuffer":{"type":"Buffer","data":[23,54,244,49,31,130,2,195,68,15,62,175,53,188,98,188,115,169,168,129]},"announce":[],"urlList":[]}}