{"title":"Official Formula 1 2013 Season Review 720p 50fps","uid":9596091,"size":3604735769,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:17e7f22995269ea7c04c2c38ec24c77ca0dae1df&amp;dn=Official+Formula+1+2013+Season+Review+720p+50fps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"b_petrov","files":1,"time":1392019044,"description":"Official Formula 1 2013 Season Review 720p 50fps\nQuality : BluRayRip\nFormat : MKV \nVideo : H.264 \nBit rate: ~2000 Kbps \nWidth: 1280 pixels \nHeight: 720 pixels \nDisplay Aspect Ratio: 16:9 \nFrame rate: 50 fps\n\nAudio Tracks :\n1. AAC ; 6 ch ; 48 KHz\n2. AAC ; 2 ch ; 48 KHz\n\n\n\nThis is the Official Review of the 2013 FIA Formula One World Championship.\n\nSebastian Vettel became the youngest driver to score a point in Formula One on his debut in the USA in 2007. In 2013 he became the youngest to win four consecutive World Championships.\n\nHis consistency and speed proved an unbeatable combination for his rivals and earned him a record-equalling thirteen wins, as well as an unprecedented nine successive victories in one season.\n\nHis epic achievement wasn't without controversy. Relive the tension between the Champion and Mark Webber when Vettel disobeyed orders in pursuit of the victory in Malaysia.\n\nTemperature rose at Mercedes as well, while overheating tyres added an explosive element to the drama throughout the year.\n\nAfter twelve years in Formula One, Mark Webber took off his helmet for the final time in Brazil. He didn't add to his tally of wins, but he finished third in the Drivers' Championship.\n\nMercedes took Red Bull by the horns in Qualifying: with eight pole positions they proved they had the outright pace. Hamilton secured his first win for Mercedes in Hungary, and with two further triumphs for team-mate Rosberg, they beat Ferrari to second place in the Constructors' Championship.\n\nRaikkonen started the season on the top step for Lotus, but the relationship crumbled. Grosjean kept the team spirit alive and with six podium appearances he proved he has matured enough to become the team's number one.\n\nThe only Official Review of the 2013 FIA Formula One World Championship is action-packed from start to finish. Go behind the scenes with the very best team radio and high-octane racing. Experience the highs and lows of Sebastian's record-breaking season. Who could stop him? No one.\n\nHighlights from every race including Silverstone, Nurburgring, Melbourne, Shanghai, Monza, Monaco and the brand new Circuit of the Americas.","torrent":{"xt":"urn:btih:17e7f22995269ea7c04c2c38ec24c77ca0dae1df","amp;dn":"Official+Formula+1+2013+Season+Review+720p+50fps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17e7f22995269ea7c04c2c38ec24c77ca0dae1df","infoHashBuffer":{"type":"Buffer","data":[23,231,242,41,149,38,158,167,192,76,44,56,236,36,199,124,160,218,225,223]},"announce":[],"urlList":[]}}