{"title":"Sealing Yourself In: Prepping for Bioterrorism, Chemical Disaste","uid":8099515,"size":218207,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19c52cccba08d0d0283c4ec3ecee1cc3476a754a&amp;dn=Sealing+Yourself+In%3A+Prepping+for+Bioterrorism%2C+Chemical+Disaste&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DaRule762","files":-1,"time":1359929461,"description":"&quot;Survival preppers&quot; want to be prepared for any emergency.\n\nWhether it's a natural disaster like a hurricane or tornado, or a man-made disaster such as civil unrest or government collapse, we want to be ready. We want to make sure that are families are safe, no matter what catastrophe happens.\n\nBut of all the things we prep for, there's nothing more scary than biological/chemical disasters, such as an act of deliberate bioterrorism, or a rampant pandemic, or an accidental biohazard release.\n\nIn this guide for the new prepper, Sealing Yourself In, we turn our attention to dealing with these disasters. You can use the information in this book to supplement your current hunker-down and bug-out plans to help you be prepared for any bio-chemical disaster that might happen.\n\nLots of preppers focus on what supplies they need to stockpile for emergencies, and their GOOD (get out of Dodge) evacuation plans. But there's one thing that's more important than all of this.\n\nAnd that is to develop the right mindset for survival. What makes a good survival prepper is how mentally prepared we are to face the challenges that may or may not be headed our way in today's world. It's the mindset that allows us to stop burying our heads in the sand, and to develop the mental focus that puts our family's safety first.\n\nThis book is written for &quot;ordinary folks&quot; who want to get started on survival prepping. If you are already an experienced prepper, this book might be a good refresher. But it's really written for the average Jane and Joe to get started on survival prepping.\n\nAnd in this book we're going to focus on information to help you develop the mindset to face the most frightening survival scenarios out there. We'll start by looking at the various types of chemical and biological hazards, and the most common bioterrorism agents.\n\nWe'll dive in to some details to help us be prepared. We'll look at the items to add to your hunker-down emergency supplies to help you cope as best as you can with bioterrorism, pandemics, and bio-chemical hazards.\n\nDon't let these scary scenarios scare YOU! Knowledge is power, and it's time to gain the knowledge you need to &quot;seal yourself in&quot; and keep yourself and your family safe.","torrent":{"xt":"urn:btih:19c52cccba08d0d0283c4ec3ecee1cc3476a754a","amp;dn":"Sealing+Yourself+In%3A+Prepping+for+Bioterrorism%2C+Chemical+Disaste","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19c52cccba08d0d0283c4ec3ecee1cc3476a754a","infoHashBuffer":{"type":"Buffer","data":[25,197,44,204,186,8,208,208,40,60,78,195,236,238,28,195,71,106,117,74]},"announce":[],"urlList":[]}}