{"title":"Oscura Lost Light-FANiSO ","uid":11727554,"size":188171547,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1a7d7d36b6448945018968fd097e0a0c74951f60&amp;dn=Oscura+Lost+Light-FANiSO+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":2,"time":1425140090,"description":" Oscura, the apprentice lighthouse keeper, has accidentally destroyed\nthe Aurora Stone, sending shards across the Driftlands and plunging\nthem into darkness and danger. It's now up to Oscura to find the\nshards of the stone and restore light to the Driftlands before the\ncreatures of the dark can destroy it. Fortunately, the accident has\nfused Oscura's hand with glowing fire, enabling him to wield powers\naltering anything the light touches. Each level challenges your\npuzzle-solving skills and reactions in this modern adventure built\nupon the time-honoured mechanics of classic platformers.\nFeatures:\n~~~~~~~~~\n* Master the Light: Along your dark journey you'll find four\ndifferent powers, each designed to help you through the\nDriftlands. Destruction, Construction, Gravity and Time are\nyours to command. Master each unique light power in your dark\njourney through the Driftlands.\n* Discover the origin of our accidental hero: Oscura wasn't always\nthe Driftland's trusty lighthouse keeper. And he didn't always\nhave his flaming hand. Taking place before the previous Oscura\ngames, Lost Light reveals where our hero's journey began and the\nfate of the original light house keeper.\n* Old school platformer meets new school design: Taking\ninspiration from classic platformers such as Super Mario Bros,\nOscura Lost Light combines these elements with a modern design\naesthetic.\n* Use your wits: The Driftlands aren't for the feint hearted and\nOscura's not a fighter. You'll need to out-think and outwit\ncreatures such as the Lost Ones, Shagrims, Bewinged, Grymfus,\nCursed Skulls and more. Just as challenging are the puzzles you\nmust solve if you wish to survive.\n* Confront Evil: Just when you think you've succeeded by\ncollecting the shards of the Aurora Stone, you'll need to face\nthe ultimate challenge and restore the Lost Light ... but beware\n... Mavro the Lord of Shadows awaits. Only by defeating Mavro\ncan you save the Driftlands.\nInstall\n~~~~~~~\n1.) Unpack\n2.) Burn or mount\n3.) Play the game","torrent":{"xt":"urn:btih:1a7d7d36b6448945018968fd097e0a0c74951f60","amp;dn":"Oscura+Lost+Light-FANiSO+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7d7d36b6448945018968fd097e0a0c74951f60","infoHashBuffer":{"type":"Buffer","data":[26,125,125,54,182,68,137,69,1,137,104,253,9,126,10,12,116,149,31,96]},"announce":[],"urlList":[]}}