{"title":"Behind the Shock Machine: The Untold Story of the Notorious Milg","uid":9422009,"size":5680048,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1acca8dfe4b433ddce30efbbf309e2e2d9e372e1&amp;dn=Behind+the+Shock+Machine%3A+The+Untold+Story+of+the+Notorious+Milg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1388607062,"description":"Behind the Shock Machine: The Untold Story of the Notorious Milgram Psychology Experiments (2013) Gina Perry (multi) \n\n\nBehind the Shock Machine: The Untold Story of the Notorious Milgram Psychology Experiments by Gina Perry\n\n\nFormat: mobi/epub/azw3\nLength: 400 pages\nGenre: Non-Fiction/Psychology\nDate: 29 August 2013\n\nThe true story of the most controversial psychological research of the modern era.\n\nIn the summer of 1961, a group of men and women volunteered for a memory experiment to be conducted by young, dynamic psychologist Stanley Milgram. None could have imagined that, once seated in the lab, they would be placed in front of a box known as a shock machine and asked to administer a series of electric shocks to a man they'd just met. And no one could have foreseen how the repercussions of their actions, made under pressure and duress, would reverberate throughout their lives. For what the volunteers did not know was that the man was an actor, the shocks were fake, and what was really being tested was just how far they would go.\n\nWhen Milgram's results were released, they created a worldwide sensation. He reported that people had repeatedly shocked a man they believed to be in pain, even dying, because they had been told to - he linked the finding to Nazi behaviour during the Holocaust. But some questioned Milgram's unethical methods in fooling people. Milgram became both hero and villain, and his work seized the public imagination for more than half a century, inspiring books, plays, films, and art.\n\nFor Gina Perry, the story of the experiments never felt finished. Listening to participants' accounts and reading Milgram's unpublished files and notebooks, she pieced together an intriguing, sensational story: Milgram's plans went further than anyone had imagined. This is the compelling tale of one man's ambition and of the experiment that defined a generation.\n\nAuthor:\n\nGina Perry is a psychologist and writer. She wrote the Australian Broadcasting Corporation's award-winning Radio National documentary Beyond the Shock Machine. She lives in Melbourne, Australia.\n","torrent":{"xt":"urn:btih:1acca8dfe4b433ddce30efbbf309e2e2d9e372e1","amp;dn":"Behind+the+Shock+Machine%3A+The+Untold+Story+of+the+Notorious+Milg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1acca8dfe4b433ddce30efbbf309e2e2d9e372e1","infoHashBuffer":{"type":"Buffer","data":[26,204,168,223,228,180,51,221,206,48,239,187,243,9,226,226,217,227,114,225]},"announce":[],"urlList":[]}}