{"title":"Periodic Tales (gnv64)","uid":7040973,"size":18988578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1af372613a7dc3d7dce6daf6be33751fdb67529d&amp;dn=Periodic+Tales+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1329539348,"description":"Periodic Tales: A Cultural History of the Elements, from Arsenic to Zinc\nBy Hugh Aldersey-Williams\nEcco | March 2011 | ISBN-10: 0061824720 | EPUB/MOBI/LIT/PDF | 18.1 mb &lt;a href=&quot;\nhttp://www.amazon.com/Periodic-Tales-Cultural-History-Elements/dp/0061824739&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Periodic-Tales-Cultural-History-Elements/dp/0061824739&lt;/a&gt;\n\nLike the alphabet, the calendar, or the zodiac, the periodic table of the chemical elements has a permanent place in our imagination. But aside from the handful of common ones (iron, carbon, copper, gold), the elements themselves remain wrapped in mystery. We do not know what most of them look like, how they exist in nature, how they got their names, or of what use they are to us. Welcome to a dazzling tour through history and literature, science and art. In Periodic Tales, you'll meet iron that rains from the heavens and neon as it lights its way to vice. You'll learn how lead can tell your future and why zinc may one day line your coffin. You'll discover what connects the bones in your body with the White House in Washington, the glow of a streetlight with the salt on your dinner table.\nFrom ancient civilizations to contemporary couture, from the oxygen of publicity to the phosphorous in your pee, the elements are near and far and all around us. Unlocking their astonishing secrets and colorful pasts, Periodic Tales is a passionate journey through mines and artists' studios, to factories and cathedrals, into the woods and to the sea to discover the true stories of these fascinating but mysterious building blocks of the universe.\n\nAbout the Author\nHugh Aldersey-Williams is the author of numerous books on architecture, design, and science, including Panicology and The Most Beautiful Molecule, which was a finalist for the Los Angeles Times Book Prize. He lives in Norfolk, England.","torrent":{"xt":"urn:btih:1af372613a7dc3d7dce6daf6be33751fdb67529d","amp;dn":"Periodic+Tales+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af372613a7dc3d7dce6daf6be33751fdb67529d","infoHashBuffer":{"type":"Buffer","data":[26,243,114,97,58,125,195,215,220,230,218,246,190,51,117,31,219,103,82,157]},"announce":[],"urlList":[]}}