{"title":"New.York.I.Love.You.(2009).Trailer.Spanish.LanzamientosDivx.es","uid":5126836,"size":58654517,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:1bbd121994bce0ba7fc8bec6b5f22cb643e61edd&amp;dn=New.York.I.Love.You.%282009%29.Trailer.Spanish.LanzamientosDivx.es&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LDivx","files":3,"time":1255652705,"description":"Drama, Romantica | 110 min. \n\nTÃƒÂ­tulo original: New York, I Love You\nPaÃƒÂ­s: USA, Francia \nEstreno en USA: 16/10/2009 \nEstreno en EspaÃƒÂ±a: 16/10/2009 \nProductora: Vivendi Entertainment \nDirector: Mira Nair, Brett Ratner, Allen Hughes, Fatih Akin, Andrey Zvyagintsev, Wen Jiang, Scarlett Johansson, Natalie Portman \nGuiÃƒÂ³n: Yvan Attal, Allen Hughes, Shunji Iwai, Wen Jiang, Joshua Marston, Natalie Portman, Scarlett Johansson, Andrei Zvyagintsev, Fatih Akin, Randall Balsmeyer, Shekhar Kapur, Brett Ratner, Mira Nair \nReparto: Natalie Portman, Kevin Bacon, Orlando Bloom, Olivia Thirlby, Hayden Christensen, Ethan Hawke, Shia LaBeouf, Julie Christie, John Hurt, Carlos Acosta, Justin Bartha, Rachel Bilson, James Caan, Bradley Cooper, Chris Cooper, Drea de Matteo, Irrfan Khan, Cloris Leachman, Blake Lively, Emilie Ohana, Maggie Q, Shu Qi, Eli Wallach, Saul Williams, Robin Wright Penn, Anton Yelchin, Ugur Yucel\n\nSinopsis: \nDesde el nacimiento del cine, Nueva York no ha dejado de ser la ciudad de ensueÃƒÂ±o del celuloide: su abundante poblaciÃƒÂ³n de peculiar idiosincrasia, sus rascacielos hechos de piedra y vidrio disparÃƒÂ¡ndose hacia los cielos, sus culturas underground y sus affaires amorosos en lo alto de los tejados, todo ello se configura como un escenario perfecto para todo tipo de acciÃƒÂ³n, comedia, drama y poesÃƒÂ­a. En la pantalla grande, se ha inmortalizado la ciudad de cientos de maneras distintas en miles de pelÃƒÂ­culas. Pero ahora se abre a la ciudad una nueva ventana romÃƒÂ¡ntica, variada, libre de prejuicios, enteramente a travÃƒÂ©s de los ojos del amor; del amor en todas sus variedades, desde el primer amor, el amor firme, y el pasajero, hasta el amor recordado, el negado, el anhelado, y el que permanece para siempre. Una ventana que brindan en colaboraciÃƒÂ³n una serie de jÃƒÂ³venes y apasionados realizadores cinematogrÃƒÂ¡ficos procedentes de todas partes del mundo. \nBajo la direcciÃƒÂ³n de un eclÃƒÂ©ctico grupo integrado por algunos de los cineastas mÃƒÂ¡s imaginativos de nuestros dÃƒÂ­as, New York, I Love You invita al pÃƒÂºblico a penetrar en la intimidad de las vidas de los neoyorquinos en tanto se las tienen con el amor, lo disfrutan, y lo buscan. \nEn el Distrito de los diamantes, una fantasÃƒÂ­a romÃƒÂ¡ntica intercultural transforma la compra de una piedra preciosa. Mientras tanto, en Chinatown, un artista desesperado busca una musa renuente. En un hotel del Upper East Side, una cliente sofisticada y un botones misterioso efectÃƒÂºan un viaje fuera del tiempo. Tras una inesperada noche en Central Park, la pareja de un joven tiene una revelaciÃƒÂ³n sorprendente que dar. Mientras se desplazan hacia Greenwich Village, dos amantes se precipitan en taxi, metropolitano y a pie para reencontrarse por primera vez tras lo que creyeron una aventura de una noche. En Tribeca, un carterista experimenta un cambio de tornas cuando sigue a una chica seductora. Y en Brooklyn, la dicha de un momento de Coney Island envuelve a una pareja octogenaria. Estas historias y otras mÃƒÂ¡s se entretejen unas a otras para conferir un collage colorido y lÃƒÂ­rico no sÃƒÂ³lo de la ciudad sino del profundo anhelo de amor y de contacto humano que todos albergan dentro del mismo. ","torrent":{"xt":"urn:btih:1bbd121994bce0ba7fc8bec6b5f22cb643e61edd","amp;dn":"New.York.I.Love.You.%282009%29.Trailer.Spanish.LanzamientosDivx.es","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bbd121994bce0ba7fc8bec6b5f22cb643e61edd","infoHashBuffer":{"type":"Buffer","data":[27,189,18,25,148,188,224,186,127,200,190,198,181,242,44,182,67,230,30,221]},"announce":[],"urlList":[]}}