{"title":"Timothy Zahn - The Conquerors Saga","uid":11570114,"size":527819321,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c86f5a23812f6f11241073502fcb73c491ca24e&amp;dn=Timothy+Zahn+-+The+Conquerors+Saga+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Cybotage","files":3,"time":1417008688,"description":"\nIn a space opera setting, a failed first contact leads to an interstellar war between humanity (nicknamed by the aliens The Human-Conquerors) and an alien race, the Zhirrzh (nicknamed by humans The Conquerors). Meanwhile, other alien races try to take advantage of the conflict between the two powers.\n\n---\n\n01 - Conquerors' Pride (1994)\n\nConquerors' Pride, written in 1994, is the first book in the series. The book begins with the invasion of unknown aliens who, after a brutally efficient battle, take with them a prisoner: Commander Pheylan Cavanagh. Adam Quinn, under orders from Lord Stewart Cavanagh, later leads a team of elite fighter pilots to embark on a perilous mission to rescue Commander Cavanagh.\n\n---\n\nConquerors' Heritage (1995)\n\nConquerors' Heritage written in 1995, is the second installment of the trilogy, following Conquerors' Pride. This book, unlike the first, is told from the viewpoint of the Zhirrzh.\n\nIn the book, the human Pheylan Cavanagh has escaped his captors. He soon believes his only hope is to convince the Zhirrzh authorities that the humans were not responsible for the war. Meanwhile, his former captor Thrr-gilag struggles with the disgrace of permitting Cavanagh's escape; and gradually comes to believe that his own people are weakened by their customs. It is herein revealed that the Zhirrzh preserve the psyches of their dead as holographic 'Elders', and that the injury done to these by radio transmission, has provoked most of their interstellar wars.\n\n---\n\nConquerors' Legacy (1996)\n\nConquerors' Legacy written in 1996, is the third installment of the trilogy, following Conquerors' Pride. This book, is told from multiple viewpoints.\n\nIn the book, Lord Stewart Cavanagh looks for a defense against the Zhirrzh race's planned attack. Individuals from both sides of the war discover the foundations for it, a tragic misunderstanding that threatens to destroy both sides.\n\n---\n &lt;a href=&quot;\nhttps://www.goodreads.com/series/41505-the-conquerors-saga&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/series/41505-the-conquerors-saga&lt;/a&gt;","torrent":{"xt":"urn:btih:1c86f5a23812f6f11241073502fcb73c491ca24e","amp;dn":"Timothy+Zahn+-+The+Conquerors+Saga+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c86f5a23812f6f11241073502fcb73c491ca24e","infoHashBuffer":{"type":"Buffer","data":[28,134,245,162,56,18,246,241,18,65,7,53,2,252,183,60,73,28,162,78]},"announce":[],"urlList":[]}}