{"title":"The Eastern Bride (Christian Movie)","uid":4634833,"size":696175234,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1cd52f09eb9f5ae3594b1b2044d2fa5ac35aa4e8&amp;dn=The+Eastern+Bride+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"IndianChristian","files":3,"time":1231518855,"description":"The Eastern Bride (Christian Movie)\n\nIt is an undisputed fact that islam is the worst religion in the world. It is the religion of Muhammad aka Satan, the father of terror. If Christianity was created by God through the sacrifice of his son Jesus Christ, then Islam was created by Satan through the death of several million unbelievers. Even today as seen from events in Mumbai, Chechanya, Jaipur, london, New York and quite a number of other places, Islam wants all unbelievers dead or converted to islam. And the method to get that done is ruthless persecutions and harassment. This movie will give you a few glimpses of it. \n\nPete de Jaeger is a young globetrotting South African business consultant. Pete de Jaeger is also unaware. He is unaware of the pressure fellow Christians are under in the Middle East. He's unaware of the deception in China and how they appear to be open to Christianity. That is about to change. While on a business trip in the Middle East, Pete ends up in the middle of a family crisis. He is quickly awakened to the fact that Christians in both countries face real-life persecution for following the Lord, something Pete has taken for granted...until now. From the Producers of &quot;Behind The Sun&quot;, this challenging and inspiring drama will open your eyes to the realities of life for Christians under pressure in the Middle East and China.  \n\nPlease pray for Christians in islamic &amp; communist countries.\n\nLanguage: English\nSubtitles: None\nRun Time: 67 minutes\nMy Rating: 10/10\nQuality: 10/10 (Dvdrip)\nYear of Release: 2005\n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won't buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God's word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don't ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian","torrent":{"xt":"urn:btih:1cd52f09eb9f5ae3594b1b2044d2fa5ac35aa4e8","amp;dn":"The+Eastern+Bride+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd52f09eb9f5ae3594b1b2044d2fa5ac35aa4e8","infoHashBuffer":{"type":"Buffer","data":[28,213,47,9,235,159,90,227,89,75,27,32,68,210,250,90,195,90,164,232]},"announce":[],"urlList":[]}}