{"title":"Mia Dyson - The Moment [2012][EAC,log,cue. FLAC]","uid":8418241,"size":296555032,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d0d69d6c014b1d56affb2ef77743d08e86e89c7&amp;dn=Mia+Dyson+-+The+Moment+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":22,"time":1367105536,"description":"Artist: Release: The Moment\nMusicBrainz: 145ad11f-d17b-4558-9288-d20c8514842c\nReleased: 2012-08-17\nLabel: MGM Distribution\nCatalog#: BDR017\nCountry: AU\nPackaging: Digipak\n\nTracklisting:\n\n01. When the Moment Comes (03:20)\n02. Pistol (03:36)\n03. Tell Me (04:08)\n04. Fill Yourself (03:06)\n05. The Outskirts of Town (04:04)\n06. Dancing on the Edge (04:46)\n07. Jesse (05:16)\n08. To Fight Is to Lose (03:51)\n09. Cigarettes (04:57)\n10. Two Roads (04:05)\n\nMIA Dyson doesn't so much wear her heart on her sleeve as pack it like a pistol on her hip. Passionate? You betcha. It's her thing.\n\nThis is the sort of girl who breaks plates and sends your saddle home with expletives carved into the leather.\n\nThe Melbourne singer-songwriter (and ARIA winner) had all but exhausted her opportunities on this continent when in 2009 she decided to head to the spiritual home of her music - the US. In the intervening years she lost her partner, went broke and fell in with a management company that tried to change her name and sell her to a reality television show.\nMia also put in a lot of hard yards playing where her heroes played and travelling the roads they wrote about. All of those experiences are laid down and shouted out in this swaggering, cigarettes-and-bourbon basted recording.\n\nDyson is well schooled in the Lucinda Williams/Bonnie Raitt school of writing and singing. She even plays her own slide guitar.\n\nThose gravel road vocal chords can belt out anthemic rock songs such as the catchy When the Moment Comes, but she has the range and control to pull off ballads as well (To Fight is to Lose and Two Roads). That said, she doesn't like to ease off much, our Mia.\nThe Moment comes tearing out of the blocks and rarely lets up. The drums kick, the guitars wail, the organs swirl and there she is in the middle of it all with her snakeskin winklepickers and generous lungs.\n\nIf you are a fan of the aforementioned Lucinda, Bonnie or the like and you haven't heard Mia Dyson you are doing yourself a disservice. She is touring this album now and the live shows are reportedly well worth it.","torrent":{"xt":"urn:btih:1d0d69d6c014b1d56affb2ef77743d08e86e89c7","amp;dn":"Mia+Dyson+-+The+Moment+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d0d69d6c014b1d56affb2ef77743d08e86e89c7","infoHashBuffer":{"type":"Buffer","data":[29,13,105,214,192,20,177,213,106,255,178,239,119,116,61,8,232,110,137,199]},"announce":[],"urlList":[]}}