{"title":"John Hiatt - Bring The Family  [1987]  [Robbie60] [FLAC]","uid":6174128,"size":275484163,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1da70d4b9b1a969bd6ba4d1bac0b5d41adbb4df7&amp;dn=John+Hiatt+-+Bring+The+Family++%5B1987%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297702757,"description":"John Hiatt\nBring The Family\n\n\nLabel: A&amp;M\nReleased: 1987\nSource: Original CD \nSize Torrent: 262 MB\nFormat: FLAC\n\n\n\n\n\nBring the Family is John Hiatt's eighth album. It was his first album to chart on the Billboard 200, and featured his first single entry on the mainstream rock chart with &quot;Thank You Girl&quot;. It features Ry Cooder on guitar, Nick Lowe on bass guitar and Jim Keltner on drums. The four would later reform as Little Village and release an album in the 1990s. &quot;Thing Called Love&quot; would later become a hit for Bonnie Raitt, and &quot;Have A Little Faith In Me&quot; is among Hiatt's most popular songs, although it wasn't released as a single in America.\nThe album was recorded in four days after McCabe's Guitar Shop booker John Chelew convinced Hiatt that these were some of his best songs. Hiatt was recently sober but had burned so many bridges in the music industry he did not think he had a chance of continuing. He had been dropped by his label and &quot;wondered if I was worth a damn.&quot; Hiatt had played some solo acoustic shows at McCabe's in January 1987 just prior to recording where he debuted songs such as &quot;Lipstick Sunset,&quot; &quot;Your Dad Did&quot; and &quot;Memphis in the Meantime.&quot;\nDemon Records in England still loved his work and had pledged about $30,000 if he wanted to record (&quot;Demon Records said I could fart in a bathtub and they'd put it out,&quot; Hiatt says). A&amp;M Records in the U.S. eventually picked up the finished disc. Recording was done in Studio 2 of Ocean Way Studios, Los Angeles. These songs were all that were recorded - there were no leftovers or outtakes and Hiatt had to complete a couple of songs in the studio. &quot;I remember Ry walking out the door on the fourth day and me coming after him and going: 'Ry, I've got one more song. Could you stay?' Literally, we'd done nine and I needed one more,&quot; Hiatt has said. Budgets were so tight that Hiatt and Lowe shared a Holiday Inn room in the San Fernando Valley during the recording sessions. Lowe, an old friend of Hiatt's, took no payment for his contribution. Chelew turned out to be correct. &quot;Bring the Family&quot; is one of the cornerstones of Hiatt's career, and not a show goes by without a generous helping of its songs.\n\n\n\nPersonnel\n\nJohn Hiatt - Acoustic guitar, vocals, Piano on &quot;Have a Little Faith in Me&quot; \nRy Cooder - Electric guitar, Harmony on &quot;Thing Called Love&quot;, Sitar on &quot;Your Dad Did&quot; \nJim Keltner - drums \nNick Lowe - Bass guitar, Harmony on &quot;Learning How To Love You&quot; \n\nJohn Chelew - Production \nLarry Hirsch - Recording, Engineering \nJoe Schiff - Engineering, Mixing \nJeffrey Gold - Art direction \nMichael Hodgson - Art direction, Design \nSteven M. Martin - Photographs \n\n\n\nTrack Listing\n\n&quot;Memphis In The Meantime&quot; \n&quot;Alone In The Dark&quot; \n&quot;Thing Called Love&quot; \n&quot;Lipstick Sunset&quot; \n&quot;Have a Little Faith in Me&quot; \n&quot;Thank You Girl&quot; \n&quot;Tip Of My Tongue&quot; \n&quot;Your Dad Did&quot; \n&quot;Stood Up&quot; \n&quot;Learning How To Love You&quot; \n\nAll tracks written by John Hiatt\n","torrent":{"xt":"urn:btih:1da70d4b9b1a969bd6ba4d1bac0b5d41adbb4df7","amp;dn":"John+Hiatt+-+Bring+The+Family++%5B1987%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1da70d4b9b1a969bd6ba4d1bac0b5d41adbb4df7","infoHashBuffer":{"type":"Buffer","data":[29,167,13,75,155,26,150,155,214,186,77,27,172,11,93,65,173,187,77,247]},"announce":[],"urlList":[]}}