{"title":"REHAB-GRAFFITI THE WORLD","uid":3942600,"size":65773614,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1db4de981cb37030646d99420deba54423db2c16&amp;dn=REHAB-GRAFFITI+THE+WORLD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"arkguy72830","files":14,"time":1198252661,"description":"The Atlanta-based quintet breaks new ground and addresses new challenges on its latest album, Graffiti the World. The collection is truly the work of combined contributions from each individual member of the band. \\&quot;It\\&amp;#039;s five people getting\\&amp;#039; together and trying to do the music that they want to hear,\\&quot; says front man Danny Alexander. \\&quot;Everybody contributed. You always have a vision of what you want to do and it never really comes out the way you plan it, but the end result is really good. You\\&amp;#039;re just constantly trying to put out what you feel. The final result of their combined efforts evokes a more positive and inspired feeling to the record.\n    Formed in the late \\&amp;#039;90s, pioneering mash-ups of scorching rock and searing rap, Rehab released its debut album, Southern Discomfort in 2000, filled with an array of guest stars including Cee-Lo, Goodie Mob and Cody Chestnutt. The album spun off the top 15 modern rock hit \\&quot;It Don\\&amp;#039;t Matter\\&quot; and sold over 140 thousand units. This success enabled the band to kick off a 2 year national tour supporting the Vans Warped Tour and bands like Kottonmouth Kings and Linkin Park. Then, three years ago, in the wake of diverging creative, personal and financial points of view, the group splintered. While facing down his own personal demons, Danny brought together a new version of the band, which has delivered, Graffiti the World. \\&quot;I did a lot of observing and lyrically sat down for a while and thought about what was going on around me, what I wanted to do and where I wanted to do it,\\&quot; Danny says. This album is a documentary of the station you are in life and trying to get to the next area or stop.\\&quot;\n    For Rehab, Graffiti the World is a band\\&amp;#039;s bid to cover the world with special sounds, seeking the dark and light within, asking questions and perhaps, sometimes, finding the right answers. And Danny says he knows well he can\\&amp;#039;t do that alone. Along with the help of not only his band members, he collaborated with A-list producers/mixers Billy Hume, whose credits include the Ying Yang Twins, David Banner, and Bonecrusher, and Phil Tan whose worked with the Neptunes, Snoop, and Mariah Carey.","torrent":{"xt":"urn:btih:1db4de981cb37030646d99420deba54423db2c16","amp;dn":"REHAB-GRAFFITI+THE+WORLD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db4de981cb37030646d99420deba54423db2c16","infoHashBuffer":{"type":"Buffer","data":[29,180,222,152,28,179,112,48,100,109,153,66,13,235,165,68,35,219,44,22]},"announce":[],"urlList":[]}}