{"title":"A Fistful of Gun (GOG)","uid":12518344,"size":118165139,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1e5d59cdf855c2d297931509e0d4f4c8f655b000&amp;dn=A+Fistful+of+Gun+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mercs215","files":3,"time":1443802698,"description":"Install instructions:\r\n1. Run &quot;setup_a_fistful_of_gun_2.0.0.1.exe&quot;\r\n2. Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: A FISTFUL OF GUN\r\nGenre: Shooter - Action - Historical\r\nWorks on: Windows (XP, Vista, 7, 8, 10)\r\nLanguages: Audio and text: English\r\nModes: Single-player - Multi-player - Co-op\r\nReleased: September 24, 2015\r\nSize: 111.5 MB\r\nCompany: FarmerGnome / Devolver Digital\r\nStore page: https://www.gog.com/game/a_fistful_of_gun\r\n\r\nAbout:\r\nWhen the evil railroad baron Clayton Boon decided to build a track to Hell, he didn’t reckon on a crazed shaman raising a posse of embittered psychopaths from the dead to stop him. Now they’ll pursue him across the whole Wild West, fighting their way through hordes of bandits, bears, braves and boogeymen just to find Boon and repay their debt with… A FISTFUL OF GUN!\r\nSelect one of eleven unique playable gunslingers and seek revenge as a lone wolf or with up to eight other bandits in local and online co-op. Master the specialized controls of each character, collect gold from fallen foes to purchase upgrades, and imbibe a bit of liquid courage and unleash a tornado of lead across the dusty plains.\r\nMisfits and Outlaws: Choose between eleven different gunslingers each with their own unique control scheme and methods of attack to master. Some characters require the finesse of a gamepad while others are strictly bound to mouse controls to mount their offensive.\r\nMultiplayer and Co-Op Modes: Gather a posse of up to eleven other players for chaotic local and online cooperative modes or square off with other gunslingers at the corral in the white-knuckled versus mode.\r\nStory and Arcade Modes: Take up arms against those that stand opposed and blast your way through the colorful landscapes of the west against dozens of unique enemies. Grab a horse, forge a river, ride a train – there’s never a dull moment in the lawless lands of the Wild West!\r\n\r\nMinimum system requirements - Windows: XP or later\r\nProcessor: Dual Core 1.8 Ghz \r\nMemory: 2 GB RAM \r\nDirectX: Version 9.0 \r\nHard Drive: 600 MB available space \r\nAdditional Notes: Gamepad, mouse, and keyboard needed to use all characters","torrent":{"xt":"urn:btih:1e5d59cdf855c2d297931509e0d4f4c8f655b000","amp;dn":"A+Fistful+of+Gun+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e5d59cdf855c2d297931509e0d4f4c8f655b000","infoHashBuffer":{"type":"Buffer","data":[30,93,89,205,248,85,194,210,151,147,21,9,224,212,244,200,246,85,176,0]},"announce":[],"urlList":[]}}