{"title":"Maxidix Wifi Suite 13.5.28 Build 491 Final (2-click run)(registr","uid":8604858,"size":7727532,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ea70fd332bda3cf8994568ea641d6775fb24251&amp;dn=Maxidix+Wifi+Suite+13.5.28+Build+491+Final+%282-click+run%29%28registr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1371948566,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nVersion: 13.5.28 Build 491 Final\n\nDescription:\nMaxidix Wifi Suite is a unique and easy to use software that gives you a full control over Wi-Fi connections and provides a set of useful extra features.\n\nHot Spot\nTurn your computer into a real Hot Spot! Share Internet from Mobile networks, LAN or even other WI-FI network. Use your computer as a repeater to boost wireless signal. Save money on connecting to paid Internet spots, if you have more than one device.\n\nAutomatic connections to ad hoc networks\nEasily set up automatic connections to ad hoc networks or Wireless Access Points (WAP) that would automatically connect every time when the needed network or WAP appears near your location.\n\nIP profiles\nTired of endless changing of IP settings? Good news, we got the solution! IP profiles allow you to set up predefined IP settings and switch between them in a second! Moreover, Wifi Suite will automatically apply needed IP settings everytime you are connected to a network.\n\nFast Connect\nSpeed up the process of connection to Wi-Fi networks up to 6 times. Wifi Suite uses an optimized connection algorithm that decreases connection time, especially when connecting to new networks.\n\nImport and Export network profiles\nExport your Wi-Fi profiles and save them for further use. For example, you can backup and then restore access to known networks after the OS have been reinstalled.\n\nPlenty and accuracy of information\nGet all the information available about Wi-Fi interface, networks, and network profiles. As well as about the network signal quality with percentage accuracy and over 80 characteristics of Wi-Fi connections.\n\nNetwork statistics\nBe able to view all the processes that use your Wi-Fi connection and your Internet traffic.\n\nHome Page - http://www.maxidix.com/products/wifi-suite\n\nInstallation instructions:\n1. Execute the Maxidix Wifi Suite 13.5.28 Build 491 Final (2-click run)(registred).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:1ea70fd332bda3cf8994568ea641d6775fb24251","amp;dn":"Maxidix+Wifi+Suite+13.5.28+Build+491+Final+%282-click+run%29%28registr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ea70fd332bda3cf8994568ea641d6775fb24251","infoHashBuffer":{"type":"Buffer","data":[30,167,15,211,50,189,163,207,137,148,86,142,166,65,214,119,95,178,66,81]},"announce":[],"urlList":[]}}