{"title":"Michael Stanley Band - 4 vinyls","uid":3778001,"size":308577539,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1eb7c08f9d3038180e808741c3c8dad38e89f509&amp;dn=Michael+Stanley+Band+-+4+vinyls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Reride","files":49,"time":1187517784,"description":"Cabin Fever 1978\nNorth Coast 1981\nMSB 1982\nYou Can&amp;#039;t Fight Fashion 1983\n\nCleveland native Michael Stanley became a regional phenomenon, but the singer/songwriter/guitarist and his Michael Stanley Band deserved more national success than they achieved. Stanley, whose real name is Michael Stanley Gee, played bass with the folk-rock group Silk in the late &amp;#039;60s. He then went solo and released two solo albums in the early &amp;#039;70s that fit right in with the &quot;singer/songwriter&quot; era. His talent attracted the likes of producer Bill Szymczyk and guest musicians Joe Walsh, Todd Rundgren, and David Sanborn from the beginning. He formed the Michael Stanley Band (aka MSB) in 1975 and pursued a more straightforward rock direction. MSB recorded a string of albums through the late &amp;#039;70s and early &amp;#039;80s that were modest successes nationally but major hits in Ohio. In fact, the Michael Stanley Band was such a sensation at home that it still holds attendance records at major concert venues. 1980&amp;#039;s Heartland was easily MSB&amp;#039;s best album, and Stanley agrees. It included the hit single &quot;He Can&amp;#039;t Love You&quot; (sung by vocalist/keyboardist Kevin Raleigh) and the minor hit &quot;Lover&quot; (sung by Stanley and featuring blistering saxophone by Clarence Clemons). MSB&amp;#039;s second and last Top 40 hit was Stanley&amp;#039;s anthem &quot;My Town&quot; in 1983. After recording for Epic, Arista, and EMI, MSB independently released two albums on their own before breaking up in 1987. \n\nThe Michael Stanley Band was a reliably consistent, meat-and-potatoes enterprise responsible for superb Midwestern rock &amp; roll. Stanley went on to become a popular television and radio personality in Cleveland. He still regularly releases albums -- solo and the one-off group project the Ghost Poets -- and performs annual summer and New Year&amp;#039;s Eve shows along with occasional acoustic dates; these concerts and albums both feature MSB alumni and other Cleveland musicians. Razor &amp; Tie has reissued most of MSB&amp;#039;s catalog and two excellent best-of collections on compact disc. ~ Bret Adams, All Music Guide\n","torrent":{"xt":"urn:btih:1eb7c08f9d3038180e808741c3c8dad38e89f509","amp;dn":"Michael+Stanley+Band+-+4+vinyls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb7c08f9d3038180e808741c3c8dad38e89f509","infoHashBuffer":{"type":"Buffer","data":[30,183,192,143,157,48,56,24,14,128,135,65,195,200,218,211,142,137,245,9]},"announce":[],"urlList":[]}}