{"title":"Dog Owner's Home Veterinary Handbook","uid":4821449,"size":6667603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1fbf991086cd9ab9e28b12346bedf93fad9889d6&amp;dn=Dog+Owner%5C%27s+Home+Veterinary+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bugzbunny","files":-1,"time":1238778863,"description":"Dog Owner's Home Veterinary Handbook \n\nby Debra M. Eldredge DVM, Liisa D. Carlson DVM, Delbert G. Carlson DVM  James M. Giffin MD, Beth Adelman \nHardcover: 656 pages \nPublisher: Howell Book House; 4 edition (August 27, 2007) \nLanguage: English\n\n\nThe guide dog lovers have relied on for more than twenty-seven years, this handbook has been extensively revised to include the latest information on everything from canine healthcare to nutrition to holistic treatments. Dog Owner''s Home Veterinary Handbook, Fourth Edition, is the definitive guide for every dog owner. It puts vital information at your fingertips, with: \n\nAn index of signs and symptoms to help you find information fast \n\nClearly written, step-by-step directions for handling common canine ailments and problems \n\nA chapter on emergencies that explains what to do immediately for shock, broken bones, burns, dehydration, heat stroke, poisoning, insect stings and bites, wounds, and more \n\nHundreds of photos and drawings that illustrate what to look for and what to do to provide the best care for your dog \n\nA glossary of terms \n\nWith this guide, you''ll know when to rush your pet to the vet and when you can begin treatment at home. You''ll communicate more effectively with your vet. You''ll have the latest information on every aspect of your dog''s medical care when you need it. This is the hands-on reference you''ll trust again and again","torrent":{"xt":"urn:btih:1fbf991086cd9ab9e28b12346bedf93fad9889d6","amp;dn":"Dog+Owner%5C%27s+Home+Veterinary+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fbf991086cd9ab9e28b12346bedf93fad9889d6","infoHashBuffer":{"type":"Buffer","data":[31,191,153,16,134,205,154,185,226,139,18,52,107,237,249,63,173,152,137,214]},"announce":[],"urlList":[]}}