{"title":"PSL1GHT PS3 SDK Ubuntu 10.10 evilsperm for Vmware","uid":6084530,"size":1625401223,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:204213b777c2d7b1a97f2ccf8e863126fdc08680&amp;dn=+PSL1GHT+PS3+SDK+Ubuntu+10.10+evilsperm+for+Vmware&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"whnunlife","files":17,"time":1294264184,"description":"This is the same release as evilsperm, however, I converted the .vdi to .vdmk to allow this virtual image to run on Vmware workstation and Vmware fusion.\n\nCopyright (C) evilsperm\n*\n* This software is distributed under the terms of the GNU General Public\n* License (&quot;GPL&quot;) version 3, as published by the Free Software Foundation.\n*\n\n\nThis is my latest VM release to keep things on the legal side =)\n\n\nAccount info to get you started:\n\nUsername = evilsperm\nPassword = password\n\nsudo su = password\n\n--------------------------------\n\nThis is the latest PSL1HGT SDK release with ps3tools installed from hackerchannel.\nYou can build hex's for all of your dev boards as well as program apps for the PS3.\nI have included the latest tools from fail0verflow at the time of this VM release 1.4.2011\nYou should check their git regularly and update them though =)\nAlso included are tools from kakaroto, oopo, aerialX (make sure to check all of their git repos as well)\n\nNearly all PS3 keys are saved in ~/.ps3\nIt is up to you to add the rest as they are released.\n\n--------------------------------\n\nSome thanx for everyone in the scene:\n\nfail0verflow, geohot, Mathieulh, marcan42, AerialX, OoPo, KaKaRoToKS, waninakoko, hackerchannel\nAnd all the others I have left out, without all of you this scene would be nowhere.\n\n\nCheck http://rebug.me site regularly for updates to this VM and all of the latest news on Rebug!\n\nIf you have any questions on how to use this please post at one of the many PS3 News sites.\n &lt;a href=&quot;\nhttp://psx-scene.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://psx-scene.com&lt;/a&gt; &lt;a href=&quot;\nhttp://ps3news.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ps3news.com&lt;/a&gt; &lt;a href=&quot;\nhttp://ps3hax.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ps3hax.net&lt;/a&gt;\n\n\nI was running into issues signing things last night in the VM, it was taking 8-10+ mins. to sign anything. This is the fix that was twitted (it has to do with the way virtualbox captures the mouse).\n\nNaha09 \n@KaKaRoToKS if using evilsperms vm so if anyone has it disable mouse integration at the bottom left and move mouse in vm window for entropy\n\nKaKaRoToKS\n@diogomontenegro move your mouse to create entropy (generates random data for the signature)\n\nJust to clarify that in english for you guys lol this is what it means.\non the VM push the right CTRL + i \nThe mouse will capture into the VM then when your signing your file shake the mouse around for a few seconds (or longer if you want) and then it will take anywhere from 30 seconds to 1 min. to sign a file.","torrent":{"xt":"urn:btih:204213b777c2d7b1a97f2ccf8e863126fdc08680","amp;dn":"+PSL1GHT+PS3+SDK+Ubuntu+10.10+evilsperm+for+Vmware","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"204213b777c2d7b1a97f2ccf8e863126fdc08680","infoHashBuffer":{"type":"Buffer","data":[32,66,19,183,119,194,215,177,169,127,44,207,142,134,49,38,253,192,134,128]},"announce":[],"urlList":[]}}