{"title":"Jquery Hotshot","uid":16016334,"size":1883398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20b2a052e32df44bacff635468b4af3cdb7ef6c5&amp;dn=Jquery+Hotshot&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"gstoqnov94","files":1,"time":1476293935,"description":"Type : PDF\r\nPages : 32\r\n\r\njQuery is used by millions of people to write JavaScript more easily and more quickly.\r\n\r\nIt has become the standard tool for web developers and designers to add dynamic, interactive elements to their sites, smoothing out browser inconsistencies and reducing costly development time.\r\n\r\njQuery Hotshot walks you step by step through 10 projects designed to familiarise you with the jQuery library and related technologies. Each project focuses on a particular subject or section of the API, but also looks at something related, like jQuery's official templates, or an HTML5 feature like localStorage. Build your knowledge of jQuery and related technologies.\r\n\r\nLearn a large swathe of the API, up to and including jQuery 1.9, by completing the ten individual projects covered in the book.\r\n\r\nSome of the projects that we'll work through over the course of this book include a drag-and-drop puzzle game, a browser extension, a multi-file drag-and-drop uploader, an infinite scroller, a sortable table, and a heat map.\r\n\r\nLearn which jQuery methods and techniques to use in which situations with jQuery Hotshots.\r\n\r\nPackt Enterprise books can be summed up through the tagline &quot;Professional Expertise Distilled&quot;. They take in-the-trenches knowledge from experienced software professionals, and distil it into a single, easy to follow manuscript","torrent":{"xt":"urn:btih:20b2a052e32df44bacff635468b4af3cdb7ef6c5","amp;dn":"Jquery+Hotshot","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20b2a052e32df44bacff635468b4af3cdb7ef6c5","infoHashBuffer":{"type":"Buffer","data":[32,178,160,82,227,45,244,75,172,255,99,84,104,180,175,60,219,126,246,197]},"announce":[],"urlList":[]}}