{"title":"Al Jarreau - Live In London","uid":6512832,"size":435459056,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:20c903fc84b75304033444c80c72c38a8dd904ae&amp;dn=Al+Jarreau+-+Live+In+London&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":22,"time":1309703566,"description":"This is a snapshot of Al Jarreau a few years after achieving pop stardom, caught live before a large crowd at London's Wembley Arena. In contrast with the lean, dynamically subtle backup band on the earlier live Look to the Rainbow, here Jarreau arms himself with a flashy, heavily electronic R&amp;B/funk band with horns, and subtlety often goes out the window in favor of high-energy showmanship. Unlike his studio albums from this period, though, this concert allows him a little bit of room to display glimpses of his famous vocal acrobatics. The set starts with a burst of high-tech pizzazz on &quot;Raging Waters&quot; and &quot;Black and Blues&quot; and ultimately settles into a partying groove with &quot;Roof Garden&quot; and &quot;We're In This Love Together.&quot; Though the concert makes for a pleasurable listen in the home, Warner could not capture the intimate connection that the live Jarreau made with his audiences in any of his periods, so one feels a bit removed from the action. The video version of the concert, by the way, contains a few songs that were not available on the audio release. ~ Richard S. Ginell\n\nDeluxe Edition:\nAl Jarreau's historic 1984 Wembley Arena show was one for the history books indeed. This stunning concert was captured on tape by famed producer Tommy LiPluma &amp; features a bulk of treasures from Al's early 80's input from the Breaking Away, Jarreau and High Crime l.p's. For this special release, Al went back to the vaults &amp; discovered 4 additional tracks not released on the original LP, as well sharing his personal reflections of this historic gig in the newly penned liner notes + 5 star remastering by Joe Reagoso from the original Warner Bros. tapes, this will be a much in demand cd for 2010\n\n\nRecorded at Wembley Arena, London, England in November 1984.\n\nPersonnel: James Studer (vocals, keyboards); Michael Paulo (flute, saxophone); Michael &quot;Patches&quot; Stewart (trumpet, flugelhorn); Robbie Buchanan (synthesizer); Malando Gassana (percussion).\n\nAudio Mixer: Bill Schnee.\n\nLiner Note Author: Joe Reagoso.\n\nRecording information: Bill Schnee Studio (11/1984); Wembley Arena, London, England (11/1984).\n\nPhotographer: Kevin Stapleton.\n\nPersonnel: Al Jarreau (vocals); Steve George, Richard Page (vocals); Charles &quot;Icarus&quot; Johnson (vocals, guitar); Michael Paulo (flute, saxophone); Michael &quot;Patches&quot; Stewart (trumpet, flugelhorn); Jerry Hey (trumpet); Bobby Lyle, James Studer (keyboards, background vocals); Robbie Buchanan (synthesizer, bass); Larry Williams (synthesizer); Nathan East (bass, background vocals); Malando Gassama (percussion);Michael Casey Young (programming).\n\nTracklist:\n01. Raging Waters\n02. Trouble In Paradise (Bonus Track)\n03. Black And Blues\n04. I Will Be Here For You\n05. Let's Pretend\n06. Our Love (Bonus Track)\n07. Take Five (Bonus Track)\n08. High Crime\n09. Boogie Down (Bonus Track)\n10. Roof Garden\n11. Teach Me Tonight ","torrent":{"xt":"urn:btih:20c903fc84b75304033444c80c72c38a8dd904ae","amp;dn":"Al+Jarreau+-+Live+In+London","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20c903fc84b75304033444c80c72c38a8dd904ae","infoHashBuffer":{"type":"Buffer","data":[32,201,3,252,132,183,83,4,3,52,68,200,12,114,195,138,141,217,4,174]},"announce":[],"urlList":[]}}