{"title":"Parliament-Funkadelic: The Mothership Connection Live From Houst","uid":4248787,"size":1994858543,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:211bca73dab574a7446cadb41904e56dfeffb708&amp;dn=Parliament-Funkadelic%3A+The+Mothership+Connection+Live+From+Houst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"MrDap","files":2,"time":1213911100,"description":"DVD Rip XVid \nYear: 1976 \nLength: 82 Mins \nAudio: Good \nVideo: Fair \n\nReview By doomsdayer520 \n\nThis review is from: George Clinton: The Mothership Connection (DVD) \nI&amp;#039;m in funk heaven! As a longtime Parliament/Funkadelic worshipper who was tragically born too late to see them in their prime, this DVD offers a long overdue pleasure overload. Never mind the cranks who are criticizing some parts of this DVD, and dig the pure uncut funk instead. Sure, the video quality here leaves something to be desired, but this was recorded on film in the mid-70&amp;#039;s. I would also recommend that you increase the brightness on your player or computer as much of the video is very dark. But that&amp;#039;s because the stage lights were presented for the live audience, not for some future DVD that people could pick apart on electronic equipment. My only legitimate beef with this package is the lack of documentation or background about the concert recorded, and a personnel listing of the huge mob on stage would have been helpful. \nBut on the good side (and all that is good is nasty) you get a wide selection of funk bombs from the catalogs of both Parliament and Funkadelic, performed by the best and brightest of the ever-evolving P-Funk mob, plus the Mothership itself in all its freaky glory. On top of it all we see mainman George Clinton leading the insanity in a parade of shock-inducing wigs and outfits, and whipping the crowd into a frenzy. Fave musical moments are the opener &quot;Cosmic Slop&quot; with Mike Hampton&amp;#039;s superhuman guitar solos, a slammin&amp;#039; &quot;Standing on the Verge of Getting&amp;#039; It On&quot; featuring a frantic Fuzzy Haskins as MC, and &quot;Mothership Connection&quot; where the brilliant (and dearly departed) Glenn Goins really shines. Visually, you gotta love the classic outfits sported by all the members of the funk mob, like Maceo Parker and the Horny Horns, laidback genius Bernie Worrell, Stingray Davis, Grady Thomas, Calvin Simon (seen rarely), the Brides of Funkenstein, and especially Garry Shider with diaper and pacifier. Unfortunately the bass player and drummer are barely pictured through the entire DVD; my guesses would be Cordell Mosson and Jerome &quot;Bigfoot&quot; Brailey, but it sure would be nice to see them. In the grand finale, &quot;Night of the Thumpasaurus Peoples&quot;, Bootsy Collins (who rules) makes a special appearance along with the rest of his Rubber Band. Apparently Sly and the Family Stone were up there too, but by that point it&amp;#039;s hard to tell who&amp;#039;s who among the 40-plus funksters on stage. \n\nIf you dig the funk in any way, and especially if you&amp;#039;re a P-Funk aficionado, dismiss the minor technical limitations of this DVD and just let the performance blow the cobwebs out your mind. \n\nOther Reviews: http://www.amazon.com/review/product/B00005UM2L/ref=cm_cr_dp_all_helpful?%5Fencoding=UTF8&amp;coliid=&amp;showViewpoints=1&amp;colid=&amp;sortBy=bySubmissionDateDescending","torrent":{"xt":"urn:btih:211bca73dab574a7446cadb41904e56dfeffb708","amp;dn":"Parliament-Funkadelic%3A+The+Mothership+Connection+Live+From+Houst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211bca73dab574a7446cadb41904e56dfeffb708","infoHashBuffer":{"type":"Buffer","data":[33,27,202,115,218,181,116,167,68,108,173,180,25,4,229,109,254,255,183,8]},"announce":[],"urlList":[]}}