{"title":"French Film Collection(Film 34) SOMBRE (1998)","uid":6034117,"size":734501818,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:212f0533218d44371af7b0b5a6b75e56e0d18189&amp;dn=French+Film+Collection%28Film+34%29+SOMBRE+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"forcefox","files":-1,"time":1292178736,"description":"ENGLISH SUBTITLES INCLUDED\n\nSombre (1998)\n\nAccording to audience and critical reactions alike, this killer thriller is either a bold and masterful exploration of the darkest recesses of the human psyche or unpardonable amoral sensationalism. Whichever way you look at it, it'll scare the bejesus out of you.\n\nSombre begins as a sort of video diary as Jean (BarbÃƒÂ©) drives around France casually strangling prostitutes. The images, taken from the killer's vehicle, are jagged, disorientating, almost abstract. Director Philippe Grandrieux is also a video artist, and these shots could have come from a particularly gruesome, avant-garde installation. But after 25 minutes, Jean meets virginal Claire (Hartley regular, LÃƒÂ¶wensohn) and the film shifts in both style and substance as it explores their delicate relationship.\n\nDespite the fact that he's already tried to murder her sister Christine (Voillat), Claire accompanies Jean on his continued killing spree. It's as if the pair need each other. For misogynist Jean, Claire represents a beacon of goodness and light in whom he might find redemption, while Jean provides Claire with the ideal cause on which to exercise her maternal instincts and urge to save.\nYet there is a suspicion that Claire yearns to be a victim herself, a daring and devastating trait that fuelled much of the critical hoohah surrounding the film. Equally controversial was Grandrieux's refusal to build a cod-psychological history to explain Jean's behaviour. Instead, he brilliantly creates a parallel world that is almost totally devoid of emotion. Faces are blank. There is hardly any dialogue and human actions are virtually restricted to bodily functions - sex, eating, violence. In this world, where the moral decay, drudgery and horrors of modern life have numbed its inhabitants so completely, the only way to feel anything is through the ultimate experiences of murder or death itself.\n\nChilling.","torrent":{"xt":"urn:btih:212f0533218d44371af7b0b5a6b75e56e0d18189","amp;dn":"French+Film+Collection%28Film+34%29+SOMBRE+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212f0533218d44371af7b0b5a6b75e56e0d18189","infoHashBuffer":{"type":"Buffer","data":[33,47,5,51,33,141,68,55,26,247,176,181,166,183,94,86,224,209,129,137]},"announce":[],"urlList":[]}}