{"title":"Are You Being Served DVD6 (1978)(nl subs) vlinder TBS","uid":6529458,"size":4518893311,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:213c47bb0b0e109889df1d3d019204ae83fb531b&amp;dn=Are+You+Being+Served+DVD6+%281978%29%28nl+subs%29+vlinder+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1310287335,"description":"Are You Being Served DVD6 (1978) \n\n\n\nAre You Being Served? is een Britse televisiecomedyserie die verscheen tussen 1972 en 1985. In Nederland en Vlaanderen is deze serie beter bekend onder de naam Wordt u al geholpen?. In Nederland werd de eerste aflevering op 21 juni 1974 uitgezonden door de TROS. De serie is geschreven door David Croft en Jeremy Lloyd. In 1992 volgde er een spin off waarin enkele ex-werknemers van het warenhuis een pension runden onder de titel Grace &amp; Favour.\n De serie speelt zich af op de afdeling dames- en herenkleding van het fictieve Londense warenhuis Grace Brothers.\n \nZe steekt op subtiele wijze de draak met de Britse klassenmaatschappij. Er heerst een afgebakende hiÃƒÂ«rarchie (directeur - afdelingshoofd - verkoopchef - senior verkopers - junior verkopers - conciÃƒÂ«rge - huishoudelijke dienst), waarbij de karakters zich doorgaans stroperig opstellen naar hun meerderen en hun ondergeschikten ronduit schofferen.\n \nEind 2008 / begin 2009 is de serie herhaald op RTL4.\n \nSeizoen 6 (1978)\n \nBy Appointment - De kans bestaat dat Koningin Elizabeth en Prins Philip de winkel komen bezoeken.\n The Club - De personeelsleden krijgen toestemming van Mr. Grace jr. om een ruimte te gebruiken als gezelschapsruimte.\n Do You Take This Man? - Mrs. Slocombe gaat trouwen met de Griek Mr. Mataxis.\n Shedding the Load - Het gaat erg slecht met de verkoop en er moet een van de personeelsleden verdwijnen.\n A Bliss Girl - Er wordt parfum verkocht, maar het meisje van de firma dat dat zou verzorgen komt niet opdagen.\n Happy Returns - Mr. Grace jr. is jarig en het personeel studeert een toneelstuk voor hem in.\n \n\nEnglish\n\n\nStoryline\n\nThis quintessentially British sitcom is about Grace Brothers, a department store in London which is owned and kept traditional, almost pre-war (e.g. precise dress code for ladies frills and gentlemen's hats according to rank), by two brothers who look old enough to have fought in the Boer war but rarely appear, as most scenes play on one floor where Mr. Cuthbert Rumbold is the executive (meaning he enjoys an endless parade of foxy but stupid secretaries) in charge of management while his dignified floor walker, Captain Stephen Peacock, has daily charge over two small sales teams. The fat and bossy, implicitly man-hungry widow Mrs. Betty Slocombe supervises the attractive Miss Shirley Brahms (with a terribly common Cockney accent) -with first choice of customers, on commission- the sale of women's clothes and accessories; the sales star at the gentleman's side is Mr. Wilberforce Clayborne Humpries...\n\n\nTitel: Are You Being Served \nBron: Retail\n Formaat: DVD5\n Geluid: 2.0\n Taal: Engels\n Subs: Nederlandds\n Menu: Ja\n Extra's: Nee\n Cover: Ja HQ\n Size: 4.20 GB\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0068040/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0068040/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/are-you-being-served-seizoen-6/1002004006218157/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/are-you-being-served-seizoen-6/1002004006218157/index.html&lt;/a&gt;\n\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:213c47bb0b0e109889df1d3d019204ae83fb531b","amp;dn":"Are+You+Being+Served+DVD6+%281978%29%28nl+subs%29+vlinder+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"213c47bb0b0e109889df1d3d019204ae83fb531b","infoHashBuffer":{"type":"Buffer","data":[33,60,71,187,11,14,16,152,137,223,29,61,1,146,4,174,131,251,83,27]},"announce":[],"urlList":[]}}