{"title":"Bob Hope Collection - Thanks for the Memory (1938) Xvid 1cd - Sh","uid":9963216,"size":796825600,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:218b22353807da8d28b56bbe131525b8ed8762e7&amp;dn=Bob+Hope+Collection+-+Thanks+for+the+Memory+%281938%29+Xvid+1cd+-+Sh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SaM","files":-1,"time":1397541636,"description":"Bob Hope Collection - Thanks for the Memory (1938) Xvid 1cd - Shirley Ross [DDR]\n\n&quot;Thanks for the Memory&quot; (1938) is a popular song, with music composed by Ralph Rainger and lyrics by Leo Robin. It was introduced in the 1938 film The Big Broadcast of 1938 by \n\nShep Fields and His Orchestra with vocals by Bob Hope and Shirley Ross. Dorothy Lamour's solo recording of the song was also popular, and has led to many mistakenly believing \n\nover the years that it was she, and Hope, who sang the tune in the film (in which Lamour also appeared).\n\nIn the film, Ross and Hope's characters are a married couple who come to the brink of divorce. Near the film's end they poignantly sing one of the many versions of this song, recalling \n\nthe ups and downs of their relationship. (Then they decide to stick together.)\n\nThe song won the Academy Award for Best Original Song, and became Hope's signature tune, with many different lyrics adapted to any situation.\n\nThe song is often regarded as a companion piece to &quot;Two Sleepy People&quot;, written in September 1938 by Hoagy Carmichael with lyrics by Frank Loesser, also performed by Bob \n\nHope and Shirley Ross in the movie Thanks for the Memory which appeared in 1939, taking its title from the success of the song.\n\nCAST:-\nBob Hope... Steve Merrick\nShirley Ross ... Anne Merrick\nCharles Butterworth... Biney\nOtto Kruger... Gil Morrell\nHedda Hopper... Polly Griscom\nLaura Hope Crews.. Mrs. Kent\nEmma Dunn ... Mrs. Platt\nRoscoe Karns ... George Kent\nEdward Gargan ... Flanahan\nJack Norton... Bert Monroe\nPatricia Wilder... Luella\nWilliam Collier Sr.... Mr. Platt\n\nMusic by Ralph Rainger\nLyrics by Leo Robin\n\nCover versions\n    Mildred Bailey recorded the song on January 10, 1938 with a mixed group featuring Chu Berry doing a nice tenor sax solo.\n    Bing Crosby recorded the song for his 1956 album, Songs I Wish I Had Sung the First Time Around.\n    Ella Fitzgerald recorded this on her Verve release Whisper Not, with backing by Marty Paich and his orchestra.\n    Stacey Kent - included the tune on her 2001 Dreamsville album.\n    Harry Nilsson released a version on his album recorded with Gordon Jenkins, A Little Touch of Schmilsson in the Night.\n    Susannah McCorkle - Thanks For The Memory - Songs Of Leo Robin (1983), Most Requested Songs (2001)\n    Frank Sinatra recorded an extended version of the song with altered lyrics for his 1981 album, She Shot Me Down.\n    Rosemary Clooney on her 1985 album Rosemary Clooney Sings Ballads.\n\nParodies\n    Charlie and his Orchestra, a Nazi-sponsored German propaganda swing band, produced a version during WWII.\n    Marilyn Monroe's performance of &quot;Happy Birthday, Mr. President&quot; to U.S. President John F. Kennedy in 1962 was followed by an additional verse sung to the tune of &quot;Thanks for the Memory&quot;: &quot;Thanks, Mr. President/For all the things you've done/The battles that you've won/The way you deal with U.S. Steel/And our problems by the ton/We thank you so much.&quot;\n    The song was parodied as &quot;Thanks for the Medicare&quot; on one episode of the 1980s NBC-TV sitcom The Golden Girls. Estelle Getty's character, Sophia Petrillo, sang these lyrics to the melody of the song: &quot;Thanks for the Medicare/For Blue Cross and Blue Shield/For a hip that finally healed/Remember, on prescriptions, generic is a steal/We thank you so much.&quot;\n    Connie Chung sang a rendition of it with her husband Maury Povich on the final episode of her show Weekends with Maury and Connie in 2006.\n    Judi Dench sang her own 'thank you' version especially for Sir Michael Parkinson on his final show - The Final Conversation - in December 2007.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 78 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 78 mins","torrent":{"xt":"urn:btih:218b22353807da8d28b56bbe131525b8ed8762e7","amp;dn":"Bob+Hope+Collection+-+Thanks+for+the+Memory+%281938%29+Xvid+1cd+-+Sh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"218b22353807da8d28b56bbe131525b8ed8762e7","infoHashBuffer":{"type":"Buffer","data":[33,139,34,53,56,7,218,141,40,181,107,190,19,21,37,184,237,135,98,231]},"announce":[],"urlList":[]}}