{"title":"Dirt Rider","uid":10673334,"size":13733643,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:2198b455ef34ae622a9263ba37e507cdc60ba973&amp;dn=Dirt+Rider&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":1,"time":1406906710,"description":"Dirt Rider â„¢ is the one and only official game from Dirt Riderâ„¢ Magazine, the largest off-road motorcycle magazine in America and the premier source for anything related to motocross and off-road bikes!\nDirt Riderâ„¢ features:\n- Race in indoor stadiums to hot desert tracks, from dense forests to steep and insane mountain tracks, from dusty farm tracks to crazy rooftops trial racing: Dirt Riderâ„¢ is packed with content like no other motocross game!\n- Stunning, fluid graphics with all the latest visual effects present!\n- Features both bikes and quads, and even includes the awesome mini bike!\n- Sixteen different riders: from professional riders to insane mascots!\n- Time trial, knock-out mode, single race and various tournaments are yours to conquer!\n- Realistic physics and tight controls designed for perfect, smooth mobile gameplay!\n- Possibility to knock opponents of your bike : )\nIf you like 2XL MX Offroad, Road Rash, Supercross HD, Ricky Carmichael motocross, Bike Race or just anything related to motorbikes: you are totally going to love the one and only official Dirt Riderâ„¢ game!\nPLEASE NOTE:\nWe are offering this free motorcycle game as a trial version.\nThe full version can be purchased from within the game after installing.","torrent":{"xt":"urn:btih:2198b455ef34ae622a9263ba37e507cdc60ba973","amp;dn":"Dirt+Rider","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2198b455ef34ae622a9263ba37e507cdc60ba973","infoHashBuffer":{"type":"Buffer","data":[33,152,180,85,239,52,174,98,42,146,99,186,55,229,7,205,198,11,169,115]},"announce":[],"urlList":[]}}