{"title":"Night Watch 2004 720p x264 BRRip [MP4,AC3] Ehhhh","uid":9508553,"size":1051193585,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:21d7d71e37724d9bf9b06426c39615b62efc2f96&amp;dn=Night+Watch+2004+720p+x264+BRRip+%5BMP4%2CAC3%5D+Ehhhh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mynameisurlz","files":-1,"time":1390360020,"description":" Two bands of warriors, one good and one evil, battle to keep the peace in Moscow in this cat's cradle thriller from Russia. In 1342, the Warriors of Light (led by Gesser, Lord of Light) and the Warriors of Darkness (led by Zavulon, General of Darkness) declare a truce under which each side will form a law enforcement team to monitor the other side's activities. The Warriors of Light, who enforce the powers of good, patrol the Night Watch, while the Warriors of Darkness, who openly embrace evil, staff the Day Watch. Each watch group also contains &quot;Others,&quot; mortals with supernatural powers from both sides that include vampires, shapeshifters, witches, and the like. Prophecy suggests that one day, a Great One will surface and permanently extinguish the threat of an apocalyptic war between the two sides by upsetting the balance, lending greater power to either good or evil (depending on his or her choice) and thus determining the future of mankind forever. In 1992, Night Watch member and Warrior of Light Anton Gordesky (Konstantin Khabensky) discovers he's an &quot;other&quot; amid a sting on a witch. Cut to twelve years later. In 2004, Anton still works the Night Watch, but now he's a vampiric warrior who drinks blood. One night, while on patrol, he rescues a young boy named Egor (Dima Martinov) from a handful of Dark Warriors, but in the process, he encounters Svetlana (Maria Poroshina), a woman who acts as a &quot;funnel&quot; -- a conduit for the powers of evil. Anton reflects on the prophecy regarding &quot;The Great One,&quot; and begins to suspect that Svetlana and Egor may be harbingers of this fateful event. ","torrent":{"xt":"urn:btih:21d7d71e37724d9bf9b06426c39615b62efc2f96","amp;dn":"Night+Watch+2004+720p+x264+BRRip+%5BMP4%2CAC3%5D+Ehhhh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21d7d71e37724d9bf9b06426c39615b62efc2f96","infoHashBuffer":{"type":"Buffer","data":[33,215,215,30,55,114,77,155,249,176,100,38,195,150,21,182,46,252,47,150]},"announce":[],"urlList":[]}}