{"title":"Marie Lu - Legend 1&amp;2. NL Ebook. DMT","uid":9089232,"size":4074807,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:232b70dd804cc67e14123ad63dd8562868c58234&amp;dn=Marie+Lu+-+Legend+1%26amp%3B2.+NL+Ebook.+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"BiWild","files":-1,"time":1382558305,"description":"Marie Lu - Legend 1&amp;2. NL Ebook. DMT\n\nAuteur: Marie Lu \nPagina's: 239 / 291\nTaal: Dutch/Nederlands\nUitgever: Gottmer Uitgevers Groep B.V\nJaar van uitgifte: 2012 / 2013\nGenre: Jeugd\n\nAfbeelding\n\nLegend\nLegend speelt zich af in het Los Angeles van 2130, dat ondergelopen is na een overstroming. De 15-jarige June, telg uit de elite \nvan de Republiek, is een wonderkind. Ze is gehoorzaam en loyaal en wordt dan ook klaargestoomd voor een van de belangrijkste \nfuncties in de militaire rangorde van haar land. De eveneens 15-jarige Day, geboren in een sloppenwijk, is de meest gezochte \ncrimineel van de Republiek. Normaal gesproken zouden hun wegen zich nooit kruisen, maar dat gebeurt wel als de broer van June, \neen belangrijke militair, wordt vermoord en Day de hoofdverdachte is. De overheid opent de jacht op hem. Een ultiem kat-en-muisspel \ntussen June en Day gaat van start: zij wil haar broers dood wreken, terwijl hij probeert uit handen van de overheid te blijven en intussen \nook nog zijn familie wil redden van een mysterieuze epidemie. Maar dan komt June erachter dat de overheid iets met haar broers dood \nte maken heeft en er alles aan doet om dat verborgen te houden.\n\n\nAfbeelding\n\nLegend 2/ Wonderkind\nAan het eind van boek 1 ontsnappen Day en June ternauwernood aan een executie dankzij de tussenkomst van de Patriotten. \nDeze rebellen, die loyaal zijn aan de voormalige Verenigde Staten, gooien het op een akkoordje met hen. Day krijgt een prothese \nvoor zijn manke been. In ruil daarvoor moeten ze de Patriotten bijstaan bij de aanval tegen de Republiek. Het plan is om de nieuwe \nElector Primo te vermoorden. Anden blijkt echter een sympathieke, niet-corrupte jonge jongen te zijn, die bovendien het leven van \nDays broer Eden redt. Dit brengt Day en June in een lastig pakket. Als de jonge Elector dan ook nog hevig verliefd wordt op June, \nwordt Day helemaal op de proef gesteld\n\n\nMet dank aan de originele poster !! \n\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:232b70dd804cc67e14123ad63dd8562868c58234","amp;dn":"Marie+Lu+-+Legend+1%26amp%3B2.+NL+Ebook.+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"232b70dd804cc67e14123ad63dd8562868c58234","infoHashBuffer":{"type":"Buffer","data":[35,43,112,221,128,76,198,126,20,18,58,214,61,216,86,40,104,197,130,52]},"announce":[],"urlList":[]}}