{"title":"Ede Staal - Mien Toentje / As Vaaier Woorden (extras)  mp3@320Kb","uid":4718280,"size":198667676,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:239909b53b3226b66aafe4f423bdb32b33089fef&amp;dn=Ede+Staal+-+Mien+Toentje+%2F+As+Vaaier+Woorden+%28extras%29++mp3%40320Kb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WindTrade","files":29,"time":1234384710,"description":"Ede Staal (Warffum, Groningen, 2 augustus 1941 - Delfzijl, Groningen, 22 juli 1986) was leraar Engels en Groningse streektaalzanger en -dichter.\n\nEde Staal werd, na al in 1973 een single gemaakt te hebben (&quot;I'm in the blues&quot;), in 1981 ontdekt door Radio Noord, In 1982 werd zijn liedje &quot;Mien Toentje&quot; de herkenningsmelodie van een tuinierrubriek op Radio Noord. Het grappige liedje werd razend populair en al snel werd Ede de volkszanger van Groningen. De aanvragen voor optredens stroomden binnen maar Ede ging er zelden op in. \nIn december 1984 kwam Ede's eerste LP uit, met twaalf Groningse liedjes. De plaat, met de titel Mien Toentje, was een ongelofelijk succes. Het oplagecijfer rees naar het niveau van dat van een landelijk topsucces. In januari 1985 moest Staal een zware operatie ondergaan. Hij stond daardoor geruime tijd op non-actief. Pas in november dat jaar zou hij weer succesvol optreden op het Mollebone-liedjesfestival in Delfzijl. Begin 1986 kreeg Staal een vaste column in het Radio Noordprogramma Sloaperstil. Zijn &quot;vertelstertjes&quot; werden wekelijks uitgezonden op zondagochtend, en een aantal van hen zijn verschenen in het blad &quot;Toal en Taiken&quot;.\n\nJuist toen zijn ster begon te rijzen, werd bekend dat Staal aan longkanker leed. Op 22 juli 1986 overleed hij, na een korte maar zeer succesvolle artistieke carriÃƒÂ¨re, in zijn boerderij aan de Farmsumerweg onder Delfzijl. In die plaats werd hij ook begraven.\n\nOp 4 oktober 1986 kwam postuum zijn tweede LP uit (As vaaier woorden). Staal had in de laatste maanden van zijn leven nog een belangrijk aandeel gehad in de voorbereidingen. Bij de uitreiking van het eerste exemplaar aan zijn vrouw Fieke, werd tevens een prijs ingesteld (fl. 5000) die tweejaarlijks zal worden toegekend aan iemand die zich (niet beroepsmatig) bijzonder verdienstelijk heeft gemaakt voor de streektaal in relatie tot de radio. Diezelfde dag werd de K. ter Laan-prijs (van stichting 't Grunneger Bouk) postuum aan Staal toegekend. De tweede LP werd net zo'n groot succes als de eerste.\n","torrent":{"xt":"urn:btih:239909b53b3226b66aafe4f423bdb32b33089fef","amp;dn":"Ede+Staal+-+Mien+Toentje+%2F+As+Vaaier+Woorden+%28extras%29++mp3%40320Kb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"239909b53b3226b66aafe4f423bdb32b33089fef","infoHashBuffer":{"type":"Buffer","data":[35,153,9,181,59,50,38,182,106,175,228,244,35,189,179,43,51,8,159,239]},"announce":[],"urlList":[]}}