{"title":"The Halloween Encyclopedia(pdf){Zzzzz}","uid":11336653,"size":6683860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:245b16dec42a298779d545e9bdf3d86116eaaf8e&amp;dn=The+Halloween+Encyclopedia%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414752438,"description":"Several hundred A-Z entries cover the history, folklore, symbols, rituals, artifacts, and activities of Halloween. Morton's research extends to Wiccan lore, Celtic observances, and Christian mythology, including the Mexican celebration of the Day of the Dead. She writes enthusiastically about folk customs and is sensitive to the controversies surrounding horror literature, witchcraft, and demonism. Without undue pedantry, she explains the house-to-house souling pilgrimage, the incorporation of cabbages in Scottish holidays, the source of the boogeyman in bogs, and the lengthy training of Druid priests in predicting the future. Contributing to data are detailed photos and line drawings--players enjoying a fireside game of snap-apple, an illustration from the Luttrell Psalter, a cook preparing holiday eggs, children around a bonfire. A lengthy entry on Guy Fawkes Day, which absorbed many Halloween traditions, includes a detailed history, an engraving of the gunpowder conspirators, descriptions of regional variations, and the texts of several popular rhymes.\n\nAssisting teachers, researchers, and the media is a two-page chronology of Halloween, beginning with ancient Egyptian writings and a post-9/11 urban legend about going to malls on Halloween. A second appendix lists and summarizes literature and films from 1714 to 2001. The bibliography is thorough, covering early sources as well as recent works. The author could have improved on the list of books by separating primary and secondary sources.\n\nThis generously illustrated and indexed overview is a worthy addition to public and school libraries as well as the reference shelves of journalists and leaders of community events. Information on Halloween can be found in resources such as Folklore of American Holidays (3d ed., Gale, 1998) and Holidays, Festivals, and Celebrations of the World Dictionary (3d ed., Omnigraphics, 2003), but The Halloween Encyclopedia offers much more detail. RBB\n\nPublisher: McFarland; 2 edition (27 April 2011)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B005128V80","torrent":{"xt":"urn:btih:245b16dec42a298779d545e9bdf3d86116eaaf8e","amp;dn":"The+Halloween+Encyclopedia%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245b16dec42a298779d545e9bdf3d86116eaaf8e","infoHashBuffer":{"type":"Buffer","data":[36,91,22,222,196,42,41,135,121,213,69,233,189,243,216,97,22,234,175,142]},"announce":[],"urlList":[]}}