{"title":"The King of Kings (1927) - Cecil B de Mille (Silent)","uid":4746948,"size":1470369148,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:24fa2303efee9edb18200e8b0ad71939cd66604c&amp;dn=The+King+of+Kings+%281927%29+-+Cecil+B+de+Mille+%28Silent%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"johnefp","files":-1,"time":1235931864,"description":"Plot Synopsis by Hal Erickson\n\nHaving scored big-time box office with his first Biblical epic, The Ten Commandments (1923), Cecil B. DeMille hoped to top this success with his 1927 The King of Kings. Inasmuch as he was now dealing with the life of Christ, DeMille had to be careful to serve up equal amounts of showmanship and reverence. The first creative challenge: how to &quot;introduce&quot; Christ in a tasteful manner? The answer: as a blind child is cured through Jesus' intervention, DeMille cuts to the child's point-of-view, slowly fading in on the kindly countenance of H.B. Warner as the Son of Man. Still, DeMille remained DeMille, especially in his handling of the character of Mary Magdalene (Jacqueline Logan). No longer a tattered streetwalker, Mary Magdalene is now a glamorous courtesan, replete with legions of gorgeous slave girls (one of whom is &quot;bubble dancer&quot; Sally Rand) and dressed in revealing Hollywood-style gowns. In fact, the film opens on this character, as she ruminates over the defection of her favorite customer, Judas Iscariot (Joseph Schildkraut), who is spending far too much time with Jesus of Nazareth. Upon visiting Jesus herself, she immediately repents, casting off all her prior sins. Once again, the efficacy of the Cecil B. DeMille formula is proven: redemption has no dramatic value unless the film shows viewers why the sinner needs to be redeemed. Once he's gotten his box-office considerations out of the way, DeMille adheres faithfully to the particulars of Jesus' life, betrayal, trial, Crucifixion, and Resurrection. (Again, however, the director improves a bit upon his source material: the storm that follows the Crucifixion is of the same spectacular dimensions as the parting of the Red Sea in Ten Commandments, while the Resurrection is filmed in vibrant Technicolor). To back up the authenticity of his images, DeMille -- with an assist from scenarist Jeannie Macpherson -- utilizes scriptural quotes in his subtitles. And to avoid any untoward publicity while filming, DeMille required all of his actors to sign legal documents preventing them from indulging in any sort of &quot;sinful&quot; activity; this meant that poor old H.B. Warner had to steer clear of alcoholic beverages for nearly a year, though he more than made up for lost time after his contract ran out. Prepared to mercilessly lambaste The King of Kings, DeMille's critics were disarmed by his reverent, tasteful approach to the subject. Years after the film's release, a specially prepared 60-minute version of the 18-reel King of Kings was making the rounds of religious groups, church basements, and Easter-weekend telecasts. The film was remade in 1961 by producer Samuel Bronston and director Nicholas Ray, with Jeffrey Hunter as Jesus. &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0018054/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0018054/&lt;/a&gt;\n\nDirector:\nCecil B. DeMille\n\nH.B. Warner ... Jesus, the Christ\nDorothy Cumming ... Mary, the mother\nErnest Torrence ... Peter\nJoseph Schildkraut ... Judas Iscariot\nJames Neill ... James, brother of John\n\nValid : Yes [AVI]\nDuration : 02:37:35\nMovie complete : Yes\n\n[Video]\nResolution : 464x352\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 1052 Kbps\nQuality Factor : 0,28 b/px\n\n[Audio]\nCodec : ATSC/A-52 Dolby AC3\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 192 Kbps","torrent":{"xt":"urn:btih:24fa2303efee9edb18200e8b0ad71939cd66604c","amp;dn":"The+King+of+Kings+%281927%29+-+Cecil+B+de+Mille+%28Silent%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24fa2303efee9edb18200e8b0ad71939cd66604c","infoHashBuffer":{"type":"Buffer","data":[36,250,35,3,239,238,158,219,24,32,14,139,10,215,25,57,205,102,96,76]},"announce":[],"urlList":[]}}