{"title":"State of Decay + 2 DLC with latest patch (6/18/15)","uid":10850750,"size":2253703295,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:251a474fac08519dd38199a201ea5d9af9ab91d8&amp;dn=State+of+Decay+%2B+2+DLC+with+latest+patch+%286%2F18%2F15%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Tokizo","files":1,"time":1408807590,"description":"Its seem the game still work with old crack, but im not sure if it working perfectly, but the game running just fine.\n\nYou can download the crack from here: http://thepiratebay.se/torrent/10281774/State_of_Decay_Lifeline_Crack_Only_SKIDROW\n\nDLC:\nState of Decay - Breakdown\nState of Decay - Lifeline\n\nNotes, 6/18/15\n19 JUNE\t- UNDEAD SANYA\nSorry, everybody - I was on a plane with broken wifi. But the eagle has landed along with the patch notes: \n\n\nLifeline: \n\nFixed instances where players were only getting credit for rescuing 8 or less soldiers. \nZombies no longer disappear if a siege finishes while you are away from the base. \nFixed Words of Encouragement bonuses that weren't being applied during Radio Calls for assistance after stamina depletion if you've exited the game and then continued. \nFixed a bad character reference with a small text change. \nShortened Sasquatch's overblown and silly name. \nFixed power lines that were not lining up correctly and horizontally sticking out in the. \nFixed church crosses that weren't loading in correctly and appeared as black. \nFixed instances where the players were getting stuck on a wheelchair sign near the supermarket. \nFixed cameras going through the wall of the building near the Landing Zone. \nFixed spot where the player could get out of the intended environment. \nFixed two buildings that when viewed from specific areas were partially buried in the ground. \nFixed an area where environmental zombies (Zeds that aren't meant to be interacted with) were easily visible to the player. \nFixed AI hang for when NPC's would refuse to get into vehicles. \nRenamed the advice-giving doctor &quot;Schupman&quot;. \nFixed a series of text errors. \nFixed issues with Julene's friend becoming unresponsive when Julene would die while gathering at her house. \nFixed issue with Vienna Cho never becoming rescue-able. (This should help with progression stalls.) \nFixed an issue with broken stats that was tied to the generator and refrigeration. The construction bonuses would become too high but the refrigeration wouldn't offset and everyone would become sick if they would quit and reload multiple times. These should now give correct bonuses. \nAn invisible wall was removed from a small danger zone near black Friday \nMade a pathing change to prevent zombies from running through the back wall of the building \n\n\nBreakdown: \n\nFixed localization capabilities for RV text. \n\n\nAll: \n\nAdded dump files that will help us discover why ULL Crashes are happening. \nDisabled rumble when we enter a scene (should fix infinite rumble when you finish a siege with rumble active) \nFixed Medical Advice and Words of Encouragement across all games ","torrent":{"xt":"urn:btih:251a474fac08519dd38199a201ea5d9af9ab91d8","amp;dn":"State+of+Decay+%2B+2+DLC+with+latest+patch+%286%2F18%2F15%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251a474fac08519dd38199a201ea5d9af9ab91d8","infoHashBuffer":{"type":"Buffer","data":[37,26,71,79,172,8,81,157,211,129,153,162,1,234,93,154,249,171,145,216]},"announce":[],"urlList":[]}}