{"title":"Guy Clark - My Favorite Picture of You [2013][EAC,log,cue. FLAC]","uid":8762051,"size":265570309,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:25ad11d4e1cc5d4e5d3d4bbb3f496e3a7e8ee207&amp;dn=Guy+Clark+-+My+Favorite+Picture+of+You+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1375262060,"description":"Artist:Guy Clark\nRelease:My Favorite Picture of You\nReleased: 2013\nLabel: Dualtone Music\nCatalog#: DUA 1636\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:country,americana\n\n\n01. Cornmeal Waltz\n02. My Favorite Picture Of You\n03. Hell Bent On A Heartache\n04. El Coyote\n05. Heroes\n06. Rain In Durango\n07. Good Advice\n08. The Death Of Sis Draper\n09. Waltzing Fool\n10. The High Price Of Inspiration\n11. I'll Show Me\n\nGuy Clark's first album in four years is a wonderfully rough, tough, tender, wise, and gracefully resigned testament to a life lived, a craft followed, and regrets considered, weighed, and given due. Now 71 years old, Clark has been a world-class songwriter for decades, and as My Favorite Picture of You shows, he still is. He's as sturdy, honest, and truthful a songwriter as you're ever going to get. Clark's voice has grown rougher and more wearied, but it perfectly fits the songs here (Clark wrote or co-wrote everything on this album except for his fine cover of Lyle Lovett's &quot;Waltzing Fool&quot;), songs -- some sad, some not so -- that look back and remember, and yet that voice still has some hope left in it for a better future, or at least some kind of a future, even if it isn't better. The title tune is an emotional, confessional beauty about the love of Clark's life, Susanna Clark, his wife of 40 years, who passed in 2012. The cover of the album has Clark holding up a picture of his wife, Clark's favorite picture of her, as the song goes. The picture was taken after she had returned home one day to find Clark and fellow Texas alcoholic and brilliant songwriter Townes Van Zandt drunk again, an issue Susanna was willing to pack her bags over. She stormed outside, which is when the picture was taken. There's the song, and as Clark struggles in it to sort out his emotions about his late wife, what emerges is one of the most honest and haunting love songs ever written. Such is life. That seems to be the statement Clark is making with this fine, balanced set of songs, each recorded simply, strikingly sparse, but somehow full of depth and balance too, thanks to the presence of Bryn Davies' haunting cello and Morgane Stapleton's tender vocal harmonies on some tracks. There are so many great songs here, including the opener, the beautiful and roughly elegant &quot;Cornmeal Waltz,&quot; the wise &quot;Hell Bent on a Heartache,&quot; and the Appalachian murder ballad-styled &quot;The Death of Sis Draper,&quot; although everything here is of a piece, recorded with a sparse, clear, and unadorned sound that perfectly supports Clark's whiskey-worn voice and his songs that tell stories of lives lived, loves found and lost, the deep cost of a fleeting moment of redemption, and old memories that enrich and then vanish like ghosts, and under it all, there is the voice of someone who has lived and knows perfectly well how to tell those stories. My Favorite Picture of You is simply a wonderful, balanced gem of an album from a masterful songwriter.","torrent":{"xt":"urn:btih:25ad11d4e1cc5d4e5d3d4bbb3f496e3a7e8ee207","amp;dn":"Guy+Clark+-+My+Favorite+Picture+of+You+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ad11d4e1cc5d4e5d3d4bbb3f496e3a7e8ee207","infoHashBuffer":{"type":"Buffer","data":[37,173,17,212,225,204,93,78,93,61,75,187,63,73,110,58,126,142,226,7]},"announce":[],"urlList":[]}}