{"title":"BUZZ CUT - James W. Hall. Read by Frank Muller {FerraBit}","uid":4887227,"size":521901838,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:25c2b621c59fc6968da69b97a2fcfac01df3538c&amp;dn=BUZZ+CUT+-+James+W.+Hall.+Read+by+Frank+Muller+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FerraBit","files":-1,"time":1241783848,"description":"BUZZ CUT by James W. Hall (1996)\n\nRead by Frank Muller\n\nPublisher . .: Recorded Books (1996)\nISBN-10 . . .: 078873413X\nFormat . . . : MP3. From 12 CD's (13.5 hours). 270 tracks (~every 3 minutes).\nBitrate . . .: ~85 kbps (iTunes 8, VBR, mono, 44kHz)\nUnabridged . : Always (Frank Muller never read an abridgement)\nGenre . . . .: Suspense Thriller Fiction (USA)\n\nThe fifth book in the Thorn P.I. series\n\nButler Jack tracks down his childhood sweetheart, Monica, the daughter of Morton Sampson, president of Fiesta Cruise Lines. When he offers her the chance to avenge her mother and humiliate her father, she jumps at it, not realizing his true motives until he begins to kill the passengers one by one.\n\nScanned cover, edited files names and MP3 tags - just for you. \n\nCheers, FerraBit\nMay 2009\n\nLinks:\nhttp://www.jameswhall.com &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Frank_Muller&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Frank_Muller&lt;/a&gt; \n\nOriginally posted: TPB, Demoniod, Mininova\nPlease present your library card, and give me some loving.\n___________________________________________________\n \n\n  From Publishers Weekly:\nA poet as well as a thriller writer, Hall (Gone Wild, etc.) brings an ear for language and an eye for the evocative detail, for the surge of meaning within sound and surface, to his latest?which features his customary hero, the moody, middle-aged Thorn. Reuniting with Thorn here is his old friend Sugarman (last seen in Mean High Tide). Bizarre family dysfunction and impending ecological disaster prove familiar but still effective Hall motifs as Sugar signs on as head of security for a billion-dollar Miami-based cruise ship line and Thorn encounters an unusually chilling adversary. Sugar's task is to catch a chimerical murderer whose victims all have some relationship to the company's gambling flagship, the M.S. Eclipse, from which the criminal has been stealing $50,000 per month. Danger promptly surfaces, as Sugar is nearly killed by the psychopathic Butler Jack, who has stun-gun electrodes attached to his fingertips and who plans to hold the Eclipse and its passengers hostage for a king's ransom. Jack also has designs on Monica Sampson, the long-missing daughter of the cruise line's owner, but Thorn, who winds up aboard the ship along with Sugar, casts eyes toward this young beauty as well. Murder, techno-wizardry and plenty of sexual tension ignite into spectacular action as Jack sets the ship on a collision course toward an oil-laden supertanker off Miami's South Beach. The title is right on; this thriller will slice readers' sleep into slivers.","torrent":{"xt":"urn:btih:25c2b621c59fc6968da69b97a2fcfac01df3538c","amp;dn":"BUZZ+CUT+-+James+W.+Hall.+Read+by+Frank+Muller+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25c2b621c59fc6968da69b97a2fcfac01df3538c","infoHashBuffer":{"type":"Buffer","data":[37,194,182,33,197,159,198,150,141,166,155,151,162,252,250,192,29,243,83,140]},"announce":[],"urlList":[]}}