{"title":"16  Horsepower - Secret South (2000) [192]","uid":3647946,"size":60376573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:264551ff560110d09124e36dd74033bc74c70e6a&amp;dn=16++Horsepower+-+Secret+South+%282000%29+%5B192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"epeb","files":14,"time":1174920242,"description":"Sin, salvation, deliverance, redemption, the Holy Spirit, divine intervention, and prayer; it&amp;#039;s all in a day&amp;#039;s work for 16 Horsepower singer/songwriter/multi-instrumentalist David Eugene Edwards. On their third album and first for indie Razor &amp; Tie, the band works within the unique sound they&amp;#039;ve already defined. With a voice as windswept, barren and generally spooky as the Bates Motel, Edwards unravels 11 mini-sermons with a frightening intensity and emotional edge. When he sings, the ghostly moan that emanates, sounds like he&amp;#039;s overcome by forces beyond his control. It&amp;#039;s that creepy voice, similar to Michael Been of The Call, along with sparse but powerful instrumentation, and a fire and brimstone lyrical slant that separates 16 Horsepower from the rest of the alt-Americana pack. Seldom have banjos, violins, organ, and bandoneon (an old accordion that helps define the band&amp;#039;s unique sound), let alone guitar, piano and, stand-up bass, seemed quite as intimidating and brooding as in the hands of this band. The songs are texturally diverse, but the dark, menacing atmosphere, especially in the stark banjo led disc closing &quot;Straw Foot&quot; and the pounding album opener &quot;Clogger,&quot; is pervasive, giving the disc an ominous feel that rarely lets up. Their unadorned version of the traditional &quot;Wayfaring Stranger&quot; with Edwards singing through what sounds like a paper cup, could have come off an old Library of Congress album. Although they&amp;#039;re working within a genre they practically define and this album doesn&amp;#039;t push them in any radical new directions, Secret South is another worthy entry into the catalog of a band unafraid to explore the shadowy side of spiritual territory with the passion, fervor, and conviction of a backwoods preacher. \n","torrent":{"xt":"urn:btih:264551ff560110d09124e36dd74033bc74c70e6a","amp;dn":"16++Horsepower+-+Secret+South+%282000%29+%5B192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"264551ff560110d09124e36dd74033bc74c70e6a","infoHashBuffer":{"type":"Buffer","data":[38,69,81,255,86,1,16,208,145,36,227,109,215,64,51,188,116,199,14,106]},"announce":[],"urlList":[]}}