{"title":"Hombre (Western) {Newman, Boone} [1967]","uid":8186322,"size":749737134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27521473a3b68d3517d230eaab9f12db7f75ce94&amp;dn=Hombre+%28Western%29+%7BNewman%2C+Boone%7D+%5B1967%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alien99","files":-1,"time":1361730865,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0061770/?ref_=fn_al_tt_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0061770/?ref_=fn_al_tt_1&lt;/a&gt;\n\nStoryline\n\nJohn 'Hombre' Russell is a white man raised by the Apaches on an Indian reservation and later by a white man in town. As an adult he prefers to live on the reservation. He is informed that he has inherited a lodging-house in the town. He goes to the town and decides to trade the place for a herd. He has to go to another city. The only stagecoach is one being hired for a special trip paid by Faver and his wife Audra. As there are several seats others join the stagecoach making seven very different passengers in all. During the journey they are robbed. With the leadership of John Russell they escape with little water and the money that the bandits want. They are pursued by the bandits. As they try to evade the bandits they reveal their true nature in a life threatening situation. \n\nTrivia\nThe photo in the closing credits of the film was taken in 1886 by Camillus Fly, the famous Tombstone (AZ) photographer. The white boy in the photo is Jimmy (Santiago) McKinn, captured by the Apaches in 1885. Like the Paul Newman character in the film, McKinn was totally assimilated in the tribe and was rescued against his will when Geronimo surrendered in 1886.\n\nReview\n\nPaul Newman plays a half breed Apache caught in a tight spot, and one who shows his mettle when the chips are down. Trapped on a stage that is robbed by a gang of thieves, he is forced into a situation where he must defend people he doesn't respect, and fight people he has no quarrel with. In typical Elmore Leonard fashion, the lone quiet man is far more than he seems to be, and honor and simple dedication to truth are the shining jewels of human existence. (See also &quot;Valdez is Coming&quot;.) Elmore Leonard's westerns are the very best of the genre, as long as you include &quot;The Searchers&quot; and &quot;The Wild Bunch&quot; and &quot;Monte Walsh&quot;. Paul Newman's performance is all fierce inner fire and incredible fury at injustice, never losing control even when he is lashing out with devastating effect. The special highlight here is Richard Boone, always a great performer, but in this movie he is just fabulous. The scene where he verbally bullies the last spot on the stage away from an Army officer just drips with a finely tuned malevolence that you can feel in the air. Brilliant movie, one you shouldn't miss.\n","torrent":{"xt":"urn:btih:27521473a3b68d3517d230eaab9f12db7f75ce94","amp;dn":"Hombre+%28Western%29+%7BNewman%2C+Boone%7D+%5B1967%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27521473a3b68d3517d230eaab9f12db7f75ce94","infoHashBuffer":{"type":"Buffer","data":[39,82,20,115,163,182,141,53,23,210,48,234,171,159,18,219,127,117,206,148]},"announce":[],"urlList":[]}}