{"title":"knabbel en babbel heibel in de boom  2Lions-Team","uid":5362130,"size":3087198033,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:27a3d39ff18ea0a73685c260f695e11d836c6b49&amp;dn=knabbel+en+babbel+heibel+in+de+boom++2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1266144580,"description":"Knabbel en Babbel Heibel in de Boom       \n\n \n  Knabbel en Babbel, de meest ondeugende figuren die Disney studio's ooit voortgebracht hebben, zijn grappig, snoezig en altijd daar te vinden waar problemen zijn. Dit is een speciale verzameling van hun avonturen die het hele gezin keer op keer aan het lachen zullen maken.\n\nDonald Duck wordt gek in &quot;De Kwakende Lastpak&quot; als hij geen medestanders kan vinden om de boom te snoeien waarin Knabbel en Babbel wonen! In [&quot;Popcorn&quot; haalt Donald hen over om de sneeuw van zijn stoep te halen, maar uiteindelijk staat hij zelf popcorn te schuiven! Vervolgens is het vakantie en maken Knabbel en Babbel ruzie met Donald over het lekkers onder zijn boom in &quot;De Kerstverrassing&quot;. Drie keer raden wie zichzelf uitnodigen om bij Donald pannenkoeken te komen eten in &quot;Ontbijt Voor Drie&quot;? Menue: Ja. Audio: Eng/NL AC3 2CH. Subs: NL instelbaar. Cover: Nee. NZB: wordt meegepost. Bestand: VTS. Er wordt 10% blocks par meegepost. Veel plezier met deze. Grtz. Charlie.\n\n\nEnglish\n\nChip 'n Dale in the tree Heibel\n\n \n  Chip 'n Dale, the most mischievous characters that Disney studios ever produced, are funny, cute and always there to find problems. This is a special collection of their adventures the whole family once again will make them laugh.\n\nDonald Duck is crazy in &quot;The Croaking troublemaker&quot; when he could find no allies to cut the tree where Chip and Dale live! In [ &quot;Popcorn&quot; Donald brings them to the snow from his sidewalk to get, but ultimately he is sliding popcorn! Then the holidays and make Chip and Dale fight with Donald over the goodies under his tree in &quot;The Christmas Surprise&quot;. Guess who invite themselves to dinner with Donald pancakes in &quot;Three For Breakfast&quot;? Menue: Yes. Audio: Eng / Eng AC3 2CH. Subs: NL adjustable. Cover: No. NZB: meegepost is. File: VTS. It blocks 10% par meegepost. Have fun with this. Grtz. Charlie.\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail pal\nAudio : English, Dutch \nOndertitels : Dutch (Lossles)\nMenu : Yes\nDisplay aspect ratio : 4/3\n \nGenre : Animatie\nFamiliefilm\n \nWeblink : http://disneyinfo.nl/dvddetail.php?film=418 \n\n\n \n \n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                  &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\t \n\n \n","torrent":{"xt":"urn:btih:27a3d39ff18ea0a73685c260f695e11d836c6b49","amp;dn":"knabbel+en+babbel+heibel+in+de+boom++2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27a3d39ff18ea0a73685c260f695e11d836c6b49","infoHashBuffer":{"type":"Buffer","data":[39,163,211,159,241,142,160,167,54,133,194,96,246,149,225,29,131,108,107,73]},"announce":[],"urlList":[]}}