{"title":"[Shinori Raws] Street Fighter IV Juri Han Episode (HD)","uid":8806600,"size":894217636,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:27eee15815146edd5a846135871a4a234f1daef8&amp;dn=%5BShinori+Raws%5D+Street+Fighter+IV+Juri+Han+Episode+%28HD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1376347561,"description":"[b]Story[/b]\n\nIn the S.I.N. laboratory, Juri undergoes an operation on her eye. She gains the Feng Shui Engine, which gives her incredible ki, speed and power. It is revealed that Juri was a prominent practitioner of Taekwondo when she was 15. Her father was a lawyer in charge of prosecuting organized crime operations. In this capacity, Shadoloo was his next target, causing her family to be kidnapped by that very organization. During the ordeal, Juri lost her parents, and her left eye was gravely wounded.\n\nAfter the operation, Juri proceeds to assassinate operatives in a public area which was her first mission to test out the Feng Shui Engine. Even with guns, her enemies stood no chance against her as she took them out one by one by attacking them from behind. Chun-Li, Cammy and Guile were called to the scene to stop her massacre. Chun-Li rushes into the scene to arrest Juri, and arrives just as Juri kills the gunmen using the Ki of her Feng Shui Engine from the inside a building, a woman dies in the attack mistakenly (however, a boy survives). Juri and Chun-Li battle, ending with Juri unleashing her eye's power and knocking out Chun-Li. As her victim lay on the ground, Juri prepared to deal the finishing blow. However her Feng Shui Engine malfunctioned, forcing her to flee back to the lab.\n\nAfter fixing it, Seth assigns Juri her next mission: capturing Bison's elite female assassins, the Dolls. Juri flies to the base of the Dolls with several S.I.N. employees. She manages to defeat every single assassin in combat, including Juli and Juni. As she was carrying the two unconcious assassins away to an S.I.N plane, Cammy and Guile arrive. They have a heated fight, but Juri comes out on top and manages to incapacitate Guile. She boards her plane and straps Juni and Juli to beds with wheels. As it takes off, Cammy manages to jump and grab onto the open boarding ramp, and confronts Juri for one final time. After an intense conflict, Juri pushes one of the rolling tables (with Juni on it) which collides with Cammy, who both fall off the boarding ramp into mid-air. They survive the fall, though, as there was soft snow to break their fall. \n\n[b]INFO[/b]\nStudio: Gonzo\nEpisode: 1\nSubtitles: None\nLength:35 Minutes\nInput Type : AVC1(GVC)\nInput Size : 1920 x 1080\nOutput Type : YUY2\nOutput Size : 1920 x 1080\nFrameRate(Frame/sec) : 0.00 (23.98)\nSampleRate(Sample/sec) : 48000\nBitRate(Bit/sample) : 16\nChannels : 2\nKBitRate(KBit/sec) : 0\n\n[b]Captures[/b] &lt;a href=&quot;\nhttp://s19.postimg.org/g83w20b03/Shiniori_Raws_Super_Street_Fighter_IV_OVA_2_B.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/g83w20b03/Shiniori_Raws_Super_Street_Fighter_IV_OVA_2_B.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s19.postimg.org/5zbew6myb/Juri_Han_By_The_Enforcer.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/5zbew6myb/Juri_Han_By_The_Enforcer.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:27eee15815146edd5a846135871a4a234f1daef8","amp;dn":"%5BShinori+Raws%5D+Street+Fighter+IV+Juri+Han+Episode+%28HD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27eee15815146edd5a846135871a4a234f1daef8","infoHashBuffer":{"type":"Buffer","data":[39,238,225,88,21,20,110,221,90,132,97,53,135,26,74,35,79,29,174,248]},"announce":[],"urlList":[]}}