{"title":"Myron Moose Funnies (Restored)","uid":7797702,"size":116629283,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2810f0a8a320dfd8bd7b366e2b180f6a40b5094a&amp;dn=Myron+Moose+Funnies+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1352193005,"description":"Issues 1-2 of 'Myron Moose Funnies' V1\nMyron Moose Comic Book Works, 1971 and 1973\nWritten and Illustrated by Bob Foster\nWith contributions from Vincent Davis\n\nIssues 1-3 of 'Myron Moose Funnies' V2\nFantagraphics Books, 1987\nWritten and Illustrated by Bob Foster\nWith contributions from Vincent Davis, Bob Zamboni, Steve Lafler, Carol Lay\n\nNot sure why no mention is made of the Fantagraphics issues, but here's this, anyway...\n\nMyron Moose Funnies #1 shows off some of Foster's extensive knowledge of comics, including underground comics, as Myron Moose is featured in several brief parodies of Batman, Little Orphan Annie, Carl Barks' Donald Duck, Buck Rogers, Dick Tracy and Fritz the Cat, among others. Foster not only demonstrates personal knowledge (and affection) for the original comics, but exhibits an adept skill for spoofing the original artists' cartooning style (within the limits of his own ability, of course).\n\nThe second issue, following two years after the first, integrates quite a bit more deviant underground content into its content, most of it supplied by Foster but some provided by Vincent Davis. A few others also contribute to the book, most notably Alex Toth, who did a one-pager featuring Fox, a minor comic costumed hero Toth sometimes illustrated, and Myron Moose.\n\nThe brief series was successful enough that Foster produced &quot;The History of Moosekind&quot; for the first 16 issues Marvel Comic's Crazy magazine from 1973 to 1975. Though he never developed truly exceptional cartooning skills, he did evolved into a very talented writer, storyboard artist and animator. In the 1980s Foster wrote the Donald Duck comic strip for Disney and Gladstone Publishing and later was the editor of Walt Disney's Comics &amp; Stories, among other titles. He's also been an animation storyboard artist for Nickelodeon, Fox, Dreamworks and many others, which in 2010 led to Foster being elected President of The Animation Guild, a union that represents 3,000 animation artists and writers, mostly around Los Angeles, where he still lives.","torrent":{"xt":"urn:btih:2810f0a8a320dfd8bd7b366e2b180f6a40b5094a","amp;dn":"Myron+Moose+Funnies+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2810f0a8a320dfd8bd7b366e2b180f6a40b5094a","infoHashBuffer":{"type":"Buffer","data":[40,16,240,168,163,32,223,216,189,123,54,110,43,24,15,106,64,181,9,74]},"announce":[],"urlList":[]}}