{"title":"Castle S05E10 HDTV NL Subs DutchReleaseTeam","uid":8010690,"size":365119805,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:289507015ba722514432fee2c0ad4dd14fcbfccc&amp;dn=Castle+S05E10+HDTV+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Boobin16","files":-1,"time":1357989759,"description":"Plot:\n\n Castle speelt zich af rond de succesvolle schrijver Richard Castle (Nathan Fillion),die net de hoofdpersoon uit zijn detectivereeks heeft laten sterven. Als blijkt dat iemand de moorden uit zijn boeken kopieert, \n neemt het leven van de bestsellerauteur een onverwachte wending. Rechercheur Kate Beckett (Stana  Katic) gaat naar Richard voor hulp,\n en Castle wordt de belangrijkste troef van de New Yorkse politie in haar jacht op de dader. Al snel wordt duidelijk dat de karakters van Castle en Beckett niet altijd goed matchen,  maar tijdens hun samenwerking raakt Castle zo van haar onder de indruk dat hij besluit een nieuwe,door haar geï¿½nspireerde, detectivereeks te gaan schrijven.  Hij wendt zijn invloed en connecties aan om toestemming te krijgen Beckett voor langere periode te volgen tijdens haar werkzaamheden en al snel lost het duo samen moordzaken op.\n\n\n Vertaling: Rino, Quetsbeek, Sniper8421\n\n Seizoen 5 Aflevering 10: Significant Others\n\n\n Wanneer een machtige echtscheidingsadvocaat die alleen vrouwen vertegenwoordigd wordt vermoord, worden Castle en Beckett geconfronteerd met een overvloed aan boze ex-echtgenoten, elk van hen kan de moordenaar zijn. Ondertussen verhuist Castle's ex-vrouw, Meredith, in huis om te zorgen voor Alexis terwijl ze herstelt van Mono en tot overmaat van ramp, wordt Beckett ook gedwongen om in te trekken, terwijl haar appartement wordt gefumigeerd\n\n\n Deze serie wordt u aangeboden door het DutchReleaseTeam.\n Voor de reviews van de nieuwste films, muziek, series, games etc\n Kom eens langs op &lt;a href=&quot; http://www.hetmultimediacafe.be/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hetmultimediacafe.be/&lt;/a&gt;\n\n\n DutchReleaseTeam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:289507015ba722514432fee2c0ad4dd14fcbfccc","amp;dn":"Castle+S05E10+HDTV+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"289507015ba722514432fee2c0ad4dd14fcbfccc","infoHashBuffer":{"type":"Buffer","data":[40,149,7,1,91,167,34,81,68,50,254,226,192,173,77,209,79,203,252,204]},"announce":[],"urlList":[]}}