{"title":"Fab An Intimate Life of Paul McCartney by Howard Sounes(mobi)[ro","uid":6302917,"size":3954014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:291be8789dea41ff480cd28d3cb8134cf2ae9973&amp;dn=Fab+An+Intimate+Life+of+Paul+McCartney+by+Howard+Sounes%28mobi%29%5Bro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":1,"time":1302218104,"description":"FAB: AN INTIMATE LIFE OF PAUL McCARTNEY\nBy HOWARD SOUNES\nPublisher: Da Capo Press (October 26, 2010) \n Language: English\nISBN-10: 0306817837 \nNo of Pages: 656\nFormat: mobi [This can be viewed or converted to other formats using Calibre  or similar programs]\nYou can download Calibre direct from the website \n\n\nThe living embodiment of The Beatles, a musical juggernaut without parallel, Paul McCartney is undoubtedly the senior figure in pop music today. In this authoritative biography, journalist and acclaimed author Howard Sounes leaves no stone unturned in building the most accurate and extensive profile yet of music's greatest living legend.\nHe is one of the biggest stars that has ever existed, the only key member left from the unquestioned 'biggest band of all time'. But despite the almost unprecedented press coverage he has received throughout his lifetime, the private personality of Paul McCartney remains a source of intrigue and relative mystery to the public.\nSpanning the entirety of McCartney's life from early childhood right up to the present day, Fab delves deep into the life of this remarkable and often surprising man, revealing the often dark reality behind his consistently positive, relaxed public image. For the first time, Sounes will examine in detail the lifestyle of one of the richest men on the planet, the truth behind his much publicized divorce from Heather Mills, as well as his tempestuous relationship with the other Beatles, with startling revelations.\nDrawing on countless interviews, legal records and public documents, Howard Sounes' meticulous approach and brilliant powers of research reveal the real Paul McCartney, like you've never known him before.\n\nThe Author :\nHoward Sounes (born 1965 Welling, South East London, England) is a British author, journalist and biographer.\n\nOther Books:\nFred &amp; Rose \nCharles Bukowski: Locked in the Arms of a Crazy Life \nBukowski in Pictures.\nDown the Highway: The Life Of Bob Dylan\nThe Wicked Game, \n\n","torrent":{"xt":"urn:btih:291be8789dea41ff480cd28d3cb8134cf2ae9973","amp;dn":"Fab+An+Intimate+Life+of+Paul+McCartney+by+Howard+Sounes%28mobi%29%5Bro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"291be8789dea41ff480cd28d3cb8134cf2ae9973","infoHashBuffer":{"type":"Buffer","data":[41,27,232,120,157,234,65,255,72,12,210,141,60,184,19,76,242,174,153,115]},"announce":[],"urlList":[]}}