{"title":"City Infernal - Lee, Edward-viny","uid":6370505,"size":2946975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:293e7b3d0bab1821051815be853e5edd2fc987da&amp;dn=City+Infernal+-+Lee%2C+Edward-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1304668388,"description":"The story is of a girl named Cassie. She has an identical twin sister named Lissa (that's how it's spelled in the book). They are both Gothic club hoppers. One night while &quot;intoxicated&quot; Cassie finds herself in a sexual situation with Lissa's boyfriend. Lissa can't handle the pressure and ends her life with a gunshot to the head.\n\n \n\nA little while after these events, Cassie and her single father (who I pictured to look like Edward Lee himself, judging from the photo in the book) move to a small country town. Cassie changes her appearance and tries to start a new life, but she still doesn't quite fit in there.\n\n \n\nShe makes an amazing discovery: her house is a gateway to hell. Now when I say hell, I don't mean a fiery pit - I mean a city. Hell has evolved over the years into an endless metropolis. This isn't to say the people there don't suffer. There are many different degrees of suffering that one endures while in Hell. There are also ways to avoid the suffering. Cassie meets a group of friends from Hell who take her inside. If Cassie is discovered in Hell, it will be the end for her. She wants to find her sister and make things right between them. ","torrent":{"xt":"urn:btih:293e7b3d0bab1821051815be853e5edd2fc987da","amp;dn":"City+Infernal+-+Lee%2C+Edward-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"293e7b3d0bab1821051815be853e5edd2fc987da","infoHashBuffer":{"type":"Buffer","data":[41,62,123,61,11,171,24,33,5,24,21,190,133,62,94,221,47,201,135,218]},"announce":[],"urlList":[]}}