{"title":"Ozzy Osbourne - Bark at the Moon [promo].VOB","uid":9693642,"size":310099968,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2946e135cf39fd628b93a8d094b4ac187ffa4411&amp;dn=Ozzy+Osbourne+-+Bark+at+the+Moon+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1393904586,"description":"Ozzy Osbourne - Bark at the Moon [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Bark at the Moon&quot; is a song by heavy metal vocalist Ozzy Osbourne. It was the first single released from his 1983 album of the same name. The music video made for the song was the first made by Osbourne. \n\nThough credited solely to Osbourne, &quot;Bark at the Moon&quot; was composed by guitarist Jake E. Lee and bassist/lyricist Bob Daisley with some lyrics contributed by Osbourne. In 2003, Daisley filed a lawsuit against Osbourne, claiming lost royalties for his significant songwriting contributions.\n\nLyrically, the song deals with a mythical beast that once terrorized a town, was killed, and mysteriously returned to once again wreak havoc upon the villagers. The music video, however, tells the story of a scientist, played by Osbourne, who ingests a substance in his laboratory which causes him to transform into the beast depicted on the Bark at the Moon album cover. Thought to be insane, he is subsequently committed to a mental institution.\n\nThe music video for the song was partially filmed at the Holloway Sanitarium, outside of London, England.[citation needed] In the early 1980s infancy of the music video medium, the video, which was the first Osbourne had made, was highly anticipated due to his outrageous image. Drummer Tommy Aldridge played on the studio recording of the track, but the video features his replacement in the band, Carmine Appice.\n\nJohn Michael &quot;Ozzy&quot; Osbourne (born 3 December 1948) is an English rock vocalist, songwriter, and television personality. Osbourne rose to prominence in the early 1970s as the lead vocalist of the pioneering band Black Sabbath, whose dark and heavy sound has often been cited as key to the development of the heavy metal genre. Osbourne left Black Sabbath in 1979 and has since had a successful solo career, releasing 11 studio albums, the first seven of which were all awarded multi-platinum certifications in the US, though he has reunited with Black Sabbath on several occasions, most recently in 2011 to record the album 13, which was released in 2013. Osbourne's longevity and success have earned him the informal title of &quot;Godfather of Heavy Metal&quot;.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Bark_at_the_Moon_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Bark_at_the_Moon_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/jakjnAafL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jakjnAafL&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:04:16\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:2946e135cf39fd628b93a8d094b4ac187ffa4411","amp;dn":"Ozzy+Osbourne+-+Bark+at+the+Moon+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2946e135cf39fd628b93a8d094b4ac187ffa4411","infoHashBuffer":{"type":"Buffer","data":[41,70,225,53,207,57,253,98,139,147,168,208,148,180,172,24,127,250,68,17]},"announce":[],"urlList":[]}}