{"title":"Dark Side Of The Moon (Alan Parson's Original Quad Mix DVD-A)","uid":7506110,"size":3684780032,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:297daf643aefd8d4edcceef6d74bc4ca5ca20d1b&amp;dn=Dark+Side+Of+The+Moon+%28Alan+Parson%27s+Original+Quad+Mix+DVD-A%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1344179555,"description":"Pink Floyd - Dark Side Of The Moon (Alan Parson's Original Quad Mix DVD-A) (1974)\n\nI realize this has been uploaded in other formed, but this is the uncompressed DVD-A presented in Audio_TS/ Video_TS format rather than ISO and that maybe preferable to some people.\n\nThis is the real deal!!!!\nyou will never find this album in a music store!!!\n\nYou have never heard Dark Side like this before in such incredible clarity!\n\nSo, this is the original Alan Parson's Quad Mix created in 1974 from the original master tapes; it is presented here in its full glory, directly taken from the original quad mix tapes.\n\nSearch Google for what what Quad Mix is and what this DVD-A is - I'm not an audio engineer and can not explain it.\n\nhere's the info file included in the DVD-A\n----------------------------\nDark Side Of The Moon\nFrom the original 1/2&quot; Master Tapes\n\nThis is the real deal. not the usual Q8 or SQ versions with all their limitations\n(limited bandwidth on the Q8, Matrixed surround on the SQ  etc) but a genuine transfer from the original master tapes.\nFinally you can hear Alan Parsons mix as it was always intended to be heard in studio quality audio.\nThe only &quot;liberty&quot; we have taken here is an additional .1 track. You can make up your own mind as to\nwhether or not it is a worthwhile addition.\nIt also features all new artwork in both sections specially created for this DVD-Audio release\nThe disc will play on all DVD players, as  it is a DVD-Audio/Video &quot;hybrid&quot; containing the following:\n\nAudio_TS\nMLP Lossless at 24/96 Resolution in 4.1\n\nVideo_TS\nDTS from 24/48 Source files\nDolby Digital from 24/48 Source files\n\nAdditionally, it is possible to play both the lossy streams from DVD-Audio players.\nEach type has it's own menus. What you can access is dependant entirely on your player.\n\nAll Authoring, Encoding, Post Production and design is exclusive to this release.\n\nFEEL FREE TO DISTRIBUTE THIS DISC TO OTHERS, BUT ALWAYS &quot;AS IS&quot; AND IN FULL.\nPLEASE DO NOT RIP AND REPOST IN ANY OTHER FORMAT. THERE IS NO NEED AS ALL DVD PLAYERS CAN READ THIS DISC,\nAND DOING SO WILL DEPRIVE OTHERS OF THE FULL HIGH RESOLUTION FORMATS USED.\nADDITIONALLY, RIPPING TO DTS-CD WILL INVOLVE QUALITY LOSS DUE TO DOWNSAMPLING, AND WILL\nREDUCE THE LISTENING PLEASURE FOR OTHERS.\n\n","torrent":{"xt":"urn:btih:297daf643aefd8d4edcceef6d74bc4ca5ca20d1b","amp;dn":"Dark+Side+Of+The+Moon+%28Alan+Parson%27s+Original+Quad+Mix+DVD-A%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297daf643aefd8d4edcceef6d74bc4ca5ca20d1b","infoHashBuffer":{"type":"Buffer","data":[41,125,175,100,58,239,216,212,237,204,238,246,215,75,196,202,92,162,13,27]},"announce":[],"urlList":[]}}