{"title":"Kate Humble Living with Nomads s01e02 ENG SUBS WEBRIP","uid":12011473,"size":666394495,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2a690224b22df2a8e1a1c625d04c0bf03bb8854e&amp;dn=Kate+Humble+Living+with+Nomads+s01e02+ENG+SUBS+WEBRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"makinapufterpup","files":4,"time":1434151630,"description":"Kate.Humble.Living.with.Nomads.s01e02.Siberia.ENG.SUBS.WEBRIP\n\nKate Humble journeys to the far north of Siberia in the teeth of the Arctic winter to travel with the Nenets. These reindeer herders spend their lives migrating with the seasons up and down the Yamal Peninsula, following their herds from pasture to pasture. But it's a tough and precarious existence, living in temperatures that can drop to -54C. And the extremes soon take a toll on Kate - a lover of warm weather - and her crew, when on the way to meet their Nenet family their vehicle breaks down and they're forced to abandon their plans.\n\nWith the chance to regroup at one of the tundra's slaughterhouses, Kate heads out to join a new family, who are migrating to their winter pasture. She finds a small group of Nenets, sharing a herd of over 300 reindeer, surviving in their reindeer-skinned chums (tents), living a harsh yet happy existence. Kate travels with them, sharing their chum by night, and learns about what it means to be a nomad in such an extreme environment.\n\nThe Nenets have managed to survive out here for centuries, living symbiotically with their animals. But now they are facing new and seemingly insurmountable threats: changing weather patterns, linked to climate change, are decimating their herds; and the global gas industry is mining the tundra, damaging pasture and blocking the Nenets' migration routes.\n\nFormat: MPEG-4\nSize: 832x468\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz","torrent":{"xt":"urn:btih:2a690224b22df2a8e1a1c625d04c0bf03bb8854e","amp;dn":"Kate+Humble+Living+with+Nomads+s01e02+ENG+SUBS+WEBRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a690224b22df2a8e1a1c625d04c0bf03bb8854e","infoHashBuffer":{"type":"Buffer","data":[42,105,2,36,178,45,242,168,225,161,198,37,208,76,11,240,59,184,133,78]},"announce":[],"urlList":[]}}