{"title":"The Compassionate Mind: A New Approach to Life's Challenges","uid":8295630,"size":5960799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2af82f3733c26c7397c0f014a707a9adbeed5a4d&amp;dn=The+Compassionate+Mind%3A+A+New+Approach+to+Life%27s+Challenges&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1364137387,"description":"aul Gilbert PhD, &quot;The Compassionate Mind: A New Approach to Life's Challenges&quot;\nISBN: 184529713X | 2009 | EPUB/MOBI | 513 pages | 3 MB/3 MB\n\nCompassion and particularly compassion towards oneself can have a significant impact on our wellbeing and mental health. Developing our sense of compassion can affect many areas of our lives, in particular our relationships with other people. In this book, Professor Paul Gilbert explores how our minds have developed to survive in dangerous and threatening environments by becoming sensitive and quick to react to perceived threats. This can sometimes lead to problems in how we respond to life's challenges and scientific evidence has demonstrated that compassion towards oneself and others can lead to an increased sense of happiness and wellbeing - particularly valuable when we are feeling stressed. Based on evolutionary research and scientific studies of how the brain processes emotional information, this compassionate approach offers an appealing alternative to the traditional western view of compassion, which sometimes sees it as a sign of weakness and can encourage self-criticism and a hard-nosed drive to achieve.","torrent":{"xt":"urn:btih:2af82f3733c26c7397c0f014a707a9adbeed5a4d","amp;dn":"The+Compassionate+Mind%3A+A+New+Approach+to+Life%27s+Challenges","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2af82f3733c26c7397c0f014a707a9adbeed5a4d","infoHashBuffer":{"type":"Buffer","data":[42,248,47,55,51,194,108,115,151,192,240,20,167,7,169,173,190,237,90,77]},"announce":[],"urlList":[]}}