{"title":"Atlas of Oceans (gnv64)","uid":7741394,"size":36180319,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b25920d8bdcdd22a9d79e335b40ab1e42609304&amp;dn=Atlas+of+Oceans+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1350638706,"description":"Atlas of Oceans: A Fascinating Hidden World\nby John Farndon\nThomas Reed | March 2011 | ISBN: 1408131110 | 256 pages | PDF | 34.5 mb &lt;a href=&quot;\nhttp://www.amazon.com/Atlas-Oceans-Fascinating-Hidden-World/dp/1408131110&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Atlas-Oceans-Fascinating-Hidden-World/dp/1408131110&lt;/a&gt;\n\nSeventy per cent of our planet's surface is covered with water, but most conventional atlases focus on the other thirty per cent. This fascinating and beautifully presented survey of the world's oceans and what lives within them is published in association with the Census on Marine Life, a decade-long scientific initiative between researchers from over 80 countries to assessing and explaining the rich diversity and abundance of undersea life. Every aspect of the oceans is explored, from the seabed, continental shelves, currents, water circulation and waves, to all the wildlife that calls these places home. Each ocean (the Atlantic, Pacific, Indian, Southern, Arctic, the Seas of Europe, the Eurasian Inland Seas and the South China Sea) is examined in great detail, revealing its characteristics, underwater topography, principal species and particular features, including the effects of habitat erosion.\n\nTopics covered include: - Coastlines, beaches, estuaries, salt marshes - the clash of man and wildlife - Temperate waters - plankton, seaweed forests and the Newfoundland Great Banks - Tropical waters - coral reefs, mangrove swamps and seagrass meadows - Polar waters - floating ice, migrations, life beneath the ice - The open ocean - currents, CO2 storage capacity, global warming and acidification - The ocean deeps - the mysterious twilight world and the least explored of all environments.\n\nAbout the Author\nLONDON-BASED AUTHOR JOHN FARNDON studied earth sciences and English literature at Cambridge University but has since written on just about every topic imaginable. He has written over 300 books, which have sold millions of copies around the world in most major languages and include many best-sellers, such as the award-winning 'Do Not Open', which became a cult-hit in the USA. He has a growing following on his internet sites, including podcasts and blogs, and is also a playwright and songwriter, whose work has been performed at such theatres as the Donmar and Almeida in London and the Salisbury Playhouse. Songs of his have been selected many times for the Sondheim Singing prize and other showcases. &lt;a href=&quot; http://www.johnfarndon.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.johnfarndon.com&lt;/a&gt;","torrent":{"xt":"urn:btih:2b25920d8bdcdd22a9d79e335b40ab1e42609304","amp;dn":"Atlas+of+Oceans+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b25920d8bdcdd22a9d79e335b40ab1e42609304","infoHashBuffer":{"type":"Buffer","data":[43,37,146,13,139,220,221,34,169,215,158,51,91,64,171,30,66,96,147,4]},"announce":[],"urlList":[]}}