{"title":"Adam Sandler - The Chanukah Song   (2nafish)","uid":5202871,"size":141418500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2b3e34caaea14e84930126c4d7a3347e6bb87691&amp;dn=Adam+Sandler+-+The+Chanukah+Song+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1260242802,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;The Chanukah Song&quot; is a series of humorous songs written and performed by Adam Sandler. All variations center on the theme of Jewish children feeling alienated during the Christmas season, and Sandler's listing of Jewish celebrities (both real and fictional).\n\nDuring the final verse, performed originally on Saturday Night Live and on a radio cut, Sandler sings the line &quot;Drink your gin and tonic-ah, but don't smoke marijuan-icah.&quot; On the uncut album version, and during various concert appearances, the line was changed to &quot;Drink your gin and tonic-ah, and smoke your marijuan-icah.&quot; The uncut version, despite the reference to marijuana, receives most radio airplay today; another radio edit skips completely over the gin and tonic/marijuana line altogether.\n\nThe song also mentions that &quot;you don't need 'Deck the Halls' or 'Jingle Bell Rock.'&quot; Ironically, neither one of those holiday songs explicitly mentions Christmas. &quot;Jingle Bell Rock&quot; is a general winter song, and &quot;Deck the Halls&quot; mentions New Year and Yule but not Christmas.\n\nWhat the Hell Happened to Me? is a 1995 comedy album by Adam Sandler. It contains the official recording of &quot;The Chanukah Song&quot;, which has become a holiday staple and one of the best-known works by Sandler. The song hit #80 on the Billboard Hot 100 and #25 on the US Modern Rock charts. The album has been certified double platinum, having sold over 2,000,000 copies. The Excited Southerner skits on the album are early versions of what would end up being his character 'Bobby Boucher' in 1998's The Waterboy.\n\nAdam Richard Sandler (born September 9, 1966) is an American actor, comedian, musician, screenwriter and film producer. He is the founder of Happy Madison Productions, a film production company that also developed the television series Rules of Engagement.\n\nAfter becoming a Saturday Night Live cast member, he went on to star in several Hollywood feature films that grossed over US$100 million at the box office. He is best known for his comedic roles, such as in the films Billy Madison (1995), Big Daddy (1999), and Mr. Deeds (2002), though he has ventured into more dramatic territory.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:2b3e34caaea14e84930126c4d7a3347e6bb87691","amp;dn":"Adam+Sandler+-+The+Chanukah+Song+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b3e34caaea14e84930126c4d7a3347e6bb87691","infoHashBuffer":{"type":"Buffer","data":[43,62,52,202,174,161,78,132,147,1,38,196,215,163,52,126,107,184,118,145]},"announce":[],"urlList":[]}}