{"title":"Need For Speed - Hot Pursuit 2 by relentlesstech (2002)","uid":9342158,"size":682964661,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2b888009f4211378bca0d4045ff33606fc1df634&amp;dn=Need+For+Speed+-+Hot+Pursuit+2+by+relentlesstech+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"relentlesstech","files":-1,"time":1386955730,"description":"Need for Speed: Hot Pursuit 2 was the debut Need for Speed title from the newly formed EA Black Box (created after the purchase of Black Box Games in Vancouver), and the first Need for Speed for the sixth generation of consoles. Different versions of the game were produced for each game platform; the Xbox, GameCube and PC versions were developed in EA Seattle, while the PS2 version was developed by Black Box Games in Vancouver.\n\nHot Pursuit 2 draws primarily from the gameplay and style of NFS III; its emphasis was on evading the police and over-the-top tracks featuring lengthy shortcuts. Although the game allowed players to play as the police, the pursuit mode was drastically less realistic than preceding versions of NFS; players merely needed to &quot;tap&quot; a speeder a certain number of times to arrest them, as opposed to using actual police tactics such as the PIT maneuver to immobilize a speeding vehicle.\n\nThis was the first Need for Speed version since the start of the series that did not feature a true &quot;in the driving seat&quot; camera view, complete with steering wheel, dashboard etc. In some ways this can be considered to be the landmark in EA's move from realistic racing to arcade street racing. It is also the last game in the Need for Speed series for PC to feature the split-screen two player mode introduced in Need for Speed II. For the multiplayer mode of the PC version, GameSpy's internet matchmaking system was used in place of Local Area Network (LAN) play. Hot Pursuit 2 is also the first Need for Speed to forego an original instrumental rock/techno soundtrack in favor of songs sung by licensed song artists under the EA Trax label.","torrent":{"xt":"urn:btih:2b888009f4211378bca0d4045ff33606fc1df634","amp;dn":"Need+For+Speed+-+Hot+Pursuit+2+by+relentlesstech+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b888009f4211378bca0d4045ff33606fc1df634","infoHashBuffer":{"type":"Buffer","data":[43,136,128,9,244,33,19,120,188,160,212,4,95,243,54,6,252,29,246,52]},"announce":[],"urlList":[]}}