{"title":"PJ Harvey - Let England Shake - Music Videos/Short Films [HD/720","uid":6651844,"size":581689743,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2cb3644fb34dbf886f7a997a47daa522c06da9b2&amp;dn=PJ+Harvey+-+Let+England+Shake+-+Music+Videos%2FShort+Films+%5BHD%2F720&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"egopatient","files":12,"time":1315181268,"description":"PJ HARVEY\nLet England Shake\n\nA series of twelve short films to accompany Polly Jean Harvey's eight studio album of the same name, directed by Seamus Murphy. \n\nABOUT THESE FILMS\nAfter viewing Seamus Murphy's award-winning &quot;A Darkness Visible&quot; exhibition in London in 2008, which PJ Harvey noted as having &quot;an emotional impact&quot;, and purchasing his book, Harvey contacted Murphy as she &quot;wanted to speak to him more about his experiences being there in Afghanistan.&quot; Murphy saw Harvey perform and the collaboration began with her requesting him to take promotional photographs for Let England Shake in July 2010. In addition to the album's photography, originally Harvey and Murphy planned to record a documentary of the recording process of the album; however, instead, twelve short films, one for each of the album's songs, were made. Each film incorporates a mix of still photography and video documenting the album's themes &quot;in the manner of classic photographic reportage - recording real &amp; spontaneous situations.&quot; Murphy travelled throughout England alone &quot;with little equipment&quot;, due to a low budget and lack of assistants, and after photography, directing and producing the films solely by himself, edited the final product in Berlin, Germany with video editor Sebastian Gollek.\n\nRELEASE\nA standard definition version of &quot;The Last Living Rose&quot; was the first of the films to be released on December 17, 2010 and &quot;The Words That Maketh Murder&quot; followed a month later on January 17, 2011. SD versions of &quot;Let England Shake&quot; and &quot;The Glorious Land&quot; were released on February 14, 2011 and March 8, 2011, respectively. From March 15 to May 5, all twelve films were consecutively released in 720p HD.\n\nTECHNICAL SPECIFICATIONS\nVideo: H264/MPEG-4 AV1 (.mp4)\nAudio: AAC (.aac)\nVideo bitrate: 1.5mbps VBR\nAudio bitrate: 192kbps VBR\nAudio sample rate: 44100kHz\nVideo resolution: 1280x720\nFrames per second: 25fps\nAspect ratio: 16:9","torrent":{"xt":"urn:btih:2cb3644fb34dbf886f7a997a47daa522c06da9b2","amp;dn":"PJ+Harvey+-+Let+England+Shake+-+Music+Videos%2FShort+Films+%5BHD%2F720","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cb3644fb34dbf886f7a997a47daa522c06da9b2","infoHashBuffer":{"type":"Buffer","data":[44,179,100,79,179,77,191,136,111,122,153,122,71,218,165,34,192,109,169,178]},"announce":[],"urlList":[]}}