{"title":"Regina Spektor - Far (2009) [FLAC]","uid":6025936,"size":270535802,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d4251fdc924ab445d0437753fe62c965c06b3b0&amp;dn=Regina+Spektor+-+Far+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"insinuendo","files":23,"time":1291931396,"description":"Far is the fifth studio album by American alternative singer-songwriter Regina Spektor, released in Europe through Sire Records on June 22, 2009 and North America on June 23, 2009[1] The album's first single, &quot;Laughing With&quot;, was uploaded to Spektor's MySpace page[2] on May 8 and was released as a digital download on May 18 in the United States and parts of Europe, along with the b-side &quot;Blue Lips&quot;. Two viral videos for &quot;Dance Anthem of the 80s&quot; and &quot;Eet&quot; were also released on Spektor's MySpace account.[3] The official music video for &quot;Laughing With&quot; was released on iTunes on May 26, 2009. A special edition of the album was released with two bonus tracks and a DVD, which included four music videos.\n\nSpektor decided to work with multiple producers on the album. She has compared composing an album to taking a class, and as such, she wanted to have &quot;multiple professors&quot;.[4] She also felt the multiple producers would allow them not to worry what the single or big hit would be. The most notable producers include David Kahne, who produced her last album Begin to Hope, and Jeff Lynne, former member of Electric Light Orchestra and The Traveling Wilburys. Although Lynne has an expansive musical background, Spektor did not know of his work when she originally met him.[5]\n\n\nReview\n\nby Heather Phares\n\nRegina Spektor worked with no less than four big-name producers on Far, all of them with very different backgrounds: David Kahne was her collaborator on 2006's Begin to Hope; Garret &quot;Jacknife&quot; Lee counts R.E.M. and U2 among his credits; Jeff Lynne's lavish sound is famous on ELO's albums; and Mike Elizondo has worked with Fiona Apple and Maroon 5. It's something of a surprise, then, that Far sounds so homogenized. On Soviet Kitsch and Begin to Hope, Spektor's wide-eyed moments were balanced with darker, knowing songs that kept her music grounded. Here, almost all of the rough or unpredictable edges have been smoothed away, and all that's left is Spektor's sweet, quirky side. At times, Far gets close to being unbearably precious, whether it's putting Spektor's name in all lowercase letters in the liner notes, her dolphin on the otherwise charming &quot;Folding Chair,&quot; or lyrics like &quot;We made our own computer out of macaroni pieces&quot; on the chirpy opener, &quot;The Calculation.&quot; Even the album's darker tracks, such as the percussion-heavy &quot;Machine,&quot; are surprisingly sugary compared to her previous work. However, Spektor's guileless voice and delivery allow her to get away with sounds and ideas that would be horribly cloying in the hands of almost any other artist. She manages to make a song with the chorus &quot;Eet, eet, eet&quot; catchy and affecting, and fashions an observant and witty story out of returning a wallet to Blockbuster Video. Still, Far's best moments occur when Spektor turns down the whimsy a few notches. It's probably not a coincidence that the Kahne-produced &quot;Human of the Year&quot; shares some of Begin to Hope's intimacy and ambition, but &quot;Blue Lips&quot; and &quot;Man of a Thousand Faces&quot; also let Spektor's more mature -- but not overly serious -- side shine. Likewise, &quot;Two Birds&quot; and &quot;One More Time with Feeling&quot; show that she hasn't lost her touch for deceptively pretty pop with clever lyrics. While Far is far from bad, it doesn't quite live up to expectations, either, based on all the talent involved in making it and how fully Spektor expressed herself on Begin to Hope.\n\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/far-r1567185&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/far-r1567185&lt;/a&gt;\n\n\nTrack listing\n\n    * All songs on the album were written by Regina Spektor.\n\n\n1. \t&quot;The Calculation&quot;   \tMike Elizondo \t3:11\n2. \t&quot;Eet&quot;   \tMike Elizondo \t3:52\n3. \t&quot;Blue Lips&quot;   \tJeff Lynne \t3:34\n4. \t&quot;Folding Chair&quot;   \tJeff Lynne \t3:35\n5. \t&quot;Machine&quot;   \tMike Elizondo \t3:55\n6. \t&quot;Laughing With&quot;   \tJacknife Lee \t3:17\n7. \t&quot;Human of the Year&quot;   \tDavid Kahne \t4:07\n8. \t&quot;Two Birds&quot;   \tJacknife Lee \t3:18\n9. \t&quot;Dance Anthem of the 80's&quot;   \tJacknife Lee \t3:43\n10. \t&quot;Genius Next Door&quot;   \tJeff Lynne \t5:06\n11. \t&quot;Wallet&quot;   \tJeff Lynne \t2:28\n12. \t&quot;One More Time with Feeling&quot;   \tDavid Kahne \t3:59\n13. \t&quot;Man of a Thousand Faces&quot;   \tMike Elizondo \t3:11","torrent":{"xt":"urn:btih:2d4251fdc924ab445d0437753fe62c965c06b3b0","amp;dn":"Regina+Spektor+-+Far+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4251fdc924ab445d0437753fe62c965c06b3b0","infoHashBuffer":{"type":"Buffer","data":[45,66,81,253,201,36,171,68,93,4,55,117,63,230,44,150,92,6,179,176]},"announce":[],"urlList":[]}}