{"title":"In.the.Shadow.of.the.Moon.XviD.AC3.MVGroup.Forum.avi","uid":6879938,"size":942249984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2e0a5b0ddbe4db0ed9ae960d5b0c132fb27119f3&amp;dn=In.the.Shadow.of.the.Moon.XviD.AC3.MVGroup.Forum.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MVGroup","files":1,"time":1323618187,"description":"In the Shadow of the Moon\n\nInformation\nIN THE SHADOW OF THE MOON is an intimate epic, which vividly communicates the daring and the danger, the pride and the passion, of this extraordinary era in American history. Between 1968 and 1972, the world watched in awe each time an American spacecraft voyaged to the Moon. Only 12 American men walked upon its surface and they remain the only human beings to have stood on another world. Now for the first, and very possibly the last, time, IN THE SHADOW OF THE MOON combines archival material from the original NASA film footage, much of it never before seen, with interviews with the surviving astronauts, including Jim Lovell (Apollo 8 and 13), Dave Scott (Apollo 9 and 15), John Young (Apollo 10 and 16), Gene Cernan (Apollo 10 and 17), Mike Collins (Apollo 11), Buzz Aldrin (Apollo 11), Alan Bean (Apollo 12), Edgar Mitchell (Apollo 14), Charlie Duke (Apollo 16) and Harrison Schmitt (Apollo 17). The astronauts emerge as eloquent, witty, emotional and very human.\n\nA reviewer:\n\\\\\\\\\\\\\\&quot;I have seen many of the preceding documentaries on the history of the American space program, the Apollo program in particular. Where this documentary exceeds all previous efforts was in revealing the humanity of the astronauts. Most other documentaries focus on the politics which motivated and technical hurdles overcome in the American space program. David Sington brilliantly uses only the astronauts voices for narration of facts and more with newly released footage from NASA, as well as a lot of footage we\\\\\\\\\\\\\\'ve all seen before. Because of the free rein given to the astronauts in the interviews, you see many sides of each revealed. For instance, Mike Collins (who has heretofore rarely been interviewed) reveals wonderful humor and joy in his accomplishments. You find out more about their worries and fears, how they look back on their work and what they were thinking at the time. They are all revealed as nice guys with whom you would want to spend an afternoon. Strangely absent, but it works well in the end, was Armstrong. He gives virtually no interviews. In a way, having everyone else talk about him is maybe better than him talking.\\\\\\\\\\\\\\&quot;\n\nTechnical Specs \nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1176 kbps\nVideo Resolution: 832 x 464\nVideo Aspect Ratio: 1.793 (16.9)\nFrames Per Second: 25\nAudio Codec: 0x2000 (Dolby AC3)\nAudio Bitrate: 128 kb/s AC3 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime Per Part: 96.Mins\nNumber Of Parts: 2\nPart Size: 898 MB\nEncoded by Harry65\nSource: DVD\nExtra Run-time 58mins part size 700 MB ","torrent":{"xt":"urn:btih:2e0a5b0ddbe4db0ed9ae960d5b0c132fb27119f3","amp;dn":"In.the.Shadow.of.the.Moon.XviD.AC3.MVGroup.Forum.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e0a5b0ddbe4db0ed9ae960d5b0c132fb27119f3","infoHashBuffer":{"type":"Buffer","data":[46,10,91,13,219,228,219,14,217,174,150,13,91,12,19,47,178,113,25,243]},"announce":[],"urlList":[]}}