{"title":"Joe Celko's SQL for Smarties, Fourth Edition","uid":7580097,"size":18812447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e8dc19183ee938f2ecc86f756273ed8bd0c4d90&amp;dn=Joe+Celko%27s+SQL+for+Smarties%2C+Fourth+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1346217811,"description":"Joe Celko's SQL for Smarties, Fourth Edition\n\n\nPublication Date: November 1, 2010  \nISBN-10: 0123820227  \nISBN-13: 978-0123820228  \nEdition: 4\n\nSQL for Smarties was hailed as the first book devoted explicitly to the advanced techniques needed to transform an experienced SQL programmer into an expert. Now, 15 years later and in its fourth edition, this classic reference still reigns supreme as the only book written by a SQL master that teaches programmers and practitioners to become SQL masters themselves! These are not just tips and techniques; also offered are the best solutions to old and new challenges. Joe Celko conveys the way you need to think in order to get the most out of SQL programming efforts for both correctness and performance. New to the fourth edition, Joe features new examples to reflect the ANSI/ISO Standards so anyone can use it. He also updates data element names to meet new ISO-11179 rules with the same experience-based teaching style that made the previous editions the classics they are today.\n\nKEY FEATURES\n\nExpert advice from a noted SQL authority and award-winning columnist who has given ten years service to the ANSI SQL standards committee\nTeaches scores of advanced techniques that can be used with any product, in any SQL environment, whether it is an SQL 92 or SQL 2008 environment\nOffers tips for working around deficiencies and gives insight into real-world challenges","torrent":{"xt":"urn:btih:2e8dc19183ee938f2ecc86f756273ed8bd0c4d90","amp;dn":"Joe+Celko%27s+SQL+for+Smarties%2C+Fourth+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e8dc19183ee938f2ecc86f756273ed8bd0c4d90","infoHashBuffer":{"type":"Buffer","data":[46,141,193,145,131,238,147,143,46,204,134,247,86,39,62,216,189,12,77,144]},"announce":[],"urlList":[]}}