{"title":"Breath of Fire IV PSX-PSP EBOOT","uid":4517313,"size":279083334,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:2f3b5b07a45edb48f4152ec77eb0e352e7e76c99&amp;dn=Breath+of+Fire+IV+PSX-PSP+EBOOT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"teargrants15","files":1,"time":1227025120,"description":"Like previous games in the series, Breath of Fire IV takes place in a fantasy world inspired by both classical European and Japanese folklore. A number of races resembling humans and anthropomorphic animals populate the land, which carries a predominate medieval and sword and sorcery theme. The world itself is divided into two distinct cultural halves: the Western Fou Empire, modeled after feudal China and East Asia, and the Eastern Kingdoms, with areas resembling both Medieval Europe and Arabia. While both cultures remain at an uneasy alliance following years of turbulent war, the actions of several military officials threaten to once again pull the world apart. Watching over humanity are the Endless, immortal godlike beings who take the form of dragons and control the elements that sustain the world. Much of the plot deals with the central characters&amp;#039; interaction with the people and Endless who inhabit the world. Throughout the game the player will play as Ryu and occasionally play as the game&amp;#039;s antagonist Fou-Lu. Fou-Lu is the first Emperor of the Fou Empire and is referred to as a god Emperor. He seeks to rule the world as a god, however, he needs Ryu to accomplish his goal.\n\n----------------------------------------------------------------------------------\n\nThis is Breath of Fire IV, an eboot file.\nWorking fine on my 3.90 m33-3 with no glitches whatsoever.\n\n\nSeeders please! This file seriously needs seeders!\nPlease help me seed. Thanks in advance!","torrent":{"xt":"urn:btih:2f3b5b07a45edb48f4152ec77eb0e352e7e76c99","amp;dn":"Breath+of+Fire+IV+PSX-PSP+EBOOT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f3b5b07a45edb48f4152ec77eb0e352e7e76c99","infoHashBuffer":{"type":"Buffer","data":[47,59,91,7,164,94,219,72,244,21,46,199,126,176,227,82,231,231,108,153]},"announce":[],"urlList":[]}}