{"title":"Amelia Peabody Mystery series - Elizabeth Peters","uid":9240769,"size":9465656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f762ba72b70080198ac6777392f177b6e4387da&amp;dn=Amelia+Peabody+Mystery+series+-+Elizabeth+Peters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1385270317,"description":"The Amelia Peabody series is a series of nineteen historical mystery novels and one non fiction companion volume written by Elizabeth Peters, featuring Egyptologist Amelia Peabody Emerson, for whom the series is named. The novels blend satire (mostly of the adventure novel, such as written by H. Rider Haggard), mystery, romance, and comedy. The series spans a thirty-eight-year period from 1884 to 1923. Most of the books are primarily set in Egypt, with some installments including scenes set in England and Gaza. Of the in the series, only two do not take place in Egypt at all: Deeds of the Disturber, set entirely in England, and A River in the Sky, set mostly in Ottoman-era Palestine.\nThe first installment, Crocodile on the Sandbank, was first published in 1975. By the late 1990s, new books were published at the rate of one annually, with many of the later books in the series appearing on the New York Times Bestseller List for fiction. The last installment in the series to be published, A River in the Sky, was released in 2010.[1][2] It is the 19th novel in the series, which also includes a non-fiction companion book, Amelia Peabody's Egypt: A Compendium.\nThe series was primarily written in chronological order, with the exception of Guardian of the Horizon and A River in the Sky, which were the 16th and 19th books to be published, but 11th and 12th in the chronology. Prior to her death, Peters suggested that she might continue the series with new installments written out of sequence, since the series took place in real time and the aging of the characters precluded extending the series much further than the point at which it ended, in 1923.\n\nEach book in the series is a stand-alone mystery which can be read without previous knowledge. However, the characters age throughout the series and events in previous books (including spoilers concerning some of the main characters) are referenced in later books.","torrent":{"xt":"urn:btih:2f762ba72b70080198ac6777392f177b6e4387da","amp;dn":"Amelia+Peabody+Mystery+series+-+Elizabeth+Peters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f762ba72b70080198ac6777392f177b6e4387da","infoHashBuffer":{"type":"Buffer","data":[47,118,43,167,43,112,8,1,152,172,103,119,57,47,23,123,110,67,135,218]},"announce":[],"urlList":[]}}