{"title":"Dalai Lama-How to See Yourself as You Really Are","uid":4053690,"size":398050345,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:303c74164c3728d389705961ab8357969f34aff3&amp;dn=Dalai+Lama-How+to+See+Yourself+as+You+Really+Are&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jwhitt62","files":124,"time":1204272808,"description":"Like the two wings of a bird, love and insight work cooperatively to bring about enlightenment, says a fundamental Buddhist teaching. According to His Holiness the Dalai Lama, we each possess the ability to achieve happiness and a meaningful life, but the key to realizing that goal is self-knowledge. In How to See Yourself As You Really Are, the world's foremost Buddhist leader and recipient of the Nobel Peace Prize shows readers how to recognize and dispel misguided notions of self and embrace the world from a more realistic -- and loving -- perspective.\n\nStep-by-step exercises help readers shatter their false assumptions and ideas and see the world as it actually exists. By directing our attention to the false veneer that so bedazzles our senses and our thoughts, His Holiness sets the stage for discovering the reality behind appearances. But getting past one's misconceptions is only a prelude to right action, and the book's final section describes how to harness the power of meditative concentration to the service of love, and vice versa, so that true altruistic enlightenment is attained. \n\n\nEnlivened by personal anecdotes and intimate accounts of the Dalai Lama's own life experiences, How to See Yourself As You Really Are is an inspirational and empowering guide to achieving self-awareness that can be read and enjoyed by spiritual seekers of all faiths.","torrent":{"xt":"urn:btih:303c74164c3728d389705961ab8357969f34aff3","amp;dn":"Dalai+Lama-How+to+See+Yourself+as+You+Really+Are","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"303c74164c3728d389705961ab8357969f34aff3","infoHashBuffer":{"type":"Buffer","data":[48,60,116,22,76,55,40,211,137,112,89,97,171,131,87,150,159,52,175,243]},"announce":[],"urlList":[]}}