{"title":"Mira Wilkins - The History of Foreign Investment in the United S","uid":10135749,"size":3869279,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:306c9292e4ca0a5ff32b583b1bd2ac4eacc89643&amp;dn=Mira+Wilkins+-+The+History+of+Foreign+Investment+in+the+United+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1399943291,"description":"Description\nProduct Details\nBook Title: The History of Foreign Investment in the United States, 1914-1945 (Harvard Studies in Business History)\t\nBook Author: Mira Wilkins\nSeries: Harvard Studies in Business History (Book 43)\nHardcover: 1008 pages\nPublisher: Harvard University Press (July 30, 2004)\nLanguage: English\nISBN-10: 0674013085\nISBN-13: 978-0674013087\n\n===================================================================================\nBook Description\nRelease date: July 30, 2004 | ISBN-10: 0674013085 | ISBN-13: 978-0674013087\nMira Wilkins, the foremost authority on foreign investment in the United States, continues her magisterial history in a work covering the critical years 1914-1945.\nWilkins includes all long-term inward foreign investments, both portfolio (by individuals and institutions) and direct (by multinationals), across such enterprises as chemicals and pharmaceuticals, textiles, insurance, banks and mortgage providers, other service sector companies, and mining and oil industries. She traces the complex course of inward investments, presents the experiences of the investors, and examines the political and economic conditions, particularly the range of public policies, that affected foreign investments. She also offers valuable discussions on the intricate cross-investments of inward and outward involvements and the legal precedents that had long-term consequences on foreign investment.\nAt the start of World War I, the United States was a debtor nation. By the end of World War II, it was a creditor nation with the strongest economy in the world. Integrating economic, business, technological, legal, and diplomatic history, this comprehensive study is essential to understanding the internationalization of the American economy, as well as broader global trends.\n\n===================================================================================\nReviews\nThis book is breathtaking in scope and highly original. Mira Wilkins provides the first comprehensive account of foreign investment into the United States in the interwar years. In a literature which remains extremely focused on the domestic economy, Wilkins shows the importance of the business and capital relations between the United States and the rest of the world and confronts important assumptions about the nature of American 'exceptionalism.' This work is a major event in historical scholarship, of significance far beyond the business history community, where it will become an immediate classic. It will be widely welcomed. (Geoffrey Jones, Harvard Business School)\n\nA unique and valuable book about the pivotal period during which the United States switched from being a global debtor to a global creditor. The analysis of the role of 'cosmopolitan finance' in the interwar years is particularly interesting. No other work in international business history today matches the breadth, detail, and extensive research of Mira Wilkins's books. (Benjamin Gomes-Casseres, Brandeis University, International Business School)\n\nMira Wilkins is the foremost authority on both foreign investment in the United States and U.S. investment abroad...The current volume is a comprehensive history of the cross-border inflows from 1914 to 1945, covering both foreign direct investment (FDI) and foreign portfolio investment (FPI) in the United States...What Wilkins has carefully laid out is the micro-history of these movements, who entered, who stayed out, who endured, and who failed. One acquires very clear ideas of what, why, and how capital was reallocated and expanded during the first half of the twentieth century at the level of the firm and the central role of technological knowledge. Wilkins's rich account of foreign investment in the U.S. is also a major part of the story of the retreat from the pre-World War I high-tide of globalization. Business and economic historians of the twentieth century are surely and greatly in Mira Wilkins's debt. Finally, it should also be said that students of the macroeconomic movements of foreign investment will ignore this micro-history and its abrupt changes at their peril. (Michael Edelstein EH.NET 2004-11-01)\n\nThe author has produced a work of impressive scholarship. Until the 1930s little data was collected on foreign investment, and Wilkins has done an admirable job in piecing together many sources to tell a coherent story set against a background of war, depression, and frequent changes in technology, public attitudes, and government policies. (R. E. Schenk Choice 2004-11-01)\n\n===================================================================================\nAbout the Author\nMira Wilkins is Professor of Economics at Florida International University.\n===================================================================================","torrent":{"xt":"urn:btih:306c9292e4ca0a5ff32b583b1bd2ac4eacc89643","amp;dn":"Mira+Wilkins+-+The+History+of+Foreign+Investment+in+the+United+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306c9292e4ca0a5ff32b583b1bd2ac4eacc89643","infoHashBuffer":{"type":"Buffer","data":[48,108,146,146,228,202,10,95,243,43,88,59,27,210,172,78,172,200,150,67]},"announce":[],"urlList":[]}}