{"title":"Thomas Sowell - The Housing Boom and Bust  [unabridged]","uid":5051584,"size":343177307,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:30ddeb4901882911c688eb574af3cf25ac6489f9&amp;dn=Thomas+Sowell+-+The+Housing+Boom+and+Bust++%5Bunabridged%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"sheila6","files":96,"time":1250193512,"description":"Thomas Sowell - The Housing Boom and Bust\n\nUnabridged Audio Book\n\n\nWhile Sowell is clearly brilliant, he is also able to effectively communicate the whole story of the boom and bust in an interesting manner that is still rooted in his perspective as an economist.\n\nRead this and you will better understand what lead directly to the attempt to make us into a Marxist nation that we are facing today.\n\n\n\n\nThis is a plain-English explanation of how we got into the current economic disaster that developed out of the economics and politics of the housing boom and bust. The &quot;creative&quot; financing of home mortgages and the even more &quot;creative&quot; marketing of financial securities based on American mortgages to countries around the world, are part of the story of how a financial house of cards was built up-and then suddenly collapsed.\n\nThe politics behind all this is another story full of strange twists. No punches are pulled when discussing politicians of either party, the financial dangers they created, or the distractions they created later to escape their own responsibility for what happened when the financial house of cards in the financial markets collapsed.\n\nWhat to do, now that we are in the midst of an economic disaster, is yet another story-one whose ending we do not yet know, but one whose outlines and implications are explored to reveal some surprising and sobering lessons.\n\n\n\nAbout the Author\nThomas Sowell has taught economics at Cornell, UCLA, Amherst and other academic institutions, and his Basic Economics has been translated into six languages. He is currently a scholar in residence at the Hoover Institution, Stanford University. He has published in both academic journals in such popular media as the Wall Street Journal, Forbes magazine and Fortune, and writes a syndicated column that appears in newspapers across the country.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:30ddeb4901882911c688eb574af3cf25ac6489f9","amp;dn":"Thomas+Sowell+-+The+Housing+Boom+and+Bust++%5Bunabridged%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30ddeb4901882911c688eb574af3cf25ac6489f9","infoHashBuffer":{"type":"Buffer","data":[48,221,235,73,1,136,41,17,198,136,235,87,74,243,207,37,172,100,137,249]},"announce":[],"urlList":[]}}