{"title":"Garbage by Juan Gimenez  (HM 1987) cbr","uid":10086584,"size":75282270,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:313844ec88d8aa96af35ce8a4c44f3de3ddad202&amp;dn=Garbage+by+Juan+Gimenez++%28HM+1987%29+cbr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GP67","files":-1,"time":1399110380,"description":"In the discharge of toxic waste that covers the whole country, those &quot;heights&quot; watch people patronize the underzone wallow in the mud like rats. Yet both groups are aware of these old photos that show it was better centuries ago, in cities as modern as clean.But everyone thinks those days are gone, or that these are only legends The arrival of a man literally fell from the sky suddenly put them on the path to an old memory. A long way and the least painful\n\nThe world is desolate, destroyed by an Apocalypse that have ravaged the brightest part of the planet. For the survival of mankind, the great pundits have decided to sacrifice much of our good old Earth Outside, some people live in what looks more like a huge relief than anything else.Deprived of all, they risk their lives by making near the white city to recover everything that comes out, as radioactive waste food It is time to revolt! Someone has rightly excluded from the white city for serious misconductand the best way for him to return to this paradise is to raise an army, composed of the wealthy of the human race! But all is not so easy...\n\nenjoy ","torrent":{"xt":"urn:btih:313844ec88d8aa96af35ce8a4c44f3de3ddad202","amp;dn":"Garbage+by+Juan+Gimenez++%28HM+1987%29+cbr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"313844ec88d8aa96af35ce8a4c44f3de3ddad202","infoHashBuffer":{"type":"Buffer","data":[49,56,68,236,136,216,170,150,175,53,206,138,76,68,243,222,61,218,210,2]},"announce":[],"urlList":[]}}