{"title":"David G. McAfee - Mom, Dad, I'm an Atheist [2012][A]","uid":10052040,"size":4417055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:313c01360258fbc000bfc082db5939e2ce8957e0&amp;dn=David+G.+McAfee+-+Mom%2C+Dad%2C+I%27m+an+Atheist+%5B2012%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1398615760,"description":"Description\nProduct Details\nBook Title: Mom, Dad, I'm an Atheist: The Guide to Coming Out as a Non-believer\nBook Author: David G. McAfee (Author)\nPaperback: 156 pages\nPublisher: Dangerous Little Books (December 12, 2012)\nLanguage: English\nISBN-10: 1908675047\nISBN-13: 978-1908675040\n\n===================================================================================\nBook Description\nThis essential guide to coming-out as a non-believer has been written to make it easier for atheists, agnostics, freethinkers, and non-believers of all ages and backgrounds to be open about their non-religiosity while minimizing the negative interactions in familial, social, and professional circles.\nAs a survival guide for non-believers who wish to come out, this book provides advice and resources for those interested in publically rejecting religious dogma as well as real stories from non-believers who have experienced coming-out to less-than-supportive family or friends.\nWhether you're new to disbelief and looking for the cleanest possible break from your former faith or you're a lifelong atheist who wants to establish a sense of community with like-minded people, this guide provides useful resources including: tips for handling potential conflicts with believers, the author's answers to some of the most frequently asked questions on behalf of believers, and numerous references to support groups, services, and advocacy organizations dedicated to non-theists.\nFrom dealing with grief from a secular perspective to handling potential clashes in religious worldviews between significant others, this book offers multiple perspectives from non-religious individuals who have generously shared their experiences to help those atheists who may find themselves in similar situations.\n===================================================================================\nReview\n&quot;For many people, figuring out that the supernatural claims of religions don't hold up to honest analysis is relatively easy. It's the next step--sharing this conclusion with mom and dad--that often proves to be the most difficult of all. Fortunately, David G. McAfee has produced an invaluable contribution to all nonbelievers who find they must navigate that most treacherous minefield known as the religious family...&quot;\n-- Guy P. Harrison, author of Race and Reality and 50 Simple Questions for Every Christian\n===================================================================================\nAbout the Author\nDavid G. McAfee is a journalist, a religious studies scholar, and author of Disproving Christianity and other Secular Writings. He is a columnist for Canadian Freethinker Magazine and a contributor to American Atheist Magazine. Mr. McAfee attended University of California, Santa Barbara, and graduated with a dual-degree in English and Religious Studies with an emphasis on Christianity and Mediterranean religions. After experiencing discrimination within the American public education system as a result of his secular activism, David G. McAfee sought to publish Mom, Dad, I'm an Atheist to help those who fear similar professional or familial consequences to their public non-belief.\n===================================================================================","torrent":{"xt":"urn:btih:313c01360258fbc000bfc082db5939e2ce8957e0","amp;dn":"David+G.+McAfee+-+Mom%2C+Dad%2C+I%27m+an+Atheist+%5B2012%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"313c01360258fbc000bfc082db5939e2ce8957e0","infoHashBuffer":{"type":"Buffer","data":[49,60,1,54,2,88,251,192,0,191,192,130,219,89,57,226,206,137,87,224]},"announce":[],"urlList":[]}}