{"title":"Barry Rubin - The Tragedy of the Middle East","uid":10715569,"size":1055473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3220dc01e5ff62c397deb7d02ec7f8f81a8a89f9&amp;dn=Barry+Rubin+-+The+Tragedy+of+the+Middle+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SectorVector","files":-1,"time":1407405712,"description":"The Tragedy of the Middle East by Barry Rubin\n\n# 292 pages\n# Cambridge University Press; (September 2, 2002)\n\n\nThe Middle East has changed clearly, substantially, and dramatically during the last decade. Yet scholarly and public understanding lags far behind recent events. Barry Rubin's historical and political summation of the region shows how events and ideas have both shaped and altered its character.\n\n\nThree interlinked themes are crucial to the book.\n\nFirst, a reinterpretation of the era of recent upheaval the Middle East has just passed through, which the author calls the Era of Radical Expectations. During that period, many Arabs believed that some leader, country, or radical movement would unite the region, solving all its problems.\n\n\nSecond, an evaluation of how the historical experience of the period between the 1940s and the 1990s undermined the old system, making change necessary.\n\n\nThird, an analysis of the region today that explains future developments, in what the author terms the Era of Reluctant Pragmatism, as the Middle Eastern societies determine their relationships to the West.\n\n\nBarry Rubin is Director of the Global Research in International Affairs (GLORIA) Center of the Interdisciplinary Center in Herziliya, Israel, and editor of the Middle East Review of International Affairs. He is the author of 16 books on the Middle East and has edited another 17 that include the widely reviewed and acclaimed The Transformation of Palestinian Politics (Harvard, 1999) and The Israel-Arab Reader (Penguin/Putnam, 2002)\n\n-_-","torrent":{"xt":"urn:btih:3220dc01e5ff62c397deb7d02ec7f8f81a8a89f9","amp;dn":"Barry+Rubin+-+The+Tragedy+of+the+Middle+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3220dc01e5ff62c397deb7d02ec7f8f81a8a89f9","infoHashBuffer":{"type":"Buffer","data":[50,32,220,1,229,255,98,195,151,222,183,208,46,199,248,248,26,138,137,249]},"announce":[],"urlList":[]}}