{"title":"Chemical Reaction Engineering Essentials, Exercises and Examples","uid":12011721,"size":4663739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3284dc2169cc3e56a5b6bd438865608a627ea2f7&amp;dn=Chemical+Reaction+Engineering+Essentials%2C+Exercises+and+Examples&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1434177922,"description":"ISBN 9780415695381\n\nhemical Reaction Engineering: Essentials, Exercises and Examples presents the essentials of kinetics, reactor design and chemical reaction engineering for undergraduate students. Concise and didactic in its approach, it features over 70 resolved examples and many exercises.\n\nThe work is organized in two parts: in the first part kinetics is presented focusing on the reaction rates, the influence of different variables and the determination of specific rate parameters for different reactions both homogeneous and heterogeneous. This section is complemented with the classical kinetic theory and in particular with many examples and exercises. The second part introduces students to the distinction between ideal and non-ideal reactors and presents the basic equations of batch and continuous ideal reactors, as well as specific isothermal and non-isothermal systems. The main emphasis however is on both qualitative and quantitative interpretation by comparing and combining reactors with and without diffusion and mass transfer effects, complemented with several examples and exercises. Finally, non-ideal and multiphase systems are presented, as well as specific topics of biomass thermal processes and heterogeneous reactor analyses. The work closes with a unique section on the application of theory in laboratory practice with kinetic and reactor\nexperiments.\n\nThis textbook will be of great value to undergraduate and graduate students in chemical engineering as well as to graduate students in and researchers of kinetics and catalysis","torrent":{"xt":"urn:btih:3284dc2169cc3e56a5b6bd438865608a627ea2f7","amp;dn":"Chemical+Reaction+Engineering+Essentials%2C+Exercises+and+Examples","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3284dc2169cc3e56a5b6bd438865608a627ea2f7","infoHashBuffer":{"type":"Buffer","data":[50,132,220,33,105,204,62,86,165,182,189,67,136,101,96,138,98,126,162,247]},"announce":[],"urlList":[]}}