{"title":"Frankie Boyle - work! consume! die! 32kbs mp3 unabridged","uid":6779602,"size":125762485,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:32a04a21764da90bfbe59ec26e705e8eed05be5d&amp;dn=Frankie+Boyle+-+work%21+consume%21+die%21+32kbs+mp3+unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"audiobookman","files":3,"time":1319849032,"description":"\n\nWork! Consume! Die!\n\nUNABRIDGED\nby Frankie Boyle\nNarrated by Angus King\n\nLENGTH\n8 hrs and 46 mins\n\n10-13-11\n\nBrace yourself, Frankies back, and hes more outspoken and brilliantly inappropriate than ever.\n\nThere are fears that this Christmas could see the start of a double-dip recession, or worse still a double-dip-with-misery-sprinkles and f**k-wheres-my-job?-sauce. Why not chuckle into the howling void as taloned fingers reach up to consume you with Frankie Boyles new book, Work! Consume! Die!\n\nIn Work! Consume! Die! stand-up comedy's favourite pessimist, Frankie Boyle, offers his outrageous, laugh-out-loud, cynical rant on life as he knows it. He describes your reality as viewed through a bloodshot eye pressed against a shit-smeared telescope, focused on hell:\n\nCharlie Sheens life consists of going on huge drug benders with groups of porn stars. If he straightened himself out he could have a really mediocre career as a bit-part Hollywood actor. Playing the role of Martin Sheens corpse. Hes crazy like a fox! And also actually crazy. What a tragic waste, not being Charlie Sheen is. How majestic it will be for him to die, possibly quite soon, knowing that when they make a movie of his life, it will be a porno.\nThe X Factor will be allowed to show product placements. Thats powerful advertising. Last series I realised that looking at the judges alone had made me subconsciously buy a gnome, a scrag-end of mutton, a vacuous mannequin and a suspected gay.\nThe Taliban are running out of bullets. Operation &quot;Get our troops to absorb them with their bodies&quot; is finally paying off. The Taliban are finding it impossible to get hold of essential supplies at last were fighting on equal terms. But lets not get complacent. Just because theyre running out of bullets we mustnt assume our boys wont get shot. Remember, the US troops have still got plenty.\n\nWhat the Critics Say\n\nReviews of My Shit Life So Far: &quot;If you are suffocating in cosy Christmas cheer, this abrasively cynical, relentlessly misanthropic book might feel like a welcome faceful of ice-cold water straight out of the Clyde.&quot; (The Sunday Times)\n\n&quot;Quite triumphantly, this is the most abusive, obscene, insulting memoir yet published Many, many funny lines here. A difficult book to read sedately in public.&quot; (The Evening Standard)\n\n&quot;He has a shocking, acid-tongued wit and his sharp observations make this one of the funniest autobiographies Ive read.&quot; (The Sun)","torrent":{"xt":"urn:btih:32a04a21764da90bfbe59ec26e705e8eed05be5d","amp;dn":"Frankie+Boyle+-+work%21+consume%21+die%21+32kbs+mp3+unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32a04a21764da90bfbe59ec26e705e8eed05be5d","infoHashBuffer":{"type":"Buffer","data":[50,160,74,33,118,77,169,11,251,229,158,194,110,112,94,142,237,5,190,93]},"announce":[],"urlList":[]}}