{"title":"The Reign of Arthur: From History... (2013) Christopher Gidlow (","uid":9505993,"size":2545136,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32b83dfbd285a51160cc94b9812766db20ff454d&amp;dn=The+Reign+of+Arthur%3A+From+History...+%282013%29+Christopher+Gidlow+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1390318308,"description":"The Reign of Arthur: From History to Legend (2013) Christopher Gidlow (multi)\n\nThe Reign of Arthur: From History to Legend by Christopher Gidlow\n\n\nFormat: mobi/epub/azw3\nLength: 288 pages\nGenre: History\nDate: 31 March 2013\n\nIn this work, Christopher Gidlow takes look at the early sources describing Arthur's career and compares them to the reality of fifth and sixth-century life in Britain, presenting a case for the existence of Arthur.\n\nMedieval legends of Arthur abound and, until recently, were thought to preserve historical evidence from the Arthurian age. Modern research has overturned that idea but the resulting backlash against the dark-age sources is, as Gidlow shows, an overreaction.\n\nWorking from history to legend, he compares the earliest references to Arthur - a late sixth-century comparison between him and a slain northern warrior and a detailed account of Arthur's career in the Historia Brittonum three centuries later - with contemporary testimony, archaeological discoveries and Arthurian legends. The picture which emerges - the only one to fit all the facts - is that of a dark-age general who united the Kings of the Britons and led them to fight against the invading Saxons. There is evidence for the existence of this war-leader, and no other name for him but Arthur.\n\nThe Reign of Arthur includes a new setting for Arthur's greatest battle, a likely place for his last battle and fresh suggestions about his tomb at Glastonbury. It also identifies an areas of operations in the region of Hay-on-Wye. Based on the latest research, this book is a addition to our knowledge of the elusive Arthur.\n\nAuthor:\n\nChristopher Gidlow is events and live interpretation manager at the Historic Royal Palaces. An Oxford history graduate, he has a longstanding interest in the middle ages and the Arthurian legends. At Oxford he was president of the university Arthurian Society, of which he is now an honorary life member. ","torrent":{"xt":"urn:btih:32b83dfbd285a51160cc94b9812766db20ff454d","amp;dn":"The+Reign+of+Arthur%3A+From+History...+%282013%29+Christopher+Gidlow+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32b83dfbd285a51160cc94b9812766db20ff454d","infoHashBuffer":{"type":"Buffer","data":[50,184,61,251,210,133,165,17,96,204,148,185,129,39,102,219,32,255,69,77]},"announce":[],"urlList":[]}}