{"title":"Coercion as Cure - A Critical History of Psychiatry - Thomas Sza","uid":10817996,"size":1325578,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32f2bbb9f46472100b7f60a7011410bfcc82da28&amp;dn=Coercion+as+Cure+-+A+Critical+History+of+Psychiatry+-+Thomas+Sza&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gard0802","files":2,"time":1408485338,"description":"Understanding the history of psychiatry requires an accurate view of its function and purpose. In this provocative new study, Szasz challenges conventional beliefs about psychiatry. He asserts that, in fact, psychiatrists are not concerned with the diagnosis and treatment of bona fide illnesses. Psychiatric tradition, social expectation, and the law make it clear that coercion is the profession's determining characteristic.\n\nPsychiatrists may &quot;diagnose&quot; or &quot;treat&quot; people without their consent or even against their clearly expressed wishes, and these involuntary psychiatric interventions are as different as are sexual relations between consenting adults and the sexual violence we call &quot;rape.&quot; But the point is not merely the difference between coerced and consensual psychiatry, but to contrast them. The term &quot;psychiatry&quot; ought to be applied to one or the other, but not both. As long as psychiatrists and society refuse to recognize this, there can be no real psychiatric historiography.\n\nThe coercive character of psychiatry was more apparent in the past than it is now. Then, insanity was synonymous with unfitness for liberty. Toward the end of the nineteenth century, a new type of psychiatric relationship developed, when people experiencing so-called &quot;nervous symptoms,&quot; sought help. This led to a distinction between two kinds of mental diseases: neuroses and psychoses. Persons who complained about their own behavior were classified as neurotic, whereas persons about whose behavior others complained were classified as psychotic. The legal, medical, psychiatric, and social denial of this simple distinction and its far-reaching implications undergirds the house of cards that is modern psychiatry. Coercion as Cure is the most important book by Szasz since his landmark The Myth of Mental Illness.","torrent":{"xt":"urn:btih:32f2bbb9f46472100b7f60a7011410bfcc82da28","amp;dn":"Coercion+as+Cure+-+A+Critical+History+of+Psychiatry+-+Thomas+Sza","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f2bbb9f46472100b7f60a7011410bfcc82da28","infoHashBuffer":{"type":"Buffer","data":[50,242,187,185,244,100,114,16,11,127,96,167,1,20,16,191,204,130,218,40]},"announce":[],"urlList":[]}}