{"title":"World of goo v 1.0.2 Android","uid":6939082,"size":48238558,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:332218587f73bcf45bbd62ce8e868ee2b2b186bb&amp;dn=World+of+goo+v+1.0.2+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cad40","files":1,"time":1325896109,"description":"Description\n-----------\n- &quot;Game of the Year&quot; -MetaCritic, IGN, TouchArcade, Rock Paper Shotgun, GameTunnel\nBeautiful and surprising, the millions of Goo Balls who live in the World of Goo are curious to explore - but they don't know that they are in a game, or that they are extremely delicious.\nThis is the FULL award winning game, now on Android. Drag and drop living, squirming, talking, globs of goo to build structures, bridges, cannonballs, zeppelins, and giant tongues.\nMysterious Levels - Each level is strange and dangerously beautiful, introducing new puzzles, areas, and the creatures that live in them.\nWorld of Goo Balls - Along the way, undiscovered new species of Goo Ball, each with unique abilities, come together to ooze through reluctant tales of discovery, love, conspiracy, beauty, electric power, and the third dimension.\nThe Sign Painter - Someone is watching you.\nWorld of Goo Corporation - Congratulations! World of Goo Corporation is the Global Leader in Goo and Goo Related Product, including World of Goo Corporation Trademark Brand Soft Drink Beverage and World of Goo Corporation Trademark Brand Facial Exfoliating Lotion. Succulent!\nMassive Online Competition - Human players around the world compete in a living leaderboard to build the tallest towers of goo in World of Goo Corporation's mysterious sandbox. World of Goo Corporation is contractually obligated to state that everyone is a winner and is enthusiastic to celebrate everyone's tower building opportunities equally.\nCongratulations, and good luck!\nAwards and recognition for World of Goo: \n* Wii Game of the Year -IGN \n* iPad Game of the Year - TouchArcade, MetaCritic\n* Best Indie Game -Spike TV Video Game Awards\n* Best Design -Academy of Interactive Arts and Sciences \n* Best Downloadable Title -Game Developers Choice Awards \n* Best Design -Independent Games Festival \n* Technical Excellence -Independent Games Festival \n* Best Indie Game -Spike TV Video Game Awards\n* Game of the Year -Rock Paper Shotgun \n* Game of the Year -GameTunnel \n* Best PC Puzzle Game -IGN \n* Best Wii Puzzle Game -IGN \n* Best Artistic Design Wii -IGN \n* Best New IP Wii -IGN \n* Most Innovative Design Wii -IGN \n* Puzzler of the Year -Golden Joystick Awards\n\n\n\nIf u have any other requests click on my latest torrent and leave message ill see what i can do \n &lt;a href=&quot;\nhttp://thepiratebay.se/user/cad40/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cad40/&lt;/a&gt;","torrent":{"xt":"urn:btih:332218587f73bcf45bbd62ce8e868ee2b2b186bb","amp;dn":"World+of+goo+v+1.0.2+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"332218587f73bcf45bbd62ce8e868ee2b2b186bb","infoHashBuffer":{"type":"Buffer","data":[51,34,24,88,127,115,188,244,91,189,98,206,142,134,142,226,178,177,134,187]},"announce":[],"urlList":[]}}