{"title":"The Carpetbaggers 1964 ENG FRE SPAsub DVDrip XviD 100% Honeyko a","uid":4135605,"size":4591813515,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:33fef5a687944f70161640ab9219d58b1a8e4cd1&amp;dn=The+Carpetbaggers+1964+ENG+FRE+SPAsub+DVDrip+XviD+100%25+Honeyko+a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"mike18xx","files":6,"time":1208249175,"description":"THE CARPETBAGGERS (1964): Hollywood Soapy Sleaze, Melodrama, Tycoons,\nCorporate Raiders, Blonde Bombshells, Duesenbergs, George Peppard.\n\nIn 1964, it was erotic, escapist trash; but compared with the complete\ngarbage the movie industry releases today (with its inane dialogue and\nubiquitous male ass shots), &quot;The Carpetbaggers&quot; is now high-class art.\n\nVideo Codec ..........: XviD, CQ 2.75, LEM de-grain, Didees SixOfNine-HVS\nFrame Size ...........: 704x368, 844x368 Anamorphic DAR\nVideo FPS ............: 23.976 original, 3671 Kbps\n\nAudio: English DPLII (from AC3 5.1) 192kbps, English and French Mono\n\nSubtitles: English, Spanish\n\nSource: Hideously grainy (&quot;It&amp;#039;s a dot blizzard!&quot;) Region 1 NTSC DVD9.\nOriginal film VOB size : 6.86gb; size of this &quot;XviD 100%&quot; rip: 4.26gb\nGrain remaining: The opening sky-credits sequence had literally more\ngrain than movie, so it&amp;#039;s still pretty bad. The rest cleaned up nicely.\n\nDVD: Should you buy it? Answer: No. Avoid the grainy &quot;American cut&quot;, and\nbe advised than any PAL with the racier European cut, while containing a\nfew more glimpes of bare backs, will be a &quot;tinny&quot; sped-up version. There\nare also zero DVD extras. Hold your cash until they treat this film right.\n\n***** Riveting Hollywood Sleaze - 5.0 out of 5 stars\n\n&quot;The Carpetbaggers&quot; is a fantastic adaptation of Harold Robbins&amp;#039; bestseller,\nvery racy for its era, with dialogue that is often rare and juicy, a superb\ncast, and great direction by Edward Dmyrtryk. The character of Jonas Cord is\nloosely based on the life of Howard Hughes, and it is interesting to compare\nthis film with Martin Scorsese&amp;#039;s &quot;The Aviator.&quot; Both George Peppard as Cord\nand Leonardo DiCaprio as Hughes give brilliant performances, but overall, I\nfind this film far more satisfying, and certainly a lot more entertaining.\n\nPeppard was at the height of his career in this film, and it is perhaps his best.\nIt gives him a wide range of emotions, as well as the physicality and toughness\nhe was so good at. Others that shine in the large cast are Alan Ladd in what was\nto be his last film as Nevada Smith, Carroll Baker as the sultry Rina, Robert\nCummings as Nevada&amp;#039;s slick and slimey manager. Elizabeth Ashely as Mrs. Jonas\nCord (and who soon after this film was to become the real life Mrs. Peppard),\nMartin Balsam as the owner of a film studio, and Lew Ayres, as second in command\nin Jonas Cord&amp;#039;s empire, has some of the best lines in the film.\n\nThe pacing of the film never lags, and there is a brutal fight between Jonas\nand Nevada, one of those screen fights that is always fascinating to watch.\nThe Nevada Smith character is quite complex, and was to spawn a &quot;prequel&quot; two\nyears later, starring Steve McQueen. The cinematography by Joseph MacDonald is\nmarvelous, the Edith Head gowns lavishly glamorous, and very important to the\nsuccess of this film is the fabulous jazzy score, one of Elmer Bernstein&amp;#039;s finest.\nIn my youth I devoured all of Robbins&amp;#039; books, loved the well-written sleaze of\nthem, and loved this film in its theatrical release. I&amp;#039;ve since watched it\nrepeatedly, and find more to enjoy in it with each viewing. -- Alejandra Vernon ","torrent":{"xt":"urn:btih:33fef5a687944f70161640ab9219d58b1a8e4cd1","amp;dn":"The+Carpetbaggers+1964+ENG+FRE+SPAsub+DVDrip+XviD+100%25+Honeyko+a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33fef5a687944f70161640ab9219d58b1a8e4cd1","infoHashBuffer":{"type":"Buffer","data":[51,254,245,166,135,148,79,112,22,22,64,171,146,25,213,139,26,142,76,209]},"announce":[],"urlList":[]}}