{"title":"La Mujer de las Nueve Lunas - Carmen Torres Ripa [Epub][Spanish]","uid":6836930,"size":645756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34146a8057f25048264fb93d998f04909fce0589&amp;dn=La+Mujer+de+las+Nueve+Lunas+-+Carmen+Torres+Ripa+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virana","files":-1,"time":1322045645,"description":"Carmen Torres Ripa\nLa mujer de las nueve lunas [epub]\n\n\nResumen:En la actualidad hablar de feminismo no es un tabÃƒÂº, pero hace siglos atreverse a reivindicar a la mujer como lo hacÃƒÂ­a Hildegard de Bingen, canonizada en 1940, era una temeridad a la que misteriosamente nadie se atreviÃƒÂ³ a oponerse con la suficiente determinaciÃƒÂ³n para hacer callar a esta abadesa alemana. En 1118, en Renania, siendo priora del monasterio de San Disibolo, descubre a su bella novicia que acaba de dar a luz con heridas que hacen temer por su vida y a su hijo que aun se halla vivo, aunque semienterrado en el bosque.\n\nEn el presente un joven sacerdote es reclamado por el Vaticano para estudiar los cÃƒÂ³dices que santa Hildegarda dejÃƒÂ³ escritos en el lenguaje inventado por ella, llamado Lingua Ignota, para tratar de descifrar una profecÃƒÂ­a reveladora de misterios que ataÃƒÂ±en a la Iglesia, en los que poco a poco irÃƒÂ¡ descubriendo que detrÃƒÂ¡s de todo ello hay unos intereses oscuros en los que se verÃƒÂ¡ reflejado, moral, fÃƒÂ­sica y emocionalmente.\n\nPara los que todavÃƒÂ­a no sepan quiÃƒÂ©n era esta mujer de armas tomar, independiente y polifaceta (realmente, era buena en casi todo: curandera con hierbas, compositora musical, escritora y hasta visionaria), la novela es una buena oportunidad de acercarse a ella. En cambio, hay que decir que la trama en la que se ve envuelta (no hay nada mejor que un thriller para captar la atenciÃƒÂ³n de los lectores), es algo floja, entre otras razones porque los personajes ficticios no son creÃƒÂ­bles y viven situaciones demasiado forzadas y novelescas, ademÃƒÂ¡s de que se cuela una especie de relaciÃƒÂ³n amorosa un tanto descafeinada. AsÃƒÂ­ que desde el punto de vista informativo, La mujer de las nueve lunas es un obra impecable (y hace justicia con un personaje que parecÃƒÂ­a arrinconado en la Historia), pero como thriller, resulta irregular.\n\nSamuel Beyhe, un joven sacerdote experto en mÃƒÂ­stica en plena crisis de fe, recibe un encargo de sus superiores vaticanos: investigar la vida y obra de Hildegard de Bingen, una abadesa de la Edad Media, teÃƒÂ³loga, profetisa y visionaria, que revolucionÃƒÂ³ la jerarquÃƒÂ­a eclesiÃƒÂ¡stica de su ÃƒÂ©poca.\nLo que empieza siendo una investigaciÃƒÂ³n, pronto se convierte en una vertiginosa carrera por descifrar una profecÃƒÂ­a que afectarÃƒÂ¡ irremediablemente al papel de la mujer dentro de la Iglesia CatÃƒÂ³lica. Y tambiÃƒÂ©n en un peligroso juego donde la rompedora visiÃƒÂ³n de Hildegard en torno a la verdad, la fe, el sexo y el amor cambiarÃƒÂ¡n la vida de Samuel para siempre.","torrent":{"xt":"urn:btih:34146a8057f25048264fb93d998f04909fce0589","amp;dn":"La+Mujer+de+las+Nueve+Lunas+-+Carmen+Torres+Ripa+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34146a8057f25048264fb93d998f04909fce0589","infoHashBuffer":{"type":"Buffer","data":[52,20,106,128,87,242,80,72,38,79,185,61,153,143,4,144,159,206,5,137]},"announce":[],"urlList":[]}}