{"title":"Marine Ornamental Shrimp Biology, Aquaculture and Conservation.p","uid":10495677,"size":3172465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3422df6dfa3a0ec8e4228ad7ccd727f04cda9bf2&amp;dn=Marine+Ornamental+Shrimp+Biology%2C+Aquaculture+and+Conservation.p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":1,"time":1404617760,"description":" Ricardo Calado, &quot;Marine Ornamental Shrimp: Biology, Aquaculture and Conservation&quot;\n2008 | ISBN-10: 1405170867 | 280 pages | PDF | 3 MB\n\nMarine ornamental shrimp are amongst the most heavily traded invertebrate species in the aquarium industry. The majority of traded species are still collected from the wild, having a major effect on ocean ecosystems. An increase in the amount of culture of these species is now a major priority for those in the trade and for marine conservationists. Marine Ornamental Shrimp provides a global overview of the biology, culture and conservation of the major families of marine ornamental shrimp. Coverage in this thorough volume includes ecological aspects, reproductive biology, major techniques used in culture systems for maturation, larviculture, and juvenile growth, and details of the main conservation issues surrounding these important species including a discussion of the negative aspects of wild specimen collection and the ongoing efforts to mitigate such impacts. Marine Ornamental Shrimp is an important and extremely timely publication which will be an essential reference and manual for all those involved in the trade and culture of marine ornamental species, including aquaculture scientists and personnel in aquaria. Conservation biologists and invertebrate zoologists will also find much of importance within this book. Libraries in all universities and research establishments where aquaculture and biological sciences are studied and taught should have copies of this book on their shelves.","torrent":{"xt":"urn:btih:3422df6dfa3a0ec8e4228ad7ccd727f04cda9bf2","amp;dn":"Marine+Ornamental+Shrimp+Biology%2C+Aquaculture+and+Conservation.p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3422df6dfa3a0ec8e4228ad7ccd727f04cda9bf2","infoHashBuffer":{"type":"Buffer","data":[52,34,223,109,250,58,14,200,228,34,138,215,204,215,39,240,76,218,155,242]},"announce":[],"urlList":[]}}