{"title":"The Perfect Woman - Jesse Abundis","uid":11239619,"size":370083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3460f84fa802af6125e73b36f7b6f2adccb36b5d&amp;dn=The+Perfect+Woman+-+Jesse+Abundis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1413650325,"description":"A serial killer plagued with an idea to find his ideal woman, has taken to the streets of New York to harvest the body parts of the women he has romanced and fallen in love with, to paste together his perfect woman, all to end the demon inside him.\n\nThis killer is unlike others, he's avoided the attention of the NYPD by making his victims look like love struck girls, running to disappear from their lonely broken lives.\n\nUnaware to the killer, two unlikely souls, Karen &amp; Peewee, have taken the cause to investigate and put an end to the string of disappearances. Their search will lead them down a dark path, one that will bring Karen's own demons into the light.\n\nBut they are not the only ones that have crossed paths with the killer, Lieutenant Detective Brian Klecko was the first one to investigate the first missing victim, a case that crippled his soul and put his sanity into question as he falls deeper into a black abyss that temps him to become a monster this world has ever seen.\n\nIn the end, nothing will ever be the same again","torrent":{"xt":"urn:btih:3460f84fa802af6125e73b36f7b6f2adccb36b5d","amp;dn":"The+Perfect+Woman+-+Jesse+Abundis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3460f84fa802af6125e73b36f7b6f2adccb36b5d","infoHashBuffer":{"type":"Buffer","data":[52,96,248,79,168,2,175,97,37,231,59,54,247,182,242,173,204,179,107,93]},"announce":[],"urlList":[]}}