{"title":"Ray Monk - Ludwig Wittgenstein The Duty of Genios (bio, epub, mo","uid":7842488,"size":8076225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35a248f96e6a468b2557076d94ebc987d1ef5bb0&amp;dn=Ray+Monk+-+Ludwig+Wittgenstein+The+Duty+of+Genios+%28bio%2C+epub%2C+mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"attar23","files":5,"time":1353376128,"description":"From Publishers Weekly\nAccording to Monk, philosopher and reluctant Cambridge don Wittgenstein (1889-1951) was driven by spiritual as much by intellectual concerns, exchanged academia for solitude whenever possible and was drawn to brilliant younger men. &quot;Monk has done an excellent job of elucidating the twin journeys of an extraordinary mind and soul,&quot; said PW. Photos.\nCopyright 1991 Reed Business Information, Inc.\n\nFrom Library Journal\nThe veritable flood of writings about Wittgenstein--fiction as well as nonfiction--continues unabated, and this is a worthy addition. Monk gives a more balanced account of Wittgenstein's life and personality than does Brian McGuinness ( Wittgenstein: A Life; Young Ludwig, 1889-1921, LJ 9/15/88), insofar as he deals with Wittgenstein's homosexuality and goes into considerable detail about the three main relationships in Wittgenstein's life. Monk has done a great deal of research; what emerges is a portrait of a troubled, restless, creative mind, one destined, it seems, to be forever dissatisfied. Though not the last word on Wittgenstein's life--something on the order of a &quot;psychobiography&quot; must someday be written--this book is highly recommended.\n- Leon H. Brody, U.S. Office of Personnel Management Lib., Washington, D.C.\nCopyright 1990 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:35a248f96e6a468b2557076d94ebc987d1ef5bb0","amp;dn":"Ray+Monk+-+Ludwig+Wittgenstein+The+Duty+of+Genios+%28bio%2C+epub%2C+mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35a248f96e6a468b2557076d94ebc987d1ef5bb0","infoHashBuffer":{"type":"Buffer","data":[53,162,72,249,110,106,70,139,37,87,7,109,148,235,201,135,209,239,91,176]},"announce":[],"urlList":[]}}