{"title":"Purity Ring - Another Eternity (2015) [24.96 FLAC] HDtracks","uid":14603215,"size":771800242,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:361244415e6a2e5c2f33071e81c522138a5a68a2&amp;dn=Purity+Ring+-+Another+Eternity+%282015%29+%5B24.96+FLAC%5D+HDtracks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":11,"time":1463064244,"description":"\n  Purity Ring - Another Eternity (2015) [24.96 FLAC] HDtracks\r\n\r\n  Genre: Electronic\r\n  Styles: Synth Pop, Indie\r\n  Source: WEB (HDtracks 44khz recordings mastered to 96khz/24bit)\r\n  Codec: FLAC\r\n  Bit rate: 2,900 kbps\r\n  Bit depth: 24\r\n  Sample rate: 96 kHz\r\n\r\n  01 Heartsigh \r\n  02 Bodyache \r\n  03 Push Pull \r\n  04 Repetition \r\n  05 Stranger Than Earth \r\n  06 Begin Again \r\n  07 Dust Hymn \r\n  08 Flood On The Floor \r\n  09 Sea Castle \r\n  10 Stillness In Woe \r\n\r\n  Review by Heather Phares\r\n\r\n  After the surge of ethereal electronic bands that arrived in the wake of Shrines, Purity Ring's Megan James and Corin Roddick wanted their second album to stand out from the pack. On Another Eternity, they do just that -- by becoming more pop. Where Shrines often felt exploratory, this album is direct, possibly because they worked in physical proximity for the first time, choosing Edmonton as a home base. Another Eternity makes the contrast between James' limpid vocals and Roddick's thumping beats more distinct, and distinctive, than ever, particularly on the gorgeous &quot;Begin Again.&quot; Wedding poetic verses with soaring, insistent choruses that CHVRCHES would love to call their own, it's one of Purity Ring's most immediate songs. However, it isn't a compromise, and as James and Roddick look to even more popular styles of music for inspiration, they sound more unique. Their R&amp;B and hip-hop leanings are clearer than they were on Shrines, and on tracks like &quot;Repetition,&quot; which sounds equally alien and sensual, and &quot;Stranger Than Earth,&quot; where rattling, trap-inspired beats add some friction, they're also more creative. And while Roddick and James are no longer online collaborators, they still play with the dualities of virtual and real, physical and spiritual on Another Eternity. Song titles like &quot;Push Pull&quot; and phrases like &quot;veins growing slow&quot; nod to James' fascination with bodily imagery on Shrines, and her crystalline, perhaps slightly processed vocals have a more-human-than-human vulnerability that gives &quot;Heartsigh&quot; a hyperreal poignancy. It all comes together brilliantly on &quot;Bodyache,&quot; a wish for intimacy to a music-box melody and synths that sparkle like tears -- or stars. Another Eternity remains true to what makes Purity Ring special by refining it, and proves that they can challenge themselves and deliver their most accessible work yet","torrent":{"xt":"urn:btih:361244415e6a2e5c2f33071e81c522138a5a68a2","amp;dn":"Purity+Ring+-+Another+Eternity+%282015%29+%5B24.96+FLAC%5D+HDtracks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361244415e6a2e5c2f33071e81c522138a5a68a2","infoHashBuffer":{"type":"Buffer","data":[54,18,68,65,94,106,46,92,47,51,7,30,129,197,34,19,138,90,104,162]},"announce":[],"urlList":[]}}