{"title":"Chinese Aircraft.pdf","uid":7672005,"size":107955861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:364e5763667bb66ace85fa6c18465e9b39dcbf2a&amp;dn=Chinese+Aircraft.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JinRohEX","files":1,"time":1348602178,"description":"Chinese Aircraft: China's Aviation Industry Since 1951\nby Yefim Gordon, Dmitriy Komissarov\n\nDescription:\n Shrouded in secrecy, output from the Chinese aviation industry was, until recently, largely unknown in the West. In the 1950s, when communist China and the Soviet Union were on friendly terms, the Soviet Union assisted in the establishment of the People's Liberation Army Air Force (PLAAF) by delivering combat aircraft and training Chinese personnel. \n Following the 1960s' rift between Moscow and Beijing, the Chinese authorities set up an indigenous aircraft industry, and as they gained experience, versions of Soviet aircraft started appearing together with their own designs. \n Chinese Aircraft provides a full description of all aircraft types including the Shaanxi Y8, the Chengdu JF-17 (FC-1) light fighter, which is now entering service with the Pakistan Air Force, the Shenyang J-10, and the KJ-2000 AWACS aircraft based on the Il'yushin IL-76. It also details the factories and design institutions representing the industry over the years, including Chengdu, Guizhou, Shenyang, Xian, and Chiange and compares early and late designs to show how those organizations developed. \n A special section deals with experimental types and the latest research and development while further sections are devoted to aircraft weapons, unmanned aerial vehicles, and Chinese aircraft exports on a country-by-country basis. \n Numerous color profiles and three-view drawings are also included, along with the logos of production enterprises and design institutions to form a comprehensive guide to Chinese aircraft and China's aviation industry.\n\nPages:\t264\nFirst Edition:  2008","torrent":{"xt":"urn:btih:364e5763667bb66ace85fa6c18465e9b39dcbf2a","amp;dn":"Chinese+Aircraft.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"364e5763667bb66ace85fa6c18465e9b39dcbf2a","infoHashBuffer":{"type":"Buffer","data":[54,78,87,99,102,123,182,106,206,133,250,108,24,70,94,155,57,220,191,42]},"announce":[],"urlList":[]}}