{"title":"Jane Fonda - Yoga Exercise Workout ISO (1993)","uid":10491586,"size":2445250767,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:367569ea7b1e9ec1f5fa47913158a5a5f4bc6481&amp;dn=Jane+Fonda+-+Yoga+Exercise+Workout+ISO+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"christmasinthecity","files":-1,"time":1404559011,"description":"This is an old but popular yoga VHS from 1993. I've converted it from VHS to ISO so the quality is not brilliant - but it is watachable - it's not on the TPB hence the upload.\n\nDescription:\n\n It was probably inevitable that Jane Fonda, who played such a defining role in the aerobics boom of the 1980s, would be on the yoga train as well when it started rolling in the 1990s. And on this tape (recorded in 1993), she does a good job of it. The focus is on the &quot;sun salutation,&quot; a connected series of poses that builds strength, flexibility, and balance, and with repeated practice this offers what Fonda calls &quot;an excellent full-body workout.&quot; The program is divided into three sections, any one of which can be practiced on its own. The first breaks down the various poses comprising the sun salute, while the second is devoted to several repetitions of the salute itself; three variations are offered, two incorporating some of Fonda's own techniques and one that's closer to the &quot;classical&quot; or &quot;Series C&quot; salutation. The final section (which might actually be a better place to prepare for your practice than to finish it) focuses on relaxation and breathing. Fonda's manner is brisk, but her instructions are clear and concise, and while the tape isn't especially difficult, it should prove challenging enough for beginners and most intermediates. ","torrent":{"xt":"urn:btih:367569ea7b1e9ec1f5fa47913158a5a5f4bc6481","amp;dn":"Jane+Fonda+-+Yoga+Exercise+Workout+ISO+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"367569ea7b1e9ec1f5fa47913158a5a5f4bc6481","infoHashBuffer":{"type":"Buffer","data":[54,117,105,234,123,30,158,193,245,250,71,145,49,88,165,165,244,188,100,129]},"announce":[],"urlList":[]}}