{"title":"Vassily Aksyonov - The Island of Crimea (pdf)","uid":10136013,"size":3049794,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36a6cbd21ce0b98d32bbd552ec5dab1615af183f&amp;dn=Vassily+Aksyonov+-+The+Island+of+Crimea+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1399945828,"description":"Vassily Aksyonov - The Island of Crimea (Vintage Books, 1983). 369 pp.\n\nSatirical novel first published in 1981 about the Soviet invasion of the island of Crimea -- you remember the invasion, don't you? Of course you do. The book was all but forgotten until recent events made it relevant again. There was an interesting article in The New Yorker about it a few months ago.\n\nback cover:\n\nHailed by Time as the &quot;preeminent&quot; writer of his generation in the Soviet Union before he emigrated in 1980, Vassily Aksyonov is one of the most exciting and prodigiously talented novelists anywhere in the world today; and in The Island of Crimea he gives us a richly comic and keenly incisive satire on modern Soviet life and its relation to the West.\n\n&quot;The Island of Crimea is a profoundly political and contemporary statement but with none of the shrillness and compromise with literary quality we have almost come to expect from books of its kind.&quot;\n--New York Times Book Review\n\n&quot;Aksyonov shows the amazing similarity between human beings from the satirist's eternal point of view and his unshakeable faith that people are fools ... deserves to be as popular as Nabokov's Ada&quot;\n--Baltimore Sun\n\n&quot;Aksyonov is a ranking officer, unretired, in the small corps of world-class\nsatirists.&quot;\n--Los Angeles Times Book Review\n\n******\n\nThis is my first upload in a long while. Hope you enjoy it. I hope to be able to post more good books soon.\n\n","torrent":{"xt":"urn:btih:36a6cbd21ce0b98d32bbd552ec5dab1615af183f","amp;dn":"Vassily+Aksyonov+-+The+Island+of+Crimea+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a6cbd21ce0b98d32bbd552ec5dab1615af183f","infoHashBuffer":{"type":"Buffer","data":[54,166,203,210,28,224,185,141,50,187,213,82,236,93,171,22,21,175,24,63]},"announce":[],"urlList":[]}}