{"title":"The Denver Gentlemen - Introducing.. (2007)","uid":7901381,"size":47660139,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:374dde7bb0fb88dc60ec8753fd3a9ceb9b21d558&amp;dn=The+Denver+Gentlemen+-+Introducing..+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1354974488,"description":"The Denver Gentlemen - Introducing.. (2007) mp3\n\n\n\nThis is where it all begins, folks. If you want to talk about the Denver Sound, then you have to begin with The Denver Gentlemen. In its earliest conception, it was made up of Jeffrey-Paul Norlander, David Eugene Edwards, Slim Cessna and Jen-Yves Tola.  Introducing... album by Denver Gentlemen was released Mar 13, 2007 on the Smooch label. A strangely compelling and wholly original melding of Eastern European folk, traditional gospel, country, and baroque jazz. Introducing, was the long-overdue debut from Denver, CO, legends, The Denver Gentlemen. The cd was actually recorded five years prior to its release, and the band was already long deceased by the time Absalom Records uncovered the tracks and issued them in 2001. Obviously worth the wait, Jeffrey-Pauls otherworldly warble, displaying an unnaturally wide vibrato, may take some getting used to, but is ultimately the perfect vehicle for the pervasive strangeness of the albums carnival sounds and religious imagery. Introducing... album alternately swinging and stomping, the loose-limbed clattering of accordion, piano, drums, and brass make for a sound completely without modern parallel. This is the birth of gothic americana.","torrent":{"xt":"urn:btih:374dde7bb0fb88dc60ec8753fd3a9ceb9b21d558","amp;dn":"The+Denver+Gentlemen+-+Introducing..+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"374dde7bb0fb88dc60ec8753fd3a9ceb9b21d558","infoHashBuffer":{"type":"Buffer","data":[55,77,222,123,176,251,136,220,96,236,135,83,253,58,156,235,155,33,213,88]},"announce":[],"urlList":[]}}