{"title":"Lost Planet 2 Retail Launcher-SKIDROW","uid":5880498,"size":7954657,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3840e5cf67f905dc2ec8dc082d0ee87232a484d4&amp;dn=Lost+Planet+2+Retail+Launcher-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HeroMaster","files":-1,"time":1286818603,"description":"Eboy\n \nS  K  i  D  R  O  W\n \n-  T H E  L E A D i N G  F O R C E  -\n \nproudly presents\nLost Planet 2 Retail Launcher\n \nRELEASE DATE : 11-10-2010              PROTECTION : SecuROM  xlive\nGAME TYPE    : Action                  DISKS      : CRACKED UPDATE\n \nRelease Notes:\n \nThe Skid Rowdies are looking new blood to fill up the ranks.\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n \nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible.\n \n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n \nLost Planet 2 Retail Launcher Notes:\n \nHere you have the Retail launcher with language selector and\ncontroller configurator.\n \nOn with the game release information:\n \nLost Planet 2 is the sequel to Lost Planet: Extreme Condition,\nthe landmark third-person shooter which debuted on Xbox 360\nand went on to sell over 2.3 million units worldwide after its\nrelease. Lost Planet 2 offers deeper insight into the world of\nE.D.N III and the uncertain fate of future mankind.\n \nAlready acclaimed for its visual accomplishments from the\nconsole versions, Lost Planet 2 will define the 3D experience\non the PC. Stunning environments will immerse the player in\nNVIDIA Vision Surround technology, and the rebalanced gameplay\nand streamlined control mechanics make Lost Planet 2 PC the\nultimate Lost Planet experience.\n \nA decade has passed since the events of the first game, and\nthe face of E.D.N. III has changed dramatically. Terraforming\nefforts have been successful and the ice has begun to melt,\ngiving way to lush tropical jungles and harsh unforgiving\ndeserts. Mankind has engaged in a civil war to take control of\nthe precious Thermal Energy that powers weapons and vehicles\non E.D.N. III and resulted in a separation into various\nfactions.\n \nPlayers will control heroes from each faction across 6\ninterconnected episodes, viewing the war from the perspective\nof each, creating a truly unique interactive experience. With\nthis concept, players will have the opportunity to engage in\nthe story in a much more dynamic way as plot threads evolve\nfrom different players perspectives.\n \nThe intense and action-packed campaign mode comes with the\nability to form teams of up to 4 players online. Beyond the\ndeep single-player and co-op modes, Lost Planet 2 is loaded\nwith extensive multiplayer modes allowing up to 16 players to\ncompete online, each with their own customizable avatar.\n \nNo action game would be complete without an arsenal of\nweaponry, and Lost Planet 2 has a huge variety of hardware for\nplayers to unleash on unsuspecting enemies. Machine guns,\nshotguns, rocket launchers, lasers, sniper rifles, grenades\nand a host of other weapons are scattered across the game. The\ngrappling hooks that made the gameplay in Lost Planet a true\n3-D experience are back, allowing gamers to gain tactical\nadvantage by moving to elevated locations quickly.\n \nLost Planet 2's biggest weapons come on two legs: the heavily\narmed and armored robotic Vital Suits return in greater\nnumbers and variety than the first game. There are VS that\ntransform into other vehicles, hold up to three players and\nsome that even take multiple players to operate.\n \nCo-op action: Team up to battle the giant Akrid in explosive 4\nplayer online co-operative play. Teamwork is the player's key\nto victory as the team is dependent on each other to succeed\nand survive.\n \nMassive scale of enemies: Players skill on the battlefield and\nability to work as a team will be tested like never before\nagainst the giant Akrid. Players will utilize teamwork\ntactics, new weapons and a variety of vital suits (VS) to\nfight these larger-than-life bosses.\n \nBeautiful massive environments: Capcom's advanced graphics\nengine, MT Framework 2.0, and DirectX 11 support will bring\nthe game to life with the next step in 3D fidelity and\nperformance.  See Lost Planet 2's world through new eyes, with\nsupport for hardware tessellation and compute shader.\n \nDeep level of character customization: Players will have\nhundreds of different ways to customize their look, nom de\nguerre, emotes, and weapons to truly help them define their\ncharacter on the battlefield. A wide array of customizable\nabilities range from taking less damage, to running faster to\noperating data posts quicker\n \nRewards System: Players will receive rewards for assisting\nteammates and contributing to the team's success\n \nMultiplayer: Compete in 16-player multiplayer matches with\nnine different maps and 5 different game modes including\nData Post Battle, Akrid Egg Battle, Fugitive, Elimination and\nTeam Elimination. Additional maps will be available as\ndownloadable content after the game's release.\n \nExciting new VS features- Based on fan feedback, the team has\nimplemented an unbelievable variety of Vital Suits and new\nways to combat VS's. The new VS system will have a powerful\nimpact on the way the player takes to the war zone in Lost\nPlanet 2\n \nInstall Notes:\n \n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on DVD 2 to your\ninstallation directory and overwrite\n5. Play the game\n \nSupport the companies, which software you actually enjoy\n \nInstall Notes:\n \n1. Unpack the included rar files.\n2. Run Darksiders.Update.1.exe and install\n3. Copy the cracked content from SKIDROW directory to your\nmain installation directory and overwrite.\n3. Play the game\n \nAdditional Notes:\n \nWe have noticed that some people had various crashes with our\nnew Installer.exe. These small issues should be corrected now.\nThis updated installer is using the same code as the one we\nused for Civilization V, so everything should be fine now.\n \nIf you didn't have any problems with the installer, then you\ndon't have to do anything.\n \nWe included to options:\n \nOption 1:\n \nAccess the included Installer FIX folder and mount the iso and\ninstall it the game(insert dvd's when asked)\n \nOption 2:\n \nReplace the Installer.exe in the iso with the Installer.exe\nincluded in the Installer FIX folder with this update.\n \nNote from the coder of the Installer:\n \nI'm extremly sorry that this release is required to fix the\ninstaller. But Valve Software was not nice enough to document\nthe sim/sid format. Also if you encouncered the issue that the\npost-install process was looping then you should blame\nMicrosoft, for the work arround I've moved the process to the\ninstallation thread so it won't wait for the message (which\nwas never removed for some unknown reason). In case you still\nhave trouble installing, we added error messages, you don't\nneed to understand them, we are watching so don't worry. The\ninternal error codes should only occour if something is going\n&quot;really&quot; wrong, like you have corrupted files or miss the main\nentry of install .sim.\n \nGreetings:\n \nSalutes to our old Amiga friends from:\n \nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n \nSalutes to our new friends in:\n \nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n \nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by XXX\n\n\nENJOY!","torrent":{"xt":"urn:btih:3840e5cf67f905dc2ec8dc082d0ee87232a484d4","amp;dn":"Lost+Planet+2+Retail+Launcher-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3840e5cf67f905dc2ec8dc082d0ee87232a484d4","infoHashBuffer":{"type":"Buffer","data":[56,64,229,207,103,249,5,220,46,200,220,8,45,14,232,114,50,164,132,212]},"announce":[],"urlList":[]}}