{"title":"Powers (Brian Michael Bendis and Michael Avon Oeming)","uid":4980407,"size":805162738,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3876f042b32f54f085ea56707626ac89dd53a251&amp;dn=Powers+%28Brian+Michael+Bendis+and+Michael+Avon+Oeming%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"brodahisou","files":-1,"time":1246269597,"description":"Powers is set in a world where superpowers are relatively common but not mundane. It follows the lives of two detectives, Christian Walker and Deena Pilgrim, police officers in a Homicide department devoted to cases that involve &quot;powers&quot; (people with superpowers). Walker himself used to be a costumed superhero named Diamond, but became a police officer after he lost his abilities. Though stripped of his powers, he still retains his contacts within the superhero community.\n\nThe first story-arc sees Walker team up with rookie, Deena Pilgrim, to investigate the shocking murder of one of the world`s most popular icons, Retro Girl. As the murder investigation takes them from the seediest underbelly the city has to offer to the gleaming towers that are home to immortal beings, hidden truths about Retro Girl come to light. Walker finds that to solve this crime, he may have to reveal a dark secret.\n\nPowers is a creator-owned comic book series by Brian Michael Bendis (writer) and Michael Avon Oeming (artist). The series' first volume was published by Image Comics (2000 to 2004). Subsequent volumes (beginning in 2004) have been published by Marvel Comics as a part of the Icon imprint.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:3876f042b32f54f085ea56707626ac89dd53a251","amp;dn":"Powers+%28Brian+Michael+Bendis+and+Michael+Avon+Oeming%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3876f042b32f54f085ea56707626ac89dd53a251","infoHashBuffer":{"type":"Buffer","data":[56,118,240,66,179,47,84,240,133,234,86,112,118,38,172,137,221,83,162,81]},"announce":[],"urlList":[]}}