{"title":"Cinematic Titanic - 10 - Danger On Tiki Island","uid":10122178,"size":734482432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:38fb0892e1777e1559bddfcfbd50dc8c70c8bb84&amp;dn=Cinematic+Titanic+-+10+-+Danger+On+Tiki+Island&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nasty_llama","files":1,"time":1399692332,"description":"An atomic bomb test in the South Pacific creates an isolated world of terror.\n\nStrange things are happening on this remote island in the Pacific, where a Peace Corps volunteer, a researcher and his love-starved lady arrive to find that nearby atomic testing has mutated some of the plants. It that weren't bad enough, a monster terrifies the villagers in its lust for blood. The man-beast must be stopped - but how? With sarongs a-plenty, this film was a staple at drive-ins in its day. Now experience it live with Cinematic Titanic.\n &lt;a href=&quot;\nhttp://www.cinematictitanic.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cinematictitanic.com/&lt;/a&gt;\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nCinematic Titanic is a project by Mystery Science Theater 3000 (MST3K) creator and original host, Joel Hodgson. The project involves &quot;riffing&quot; B-movies, in a manner similar to that of MST3K. Joining Hodgson are many of the original MST3K cast, as well as some cast members who joined later in the show's run. These include Trace Beaulieu, J. Elvis Weinstein, Frank Conniff and Mary Jo Pehl. It was first performed live on December 7, 2007 and first aired on December 22, 2007.\n\nOn February 16, 2013, it was announced that the touring portion of Cinematic Titanic was going on an indefinite hiatus. According to an email sent out to members of the site, due to &quot;5 people living in 5 different cities with different lives and projects, it has become increasingly difficult to coordinate our schedules and give Cinematic Titanic the attention it requires to keep growing as a creative enterprise and a business.&quot; The final tour began on September 23, 2013.\n\nLike Mystery Science Theater 3000, the series uses black silhouettes of the riffers placed over the films, but in the case of Cinematic Titanic they sit on both sides of the screen rather than just on the lower right.[7] Visual gags are frequent (such as Beaulieu's use of a cherry picker in The Oozing Skull), and there are two or three host segments per episode, all performed in silhouette.\n\nThe actors essentially play themselves as they participate in an experiment for some unknown (possibly shadowy) corporation or military force. The story currently provided to the cast is that there is a tear in the &quot;electron scaffolding&quot; that threatens all digital media in the world.[8] Their experience doing MST3K is key to the organization's plans. The riffing for each film is recorded to a &quot;nanotated disc&quot; and inserted into a &quot;Time Tube&quot; by Hodgson that descends into the frame at the end of every episode. The unknown organization is very firm on keeping the cast focused on their duties, providing no time frame for completion and requiring them to stay within the facilities at all times. They apparently have massive resources and an autonomous military force, which they use to keep the cast in line. As of now, the cast is inquisitive of the true purpose of the experiments but have no major problems as, aside from having to watch bad movies, they are well-treated.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Cinematic_Titanic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Cinematic_Titanic&lt;/a&gt;","torrent":{"xt":"urn:btih:38fb0892e1777e1559bddfcfbd50dc8c70c8bb84","amp;dn":"Cinematic+Titanic+-+10+-+Danger+On+Tiki+Island","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38fb0892e1777e1559bddfcfbd50dc8c70c8bb84","infoHashBuffer":{"type":"Buffer","data":[56,251,8,146,225,119,126,21,89,189,223,207,189,80,220,140,112,200,187,132]},"announce":[],"urlList":[]}}