{"title":"Austin Sarat - The Killing State. Capital Punishment in Law, Pol","uid":10279608,"size":17194850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3956784022e7f3f0dc39e458a3097dd76ea59365&amp;dn=Austin+Sarat+-+The+Killing+State.+Capital+Punishment+in+Law%2C+Pol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1401676689,"description":"Description\nProduct Details\nBook Title: The Killing State: Capital Punishment in Law, Politics, and Culture\t\nBook Author: Austin Sarat\nPaperback: 288 pages\nPublisher: Oxford University Press (May 24, 2001)\nLanguage: English\nISBN-10: 0195146026\nISBN-13: 978-0195146028\n\n===================================================================================\nBook Description\nPublication Date: May 24, 2001 | ISBN-10: 0195146026 | ISBN-13: 978-0195146028\nOver 7,000 people have been legally executed in the United States this century, and over 3,000 men and women now sit on death rows across the country awaiting the same fate. Since the Supreme Court temporarily halted capital punishment in 1972, the death penalty has returned with a vengeance. Today there appears to be a widespread public consensus in favor of capital punishment and considerable political momentum to ensure that those sentenced to death are actually executed. Yet the death penalty remains troubling and controversial for many people. The Killing State: Capital Punishment in Law, Politics, and Culture explores what it means when the state kills and what it means for citizens to live in a killing state, helping us understand why America clings tenaciously to a punishment that has been abandoned by every other industrialized democracy.\nEdited by a leading figure in socio-legal studies, this book brings together the work of ten scholars, including recognized experts on the death penalty and noted scholars writing about it for the first time. Focused more on theory than on advocacy, these bracing essays open up new questions for scholars and citizens: What is the relationship of the death penalty to the maintenance of political sovereignty? In what ways does the death penalty resemble and enable other forms of law's violence? How is capital punishment portrayed in popular culture? How does capital punishment express the new politics of crime, organize positions in the &quot;culture war,&quot; and affect the structure of American values? This book is a timely examination of a vitally important topic: the impact of state killing on our law, our politics, and our cultural life.\n\n===================================================================================\nEditorial Review\nFrom Booklist\nLarger libraries serving patrons interested in capital punishment and other legal issues will want to consider this collection of critiques of &quot;the killing state&quot;: essays that focus on capital punishment's effect on democracy, the legal system, and U.S. culture. Editor Sarat, an Amherst College professor of jurisprudence and political science, is president of the Law and Society Association; most other contributors are professors of law, philosophy, political science, or anthropology, from nearly a dozen respected universities. Essays on democracy and the death penalty place the ultimate punishment in historical and international perspective. Those on capital punishment's impact on legal values stress the conflict between the law's theoretical openness to additional evidence and execution's irreversibility. The book's last section sees capital punishment as a symbol in our current cultural wars &quot;over the integrity and stability of ideas of free will and responsibility,&quot; and then considers the unarticulated assumptions about the death penalty and the crimes it punishes, in films such as Dead Man Walking and Last Dance. Mary Carroll --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nReview\n&quot;This collection of essays brings us up to date on the vexatious problem of capital punishment.... [It] will keep us thinking well into the next century.&quot;--Bimonthly Review of Law Books\n\n===================================================================================\nAbout the Author\nAustin Sarat is William Nelson Cromwell Professor of Jurisprudence and Political Science at Amherst College. He has written and edited many books and articles on the theory and practice of law, and was recently elected President of the Law and Society Association.\n===================================================================================","torrent":{"xt":"urn:btih:3956784022e7f3f0dc39e458a3097dd76ea59365","amp;dn":"Austin+Sarat+-+The+Killing+State.+Capital+Punishment+in+Law%2C+Pol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3956784022e7f3f0dc39e458a3097dd76ea59365","infoHashBuffer":{"type":"Buffer","data":[57,86,120,64,34,231,243,240,220,57,228,88,163,9,125,215,110,165,147,101]},"announce":[],"urlList":[]}}