{"title":"Paramore-All_We_Know_Is_Falling-(Advance)-2005-RTB [Rock/Alterna","uid":3348659,"size":61551470,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39579ec03d866505b8a4daea056e4234abb64457&amp;dn=Paramore-All_We_Know_Is_Falling-%28Advance%29-2005-RTB+%5BRock%2FAlterna&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"armis","files":13,"time":1119740401,"description":"ARTiST   :  Paramore\nALBUM    :  All We Know is Falling\nLABEL    :  Fueled By Ramen\nGENRE    :  Rock\n\nENCODER  :  Lame 3.90 / APS\nQUALiTY  :  VBRkbps / 44.1kHz / Joint-Stereo\n\nRELEASE  :  Jun-25-2005\nSTREET   :  Jul-26-2005\nSOURCE   :  CDDA\nTYPE     :  Album\nPLAYTIME :  35:52 min\n\n=================\n+ TRACK LiSTiNG +\n=================\n[#] [Track Name]                                      [Time]\n\n01. All We Know                                       03:14\n02. Pressure                                          03:06\n03. Emergency                                         04:00\n04. Brighter                                          03:43\n05. Here We Go Again                                  03:46\n06. Let This Go                                       03:41\n07. Whoa                                              03:22\n08. Conspiracy                                        03:42\n09. Franklin                                          03:19\n10. My Heart                                          03:59\n\n=======================\n+ RELEASE iNFORMATiON +\n=======================\n\nHayley Williams: vocals *John Hembree: bass * Josh Farro: lead\nguitar *\nJason Bynum: guitar * Zac Farro: drums\n\nAll We Know Is Falling, the debut release from Paramore on\nFueled By Ramen, marks the arrival of a truly enthralling new\nrock band. Powered by buoyant melodies and powerful hooks, the\nTennessee-based outfit's debut is made indelible by the\nirresistible force of singer Hayley Williams. The 16-year-old\nvocalist's earnest emotion and strikingly confident range and\nphrasing set Paramore apart from the pack, with the joyous\nnoise of songs such as &quot;My Heart&quot; and &quot;Here We Go Again&quot;\nevincing a passionate positivism that can't help move every\nlistener in its path.\n\nRaised in Meridian, Mississippi, Hayley has been raising her\nvoice for as long as she can remember - singing and writing\nsongs for talent contests and local commercials. At 13, her\nfamily moved to Franklin, Tennessee, where she made friends\nwith two brothers - guitarist Josh and drummer Zac Farro. It\nwasn't long before the two teenaged musicians invited Hayley\nto sing in their fledgling band.\n\nThe Farros helped open up Hayley's musical horizons,\nintroducing the talented young singer to a new world of music,\nfrom classic rock bands such as U2 and the Cure to such modern\noutfits as Sparta and Failure.\n\n&quot;It was all so new for me,&quot; she says. &quot;It really challenged me\nto use my voice in different ways. It was also good for me as\na writer because I realized that lyrics didn't have to be\nsimple pop stuff; they could be harder and deeper.&quot;\n\nThe band, which also now featured Hayley's next door neighbor\nJason Bynum on rhythm guitar, adopted the moniker Paramore and\nstarted performing and recording almost immediately. They\nplayed at local gatherings and their school talent show, then\nquickly began performing at rock venues in and around\nFranklin. The combination of musical energy between brothers,\nJason and Hayley's bold charisma earned them instant\nattention.\n\nParamore concentrated on the next phase of their musical\njourney, spending the summer and early fall in a Nashville\nstudio cutting their first real demos. &quot;It was great,&quot; Hayley\nsays. &quot;We've learned a lot since then. I think we'd probably\ndo a lot of things very differently now. But it was a great\nexperience and I'm grateful we had the opportunity.&quot;\n\nWith many labels anxious to sign them, the band decided to\nrelease their debut album through Fueled By Ramen. Huge fans\nof many of the label's artists like Fall Out Boy and The\nAcademy Is..., Paramore felt there was no better label to\nrelease All We Know Is Falling. &quot;Fueled By Ramen is an amazing\nlabel,&quot; Hayley says. &quot;Some of our favorite bands are on Fueled\nby Ramen. We knew that they would know exactly how to carry\nout the vision for our band and music.&quot;\n\nAfter having seen Paramore perform only once, Fueled By\nRamen's founder John Janick knew he had to sign the band. &quot;I\nseldom find a band that I feel compelled to work with after\njust one encounter&quot; John says. &quot;I knew that I had to put out\nthe Paramore record after I met the band. Their talent,\nsincerity and dedication exceed that of many bands.&quot;\n\nIn March 2005, Paramore temporarily relocated to sunny\nOrlando, Florida for a couple of months. With extensive\ntouring obligations in their immediate future, the band felt\nthey needed to fully hone in on all aspects of their musical\nlife before recording All We Know Is Falling.\n\n&quot;We wanted to get away from the distractions of home and just\npractice, write songs, record and do shows - all the things\nthat a band does,&quot; Hayley says.\n\nJosh adds, &quot;We missed home a lot. But it was awesome to be\nable to wake up and devote ourselves one hundred percent to\nplaying our music.&quot;\n\nWhile in Florida, Paramore began sessions for their\nmuch-anticipated first full-length collection, working with\nproducers James Wisner (Dashboard Confessional, Further Seems\nForever, Underoath) and Mike Green (Yellowcard, The Black\nMaria). The band also enlisted bassist John Hembree to fill in\na deserted position and round out the line-up. They recorded\nnew tracks such as &quot;Emergency&quot; and &quot;Pressure&quot; which display a\nmusical enthusiasm and lyrical depth well beyond the band's\nrelatively young ages. In addition to her open-hearted vocal\nstyle, Williams has worked hard to expose her life and\nemotions in her songs.\n\n&quot;I always try to write from personal experience,&quot; she says.\n&quot;At first what I was writing was kind of metaphorical, but now\nI've been trying to be more straightforward. It's all about\nthings that have happened to me or to the people that I love.&quot;\n\nParamore has won praise for their live performances, which\nhave included dates alongside Less Than Jake, Anberlin and\nCopeland, as well as high profile performances on The Fueled\nBy Ramen &amp; Friends Tour, the Taste of Chaos Tour and the\nBamboozle Festival. With this summer's Vans Warped Tour on the\nhorizon, more enthralled Paramore fans will most certainly\nfollow.\n\nSays Josh, &quot;We love making music together. We have the best\ntime on stage, we feel so alive when we're playing. We're\nexcited to have the world hear our songs and we hope they like\nwhat they hear. We can't wait to get out there more and have\npeople see what this band is all about.&quot;\n\n","torrent":{"xt":"urn:btih:39579ec03d866505b8a4daea056e4234abb64457","amp;dn":"Paramore-All_We_Know_Is_Falling-%28Advance%29-2005-RTB+%5BRock%2FAlterna","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39579ec03d866505b8a4daea056e4234abb64457","infoHashBuffer":{"type":"Buffer","data":[57,87,158,192,61,134,101,5,184,164,218,234,5,110,66,52,171,182,68,87]},"announce":[],"urlList":[]}}