{"title":"Unearthed: Trail of Ibn Battuta 1.3 Android","uid":10302150,"size":1721903593,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:396d624cec83e41121f46dc52dc1da11e3be8e25&amp;dn=Unearthed%3A+Trail+of+Ibn+Battuta+1.3+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":".BONE.","files":-1,"time":1401986616,"description":"Unearthed:Trail of Ibn Battuta v1.3\nRequirements: 4.0 and up\nOverview: As featured in TegraZone, Unearthed is an episodic third person Action Adventure game set in modern day Middle East. The game is available in both Arabic and English voice over and features 21 Languages for Menu and Subtitles.\nImage\n\n* Synopsis:\nWhen fortune hunter Faris Jawad and his sister Dania receive a call to visit Morocco they embark on an exotic adventure throughout the Middle East on the trail of the famous Muslim explorer Ibn Battuta. \n\nThe trail won't be clear however as Faris will have to overcome an unholy alliance of a militia army leader, a weapons dealer and a wealthy antiquities smuggler who are after the same goal. \n\n* Key Features:\nâ—¾Plays Great on NVIDIA SHIELD\nâ—¾Supports Android Controllers and MOGA controllers.\nâ—¾Travel across the Middle East from the wild life of Moroccan Atlas mountains to the alleys of old Damascus through the port of Alexandria and the metropolitan city of Dubai. \n\nâ—¾Unique mix of platforming, melee fighting, shooting and stealth gameplay. \n\nâ—¾Presented in a TV style episodic format along with recaps of previous episodes and teaser cliff hangers of what lies ahead. \n\nâ—¾Unlockable Survival Mode: Battle against endless waves of enemies (Mummies, Zombies, Ghouls) across varied maps with leaderboards support.\n\nâ—¾Unlockable Extras: Concept Art, Renders, Animatics, Cutscenes, Character Gallery and Treasures. \n\nâ—¾Available in 21 languages for menussubtitles. Voice-over in Arabic and English.\n\n* Gold Edition Features:\nThis Gold Edition contains over 120 fixes to the console version based on the reviews and player feedback, they are summarized as below: \n\nâ—¾ General: A restructured tutorial level to better introduce the game mechanics, No more colliding with ragdolls and small objects such as broken pot pieces which allows for easier movement, invisible walls to prevent falling from high surfaces, clear font size for hints and facts in the loading screens, re-recorded all the Arabic voiceover to remove the extra echo. \n\nâ—¾Hand to Hand Combat: Fully revamped hand to hand fighting system with brand new animations, full camera orbit control, more fluid response and streamlined special moves . \n\nâ—¾Shooting System: Re-balanced all the weapons to allow for weapon specific range, accuracy, reverb zones, recoil, auto, semi-auto and manual targeting, and brand new weapon SFX. \n\nâ—¾Driving System: Improved car handling, no more flipping when turning at very high speeds, orbit camera, Better driving enemy AI, Tire tracks, Full Physical Damage Model for the player car with smoke, sparks on colliding with other cars, props and buildings.\n\n* Notes:\n- Minimum requirement is Dual-Core processors, 1 GB of RAM, 1.7 GB of free space.\n- Tested on NVidia Shield, Galaxy S4 and Note 3.\n\nThis app has no advertisements\n","torrent":{"xt":"urn:btih:396d624cec83e41121f46dc52dc1da11e3be8e25","amp;dn":"Unearthed%3A+Trail+of+Ibn+Battuta+1.3+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396d624cec83e41121f46dc52dc1da11e3be8e25","infoHashBuffer":{"type":"Buffer","data":[57,109,98,76,236,131,228,17,33,244,109,197,45,193,218,17,227,190,142,37]},"announce":[],"urlList":[]}}