{"title":"Lagrimas del sol.DVDRIP.(spanish).","uid":5951672,"size":734380032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:398a1fa3845569dda045ec8953070b5ebf7cab70&amp;dn=Lagrimas+del+sol.DVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zurera","files":-1,"time":1289551487,"description":"DirecciÃƒÂ³n: Antoine Fuqua.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2003.\nDuraciÃƒÂ³n: 121 min.\nInterpretaciÃƒÂ³n: Bruce Willis (Teniente A.K. Waters), Monica Bellucci (Dr. Lena Kendricks), Cole Hauser (James &quot;Red&quot; Atkins), Tom Skerrit (CapitÃƒÂ¡n Bill Rhodes), Eamonn Walker (Ellis &quot;Zee&quot;, Pettigrew), Nick Chinlund (Michael &quot;Slo&quot; Slowenski), Fionnula Flanagan (Enfermera Grace), Malick Bowens (Coronel Idris Sadick), Johnny Messner (Kelly Lake), Paul Francis (Danny &quot;Doc&quot; Kelley).\nGuiÃƒÂ³n: Alex Lasker y Patrick Cirillo.\nProducciÃƒÂ³n: Michael Lobell, Arnold Rifkin e Ian Bryce.\nMÃƒÂºsica: Hans Zimmer.\nFotografÃƒÂ­a: Mauro Fiore.\nMontaje: Conrad Buff.\nDiseÃƒÂ±o de producciÃƒÂ³n: Naomi Shohan.\nDirecciÃƒÂ³n artÃƒÂ­stica: David Lazan.\nVestuario: Marlene Stewart.\nEstreno en USA: 7 Marzo 2003.\nEstreno en EspaÃƒÂ±a: 21 Noviembre 2003.\n\n\nSINOPSIS\n\nEl Teniente de las Fuerzas Especiales de los Navy Seal A.K. Waters (Bruce Willis) y su es-cuadrÃƒÂ³n de ÃƒÂ©lite de especialistas tÃƒÂ¡cticos es obligado a elegir entre el deber y la humani-dad, entre seguir las ÃƒÂ³rdenes ignorando el con-flicto que los rodea, o encontrar el valor para seguir su criterio y proteger a un grupo de refugiados inocentes. Cuando el gobierno democrÃƒÂ¡tico de Nigeria es derrocado y el paÃƒÂ­s cae en manos de un cruel dictador militar, Waters y su equipo son asignados a una mi-siÃƒÂ³n de rutina para rescatar a la Doctora Lena Kendricks (Monica Bellucci). La Doctora Kendricks, ciudadana americana debido a su matrimonio, se dedica a atender a las vÃƒÂ­ctimas de la guerra civil que se estÃƒÂ¡ produciendo, en una misiÃƒÂ³n catÃƒÂ³lica de un poblado lejano. Cuando llega Waters, la Doctora Kendricks se niega a marcharse a menos que ÃƒÂ©l se comprometa a ayudar a trasladar a los lugareÃƒÂ±os a la frontera cercana, donde gozarÃƒÂ¡n de asilo polÃƒÂ­tico. Si los aban-donan, quedarÃƒÂ¡n a merced del enorme ejÃƒÂ©rcito rebelde. Waters tie-ne ÃƒÂ³rdenes estrictas de su oficial en jefe, el capitÃƒÂ¡n Bill Rhodes (Tom Skerritt) de mantenerse al margen del conflicto. Pero cuando ÃƒÂ©l y sus hombres comprueban de primera mano la brutalidad de los rebeldes, acogen la causa de la Doctora Kendricks y ponen sus vi-das en peligro escoltando a los habitantes del poblado en una peli-grosa marcha a travÃƒÂ©s de la densa jungla.\n","torrent":{"xt":"urn:btih:398a1fa3845569dda045ec8953070b5ebf7cab70","amp;dn":"Lagrimas+del+sol.DVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"398a1fa3845569dda045ec8953070b5ebf7cab70","infoHashBuffer":{"type":"Buffer","data":[57,138,31,163,132,85,105,221,160,69,236,137,83,7,11,94,191,124,171,112]},"announce":[],"urlList":[]}}