{"title":"Clare Bowditch - The Moon Looked On [2007]","uid":5686719,"size":70831125,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39cd26e6e546ea427e5225ae09f1b5d7398a9a31&amp;dn=Clare+Bowditch+-+The+Moon+Looked+On+%5B2007%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratetorrent1989","files":23,"time":1278945347,"description":"Clare Bowditch (born 1975) is an Australian musician from Melbourne, Victoria, and is set to release her forth album Modern Day Addiction via Island Records on the 13th of August, 2010.\n\nShe is best known as a heart-felt song-writer, for her satirical on-stage antics, and for the Open Letters section on her website in which she chronicled her early career as it happened. Most recently, she wrote an article for ABC's The Drum entitled &quot;Mr Jones and Me&quot;, and also made her debut on the ABC's Q and A, as the first panelist to also perform a song (&quot;Bigger Than the Money&quot;).\n\nHaving performed on the Melbourne pub circuit since she was seventeen years old, first with Quarter Acre Dream and then with Red Raku (they recorded two albums), Bowditch first came to prominence in 2005 with the release of her second album What Was Left, which received excellent critical reviews, and high rotation airplay on national radio stations such as Triple J, although her success can be largely credited to the strong support of local independent radio stations throughout Australia, who championed her early work. She won the Best Female Artist award at the 2006 ARIAs, and was runner up in the International Songwriting Competition (2008) in the singer/songwriter category for her song Peccadilloes. She is currently Yen Magazine's &quot;Young Woman of the Year&quot;(Music).\n\nBowditch and her partner/drummer Marty Brown, have been touring continuously in Australia and more recently in Europe since 2003. Much of this touring Bowditch has been accompanied by her band The Feeding Set, who are said to be on hiatus for Bowditch's next album. On stage, Bowditch is known best for the beauty of her songs but also for her satirical on-stage humour, and unconventional use of everyday objects (tea-pots, bottles, old casiotone) for sound-effects.\n\nClare Bowditch and her band The New Slang have now completed the recording of their forth album, Modern Day Addiction.\n\nThe album was party recorded with producer Mocky (Feist, Gonzales, Jamie Lidell, Peaches) at the legendary Hansa studios in Berlin. This album marks a decided change in direction for Bowditch, having been written on casio and piano. In October 2009 she released her first single, &quot;The Start of War&quot;, from the (as yet untitled) forthcoming album. The song was co-produced by Bowditch, her partner Marty Brown and the legendary Mick Harvey (Nick Cave and the Bad Seeds).\n\nBowditch recently signed a licensing agreement with Island Records Australia, after three years with EMI.","torrent":{"xt":"urn:btih:39cd26e6e546ea427e5225ae09f1b5d7398a9a31","amp;dn":"Clare+Bowditch+-+The+Moon+Looked+On+%5B2007%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39cd26e6e546ea427e5225ae09f1b5d7398a9a31","infoHashBuffer":{"type":"Buffer","data":[57,205,38,230,229,70,234,66,126,82,37,174,9,241,181,215,57,138,154,49]},"announce":[],"urlList":[]}}