{"title":"Standup Comedy - Joey Diaz - It's Either You or The Priest [201","uid":7028680,"size":117868836,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39d28c19b292108ee0503c5a3c0fdb92a6bb99c6&amp;dn=Standup+Comedy+-+Joey+Diaz+-+It%5C%27s+Either+You+or+The+Priest+%5B201&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rambam1776","files":-1,"time":1329156032,"description":"192 kbps CBR\n\n \n\n1. Christmas Time\n\n2. Zumba\n\n3.Ponte Corvo Deli\n\n4.Being Healthy\n\n5.EDD\n\n6. That Aint No Blow Job Dog\n\n7. I Get Emotional\n\n8. Evolution of Becoming a Man\n\n9. Losing Weight\n\n10. 1040 Club\n\n11. Bonus Track\n &lt;a href=&quot;\nhttp://bayimg.com/eaMmHAadj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eaMmHAadj&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Joey_Diaz&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Joey_Diaz&lt;/a&gt;\n\nDiaz left North Bergen for the University of Colorado at Boulder on June 1, 1985, but his academic life was interrupted when he was arrested for kidnapping and aggravated robbery, for which he served time in prison. His standup comedy career began in prison, where he gained popularity by improvising material in front of Thursday night Movie Night audiences after the projector malfunctioned.\n\nAfter he was released from prison, Diaz moved to Los Angeles, where he began performing in front of open mike audiences. After his career spread to other venues, he accepted an offer from a CBS talent scout to work on a television pilot. Although the series was not purchased, the visibility it gave him helped his career, garnering him appearances in Law &amp; Order and in films like Spider-Man 2. and the 2004 film Taxi. His most visible role was in the 2005 film The Longest Yard[1][2] and as a prison convict named Joey the Candy Bar Criminal, a part he played in four 2007 episodes of My Name is Earl, and which he obtained on the basis of his own past in prison. That same year he also appeared as &quot;Joey Karate&quot;, doing humorous promotions for the Ultimate Fighting Challenge in California, clips of which can be found on YouTube.\n\nHis subsequent roles include the 2009 TV movie The Dog Who Saved Christmas, and 2011 appearances in &quot;Scarlet Ribbons&quot;, an episode of The Mentalist and the film Bucky Larson: Born to Be a Star.\n\nDiaz is also a frequent guest on The Joe Rogan Experience podcast, and currently co-hosts a weekly podcast with Felicia Michaels named Beauty and Da Beast.\n\nIn 2010, Diaz made an appearance with Rogan on the radio program of Alex Jones.","torrent":{"xt":"urn:btih:39d28c19b292108ee0503c5a3c0fdb92a6bb99c6","amp;dn":"Standup+Comedy+-+Joey+Diaz+-+It%5C%27s+Either+You+or+The+Priest+%5B201","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39d28c19b292108ee0503c5a3c0fdb92a6bb99c6","infoHashBuffer":{"type":"Buffer","data":[57,210,140,25,178,146,16,142,224,80,60,90,60,15,219,146,166,187,153,198]},"announce":[],"urlList":[]}}