{"title":"Best Coast - Fade Away (2013) [FLAC]","uid":9081812,"size":190848038,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:39ebeee6d62ab4176987a6cc7f75128eb0fd13b9&amp;dn=Best+Coast+-+Fade+Away+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1382395343,"description":"\n  Best Coast - Fade Away (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Indie Pop\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16 \n  Sampling Rate: 44,100 Hz\n\n  01 This Lonely Morning \n  02 I Wanna Know \n  03 Who Have I Become? \n  04 Fear of My Identity\n  05 Fade Away \n  06 Baby I'm Crying \n  07 I Don't Know How\n\n  After the release of 2012's The Only Place, Best Coast parted ways with their label, Mexican Summer, and Bethany Cosentino started her own label, Jewel City, to release the Fade Away EP. That is basically the only thing that's changed in the Best Coast camp. The sound is slick and punchy, the songs are straightforward and hooky, and Cosentino's lyrics are slightly awkward but kind of endearingly so. The first two tracks sound the way Blondie would sound in 2013 if they were stoned all the time and saw the sun occasionally, especially the super-catchy &quot;This Lonely Morning,&quot; and the rest of the album splits the difference between the Ramones' poppier moments and a slightly less creepily deranged Hole circa Celebrity Skin (especially on the powerful title track). Business as usual, in other words, but business slightly better than on The Only Place. The absence of Jon Brion behind the desk means there are fewer little musical tricks to distract from the songs and a tighter, leaner sound overall. The EP format also serves the band well, since it ends right about the same time the average person's tolerance for Cosentino's endlessly introspective lyrics abruptly gives out. Sequencing the similarly navel-gazing &quot;Who Have I Become&quot; and &quot;Fear of My Identity&quot; next to each other doesn't help that particular problem much. Neither does the Mazzy Star-influenced &quot;Baby I'm Crying,&quot; which misses the melancholy target they were so very obviously aiming for and lands squarely on tedious instead. It's too bad the EP is saddled with a couple duds, because when it clicks and the music, words, and playing all get it right, one is reminded of the energy and fun that made the band worth checking out in the beginning.","torrent":{"xt":"urn:btih:39ebeee6d62ab4176987a6cc7f75128eb0fd13b9","amp;dn":"Best+Coast+-+Fade+Away+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39ebeee6d62ab4176987a6cc7f75128eb0fd13b9","infoHashBuffer":{"type":"Buffer","data":[57,235,238,230,214,42,180,23,105,135,166,204,127,117,18,142,176,253,19,185]},"announce":[],"urlList":[]}}