{"title":"ARM Assembly Language: Fundamentals and Techniques - Hohl","uid":9365963,"size":206300384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a4abc6ac17963fa27dd03130307d6246cb82bac&amp;dn=ARM+Assembly+Language%3A+Fundamentals+and+Techniques+-+Hohl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"brazerok","files":-1,"time":1387412871,"description":"ARM Assembly Language: Fundamentals and Techniques by William Hohl\n\nISBN: 1439806101 / 9781439806104\nPublisher: CRC Press (2009)\n\nScanned B/W PDF, 350 pgs, 196MB. Searchable.\n\n\n\nWritten by the director of ARM's worldwide academic program, this volume gives computer science professionals and students an edge, regardless of their preferred coding language. For those with some basic background in digital logic and high-level programming, the book examines code relevant to hardware and peripherals found on today's microcontrollers and looks at situations all programmers will eventually encounter.\n\nThe book's carefully chosen examples teach easily transferrable skills that will help readers optimize routines and significantly streamline coding, especially in the embedded space.\n\nThis book is easily adaptable for classroom use. Instructors can access features that include a solutions manual, assembly language basics, problems, and actual code. The book also provides access to a fully functional evaluation version of the RealView Microcontroller Development Kit from Keil.\n\nWhile it is still an important skill, getting good instruction in assembly language is not easy. The availability of languages such as C and Java foster the belief that engineers and programmers need only address problems at the highest levels of a program's operation. Yet, even modern coding methods, when done well, require an understanding of basic assembly methods such as those gained by learning ARM. Certain features that are the product of today's hardware, such as coprocessors or saturated math operations, can be accessed only through the hardware's native instructions. For that matter, any programmer wishing to achieve results as exact as his or her intentions needs to possess a mastery of machine code basics as taught in the pages of this book.\n\nOf the 13 billion microprocessor-based chips shipped in the last year, nearly 3 billion were ARM-based, making operational knowledge of ARM an essential component of any programmer's tool kit. That it can be applied with most any language makes it invaluable.","torrent":{"xt":"urn:btih:3a4abc6ac17963fa27dd03130307d6246cb82bac","amp;dn":"ARM+Assembly+Language%3A+Fundamentals+and+Techniques+-+Hohl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4abc6ac17963fa27dd03130307d6246cb82bac","infoHashBuffer":{"type":"Buffer","data":[58,74,188,106,193,121,99,250,39,221,3,19,3,7,214,36,108,184,43,172]},"announce":[],"urlList":[]}}