{"title":"PSP Custom firmware - Pro-B9","uid":7938742,"size":33539541,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:3ab6f3f32eb2b828f79eff3a912c9e0033ddfdbe&amp;dn=PSP+Custom+firmware+-+Pro-B9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheMrHugoHappy","files":1,"time":1355929074,"description":"This is the best PSP custom firmware: Pro-B9\nPro-B10 is actually the latest, but some errors have been reported.\nI'm using Pro-B9 for a long time now, and every ISO game I have works like a charm.\n\nAfter downloading the .ZIP file, extract.\n\nYou'll see a folder named &quot;Pro-B9 Upgrade&quot;.\n\nInside that folder, there are 3 other folders, namely &quot;6.60 Upgrade&quot;, &quot;FastRecovery&quot;, and &quot;PROUPDATE&quot;.\n\nPlug-in your PSP, and transfer these folders over in the GAME folder in your PSP.\n\nNow, on your PSP, you'll need first to upgrade to official firmware 6.60 in order to install Pro-B9.\n\nStart the 6.60 official firmware installation on your PSP, making sure that your battery is at least 75% charged. Wait for it to finish, then your PSP should restart with 6.60 official firmware installed.\n\nNow, start PROUPDATE. It should ask you what you want to do. Press the corresponding button to start the installation. The installation is very quick.\n\nCongratulations, you're now running Pro-B9 custom firmware on your PSP! You can now delete both updates data from your memory stick.\n\n\n\nWhat is Fast Recovery for?\nWhen you start your PSP after having shutting it down(not standby), you're back on official firmware 6.60. Fast Recovery let's you re-enable the custom firmware. So do not delete fast recovery from your memory stick.\n\nPlease comment, and tell me what you think about this torrent because this is only my 2nd one. Please check out my other torrent: http://thepiratebay.se/torrent/7894306/Beatbox_Videos_-_Large_Collection(100_)","torrent":{"xt":"urn:btih:3ab6f3f32eb2b828f79eff3a912c9e0033ddfdbe","amp;dn":"PSP+Custom+firmware+-+Pro-B9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ab6f3f32eb2b828f79eff3a912c9e0033ddfdbe","infoHashBuffer":{"type":"Buffer","data":[58,182,243,243,46,178,184,40,247,158,255,58,145,44,158,0,51,221,253,190]},"announce":[],"urlList":[]}}