{"title":"CyberLink ColorDirector Ultra 4.0.4627.0 Multilingual-=TEAM OS=-","uid":12778678,"size":152838669,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3ae108748a5265e1c59b7ffe70db5a3a9838ab00&amp;dn=CyberLink+ColorDirector+Ultra+4.0.4627.0+Multilingual-%3DTEAM+OS%3D-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"OnlyByTheRain","files":2,"time":1447770938,"description":"[b]CyberLink ColorDirector Ultra 4.0.4627.0 Multilingual[/b]\r\n\r\n[img]https://dump.bz/storage-1/0915/D4wHOh9C1AyUZTA8bq6lqsSP9emOvIg9.jpg[/img]\r\n\r\n[b]Professional Color Grading for Video. Color grading is an essential tool for making impressions, telling stories, and evoking responses from your video viewers. ColorDirector offers creative video-makers of all skill levels, the means to dramatically improve their projects through use of tools to control color and lighting.\r\n\r\nApply HDR to Video\r\nApply HDR to your videos to add more dynamic range to your scenes, bring out the detail and highlight the best parts of your footage.\r\n\r\nSplit Toning for Video\r\nSplit toning is an old photography technique that is now a more recent (and very effective) addition to the video editor’s toolkit.\r\n\r\nRegional and Global Blur\r\n- Draw attention to a particular object or person in your video\r\n- Adjust the depth of field in a photo. Keep only a small portion of the image in focus while taking the rest of it out of focus.\r\n\r\nAdd Vignettes with Radial Gradient Masks\r\nThe quickest way to draw your viewers attention to the focal point in your footage is by creating a vignette effect around that object or person.\r\n\r\nIntelligent Motion Tracking\r\n- Intelligent motion tracking algorithm makes frame-by-frame object tracking a breeze\r\n- Precision selection masks let you select, isolate and track multiple objects and accurately track their movements, and change or enhance their color\r\n\r\nPopular Film-Style Grades\r\nColorDirector comes with a range of built-in, professionally designed presets that emulate the styles of well-known films. You can also save any manual adjustments you make to a video as a preset and use it again on future projects.\r\n\r\nVideo Tinting\r\n- Tint Filter makes it easy to change the mood of your video\r\n- Apply different color filters to make your video feel more atmospheric, romantic or even dark and dangerous\r\n\r\nEasy Color Replacement\r\nSelect any color in a video and replace it with another using the eye-dropper tool\r\n\r\nModify Contrast &amp; Tint with RGB Tonal Curves\r\nManually setting the tonal values of the shadows, midtones, and highlights in a video is a great way to achieve exactly the look you’re after.\r\n\r\nLook-up Table (LUT) Conversion\r\n- LUTs are useful for matching footage from one source to another\r\n- ColorDirector supports .3dl, .mga, .m3d, .cube and .csp format LUT files\r\n\r\nPopular Format Support incl. H.265 (HEVC) and XAVC-S\r\nImport a wide range of popular formats for recorded video, including MP4, WMV, FLV, AVI, MPEG-2, AVCHD, ultra high def 4K files, next-gen H.265 video and now the popular XAVC-S format.\r\n\r\nImport &amp; Export High Frame Rate (120/240fps) Video\r\nIt's now easier to perform professional color grading on your action camera videos with support to import 120/240fps slow motion footage from your iPhone, GoPro or other popular action sports cameras.\r\n\r\n64-bit Engine with TrueVelocity 5 Technology\r\nColorDirector offers native 64-bit support and the award-winning TrueVelocity editing engine for improved system efficiency and faster loading of HD video footage.\r\n\r\nAutomatic Scene Detection\r\nColorDirector detects the individual scenes contained within footage, separates them into multiple clips then adds them to the storyboard panel like any other video file.\r\n\r\nOperating System:\r\n- Microsoft Windows 10, 8/8.1, 7, Vista (32bit/ 64bit)\r\n\r\nWhat's new in CyberLink ColorDirector Ultra 4:\r\n- Regional and Global Blur (New)\r\n- Add Vignettes with Radial Gradient Masks (New)\r\n- Popular Format Support incl. H.265 (HEVC) and XAVC-S (New)\r\n- Import &amp; Export High Frame Rate (120/240fps) Video (New)[/b]","torrent":{"xt":"urn:btih:3ae108748a5265e1c59b7ffe70db5a3a9838ab00","amp;dn":"CyberLink+ColorDirector+Ultra+4.0.4627.0+Multilingual-%3DTEAM+OS%3D-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae108748a5265e1c59b7ffe70db5a3a9838ab00","infoHashBuffer":{"type":"Buffer","data":[58,225,8,116,138,82,101,225,197,155,127,254,112,219,90,58,152,56,171,0]},"announce":[],"urlList":[]}}