{"title":"Clifford D. Simak - The Goblin Reservation","uid":13415369,"size":90133079,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b047070c16a04f931285998c6dfd64f52447516&amp;dn=Clifford+D.+Simak+-+The+Goblin+Reservation&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":3,"time":1454486156,"description":"The hunt for his killer leads a dead professor of supernatural phenomena into the perilous intrigues of aliens, fairy folk, and time travelers in this classic of science fiction.\r\n\r\nUntil the day he was murdered, Professor Peter Maxwell was a respected faculty member of the College of Supernatural Phenomena. Imagine his chagrin when he turns up at a Wisconsin matter transmission station several weeks later and discovers he's not only dead but unemployed. During an interstellar mission to investigate rumors of dragon activity, this alternate Maxwell is intercepted by a strange alien race that wants him to carry knowledge of a remarkable technology back to Earth, and it seems someone does not want the information shared. Suddenly, it's essential for Maxwell to find his own killer. He enlists the aid of Carol Hampton of the Time College, along with her pet saber-toothed tiger, a ghost with memory issues, and the intelligent Neanderthal man recently rescued from a prehistoric cooking pot. But the search is pointing them toward the goblins, fairies, and assorted Little Folk living in reservations on campus and into the dangerous heart of an interspecies blood feud that has been raging for millions of years.\r\n\r\nAn enthrallingly brilliant amalgam of science fiction, adventure, fairy tale fantasy, and murder mystery, The Goblin Reservation has long been a favorite of Clifford D. Simak fans and serious science fiction aficionados in general. Ingeniously inventive and unabashedly tongue-in-cheek - combining teleportation, time travel, and alien contact with dinosaurs, trolls, and William Shakespeare - this magnificent literary mélange is a bravura demonstration of a multiaward-winning fantasy and science fiction master operating at the imaginative peak of his considerable powers.\r\n\r\n\r\n\r\n\r\n\r\nNarrated by: Bernard Setaro Clark\r\nFormat: MP3\r\nBitrate: 32 Kbps\r\nLength: 6 hrs and 15 mins\r\nUnabridged Audiobook\r\nRelease Date:01-26-16\r\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:3b047070c16a04f931285998c6dfd64f52447516","amp;dn":"Clifford+D.+Simak+-+The+Goblin+Reservation","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b047070c16a04f931285998c6dfd64f52447516","infoHashBuffer":{"type":"Buffer","data":[59,4,112,112,193,106,4,249,49,40,89,152,198,223,214,79,82,68,117,22]},"announce":[],"urlList":[]}}