{"title":"The Ancient X Files - The Philosoper's Stone &amp; The Lost Ark","uid":6063061,"size":734582784,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3b29748baa624cd23094e5d9857bacb335fb4c1c&amp;dn=The+Ancient+X+Files+-+The+Philosoper%5C%27s+Stone+%26+The+Lost+Ark&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Lucy1948","files":1,"time":1293204985,"description":"Ancient X Files travels around the world to solve some intriguing riddles. Each story is a piece of detective work by an expert trying to make sense of some puzzling ancient artefact, to find the truth behind some extraordinary legend, to discover the origins of a bizarre myth or to establish the authenticity of a venerated religious relic. This series explores the bits of archaeology and history which seem to defy explanation.\n\nOur experts are following chains of clues and putting theories to the test, in an effort to explain the unexplained. Ancient X Files investigates claims about the whereabouts of the lost Ark of the Covenant; attempts to establish the authenticity of a cup some believe to be the Holy Grail; tries to de-code the mysterious Phaistos disk; investigates a cloth which is believed to carry traces of the DNA of Jesus Christ; and deciphers an encrypted book of alchemy written by the great Sir Isaac Newton.\n\n\n3) The Philosopher's Stone and the Lost Ark\nExamining the medieval myth of the Philosopher's Stone, a Holy Grail-type relic which supposedly held the key to alchemy and immortality. Many noted alchemists and adventurers searched obsessively for the artefact hoping to learn its powerful secrets, a quest which allegedly drove some to madness and others to celestial encounters. \n\nIt's one of the most coveted artefacts of the Bible: a gold-encrusted chest containing the Ten Commandments. Can modern scholarship explain the awful powers of the Ark of the Covenant and tell us how it vanished and where it is today?\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3b29748baa624cd23094e5d9857bacb335fb4c1c","amp;dn":"The+Ancient+X+Files+-+The+Philosoper%5C%27s+Stone+%26+The+Lost+Ark","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b29748baa624cd23094e5d9857bacb335fb4c1c","infoHashBuffer":{"type":"Buffer","data":[59,41,116,139,170,98,76,210,48,148,229,217,133,123,172,179,53,251,76,28]},"announce":[],"urlList":[]}}