{"title":"Amy Sedaris - I Like You: Hospitality Under the Influence","uid":10937800,"size":47108511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bbff0556a2eee19e4d6f7cfa0158a1e53eeea65&amp;dn=Amy+Sedaris+-+I+Like+You%3A+Hospitality+Under+the+Influence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Milkman","files":1,"time":1409452117,"description":"ISBN-13: 9780446545112\nPublisher: Grand Central Publishing\nPublication Date: October 22nd, 2008\nLanguage: English\n\nIn .epub format\n_____________________________________________\n&quot;Sedaris's sidesplitting guide to throwing parties hopes to return readers to the times when the word entertainment was &quot;charmingly old-fashioned, like courtship or back alley abortions.&quot; While her tongue is firmly in cheek, novice party-planners will actually find some helpful hints along the way as Sedaris offers instructions and real recipes. Her tips run the gamut from how to properly freeze meatballs (freeze them on a cookie sheet before putting them into a freezer bag so they won't stick together) and deal with the inebriated (&quot;Better to cut them off rather than pretend it's not happening and then allow them to stay over and wet your bed&quot;). She's a generous but crafty hostess (&quot;A good trick is to fill your medicine cabinet with marbles. Nothing announces a nosey guest better than an avalanche of marbles hitting a porcelain sink&quot;). Etiquette pointers include inappropriate introductions (&quot;This is Barbara, she can't have children&quot;) and things to avoid saying to the grieving (&quot;Did she smoke?&quot; &quot;Was he drinking?&quot; &quot;Where were you when this happened?&quot;). Her advice is both practical and hilarious; her instructions on removing vomit stains ends with &quot;or just toss it, chances are you've stained it before.&quot; Sedaris's first solo effort (after Wigfield with her Strangers with Candy co-stars, as well as several plays with her brother, David) is an outrageous and deadpan delight, greatly enhanced by her deliriously kitschy illustrations and photos.&quot;\n-Publishers Weekly (July 17, 2006)","torrent":{"xt":"urn:btih:3bbff0556a2eee19e4d6f7cfa0158a1e53eeea65","amp;dn":"Amy+Sedaris+-+I+Like+You%3A+Hospitality+Under+the+Influence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bbff0556a2eee19e4d6f7cfa0158a1e53eeea65","infoHashBuffer":{"type":"Buffer","data":[59,191,240,85,106,46,238,25,228,214,247,207,160,21,138,30,83,238,234,101]},"announce":[],"urlList":[]}}