{"title":"Christine McVie - Christine Perfect 1970 (Ex Member of Chicken S","uid":4826288,"size":36244820,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c7a0f88d8af159efaa66c469b4901d41370e48a&amp;dn=Christine+McVie+-+Christine+Perfect+1970+%28Ex+Member+of+Chicken+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":15,"time":1238957670,"description":"Christine McVie - Christine Perfect 1970 (Ex Member of Chicken Shack / Fleetwood Mac)\nMp3 128 mbit/s\nIncluded: Covers and this Info\n\nChristine McVie (born Christine Anne Perfect, 12 July 1943, near Greenodd, Cumbria) is an English rock singer, keyboardist, and songwriter. Her primary fame came as a member of the British/American rock band Fleetwood Mac though she has also released three solo albums. McVie has a contralto vocal range. Read more on: &lt;a href=&quot; http://en.wikipedia.org/wiki/Christine_Perfect&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Christine_Perfect&lt;/a&gt;\n\nChristine Perfect (album)\nChristine Perfect is the self-titled debut album of the music artist of the same name (Perfect being the maiden name of the future Christine McVie.). It was released just after she left Chicken Shack but before she joined Fleetwood Mac. The album contained the hit single &quot;I'd Rather Go Blind&quot; from Christine's days with Chicken Shack. The album was re-released in 1976 as &quot;The Legendary Christine Perfect album&quot;.\n\nAll Music Guide Review\nIn 1976, Sire Records issued the first U.S. release of what was a mega-import of the Blue Horizon 1970 U.K. release, an album called simply Christine Perfect, the maiden name of Christine McVie. You don't need a crystal ball to tell you the album is classic and tremendous -- the big surprise is that it didn't go multi-platinum in this country. Record executive Seymour Stein's liner notes are excellent, Stein having worked at Billboard magazine before becoming the industry legend; indeed, it takes a record man like Stein to actually give the fans hardcore facts not usually found in essays that decorate the backs of album covers. There are 12 tracks, and the liner notes declare &quot;I'd Rather Go Blind&quot; went Top Ten in the U.K. It deserved to, but there's more here than the very good reading of the Etta James hit that &quot;I'd Rather Go Blind&quot; was. &quot;When You Say&quot; has strings and production that sound hauntingly like a Marianne Faithful track on London or Nico's work on Immediate. The big difference is that, by the time this album was released in America, Christine McVie was pretty much a household name. It doesn't sound like Fleetwood Mac but, surprise of surprises, John McVie and Danny Kirwan of the Mac are performng on that tune. &quot;Wait and See&quot; is a real treasure, while &quot;And That's Saying a Lot&quot; is such a shift in mood that it starts to sink in what a complex and complete recording this is. The listener really has to stand back from McVie's fame and just hear the music for what it is, a superb presentation by a commercial voice with solid backup. &quot;No Road Is the Right Road&quot; changes the vibe again, and maybe that's a result of the array of talent, from Chicken Shack (her original band), to Yardbirds guitarist Top Topham, to Rick Hayward (later of Savoy Brown). As for the arrangements, Terry Noonan, John Bennett, and Derek Wadsworth all lend their talents. &quot;For You&quot; is neo-rockabilly with that Dave Edmunds sound from &quot;I Hear You Knocking,&quot; but try on &quot;I'm Too Far Gone (To Turn Around)&quot; -- what a stunner -- Fleetwood Mac performing a '50s-style ballad. This could have been such a huge hit when Fleetwood Mac started to flounder a bit after all the dysfunction -- dipping into the bag of old tricks would have been a neat ploy for radio play. With all the attention on her major band, too many copies of this Sire release ended up in cutout bins. What a sin, as there is much more to The Legendary Christine Perfect Album than just hype. From liner notes to cover photos, and the phenomenal sounds within, when fans of Fleetwood Mac need a fix for their obsession, this is the album to pull out and play. ~ Joe Viglione, All Music Guide\n\nTracklist:\n01. &quot;Crazy About You Baby&quot; (Williamson)\n02. &quot;I'm on My Way&quot; (Robey)\n03. &quot;Let Me Go (Leave Me Alone)&quot; (McVie)\n04. &quot;Wait and See&quot; (McVie)\n05. &quot;Close to Me&quot; (McVie, Haywood)\n06. &quot;I'd Rather Go Blind&quot; (Jordan, Foster)\n07. &quot;When You Say&quot; (Kirwan)\n08. &quot;And That's Saying a Lot&quot; (Jackson, Godfrey)\n09. &quot;No Road Is the Right Road&quot; (McVie)\n10. &quot;For You&quot; (McVie)\n11. &quot;I'm Too Far Gone (To Turn Around)&quot; (Hendricks, Otis)\n12. &quot;I Want You&quot; (White)\n\nLine up:\nTop Topham - Guitar\nDanny Kirwan - Guitar\nChristine McVie - Vocals, Main Performer, Keyboards\nJohn McVie - Bass\nRichard Hayward - Guitar","torrent":{"xt":"urn:btih:3c7a0f88d8af159efaa66c469b4901d41370e48a","amp;dn":"Christine+McVie+-+Christine+Perfect+1970+%28Ex+Member+of+Chicken+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7a0f88d8af159efaa66c469b4901d41370e48a","infoHashBuffer":{"type":"Buffer","data":[60,122,15,136,216,175,21,158,250,166,108,70,155,73,1,212,19,112,228,138]},"announce":[],"urlList":[]}}