{"title":"Christian Smith - Moral, Believing Animals. Human Personhood and","uid":10341826,"size":810444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cfba9664f6f5c31cf4eb5dc511cf43cb2bca712&amp;dn=Christian+Smith+-+Moral%2C+Believing+Animals.+Human+Personhood+and&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1402548128,"description":"Description\nProduct Details\nBook Title: Moral, Believing Animals: Human Personhood and Culture\t\nBook Author: Christian Smith (Author)\nHardcover: 176 pages\nPublisher: Oxford University Press (July 10, 2003)\nLanguage: English\nISBN-10: 0195162021\nISBN-13: 978-0195162028\n\n===================================================================================\nBook Description\nPublication Date: July 10, 2003\nWhat kind of animals are human beings? And how do our visions of the human shape our theories of social action and institutions? In Moral, Believing Animals, Christian Smith advances a creative theory of human persons and culture that offers innovative, challenging answers to these and other fundamental questions in sociological, cultural, and religious theory.\nSmith suggests that human beings have a peculiar set of capacities and proclivities that distinguishes them significantly from other animals on this planet. Despite the vast differences in humanity between cultures and across history, no matter how differently people narrate their lives and histories, there remains an underlying structure of human personhood that helps to order human culture, history, and narration. Drawing on important recent insights in moral philosophy, epistemology, and narrative studies, Smith argues that humans are animals who have an inescapable moral and spiritual dimension. They cannot avoid a fundamental moral orientation in life and this, says Smith, has profound consequences for how sociology must study human beings.\n\n===================================================================================\nReviews\n&quot;Well written and clearly argued, Moral Believing Animals is both a searching critique of recent social theory and an important first step toward the articulation of a richer model of human personhood, motivation, and culture.&quot;\n--INSight\n\n&quot;A concise book that is enjoyable and easy to read, offering a far-reaching synthesis of a variety of philosophical and sociological approaches.... Smith masterfully situates many of the key current debates while calling attention to their historical origins and implicit assumptions.&quot;--Contemporary Sociology\n\n&quot;An admirable model of wide-ranging and rich yet focused scholarship.'' --The Journal for the Scientific Study of Religion\n\n===================================================================================\nAbout the Author\nWilliam R. Kenan, Jr. Professor of Sociology and Director of the Center for the Study of Religion and Society at the University of Notre Dame\n===================================================================================","torrent":{"xt":"urn:btih:3cfba9664f6f5c31cf4eb5dc511cf43cb2bca712","amp;dn":"Christian+Smith+-+Moral%2C+Believing+Animals.+Human+Personhood+and","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cfba9664f6f5c31cf4eb5dc511cf43cb2bca712","infoHashBuffer":{"type":"Buffer","data":[60,251,169,102,79,111,92,49,207,78,181,220,81,28,244,60,178,188,167,18]},"announce":[],"urlList":[]}}