{"title":"Marco Borsato-Duizend Spiegels-NL-CD-FLAC-2013-JLM","uid":9235397,"size":403324610,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d4777f3e13540214f63efd9bb0015cd788c0bd2&amp;dn=Marco+Borsato-Duizend+Spiegels-NL-CD-FLAC-2013-JLM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mindcrasher","files":17,"time":1385163848,"description":"Marco Borsato - Duizend Spiegels\n\nRelease Info\n\nArtist: Marco Borsato\nAlbum: Duizend Spiegels\nLabel: Universal\nSource: CD (LP)\nYear: 2013\nGenre: Pop\nRip date: 2013-11-22\nStore date: 2013-11-22\nBitrate: 919 kbps\nEncoder: FLAC 1.2.1 -8\nSize: 403.31 megs\n\nTrack List\n\n1. Het Beste Wat Ik Ooit Had 4:28\n2. De Weg Terug 3:53\n3. Terug 3:43\n4. Ik Zou Het Zo Weer Overdoen (met Trijntje Oosterhuis) 4:08\n5. Stem 4:33\n6. Verlies 5:02\n7. Zoals Je Bent (feat. Lisa Lois) 3:05\n8. Bang Voor Water 3:53\n9. Woorden 4:15\n10. Samen Voor Altijd (met Jada Borsato feat. Willem Hendriks &amp; 4:08\nLange Frans, Day Ewbank &amp; John Ewbank)\n11. Alles Wat Stijgt 4:05\n12. Breng Jij Mij Naar Huis 4:36\n13. Muziek (feat. Bag2Bank &amp; Ali B) 4:24\n14. Breng Jij Mij Naar Huis (ft. Showtek) (Bonustrack) 4:06\n58:19\n\nRelease Notes\n\n&quot;De carri re van Marco Borsato telt inmiddels 23 jaar. In die tijd heeft de\nzanger alles meegemaakt wat een artiest zich kan wensen: met bijna 40 hits\nen een ongekend goed gevulde prijzenkast behoort Borsato tot de succesvolste\nvocalisten uit de muziekgeschiedenis van ons land. De songs van Borsato en\nzijn vaste componist John Ewbank zijn onderdeel geworden van het culturele\nerfgoed: miljoenen Nederlanders hebben bij liedjes als Binnen, Rood, De\nWaarheid of Dochters om er enkele te noemen hun eigen herinneringen en\nbeelden. Muziekliefhebbers herbeleven dankzij Borsato s oeuvre hun\ngeluksmomenten, vinden troost in tekst en compositie, of hebben er houvast\naan\n\nDe titel van Marco s nieuwe album Duizend Spiegels verwijst naar die\nspecifieke rol van muziek. Iedereen herkent in het werk van de\nverhalenverteller Borsato zichzelf en zijn eigen leven, en maakt bij de\nliedjes zijn eigen associaties. Een lied heeft het effect van duizend\nspiegels. Een tekst wordt bij wijze van spreken door duizend mensen op\nduizend manieren ge nterpreteerd. En al die versies zijn even waar, omdat\nelke persoonlijke interpretatie uiteindelijk iets zegt over jezelf en over\nje eigen geschiedenis\n\nDuizend Spiegels biedt een rijk scala aan stijlen en stemmingen. Zo zijn er\nduetten met Trijntje Oosterhuis (in een lied dat als de opvolger van Wereld\nZonder Jou uit 1996 kan worden gezien) en met Borsato's tien-jarige dochter\nJada. Ook rapper Lange Frans en zijn zoon Willem (5), Ali B en Gers Pardoel\nkomen voorbij. Het beste wat ik ooit had, een nummer in up-tempo, laat\nzonder omhaal het hart een sprong maken\n\nAan de andere kant van het spectrum staat op Duizend Spiegels een\nhartverscheurend lied over het verlies van een zoon, gebaseerd op een\nverhaal van een gezamenlijke vriend van Borsato en Ewbank\n\nNa de lancering van het nieuwe album gaat Borsato weer toeren. Hij zoekt\nopnieuw de theaters op, om dicht bij zijn publiek te zijn en overal in het\nland zijn muziek te delen. Delen is misschien wel de essentie van wat ik\ndoe. Ik probeer met mijn muziek het dagelijkse leven een moment te kantelen\nZodat het publiek weg kan dromen, uit zijn dak kan gaan, of zich toestaat\neven stil te staan bij een dierbaar persoon of een te koesteren moment. Als\ndat lukt, is mijn missie geslaagd. De tour van Marco Borsato zal op maandag\n18 november worden aangekondigd.&quot;\n\n0ND &amp; pH7\nS i L K\n20 12\n","torrent":{"xt":"urn:btih:3d4777f3e13540214f63efd9bb0015cd788c0bd2","amp;dn":"Marco+Borsato-Duizend+Spiegels-NL-CD-FLAC-2013-JLM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d4777f3e13540214f63efd9bb0015cd788c0bd2","infoHashBuffer":{"type":"Buffer","data":[61,71,119,243,225,53,64,33,79,99,239,217,187,0,21,205,120,140,11,210]},"announce":[],"urlList":[]}}