{"title":"Gorillaz Discography (iTunes) [theLEAK]","uid":6560197,"size":398496826,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3d833be5d8667593dfd458c0faf7e82b07a137ec&amp;dn=Gorillaz+Discography+%28iTunes%29+%5BtheLEAK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"theLEAK","files":-1,"time":1311433421,"description":"+-----------+\n| Biography |\n+-----------+\n\nConceived as the first &quot;virtual hip-hop group,&quot; Gorillaz blended the musical talents of Dan &quot;The Automator&quot; Nakamura, Blur's Damon Albarn, Cibo Matto's Miho Hatori, and Tom Tom Club's Tina Weymouth and Chris Frantz with the arresting visuals of Jamie Hewlett, best known as the creator of the cult comic Tank Girl. Nakamura's Deltron 3030 cohorts Kid Koala and Del tha Funkee Homosapien rounded out the creative team behind the Gorillaz quartet, whose virtual members included 2-D, the cute but spacy singer/keyboardist; Murdoc, the spooky, possibly Satanic bassist and the brains behind the group; Russel, a drummer equally inspired by &quot;Farrakhan and Chaka Khan&quot; and possessed by &quot;funkyphantoms&quot; that occasionally rise up and provide some zombie-style rapping; and last but not least, Noodle, a ten-year-old Japanese guitar virtuosa and martial arts master. The group's website, www.gorillaz.com, showcased Hewlett's visuals and the group's music in eye- and ear-catching detail.\n\nGorillaz debuted in late 2000 with the Tomorrow Comes Today EP, which they followed early the next year with the popular Clint Eastwood single. A self-titled, full-length debut album arrived in spring 2001. Gorillaz was a massive worldwide success and achieved platinum-level sales in the U.S.; worldwide, it sold over seven million copies. The group's Svengalis were quick to capitalize, and released the B-sides collection G-Sides, the Phase One: Celebrity Takedown DVD, and the dub-inspired remix album Laika Come Home in 2002. The project soon went on hiatus, however, as Albarn resumed work with Blur for their seventh album, 2003's Think Tank.\n\nWhen he was ready to begin the next Gorillaz album, Albarn turned to Danger Mouse (the DJ behind The Grey Album, the infamous mash-up of the Beatles' White Album and Jay-Z's Black Album) and a host of other collaborators, including De La Soul, Shaun Ryder, Debbie Harry, Dennis Hopper, and Martina Topley-Bird. Although Del tha Funkee Homosapien and Nakamura did not return, 2-D, Russel, Murdoc, and Noodle were all present and accounted for on Demon Days, another Top Ten hit, which arrived in spring 2005. The album went double platinum in America and enjoyed even more success in the U.K.; it also received a host of Grammy nominations, a sign that the band had secured critical as well as commercial approval. Gorillaz broke ground for a new album in 2007, but the project wasn't released until 2010, when Plastic Beach marked the band's third studio effort. \n\n\n\n\n+--------+\n| Formed | : 2000\n+--------+\n\n\n\n\n+-------+\n| Genre | : Alternative\n+-------+  \n\n\n\n\n+--------------+\n| Years Active | : '00s, '10s\n+--------------+\n\n\n\n\n+--------+\n| Albums | : Demon Days (2005),Gorillaz (2001),Plastic Beach (2010),The Fall(2011)\n+--------+\n\n\n\n\n+-----------+\n| Copyright | : theLEAK\n+-----------+\n\n\n\n\n+---------+\n| Content | : EXPLICIT\n+---------+\n\n\n\n\n___________________________________________________________________________________\n\n\nNOTE: All songs are purchased. The date format is DD/MM/YYYY. Included an extra artwork of each album just in case it does not appear.","torrent":{"xt":"urn:btih:3d833be5d8667593dfd458c0faf7e82b07a137ec","amp;dn":"Gorillaz+Discography+%28iTunes%29+%5BtheLEAK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d833be5d8667593dfd458c0faf7e82b07a137ec","infoHashBuffer":{"type":"Buffer","data":[61,131,59,229,216,102,117,147,223,212,88,192,250,247,232,43,7,161,55,236]},"announce":[],"urlList":[]}}