{"title":"Men In Green Faces (1011)","uid":7600595,"size":1460959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3dd83a25d654f5a1672db006c6b2545415328c80&amp;dn=Men+In+Green+Faces+%281011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fuctyou","files":-1,"time":1346803016,"description":"With just weeks remaining in his 180-day tour of Vietnam, Navy SEAL Gene Michaels hopes he will live to see his pregnant wife again, but he thrives on his dangerous missions. In fact, he feels his service will be incomplete if he does not eliminate a North Vietnamese Army &quot;enforcer,&quot; one Col. Nguyen, who has brought terror to South Vietnamese villages. His determination redoubles after his best friend dies in a Nguyen-led ambush. Intensifying Michaels's despair is the likelihood that the team was sold out by a Vietnamese interrogator whom he had offended. But finding Nguyen, while a high priority for the U.S. war effort, does not postpone any other missions. Michaels and his team are &quot;inserted and extracted&quot; literally every day, entering impenetrable jungles and engaging numerically superior forces. In what is to be their final mission, for example, Michaels leads his team of seven against Nguyen and a division of 5000 North Vietnamese regulars. But even this explosive &quot;op&quot; does not prove as deadly as the mission Michaels volunteers to join a day before his tour is up. With neither the Bible-reading Michaels nor anyone else reflecting on the war itself, the players are rather thinly developed, and the plot, nominally the search for Nguyen, is weaker as a result. But personalities inexorably emerge, and it is hard not to root for individual SEALs. Wentz fought in Vietnam as a Navy SEAL and freelance writer Jurus is director of the Southern California Writers' Conference. \n &lt;a href=&quot;\nhttp://www.amazon.com/Men-Green-Faces-Gene-Wentz/dp/0312950527&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Men-Green-Faces-Gene-Wentz/dp/0312950527&lt;/a&gt;","torrent":{"xt":"urn:btih:3dd83a25d654f5a1672db006c6b2545415328c80","amp;dn":"Men+In+Green+Faces+%281011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dd83a25d654f5a1672db006c6b2545415328c80","infoHashBuffer":{"type":"Buffer","data":[61,216,58,37,214,84,245,161,103,45,176,6,198,178,84,84,21,50,140,128]},"announce":[],"urlList":[]}}