{"title":"Exposing the Truth Movement (no Illuminati Conspiracy video)","uid":11717844,"size":93126009,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3e1bd43ae71c5d6cde94186d4cdc19361efa0c08&amp;dn=Exposing+the+Truth+Movement+%28no+Illuminati+Conspiracy+video%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"one_last_round","files":3,"time":1424672181,"description":"\n\nI think the whole truth movement was created, even the movie Loose Change. Although I didn't mention that movie in my talk, I do discuss Fritz Springmeier, Alex Jones, Alan Watt, Russ Dizdar, Eric John Phellps, Chuck Missler, Texe Marrs, Michael Tsarion, Coast to Coast, Red Ice Creations, Bill Cooper, Mark Dice, Mad Cow, Zeitgeist, Rob Skiba, Jordan Maxwell, David Icke all being agents.\n\nI think Bill Cooper might have started out as an agent but defected because he couldn't go along with it. My advice is don't listen to shows like Coast to Coast, Red Ice Creations, or the Alex Jones show. Also, don't follow their guests to be safe. Listen to youtube truthers. You can tell the difference. People on youtube are trying to expose and figure things out. The agents or what seem like agents that I listed, act like they already knew all of the information. Where did they get their information? From secret societies?\n\nI'm not saying everyone on the list is an agent. What I'm doing is questioning the leaders of the truth movement. The movie Zeitgeist was promoted on youtube's main page for what seemed like months!! It was promoted on purpose by the system. And Alex Jones somehow just got into Bohemian Grove by chance? Yeah Right!","torrent":{"xt":"urn:btih:3e1bd43ae71c5d6cde94186d4cdc19361efa0c08","amp;dn":"Exposing+the+Truth+Movement+%28no+Illuminati+Conspiracy+video%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e1bd43ae71c5d6cde94186d4cdc19361efa0c08","infoHashBuffer":{"type":"Buffer","data":[62,27,212,58,231,28,93,108,222,148,24,109,76,220,25,54,30,250,12,8]},"announce":[],"urlList":[]}}