{"title":"STRANGLEMANIA 1 and 2 .avi","uid":4975028,"size":2610487356,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e43ddf982c122dcad255f4e23aa1ff085323b90&amp;dn=STRANGLEMANIA+1+and+2+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"soupbone666","files":2,"time":1245957504,"description":"I.C.P. PRESENTS:\n\nStranglemania COLLECTORS EDITION volumes 1 and 2!\n\nFuck Hulk Hogan! Fuck Ric FlaiR! There all a bunch of weak ass chumps compared to this: The bloodiest, goriest, deadliest pro-wrestling ever seen!\n\nUnbelievable death match wrestling from Japans bloody underworld.\n\nMore Blood! More Gore! and more half naked fat guys in panties trying to kill each other!\n\nWatch at your own risk.....Guaranteed to leave you with mental scars for life!\n\nJoin Shaggy 2 dope and Violent J of The Insane Clown Posse along with Jamie Madrox of TWIZTED, as they sit you down for a ringside seat to the worlds most fobidden sport: DEATH MATCH Pro-Wrestling!\n\nSTRANGLEMANIA 1\n\nThe Ultimate Fighting Championships aint got shit compared to whats on this collection!  So call your friends over and tell 'em to bring the beer.....cause you'll need it for what your about to see!\n\nCACTUS SAC VS. LAMA NAMANEUMI\nBarbed Wire, Spiked Bed of Nails, Death tournament match #1\n\nPONDEROSA VS. SWEDEN HOUSE\nBarbed wire bed, Broken Glass, Fat boy Death Match\n\nCACTUS SAC and LEATHERNECK VS. DEADLY FRED and LAMA NAMANUEMI\nBarbed Wire bat, Thumbtac attack, Razorblade Bed Blood Match\n\nMAIN EVENT: DRUNK TERRY FLUNK VS. CACTUS SAC\nDeath Rope, Barbed Wire Bat, Razorblade bed, Thumbtac Attack, Fire bed, Exploding ring, steel ladder, Spike Death Tournament Finals\n\nAlso youll see highlights of: The battle Royal of the nobodies featuring some of Americas lamest no-name wrestlers such as: Big Larry, Malicious, Mike, Surf boy Richie, Hazel Sparks, Nate the Snake, Mysterious Mauler and Skinny Wolf!\n\n\n\nSTRANGLEMANIA 2 &quot;Bitches, Blood and Barbed-Wire!&quot;\n\nFeaturing the return of greats like Lama Namanuemi, Drunk Terry Flunk, and even them two fat, loveable, huggable, butterballs......The Mushroom Boys!!!!\n\nPlus youll see many newcomers in action. A friendly ass pansy know as Sweet Baby Bitch does battle with an unpredictable hermaphrodite known as Asshole Andy Armegedon...\n\nYoull see a fat, fudge-packer in a stupid panda bear suit named Anderino Panderina make his debut against some other idiot named Ultra-Bitch.\n\nAlso if you think death match wrestling is just for men, think again!  Because this time around the women get involved! On this DVD a fat chick named Sweaty Neden a sexy little freak named Sweet Sugar Ass in an electrified Barbed-Wire, Exploding ring match!  No holds barred in this one baby! Top notch nipple to nipple action!\n\nStranglemania 2 also feature rare, top secret, classic wrestling footage from 1907. The Masked Cabana battle The Fortified Hooligan with an ending that is so amazing, It still remains unexplained to this very day!  You have to see it to believe it!\n\nMake no mistake. This is Strangle-Mania Action at its best. Nothing has Changed. Both the returning greats and all the new comers have the same objective....to stick flaming, barb-wire wrapped bats up each others bitch asses!!! All for our Juggalo entertainment. So grab a fat chick, crack open a Faygo and pop in Stranglemania, Cause its goin down baby...wicked clown style!\n\nTHIS DVD COLLECTORS EDITION ALSO INCLUDES:\nThree never before seen matches that will destroy what sanity you may have\n\nICP's video for &quot;Another Love Song&quot;\n\n10 Minutes of ICP's Movie &quot;Big Money Hustlas!&quot;","torrent":{"xt":"urn:btih:3e43ddf982c122dcad255f4e23aa1ff085323b90","amp;dn":"STRANGLEMANIA+1+and+2+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e43ddf982c122dcad255f4e23aa1ff085323b90","infoHashBuffer":{"type":"Buffer","data":[62,67,221,249,130,193,34,220,173,37,95,78,35,170,31,240,133,50,59,144]},"announce":[],"urlList":[]}}