{"title":"The Bourne Legacy (2012) Retail PAL-NL Multi BB","uid":7947197,"size":4639290500,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3e91be270e4096524bfa25422f8aa43769aa2e5d&amp;dn=The+Bourne+Legacy+%282012%29+Retail+PAL-NL+Multi+BB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Betty-Boop","files":-1,"time":1356169243,"description":"The Bourne Legacy (2012) Retail PAL-NL Multi BB\n\n\n\nVerenigde Staten\nActie / Avontuur\n135 minuten\n\ngeregisseerd door Tony Gilroy\nmet Jeremy Renner, Rachel Weisz en Edward Norton\n\nDeel vier in de Bourne-reeks, met de nieuwe CIA-agent Aaron Cross die zijn leven niet meer zeker is wanneer zijn geheime operatie wordt stopgezet.\n\n\n\nIn hun poging alle losse eindjes betreffende de geheime operaties van Blackbrair, Treadstone en Outcome op te lossen moeten er vanuit de CIA drastische maatregelen genomen worden. De jacht op Jason Bourne en de daaraan gekoppelde publiekelijke moord op journalist Simon Ross van The Guardian (zie The Bourne Supremacy) zorgt voor ongewenste publiciteit en CIA-topman Eric Byer (Edward Norton) neemt de moeilijke beslissing om het Outcome-programma van boven tot onder plat te leggen. Een aantal zeer belangrijke agenten moet worden opgeofferd, zo ook alle agenten in opleiding, waaronder Aaron Cross. Cross (Jeremy Renner) ondergaat op dat moment in Alaska de extreem zware training van de Special Operations Group, maar met de hulp van het Outcome-programma, een strikt programma waarbij Cross blauwe en groene tabletten moet slikken, moet zelfs de zwaarste test goed te doen zijn. Door zijn oplettendheid weet Cross aan de dood te ontsnappen en gelijk treedt zijn training en zijn geprogrammeerde gedrag in werking. Ook bij de producent van de tabletten moet schoon schip worden gemaakt en ook daar wordt in opdracht van de CIA een slachtpartij aangericht. Wetenschapster/arts Marta Shearing (Rachel Weisz) overleeft de zuiveringsactie, maar ook zij is daarna haar leven niet zeker. Cross, die met enige regelmaat bij Marta ter controle kwam, redt haar uit de klauwen van een moordcommando en samen slaan ze op de vlucht, gezocht alsof ze het meest gevaarlijke koppel voor de staatsveiligheid zijn.....\n\n\nIn The Bourne Legacy wordt een vrijwel naadloze overgang gemaakt van de de derde naar de vierde film en dat zorgt voor een zeer geloofwaardige voortzetting van deze zo succesvolle franchise. Jeremy Renner is een meer dan waardig opvolger en met rollen in The Town, Mission Impossible: Ghost Protocol en The Avengers achter zijn naam is hij inmiddels een gevestigde naam in het actie-genre. Kijkend naar deze vierde Bourne-film vergeet je al heel snel dat het Matt Damon was die de reeks op de kaart heeft gezet en dat is een groot compliment voor Renner die wat ons betreft nog wel een paar Bourne-films mag gaan maken.\n\nEnglish\n\nAn expansion of the universe from Robert Ludlum's novels, centered on a new hero whose stakes have been triggered by the events of the previous three films. \n\n\nBron ................: Retail(December 2012)\nKwaliteit............: Bitrate +/- 4.272 Kbs\nTalen (DD5.1)........: Engels\nOriginele Ondertiteling : Nederlands , Frans , Engels\nMenu ................: Ja\n\n\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/86422&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/86422&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1194173/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1194173/&lt;/a&gt;","torrent":{"xt":"urn:btih:3e91be270e4096524bfa25422f8aa43769aa2e5d","amp;dn":"The+Bourne+Legacy+%282012%29+Retail+PAL-NL+Multi+BB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e91be270e4096524bfa25422f8aa43769aa2e5d","infoHashBuffer":{"type":"Buffer","data":[62,145,190,39,14,64,150,82,75,250,37,66,47,138,164,55,105,170,46,93]},"announce":[],"urlList":[]}}