{"title":"Origins of Language: A Slim Guide","uid":10589385,"size":1517922,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ea9962f83e282305ff96dd18aa6a5a15d3f8cee&amp;dn=Origins+of+Language%3A+A+Slim+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1405783379,"description":" James R. Hurford, &quot;Origins of Language: A Slim Guide&quot;\nEnglish | ISBN: 0198701888, 0198701667 | 2014 | 192 pages | PDF | 1 MB\n\nOrigins of Language: A Slim Guide offers a concise and accessible overview of what is known about the evolution of the human capacity for language. Non-human animals communicate in simple ways: they may be able to form simple concepts, to feel some limited empathy for others, to cooperate to some extent, and to engage in mind-reading. Human language, however, is characterized by its ability to efficiently express a wide range of subtle and complex meanings. After the first simple beginnings, human language underwent an explosion of complexity, leading to the very complicated systems of grammar and pronunciation found in modern languages. Jim Hurford looks at the very varied aspects of this evolution, covering human prehistory; the relation between instinct and learning; biology and culture; trust, altruism, and cooperation; animal thought; human and non-human vocal anatomy; the meanings and forms of the first words; and the growth of complex systems of grammar and pronunciation. Written by an internationally recognized expert in the field, it draws on a number of disciplines besides linguistics, including philosophy, neuroscience, genetics, and animal behaviour, and will appeal to a wide range of readers interested in language origins and evolution. ","torrent":{"xt":"urn:btih:3ea9962f83e282305ff96dd18aa6a5a15d3f8cee","amp;dn":"Origins+of+Language%3A+A+Slim+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ea9962f83e282305ff96dd18aa6a5a15d3f8cee","infoHashBuffer":{"type":"Buffer","data":[62,169,150,47,131,226,130,48,95,249,109,209,138,166,165,161,93,63,140,238]},"announce":[],"urlList":[]}}