{"title":"Dragon's Lair 3D - Special Edition [Pal], Ps2","uid":5461703,"size":476382583,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3f76f69fd1993184a2172d7a01f62710dcad276a&amp;dn=Dragon%5C%27s+Lair+3D+-+Special+Edition+%5BPal%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big_dude","files":-1,"time":1269486518,"description":"Dragon's Lair 3D - Special Edition for the Ps2                      Rel. 03/26/2004\n\n\nFormat:        DVD5 PAL\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nGenre.:        Action\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes - The Game could not be patched to Ntsc so it had to be left in Pal.\n                If you don't have the pal standard, a Multi System TV (NTSC/PAL), \n                or converter there's no point in playing this game if you have a \n                Ntsc tv/ps2 only. As the screen color will be in black &amp; white and\n                just roll.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n           &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n           &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n          &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n          &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nDragon's Lair 3D is an entirely new, built-from-the-ground-up, three-dimensional version of the highly successful 1980s coin-op phenomenon. While it stays true to the design and storyline of the arcade game, it offers a 3D experience unlike anything else Dragon\u0019s Lair fans have played before. Princess Daphne has been kidnapped by the evil dragon Singe and hidden in a medieval castle owned by Mordroc, a powerful and malevolent wizard. To save her, players take on the persona of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of a magical amulet, Dirk must overcome a slew of challenges, from jumping over flaming pits and climbing ropes to flying across chasms and battling swarms of the wizard\u0019s minions.Gamers must use cat-quick reflexes, cunning and resourcefulness to solve puzzles, defeat a variety of enemies, and fight their way through the castle to find Daphne and save the kingdom from Mordroc's clutches.\n\n\nFeatures:\n\n* Entirely new 3-D version of the 1980s arcade phenomenon.\n\n* Take full control over Dirk the Daring: jump, run, roll, climb, swing, and \n  somersault.\n\n* Explore more than 250 rooms.\n\n* Choose and collect new items, weapons, and potions along the way.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf using DVD+R booktype to DVD-ROM.\n(Only if your mod-chip or ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t\t","torrent":{"xt":"urn:btih:3f76f69fd1993184a2172d7a01f62710dcad276a","amp;dn":"Dragon%5C%27s+Lair+3D+-+Special+Edition+%5BPal%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f76f69fd1993184a2172d7a01f62710dcad276a","infoHashBuffer":{"type":"Buffer","data":[63,118,246,159,209,153,49,132,162,23,45,122,1,246,39,16,220,173,39,106]},"announce":[],"urlList":[]}}