{"title":"Echobelly - Everybody's Got One [1994]","uid":9368004,"size":295053687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f782f13df9e739098cf2b38437416c1af923ce0&amp;dn=Echobelly+-+Everybody%27s+Got+One+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387467988,"description":"The album is Everyone's Got One or EGO for short, thus the pun and point of the title. Given that Echobelly's work clearly echoes one of the great English self-obsessives, Morrissey, it's an appropriate enough tag for the quintet's full debut. Madan perhaps gained a little too much U.K. press attention based over the surprising fact that she was non-Caucasian and non-male as opposed to her own qualities straight up -- a pity, because they're considerable. While her singing voice comes across a touch weak here and there compared to the crunch of her band, lessening the overall impact as a result, she hits the spot more than once to make an impact. That she does indeed have something of Morrissey's vocal swoops and tics, and that guitarist Glenn Johansson knows his Johnny Marr and more, means Echobelly aren't a truly distinct and great group, but certainly have the foundations for a good one, as shown throughout. Madan's own life experiences provide some sharp grist for the mill. &quot;Father Ruler King Computer&quot; obliquely tackles the expectations from her Anglo-Indian family background of being a housewife and solely that, while &quot;Give Her a Gun&quot; heats up the feminist rhetoric further with smart, sharp lines like &quot;Half the population/one percent of the wealth/blame the mother/sell the sister.&quot; At the band's best, though, Madan grapples with personal politics and dreams full on -- &quot;Insomniac&quot; and &quot;Close...But,&quot; with its pictures of relationships fracturing on all fronts and resolution to look beyond them for something better, make for entertaining blasts of inspiration. Perhaps most outrageous and outrageously successful is the group's best single, &quot;I Can't Imagine the World Without Me.&quot; With trumpet and strings adding to the anthemic rip and soar of the mid-song break, it's a sparkling mini-masterpiece of Brit-pop; sassy, tuneful and memorable all at once. (4/5)","torrent":{"xt":"urn:btih:3f782f13df9e739098cf2b38437416c1af923ce0","amp;dn":"Echobelly+-+Everybody%27s+Got+One+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f782f13df9e739098cf2b38437416c1af923ce0","infoHashBuffer":{"type":"Buffer","data":[63,120,47,19,223,158,115,144,152,207,43,56,67,116,22,193,175,146,60,224]},"announce":[],"urlList":[]}}