{"title":"Mark Steyn on The Rush Limbaugh Show [Collection]","uid":10562515,"size":2026642038,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3f8397163f83864797ac3d0b5a47e70d46c6ea81&amp;dn=Mark+Steyn+on+The+Rush+Limbaugh+Show+%5BCollection%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hellz666","files":-1,"time":1405473846,"description":"Mark Steyn is an international bestselling author, a Top 41 recording artist, and a leading Canadian human rights activist.  Mark is also a popular guest host of America's #1 radio show The Rush Limbaugh Program, and America's #2 cable show Hannity. In addition, he appears each week on The Hugh Hewitt Radio Show. In Canada, he can be heard with Toronto's Number One morning man on The John Oakley Show, and seen on Sun News.\n\nOver the years, Mark's writing on politics, arts and culture has been published in almost every major newspaper around the English-speaking world, including Britain's Daily Telegraph, Canada's National Post, The Australian, The Irish Times, The Jerusalem Post, The Wall Street Journal, and many more.  His human rights campaign to restore free speech to Canada led to the repeal by Parliament of the notorious &quot;Section 13&quot; law, a battle he recounts in his book Lights Out: Islam, Free Speech And The Twilight Of The West.\n\nMark's most recent book, After America, was a Top Five bestseller in the United States and a Number One bestseller in Canada; and &quot;A Marshmallow World&quot;, his Christmas single with Jessica Martin, reached Number Seven on Amazon's easy listening bestsellers, and Number 41 on their main pop chart.\n\nMark's other books include America Alone: The End Of The World As We Know It, a New York Times bestseller in the United States and a Number One bestseller in Canada; plus A Song For The Season, Mark Steyn's Passing Parade, Mark Steyn From Head To Toe and The Face Of The Tiger. His personal view of musical theatre, Broadway Babies Say Goodnight, was published to critical acclaim in London, and to somewhat sniffier notices in New York.","torrent":{"xt":"urn:btih:3f8397163f83864797ac3d0b5a47e70d46c6ea81","amp;dn":"Mark+Steyn+on+The+Rush+Limbaugh+Show+%5BCollection%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f8397163f83864797ac3d0b5a47e70d46c6ea81","infoHashBuffer":{"type":"Buffer","data":[63,131,151,22,63,131,134,71,151,172,61,11,90,71,231,13,70,198,234,129]},"announce":[],"urlList":[]}}