{"title":"Hobbit_ Or There and Back Again, The - J. R. R. Tolkien-viny","uid":6418869,"size":3614335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40286255549d4cf59ac03267dc06fc3ad504d39c&amp;dn=Hobbit_+Or+There+and+Back+Again%2C+The+-+J.+R.+R.+Tolkien-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306248321,"description":"Hobbit_ Or There and Back Again, The - J. R. R. Tolkien-viny\n\n\n&quot;In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.&quot;\n\nThe hobbit-hole in question belongs to one Bilbo Baggins, an upstanding member of a &quot;little people, about half our height, and smaller than the bearded dwarves.&quot; He is, like most of his kind, well off, well fed, and best pleased when sitting by his own fire with a pipe, a glass of good beer, and a meal to look forward to. Certainly this particular hobbit is the last person one would expect to see set off on a hazardous journey; indeed, when Gandalf the Grey stops by one morning, &quot;looking for someone to share in an adventure,&quot; Baggins fervently wishes the wizard elsewhere. No such luck, however; soon 13 fortune-seeking dwarves have arrived on the hobbit's doorstep in search of a burglar, and before he can even grab his hat or an umbrella, Bilbo Baggins is swept out his door and into a dangerous adventure.\n\nThe dwarves' goal is to return to their ancestral home in the Lonely Mountains and reclaim a stolen fortune from the dragon Smaug. Along the way, they and their reluctant companion meet giant spiders, hostile elves, ravening wolves--and, most perilous of all, a subterranean creature named Gollum from whom Bilbo wins a magical ring in a riddling contest. It is from this life-or-death game in the dark that J.R.R. Tolkien's masterwork, The Lord of the Rings, would eventually spring. Though The Hobbit is lighter in tone than the trilogy that follows, it has, like Bilbo Baggins himself, unexpected iron at its core. Don't be fooled by its fairy-tale demeanor; this is very much a story for adults, though older children will enjoy it, too. By the time Bilbo returns to his comfortable hobbit-hole, he is a different person altogether, well primed for the bigger adventures to come","torrent":{"xt":"urn:btih:40286255549d4cf59ac03267dc06fc3ad504d39c","amp;dn":"Hobbit_+Or+There+and+Back+Again%2C+The+-+J.+R.+R.+Tolkien-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40286255549d4cf59ac03267dc06fc3ad504d39c","infoHashBuffer":{"type":"Buffer","data":[64,40,98,85,84,157,76,245,154,192,50,103,220,6,252,58,213,4,211,156]},"announce":[],"urlList":[]}}