{"title":"RenegadePress.com - All Episodes (Great Drama)","uid":4231111,"size":12580718383,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:402c7ea90ad2d011d60ea89d7cc5680b57e88046&amp;dn=RenegadePress.com+-+All+Episodes+%28Great+Drama%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"softline","files":53,"time":1213053341,"description":"Teenager and aboriginal hip-hop artist Jack Sinclair (Bronson Pelletier) and his best friend Zoey Jones (Ksenia Solo) set up an underground ezine called renegadepress.com.  What starts as a pet project soon takes on a life of its own pushing Jack, Zoey and their crew of renegade reporters to deliver the goods on what&amp;#039;s really going on in the lives of today&amp;#039;s teens.  Ripped from the headlines, the series&amp;#039; storylines are inspired by real events that have happened to today&amp;#039;s youth.\n\nRenegadepress.com continues to push the boundaries of what is comfortable to talk about on television. Dealing with tough issues is what renegadepress.com is all about because if you don&amp;#039;t talk about it, how do you fix it? We see series regulars struggle with their identity; who they are and what they want from society, from themselves and from each other. From sex to sexuality, renegadepress.com reveals the raw, sometimes harsh truths that confront teens with sensitivity, humour and heart\n \nSince this long running and award winning drama has come to an end I thought it would be appropriate to post the series for those who have never seen it. The show is very controversial and is seldom (if ever) aired outside Canada.\n    \nIf you are a parent with teenagers or about to attend high school yourself this show will scare you into not attending.  As is noted in the credits everything shown in the series is true and only the names have been changed for privacy reasons.\n \nIf you don&amp;#039;t watch all the episodes at least watch the episode entitled  &quot;Dying to Connect.  A site member posts that she will commit suicide live on her webcam at a specific date and time in the near future.  As the date approaches site traffic rises with most of the posts being encouragement to die live on camera.  Local clubs and restaurants announce special parties to watch the act on the big screen. I was able to google the actual incident this episode was based on.\n \nAlso the shows website itself is worth a visit at: &lt;a href=&quot;\nhttp://www.renegadepress.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.renegadepress.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:402c7ea90ad2d011d60ea89d7cc5680b57e88046","amp;dn":"RenegadePress.com+-+All+Episodes+%28Great+Drama%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"402c7ea90ad2d011d60ea89d7cc5680b57e88046","infoHashBuffer":{"type":"Buffer","data":[64,44,126,169,10,210,208,17,214,14,168,157,124,197,104,11,87,232,128,70]},"announce":[],"urlList":[]}}