{"title":"Moby - Studio Discography 1992 - 2011 (320kbps)","uid":6715090,"size":1753607592,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:411753e3fb3cab9664d7a697493d797f235674a9&amp;dn=Moby+-+Studio+Discography+1992+-+2011+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"piratetorrent1989","files":174,"time":1317540737,"description":"Richard Melville Hall (born September 11, 1965), better known by his stage name Moby, is an American musician, DJ, and photographer. He is known for his sample-based electronic music and his outspoken Liberal political views, including his support of veganism and animal rights.\nMoby gained attention in the early 1990s with his electronic dance music work, which dabbled in the techno and breakbeat hardcore (also known as &quot;rave&quot;) genres. However, it wasn't until his fifth studio album, the electronica and house-influenced Play, that he gained national attention. Originally released in mid-1999 to an unflattering response, it re-entered the charts in early 2000 and slowly became an unexpected hit, producing eight singles and eventually selling over 10 million copies worldwide.\nMoby followed the album in 2002 with 18, which was also successful, selling over 5 million copies worldwide and receiving mostly positive reviews, though some criticising it for being too similar to Play. His next offer, 2005's mostly upbeat Hotel was a stylistic departure, incorporating more alternative rock elements than previous albums, and received mixed reviews. However, it still sold around 2 million copies worldwide. After 2008's dance-influenced Last Night (2008), he returned to the downtempo electronica of Play and 18 with 2009's mostly-ambient Wait for Me, finding higher critical acclaim and moderate sales. Moby's latest album, Destroyed., was released on May 13, 2011.\nMoby has also co-written, produced, or remixed music for The Smashing Pumpkins, Michael Jackson, David Bowie, Brian Eno, Pet Shop Boys, Britney Spears, New Order, Public Enemy, Guns 'N' Roses, Metallica, and more.\nWorldwide, Moby has sold over 20 million albums. Allmusic considers him &quot;one of the most important dance music figures of the early '90s, helping bring the music to a mainstream audience both in the UK and in America.&quot;\n\nAlbums:\n\nMoby (1992)\nAmbient (1993)\nEverything Is Wrong (1995)\nAnimal Rights (1996)\nPlay (1999)\n18 (2002)\nHotel (2005)\nLast Night (2008)\nWait for Me (2009)\nDestroyed. (2011)","torrent":{"xt":"urn:btih:411753e3fb3cab9664d7a697493d797f235674a9","amp;dn":"Moby+-+Studio+Discography+1992+-+2011+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"411753e3fb3cab9664d7a697493d797f235674a9","infoHashBuffer":{"type":"Buffer","data":[65,23,83,227,251,60,171,150,100,215,166,151,73,61,121,127,35,86,116,169]},"announce":[],"urlList":[]}}