{"title":"The Protocols of the learned elders of Zion - Audio book.rar","uid":4723137,"size":207911522,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:413636223ededdc26a6f9be667e217598bd1c259&amp;dn=The+Protocols+of+the+learned+elders+of+Zion+-+Audio+book.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"memoryhole","files":1,"time":1234619040,"description":"INTRODUCTION\n\nOf the Protocols themselves little need be said in the way of introduction. The book in which they are embodied was first published in the year 1897 by Philip Stepanov for private circulation among his intimate friends. The first time Nilus published them was in 1901 in a book called The Great Within the Small and reprinted in 1905. A copy of this is in the British Museum bearing the date of its reception, August 10, 1906. All copies that were known to exist in Russia were destroyed in the Kerensky regime, and under his successors the possession of a copy by anyone in Soviet land was a crime sufficient to ensure the owner's of being shot on sight. The fact is in itself sufficient proof of the genuineness of the Protocols. The Jewish journals, of course, say that they are a forgery, leaving it to be understood that Professor Nilus, who embodied them in a work of his own, had concocted them for his own purposes.\n\nMr. Henry Ford, in an interview published in the New York WORLD, February 17th, 1921, put the case for Nilus tersely and convincingly thus:\n\n    &quot;The only statement I care to make about the PROTOCOLS is that they fit in with what is going on. They are sixteen years old, and they have fitted the world situation up to this time. THEY FIT IT NOW.&quot;\n\nIndeed they do! \n\ndon't be a mug, it's not anti-semetic to wake up to the crimes of the Jewish criminal mafia. stay strong, truth will always shine though. \n\nMemory_hole @ www     info       underground   .   com","torrent":{"xt":"urn:btih:413636223ededdc26a6f9be667e217598bd1c259","amp;dn":"The+Protocols+of+the+learned+elders+of+Zion+-+Audio+book.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"413636223ededdc26a6f9be667e217598bd1c259","infoHashBuffer":{"type":"Buffer","data":[65,54,54,34,62,222,221,194,106,111,155,230,103,226,23,89,139,209,194,89]},"announce":[],"urlList":[]}}