{"title":"Sexually Broken--Tiny Odette Delacroix turned into blowjob box, ","uid":9709757,"size":1709036670,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:41734e2a3c514da859a7deca454f095e571c1a90&amp;dn=Sexually+Broken--Tiny+Odette+Delacroix+turned+into+blowjob+box%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1394096509,"description":"Tiny Odette Delacroix turned into blowjob box, brutal deepthroating, extreme facefucking NO mercy! | Odette Delacroix | Matt Williams\n\nMarch 5, 2014\n\n\niPod and Low and high bitrate MP4 + Pics.\n\n\nTiny little Odette Delacroix is under 5 feet tall and 100 pounds and looks like a doll. When they come this tiny, there is one one thing to do with them. Stick their ass in a box and reduce them into a cocksucking head. We do not need the rest of her, just her mouthhole. And use her mouthhole is exactly what we are doing to do. This fresh faced pixie has a skill that belies her innocent looks. She has zero gag reflex and can deep throat better then the most experienced porn slut out there. \n\nScrewed down firmly into the box, the box screwed into a post and blindfolded with leather, Odette is the true definition of helpless. She can not move a single inch, she can not even see what is coming her way. And what is coming her way is a rock hard cock directly down her throat meat. She startles only for a second as her lips are parted and then settles down to accept her fate. It is truly impressive deepthroating. She is one of a kind. We rip off the blindfold so that we can see those big blue eyes staring up at us while we own her throat. Sinking in balls deep, over and over, she makes the dick disappear like a magician with a rabbit.\n\nThose spread open legs display a perfectly shaved pussy and we can not help but rip a few orgasms out it it with our trusty vibrator. Odette cums as easily as she sucks cock, and her moans are music to our ears. Time to shake it up a bit. While keeping her bolted into the box, we unscrew it from the post and shift her onto her back, affixing it to a metal pole. This bitch in a box is handy travel sized. We made use of her facepussy, which is at perfect height for our dick. After a through tongue polishing, we slide a finger into that tiny pussy and use the vibrator to get a few more orgasms out of that responsive cunt. Odette is blasted out of her mind, and we leave her boxed up on her back, awaiting the next time we want some fun. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_05odelacroix2/SexuallyBroken-Odette-Delacroix-Matt-Williams-Tiny-Odette-Delacroix-turned-into-blowjob-box-brutal-deepthroating-extreme-facefucking--NO-mercy.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_05odelacroix2/SexuallyBroken-Odette-Delacroix-Matt-Williams-Tiny-Odette-Delacroix-turned-into-blowjob-box-brutal-deepthroating-extreme-facefucking--NO-mercy.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:41734e2a3c514da859a7deca454f095e571c1a90","amp;dn":"Sexually+Broken--Tiny+Odette+Delacroix+turned+into+blowjob+box%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41734e2a3c514da859a7deca454f095e571c1a90","infoHashBuffer":{"type":"Buffer","data":[65,115,78,42,60,81,77,168,89,167,222,202,69,79,9,94,87,28,26,144]},"announce":[],"urlList":[]}}