{"title":"Adonis [Syrian poet] - The Pages of Day and Night (1994)","uid":9025737,"size":2562050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4189ba9c41f69ee571cdd9ef4e5b15526753ddd5&amp;dn=Adonis+%5BSyrian+poet%5D+-+The+Pages+of+Day+and+Night+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":-1,"time":1381364128,"description":"\nAdonis - The Pages of Day and Night (Marlboro Press, 1994 / rep. Northwestern University Press, 2000).  Translated from the Arabic by Samuel Hazo.\n\nISBN: 9780810160811 | 108 pages | PDF\n\n\n&quot;Adonis&quot; is the pen name of Ali Ahmad Said Esber (b. 1930), a Syrian poet, essayist, and translator.  Repeatedly mentioned as a nominee for the Nobel Prize in Literature, he has been described as the greatest living poet of the Arab world.\n\nAdonis has written more than twenty books and volumes of poetry in the Arabic language as well as translated several works from French.  Imprisoned in Syria in the mid-1950s as a result of his beliefs, Adonis settled abroad and has made his career largely in Lebanon and France.  \n\nCalling poetry a &quot;question that begets another question,&quot; in this volume Adonis sets into motion an stream of unending inquiry with difficult questions about exile, identity, language, politics, and religion.  Restless and relentless, Adonis explores the pain and otherness of exile, a state so complete that absence replaces identity and becomes the exile's only presence.  Exile can take many forms for the Arabic poet, who must practice his craft as an outsider, separated not only from the nation of his birth but from his own language; in the present as in the past, that exile can mean censorship, banishment, or death.  Through these poems, Adonis gives an exquisite voice to the silence of absence.\n\nReviews\n\n&quot;This is an immensely satisfying new collection of poems -- continuing the poet's restless, metaphysical exploration into 'everything strange.&quot; -- Publishers Weekly\n\n&quot;Many of the poems in this collection, whether lyrical, fantastical or revelatory, are imbued with a mystical timelessness; a style that echoes the pre-Islamic poetry of Sufism; and a linguistic sensibility that prefers the simple, more accessible image over the intellectualized imagery of Western poetry. . .  The most engaging portion of the collection comes in the form of a brief concluding essay in which Adonis addresses the difficulties faced by a poet writing in Arabic -- a language that was, at least for him, nullified with the advent of Islam.  This is an immensely satisfying new collection of poems -- continuing the poet's restless, metaphysical exploration into everything strange.&quot;  -- Publishers Weekly\n\n&quot;One of the best known, most prolific, and innovative of contemporary Arab poets, Adonis . . . writes from a profound understanding of and love for the Arabic culture from which he has been politically exiled.  His poems are passionate, tragic, lyrical, evocative.  Translator Hazo brings what he can of the rich, impassioned flow of Arabic into our more placid language.  The translations, unlike many, stand on their own as poems.&quot; -- Judy Clarence, Library Journal\n","torrent":{"xt":"urn:btih:4189ba9c41f69ee571cdd9ef4e5b15526753ddd5","amp;dn":"Adonis+%5BSyrian+poet%5D+-+The+Pages+of+Day+and+Night+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4189ba9c41f69ee571cdd9ef4e5b15526753ddd5","infoHashBuffer":{"type":"Buffer","data":[65,137,186,156,65,246,158,229,113,205,217,239,78,91,21,82,103,83,221,213]},"announce":[],"urlList":[]}}