{"title":"Platinum Blonde - 7 Year Itch (Greatest Hits) [FLAC] - Kitlope","uid":4453302,"size":453026789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41b2e65505e3fac94ca5538a7d7e653d215e9e48&amp;dn=Platinum+Blonde+-+7+Year+Itch+%28Greatest+Hits%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kitlope","files":20,"time":1224361706,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 41B2E65505E3FAC94CA5538A7D7E653D215E9E48\nFile Size: 432 Mb\nYear: 1999\nLabel: CBS Records\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nPlatinum Blonde was a Canadian New Wave group in the 1980s. The band originally consisted of Manchester-born ex-pat Mark Holmes (vocals, bass), Sergio Galli (guitar) and Chris Steffler (drums). Scottish musician Kenny MacLean later joined the group. The name of the band was inspired by the 1931 Jean Harlow movie Platinum Blonde. They were known also for their stylish glam rock-like appearance dressing in pastel colour outfits and their music videos.\n\nIn 1983, with the release of the album Standing in the Dark, the band invaded the airwaves in Canada with four hit singles, a double platinum album, and two Juno (Canada's national music awards) nominated songs: &quot;Standing in the Dark&quot; and &quot;It Doesn't Really Matter&quot;. Their music videos were placed into high rotation on the newly created Much Music, Canada's national music video network. Within months some were calling Platinum Blonde &quot;Canada's Duran Duran&quot; because of their similar glamorous image and cutting-edge, futuristic New Wave videos. Lyrics in their early hits dealt with political themes, such as police state repression (It Doesn't Really Matter) and nuclear war (Standing in the Dark). The Standing in the Dark video was more overt in its political overtones, with the central setting being a war situation room, presumably on the verge of a nuclear war, that is eventually stormed by a group of civilians.\n\nIn 1985, the band released a second album called Alien Shores, featuring the addition of a fourth member, Kenny MacLean. &quot;Alien Shores&quot; went quintuple platinum, the group's high-water mark of success. Hits from the second album included &quot;Situation Critical&quot;, &quot;Crying Over You&quot;, &quot;Somebody Somewhere&quot;, and &quot;Hungry Eyes&quot;.\n\nThe band's next album, Contact, though an unsuccessful breakthrough attempt in the United States, was still a hit in Canada in 1988, going platinum (though just barely). The title track charted well, and the video for &quot;Fire&quot; grabbed attention by featuring the Canadian pop duo Tu as back-up singers.\n\nRenaming themselves &quot;The Blondes&quot; for their last release, 1990's Yeah Yeah Yeah, the group switched to their own label, &quot;Justin Entertainment&quot;. By 1991 the effort was deemed a failure and the band decided to venture into solo projects.\n\nMark Holmes went on to an acting career, appearing as guitarist Quinn Quinley in Eddie and the Cruisers II: Eddie Lives!. The entire group had also appeared as alien bikers in the 1988 episode Eye for an Eye of the television series War of the Worlds. Holmes played the aliens' leader, Red.\n\nIn 1999 and 2001, Mark Holmes toured again with Dave Barrett and Sasha Tukatch to promote the release of Seven Year Itch: 1982-1989, a Platinum Blonde best-of compilation.\n\nRumors of a reunion of the original band, and possibly some new material, have continued to swirl. As of July, 2006, the band has played a few charity concerts only. A DVD video compilation entitled Platinum Blonde: The Complete DVD Collection which was originally scheduled for release in 2005 has now been shelved for more production. According to the band's official website, the compilation consists of nine music videos as well as several bonus features.\n\n\n\n\n\n\nTracks:\n\n\nIt Doesnt Really Matter\nHoly Water\nAutomatic Drive\nAnimal\nNot In Love\nSad Sad Rain\nCrying Over You\nContact \nChaperone Sally\nSomebody Somewhere\nAll Fall Down\nLost in Space\nSituation Critical\nStanding in the Dark\nHungry Eyes\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:41b2e65505e3fac94ca5538a7d7e653d215e9e48","amp;dn":"Platinum+Blonde+-+7+Year+Itch+%28Greatest+Hits%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41b2e65505e3fac94ca5538a7d7e653d215e9e48","infoHashBuffer":{"type":"Buffer","data":[65,178,230,85,5,227,250,201,76,165,83,138,125,126,101,61,33,94,158,72]},"announce":[],"urlList":[]}}