{"title":"Bob Dylan: The Legendary 1971 Weberman Phone Conversation","uid":8128695,"size":98096764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42061e230371a1e5ea2783330cf0da3d40e7cd6d&amp;dn=Bob+Dylan%3A+The+Legendary+1971+Weberman+Phone+Conversation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1360542532,"description":"This legendary phone conversation between Dylan and Weberman is a riot! Weberman is so stupid and obnoxious that it's hard to understand why Dylan would waste an hour of his time talking to this moron, but the answer soon becomes obvious - Weberman is fascinating to talk to because his sheer lunacy takes your breath away. Despite Dylan's complaints to him and repeated references to A.J. as a &quot;pig&quot;, he continues to talk to him out of morbid curiosity. When Weberman says something at one point about some backwards messages on the New Morning album, Dylan can hardly believe his ears. He's completely stunned and it's hilarious to hear Weberman seriously putting forth the notion that the backwards-masked messages &quot;when Mars invades us&quot; and &quot;please don't expose me&quot; were deliberately put into a couple of Morning songs. When Dylan, completely lost at this point, asks what he's talking about Weberman says &quot;you know as well as I do because you put them there, man&quot;. This happens fairly early in the conversation and I would have said goodbye at that point, but Dylan hangs in there for more.\n\nWeberman also had the notion that some of the songs were written for him. Dylan quickly puts that idea to rest: &quot;I didn't even know about you when I wrote Dear Landlord&quot;. Dylan also affirms that Dear Landlord was not written about Grossman. He also states that his &quot;message&quot; songs were really messages to himself. In other parts of the conversation Dylan says how much he admires Johnny Cash and refuses to say one bad thing about the man. He also insists that his children be left out of any article Weberman has planned and says if they are included &quot;my wife will hit me, man&quot;. Dylan also reveals a strong animosity toward Roger McGuinn - &quot;Fuck him. You can put that in [your article] twice.&quot;\n\nIn another amusing exchange Dylan asks rhetorically who writes better songs than he does and Weberman replies &quot;I can name you a hundred&quot; to which Dylan replies &quot;bullshit!&quot;. Weberman proceeds to name some pretty lame songwriters (and non-songwriters such as Jack Elliot) along with some good ones and Dylan gives his opinions, mostly negative. John Lennon: &quot;never!&quot;, Creedence Clearwater: &quot;bullshit!&quot;, George Harrison: &quot;...maybe&quot;. Dylan's willingness to play this game with a twit like Weberman shows that he really gets a kick out of talking to this guy.\n\nWeberman's political rhetoric is comically dated, dropping phrases like &quot;White Panther&quot;, &quot;Weather Underground&quot;, &quot;capitalist pig&quot;, and his avowed purpose in annoying Dylan was to try to make him conform to his narrow idea of correct political thinking. The fact that Dylan is still here and all those pinhead &quot;revolutionaries&quot; of the late '60s and early '70s are long gone or have all jumped on the Reagan bandwagon speaks volumes. Listening to someone like Weberman talk for an hour leaves me no doubt as to why Dylan wanted to get away from the public eye for so long. ","torrent":{"xt":"urn:btih:42061e230371a1e5ea2783330cf0da3d40e7cd6d","amp;dn":"Bob+Dylan%3A+The+Legendary+1971+Weberman+Phone+Conversation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42061e230371a1e5ea2783330cf0da3d40e7cd6d","infoHashBuffer":{"type":"Buffer","data":[66,6,30,35,3,113,161,229,234,39,131,51,12,240,218,61,64,231,205,109]},"announce":[],"urlList":[]}}