{"title":"The National - Discography (2001-2011) [FLAC]","uid":8069821,"size":2379884969,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42cbd1fce2ce31f8f5d201b62e13b3b29faaf19c&amp;dn=The+National+-+Discography+%282001-2011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1359247077,"description":"\n  The National - Discography (2001-2011) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 800 - 1,000 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  Albums:\n\n  2001 - The National\n  2003 - Sad Songs for Dirty Lovers\n  2005 - Alligator (Limited Expanded Edition)\n  2007 - Boxer \n  2010 - High Violet\n\n  EP's:\n \n  2004 - Cherry Tree\n  2007 - Extras\n  2008 - The Virginia\n \n  Singles: \n\n  2007 - Mistaken for Strangers\n  2011 - Think You Can Wai\n\n  Although formed during the post-punk revival of the late '90s, the National took inspiration from a wider set of influences, including country-rock, Americana, indie rock, and Britpop. The lineup began taking shape in Ohio and officially cemented itself in New York, with baritone vocalist Matt Berninger joining forces with two sets of brothers - Scott (bass) and Bryan Devendorf (drums), and Aaron (guitar) and Bryce Dessner (guitar). After establishing themselves as a live act, the bandmates made their studio debut with The National, a self-titled record that appeared in 2001 to considerable acclaim. Two years later, the band returned with Sad Songs for Dirty Lovers, a deft blending of alternative country and chamber pop that found the band partnering with producer Peter Katis.\n\n  The National continued working with Katis throughout the rest of the decade. Following the release of an EP, Cherry Tree, in 2004, the band signed with Beggars Banquet and released Alligator. Although sales were modest, Alligator proved to be one of the year's most critically approved releases. 2007's Boxer, an ambitious effort that featured orchestration by the Clogs' Padma Newsome and piano by Sufjan Stevens, fared similarly well. It also became the band's first album to chart fairly well, peaking at number 67 on the Billboard 200.\n \n  A documentary by French filmmaker Vincent Moon was released in 2008, capturing the band during the Boxer recording sessions. That same year, the National released The Virginia EP, a collection of new material and various B-sides, and began working on a new studio album with Katis. High Violet appeared two years later, earning the guys the highest marks of their career and going gold in multiple countries.","torrent":{"xt":"urn:btih:42cbd1fce2ce31f8f5d201b62e13b3b29faaf19c","amp;dn":"The+National+-+Discography+%282001-2011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42cbd1fce2ce31f8f5d201b62e13b3b29faaf19c","infoHashBuffer":{"type":"Buffer","data":[66,203,209,252,226,206,49,248,245,210,1,182,46,19,179,178,159,170,241,156]},"announce":[],"urlList":[]}}