{"title":"Long Live The Queen (Latest Version) (MAC) (GOG)","uid":10430917,"size":67289614,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:43698d1d375882e9fb1a95c098c898ec24888cec&amp;dn=Long+Live+The+Queen+%28Latest+Version%29+%28MAC%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sarah116","files":-1,"time":1403800138,"description":"Hey guys, here &quot;Long live the queen&quot;. This is the official mac version and it already patched with the 1.2.22 patch. Hope you guys enjoy and please help seed.\n\n\n\n---------------------\n\nLong Live The Queen (1.2.22 Patch Notes)\n\n- A 'Skip Ahead' button in dialog to rapidly move through interactions you've seen before. \n\n- A toggle in preferences to hide or show the Skip Ahead option. \n\n- Display on the skill screen of what skills currently have bonuses or penalties based on the current mood. \n\n- Clearer notification if no skill text is unlocked due to studying a skill you have a penalty for. \n\n- Version number displayed on preferences screen (lower right corner) \n\n- Improved support for fan translations \n\n\n---------------------\n\n\nBonus content included for FREE with purchase: \n\n- 17 Avatars \n\n- 2 Wallpapers \n\n- Map of Nova\n\n\n------------------\n\n\nWhat's cool about it:\n\n\n- Deceptively adorable graphics hide a deadly interior. Collect all the ways to die!\n\n-Every decision unlocks further consequences down the line, allowing you to shape the future of your character and her country with the skills you choose to pursue.\n\n- Uncover secret plots, outwit invasions, unlock mystical powers, dodge assassins, and get your enemies before they get you.\n\n\nOverview:\n\nBeing a Princess is not an easy job. Being a Queen is even harder. Especially when you're only fourteen years old, and the reason you've inherited the throne is that your royal mother has just met an untimely end.\n\nNow power is up for grabs. You may be the official heir, but much of the country's nobility would love to steal the throne for themselves. Aggressive neighbors will take advantage of any weakness to enlarge their borders at your expense. And that's not even mentioning the magical dangers which are lying in wait...\n\nCan you survive long enough to reach your coronation?\n\n  &lt;a href=&quot;\nhttp://www.gog.com/game/long_live_the_queen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/long_live_the_queen&lt;/a&gt;\n","torrent":{"xt":"urn:btih:43698d1d375882e9fb1a95c098c898ec24888cec","amp;dn":"Long+Live+The+Queen+%28Latest+Version%29+%28MAC%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43698d1d375882e9fb1a95c098c898ec24888cec","infoHashBuffer":{"type":"Buffer","data":[67,105,141,29,55,88,130,233,251,26,149,192,152,200,152,236,36,136,140,236]},"announce":[],"urlList":[]}}