{"title":"The Little Prince - Antoine De Saint-Exupery","uid":12916947,"size":1722735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4387212278c9de4ca2779b0ddfc63fc596796ca7&amp;dn=The+Little+Prince+-+Antoine+De+Saint-Exupery&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":7,"time":1449359835,"description":"The Little Prince - Antoine De Saint-Exupery\r\n\r\n\r\n\r\nThe Little Prince is a classic tale of equal appeal to children and adults. On one level it is the story of an airman's discovery, in the desert, of a small boy from another planet - the Little Prince of the title - and his stories of intergalactic travel, while on the other hand it is a thought-provoking allegory of the human condition. First published in 1943, the year before the author's death in action, this translation contains Saint-Exupery's delightful illustrations.\r\n\r\nThe Tale of the Rose - The Passion That Inspired The Little Prince - Consuelo De Saint-Exupery\r\n\r\n\r\n\r\nIn the spring of 1944, Antoine de Saint-Exupéry left his wife, Consuelo, to return to the war in Europe. Soon after, he disappeared while flying a reconnaissance mission over occupied France. Neither his plane nor his body was ever found. The Tale of the Rose is Consuelo’s account of their extraordinary marriage. It is a love story about a pilot and his wife, a man who yearned for the stars and the spirited woman who gave him the strength to fulfill his dreams.Consuelo Suncin Sandoval de Gómez and Antoine de Saint-Exupéry met in Buenos Aires in 1930—she a seductive young widow, he a brave pioneer of early aviation, decorated for his acts of heroism in the deserts of North Africa. He was large in his passions, a fierce loner with a childlike appetite for danger. She was frail and voluble, exotic and capricious. Within hours of their first encounter, he knew he would have her as his wife.Their love affair and marriage would take them from Buenos Aires to Paris to Casablanca to New York. It would take them through periods of betrayal and infidelity, pain and intense passion, devastating abandonment and tender, poetic love. Several times in the course of their marriage they would go their separate ways, but always they would return. The Tale of the Rose is the story of a man of extravagant dreams, and of the woman who was his muse, the inspiration for the Little Prince’s beloved rose—unique in all the world—whom he could not live with and could not live without.Written on Long Island in a quiet spell of reconciliation, The Little Prince was Antoine’s greatest gift to the woman he never stopped loving, the only child to emerge from their union. The Tale of the Rose is Consuelo’s reply—the love letter she never could write to her husband—a fable of its own, just as magical, poetic, and tragic as The Little Prince","torrent":{"xt":"urn:btih:4387212278c9de4ca2779b0ddfc63fc596796ca7","amp;dn":"The+Little+Prince+-+Antoine+De+Saint-Exupery","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4387212278c9de4ca2779b0ddfc63fc596796ca7","infoHashBuffer":{"type":"Buffer","data":[67,135,33,34,120,201,222,76,162,119,155,13,223,198,63,197,150,121,108,167]},"announce":[],"urlList":[]}}