{"title":"Jimi Hendrix 24 Bit Vinyl Pack","uid":8610770,"size":8913271858,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43da9b5557abb921f43d9f2f7194ef9fb462db47&amp;dn=Jimi+Hendrix+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1372127793,"description":"  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n \n  Jimi Hendrix 24 Bit Vinyl Pack\n\n  * Genres: Pop/Rock, R&amp;B\n  * Styles: Album Rock, Blues-Rock, Hard Rock, Acid Rock, Soul\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums:\n\n  * Purple Haze\n  * Hey Joe\n  * Electric Ladyland \n  * Burning of the Midnight Lamp\n  * Axis - Bold as Love\n  * Loose Ends\n  * Live at Woodstock\n  * Crash Landing\n  * Blues\n  * Are You Experienced\n\n  Artist Bio\n\n  * In his brief four-year reign as a superstar, Jimi Hendrix expanded the vocabulary of the electric rock guitar more than anyone before or since. Hendrix was a master at coaxing all manner of unforeseen sonics from his instrument, often with innovative amplification experiments that produced astral-quality feedback and roaring distortion. His frequent hurricane blasts of noise and dazzling showmanship -- he could and would play behind his back and with his teeth and set his guitar on fire -- has sometimes obscured his considerable gifts as a songwriter, singer, and master of a gamut of blues, R&amp;B, and rock styles.\n\n  * When Hendrix became an international superstar in 1967, it seemed as if he'd dropped out of a Martian spaceship, but in fact he'd served his apprenticeship the long, mundane way in numerous R&amp;B acts on the chitlin circuit. During the early and mid-'60s, he worked with such R&amp;B/soul greats as Little Richard, the Isley Brothers, and King Curtis as a backup guitarist. Occasionally he recorded as a session man (the Isley Brothers' 1964 single &quot;Testify&quot; is the only one of these early tracks that offers even a glimpse of his future genius). But the stars didn't appreciate his show-stealing showmanship, and Hendrix was straight-jacketed by sideman roles that didn't allow him to develop as a soloist. The logical step was for Hendrix to go out on his own, which he did in New York in the mid-'60s, playing with various musicians in local clubs, and joining white blues-rock singer John Hammond, Jr.'s band for a while.\n\n  * It was in a New York club that Hendrix was spotted by Animals bassist Chas Chandler. The first lineup of the Animals was about to split, and Chandler, looking to move into management, convinced Hendrix to move to London and record as a solo act in England. There a group was built around Jimi, also featuring Mitch Mitchell on drums and Noel Redding on bass, that was dubbed the Jimi Hendrix Experience. The trio became stars with astonishing speed in the U.K., where &quot;Hey Joe,&quot; &quot;Purple Haze,&quot; and &quot;The Wind Cries Mary&quot; all made the Top Ten in the first half of 1967. These tracks were also featured on their debut album, Are You Experienced, a psychedelic meisterwerk that became a huge hit in the U.S. after Hendrix created a sensation at the Monterey Pop Festival in June of 1967.\n\n  * Are You Experienced was an astonishing debut, particularly from a young R&amp;B veteran who had rarely sung, and apparently never written his own material, before the Experience formed. What caught most people's attention at first was his virtuosic guitar playing, which employed an arsenal of devices, including wah-wah pedals, buzzing feedback solos, crunching distorted riffs, and lightning, liquid runs up and down the scales. But Hendrix was also a first-rate songwriter, melding cosmic imagery with some surprisingly pop-savvy hooks and tender sentiments. He was also an excellent blues interpreter and passionate, engaging singer (although his gruff, throaty vocal pipes were not nearly as great assets as his instrumental skills). Are You Experienced was psychedelia at its most eclectic, synthesizing mod pop, soul, R&amp;B, Dylan, and the electric guitar innovations of British pioneers like Jeff Beck, Pete Townshend, and Eric Clapton.\n\n  *  Amazingly, Hendrix would only record three fully conceived studio albums in his lifetime. Axis: Bold as Love and the double-LP Electric Ladyland were more diffuse and experimental than Are You Experienced On Electric Ladyland in particular, Hendrix pioneered the use of the studio itself as a recording instrument, manipulating electronics and devising overdub techniques (with the help of engineer Eddie Kramer in particular) to plot uncharted sonic territory. Not that these albums were perfect, as impressive as they were; the instrumental breaks could meander, and Hendrix's songwriting was occasionally half-baked, never matching the consistency of Are You Experienced (although he exercised greater creative control over the later albums).","torrent":{"xt":"urn:btih:43da9b5557abb921f43d9f2f7194ef9fb462db47","amp;dn":"Jimi+Hendrix+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43da9b5557abb921f43d9f2f7194ef9fb462db47","infoHashBuffer":{"type":"Buffer","data":[67,218,155,85,87,171,185,33,244,61,159,47,113,148,239,159,180,98,219,71]},"announce":[],"urlList":[]}}