{"title":"Cooke-Debacle in Yugoslavia(Mystery Babylon)(2000)","uid":4540088,"size":162357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43f3ba03b8ab718aacc0d5b631b321f36500aa35&amp;dn=Cooke-Debacle+in+Yugoslavia%28Mystery+Babylon%29%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227904973,"description":"This is Ronald Cooke&amp;#039;s amazing book Debacle in Yugoslavia - Another Study on Mystery Babylon-Mystery Confusion (2000) which explains how NATO actually applied Vatican policy for Central Europe during the latest civil war in former Yugoslavia. Many conservative writers are concerned with the one-worldism which they perceive to be written large in the agenda of the United States government. What they do not seem to perceive is that much of this international or global thrust actually comes from the representatives of the Vatican in the US State Department. Almost every move that the US makes in Latin America is taken in conjunction with the information supplied by the Roman Catholic church. The debacle in Kosovo has all the marks of Vatican propaganda tied to it. With the NATO Command working under, pledged to, and held together by the TREATY OF ROME, the US joined in to help implement the substance of that very Treaty. The propaganda which erupted in the US in support of the NATO action was incredible to behold. In the case of armed rebellion a sovereign state has the right to defend itself. And Milosevic should have had that right, but instead the Clinton Administration in league with NATO and the Treaty of Rome decided that the KLA rebels were right and the sovereign state wrong in defending itself. From 1980 the Serbs have been systematically purged from Croatia and Bosnia. An estimated 1,200,000 have been driven from other states of Yugoslavia. The ethnic cleansing was allowed to proceed without so much as whisper of protest by that gallant defender of the oppressed, Bill Clinton. So not only was no bombing campaign launched by the US and NATO, there was not even a word of protest. The Vatican was the first &quot;state&quot; to recognize Roman Catholic Croatia when it illegally seceded from Yugoslavia. Bosnia then separated from Yugoslavia and again the US quickly recognized it as a Muslim State even though one third of the population was Serbian Orthodox Christian. Again the Serbs fought to save themselves from being driven out of what once had been their own country. Outside forces were again brought in to implement the Treaty of Rome and drive out and keep out the Serbs. Over one million Serbs have been driven out of Bosnia and not allowed to return. Mystery Babylon UN soldiers are there to keep the Serbs out of their own country. One honest speaker on C-Span noted that Yugoslavia was a truly multi-ethnic state comprised of no less than 22 different nationalities all living together peaceably until Croatia broke away and started the divisions which have plagued the whole region ever since. Find out how Vatican policy of divide and conquer was at play when the war in former Yugoslavia erupted thus enabling national extremists to take over and destroy the idea of brotherhood among the Balkan nations. 40 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:43f3ba03b8ab718aacc0d5b631b321f36500aa35","amp;dn":"Cooke-Debacle+in+Yugoslavia%28Mystery+Babylon%29%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f3ba03b8ab718aacc0d5b631b321f36500aa35","infoHashBuffer":{"type":"Buffer","data":[67,243,186,3,184,171,113,138,172,192,213,182,49,179,33,243,101,0,170,53]},"announce":[],"urlList":[]}}