{"title":"MILF 1708 - Mother's Sacrifices (1080p) [Rachel Steele]","uid":13467588,"size":523112470,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:445a5f68e6ce8f68a0608dfccb0d7f63e8df2897&amp;dn=MILF+1708+-+Mother%27s+Sacrifices+%281080p%29+%5BRachel+Steele%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xxxsunset","files":1,"time":1454953269,"description":"Screenshots: \nhttp://imgur.su/image/RXgG\r\n\r\nLength: 18 minutes\r\nSize: 498 MB\r\nFormat: MKV\r\nResolution: 1920x1080\r\n\r\nRachel struggled to pay the bills after her husband passed away. Reluctantly she became an escort working from home. One day her son came back earlier than expected and spied on her having sex with a sleazy client. She clearly was not enjoying herself. To make matters worse, the client paid her less than she had asked. Later, Rachel was trying to forget the encounter when her son approached and told her that he had seen everything that took place. The mother had no choice but to come clean. She told her son that she was only being an escort to provide him with the best opportunities in life. Her son was very touched by this. He was also turned on by the sight of his mom in such a revealing dress. Suddenly he wanted to become her man. After declaring that he would take care of her so that she no longer had to be an escort, he lunged forward and kissed her on the mouth. Rachel was startled. But her body reacted favorably. Soon she was opening her dress so that her son could fondle and suckle on her breasts. She then slid her panties off, parted her legs wide, and invited him to lick her exposed pussy. Further foreplay followed in Rachel's room. There she sucked hungrily on her son's cock while in the sixty-nine position with him. Hot on the heels of that came a passionate missionary style fuck that ended with Rachel taking her son's cum inside of her even as she had an orgasm around his plunging cock. Afterwards, the taboo twosome lay cuddling each other in happy exhaustion. Everything was different now. Rachel's son had shown he could be the man of the house. She knew she could rely him in the future, and never have to work as a prostitute again","torrent":{"xt":"urn:btih:445a5f68e6ce8f68a0608dfccb0d7f63e8df2897","amp;dn":"MILF+1708+-+Mother%27s+Sacrifices+%281080p%29+%5BRachel+Steele%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"445a5f68e6ce8f68a0608dfccb0d7f63e8df2897","infoHashBuffer":{"type":"Buffer","data":[68,90,95,104,230,206,143,104,160,96,141,252,203,13,127,99,232,223,40,151]},"announce":[],"urlList":[]}}