{"title":"HISTORY OF POP AND ROCK MUSIC - part 003","uid":6495679,"size":343300408,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:45840ed4005a8cf2561fe497aac47f7853682d60&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+003&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1309058513,"description":"                        PART 03\n\n\n                   PROCOL HARUM  - A whiter shade of pale  (1967)\n                   MOODY BLUES - Nights in White Satin   (1967)\n                   BEE GEES  -  Holiday  (1967)\n                   THE BEATLES - Fool on the hill  (1967)\n                   THE BEATLES - Your mother should know  (1967)\n\n\n\n           &quot;Whiter Shade Of Pale&quot; is a song released in 1967 by the band Procol Harum. With its haunting tonality and Bach flavouring, both provided by Hammond organist Matthew Fisher , vocals by Gary Brooker, and mysterious lyrics by Keith Reid, &quot;A Whiter Shade of Pale&quot; reached #1 on the British charts, was a hit in Europe, and reached #5 in the United States. In the years since, it has become an enduring classic, and has earned extensive critical acclaim. Rolling Stone magazine placed &quot;A Whiter Shade Of Pale&quot; as #57 of its 500 Greatest Songs of All Time in 2004. British TV station Channel 4 also placed the song at #19 in its chart of the 100 greatest number one singles. The Hammond organ line of &quot;A Whiter Shade of Pale&quot; was inspired by the Johann Sebastian Bach's &quot;Sleepers Awake&quot; and &quot;Air on a G String&quot;, but contrary to some belief, the song is not a direct copy or paraphrase of these or any other Bach piece.\n           &quot;Nights in White Satin&quot; is a 1967 song by The Moody Blues.It was not a popular title when first released. This was mainly due to its length, which at seven minutes and thirty-eight seconds was longer than the norm at that time. It was edited down to 4:25 and stripped of the orchestra and poetry reading on its original single release, backed with &quot;Cities&quot;. The song was re-released in 1972 after the success of such longer-running dramatic songs as &quot;Hey Jude&quot; and &quot;Layla&quot;, and it charted at #2 in the United States. Its original release in the United Kingdom reached #19. The song was re-released yet again in 1979, selling even more copies.\n            Bee Gees 1st is the debut album by The Bee Gees, released in July 1967. The group was successful for all of its forty years of recording music, but it had two distinct periods of exceptional success: as a harmonic &quot;soft rock&quot; act in the late 1960s and early 1970s, and as the foremost stars of the disco music era in the late 1970s.\n             Paul McCartney wrote this. It's about a man who is considered a fool by others, but whose foolish demeanor is actually an indication of wisdom. An event which prompted this song happened when Paul was walking his dog Martha, on Primrose Hill one morning. As he watched the sun rise, he noticed that Martha was missing. Paul turned around to look for his dog, and there a man stood, who appeared on the hill without making a sound. The gentleman was dressed respectably, in a belted raincoat. Paul knew this man had not been there seconds earlier as he had looked in that direction for Martha. Paul and the stranger exchanged a greeting, and this man then spoke of what a beautiful view it was from the top of this hill that overlooked London. Within a few seconds, Paul looked around again, and the man was gone. He had vanished as he had appeared. A friend of McCartney's, Alistair Taylor, was present with Paul during this strange incident, and wrote of this event in his book, Yesterday. Both Paul and Alistair could not imagine what happened to this man. He had seemed to vanish in thin air. The nearest trees for cover were too far to reach by walking or running in a few seconds, and the crest of the hill was too far as well to reach in that short time. What made the experience even more mysterious, was that just before this man first appeared, Paul and Alistair were speaking to each other of the beauty they observed of the view towards London and the existence of God. Once back home, they spent the morning discussing what had happened, trying to make some sense of it. They both agreed that this was something others were infer occurred as a result of an &quot;acid trip,&quot; but they both swore they had not taken or used any drugs. When Paul filmed the sequence for this song in the film, it shows him on a hilltop overlooking the town of Nica. \n          &quot;Your Mother Should Know&quot; is a song by The Beatles from their 1967 album Magical Mystery Tour. Its writing is credited to Paul McCartney and John Lennon, although Lennon's contributions were reportedly minimal.The song appeared in the last part of the movie Magical Mystery Tour.Paul is the only one wearing a black carnation, contributing to the &quot;Paul is Dead&quot; theory. ","torrent":{"xt":"urn:btih:45840ed4005a8cf2561fe497aac47f7853682d60","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+003","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45840ed4005a8cf2561fe497aac47f7853682d60","infoHashBuffer":{"type":"Buffer","data":[69,132,14,212,0,90,140,242,86,31,228,151,170,196,127,120,83,104,45,96]},"announce":[],"urlList":[]}}