{"title":"Omar Sosa - Mulatos [FLAC] TQMP","uid":4203988,"size":306886213,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:460d95e66382074ae64532c9afffd994f11b4451&amp;dn=Omar+Sosa+-+Mulatos+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pastafari","files":-1,"time":1211675514,"description":"Omar Sosa - Mulatos\n2004\n\nBrought to you by TQMP\nThe Quality Music Project\n\nOmar Sosa, the Cuban world jazz pianist, has made many fine albums (and a clunker or two, such as Free Roots), but has yet to reach his full potential. A very idiosyncratic artist, he has sometimes been too esoteric (Pictures of Soul, which is nevertheless one of the greatest discs ever recorded), too eclectic (Sentir, another great disc), too spare (A New Life, also great), or too outr? (Free Roots, not so great). \n\nAll that changes with Mulatos. Graced with a deep, dancing melodicism, uncanny rhythmic drive, a fabulous if way unlikely band (Sosa, piano, Fender Rhodes, harmonium, marimba, vibes, tubular bells, percussion, vocals, and samples; Dhafer Youssef (!), oud; Renaud Pion, clarinet, bass clarinet, contrabass clarinet; Deiter Ilg, acoustic bass; Steve Arguelles, drums; Philippe Foch, tabla, bowl; and Azia Arradl, guembri, qarqabas, vocal; with Paquito D'Rivera making an unlikely but thoroughly satisfying appearance on three numbers), state-of-the-art production (courtesy of producer Arguelles, who also produced Youssef's great disc, Digital Prophecy), this album manages to retain all the mystery, diversity (though this time properly contextualized), and even minimalism that has always characterized his best work. \n\nSo spectacular is the result that it almost defies belief. How could anyone make a disc at once this listenable and adventurous, this free and rigorous, this bubbly and melancholy, this simple and complex, this ancient and modern? How could anyone get such an unlikely aggregation of musicians to meld so seamlessly? How could such ravishing beauty coexist with such musical virtuosity? I don't know. But it does. \n\nMake no mistake, Sosa has been on a decades-long musical pilgrimage. If some of the aural missives he's sent back from the field have been less than captivating, each has played its part in contributing to the masterful transformation of folkloric materials (culled from the Caribbean, South America, North Africa, Spain, the Middle East, North America, Asia, and Europe) that almost magically, alchemically comes out of one's speakers on Mulatos. It's almost as if everything up till now (except, perhaps, Pictures of Soul and Ayaguna, which I think are unadulterated masterpieces) has been a fascinating though not entirely successful experiment, perhaps analogous to the promising but flawed early work of a writer who later went on to become a world-class novelist. \n\nAfter having listened to Mulatos scores of times, finding something new and intriguing every hearing, never tiring of its glories, never fearing to put it on out of a fear of being disappointed, always having it deliver, always being swept away by its brilliance, I've come to believe it's certainly the most wonderful music I own, and probably the greatest music I've ever heard.\n-- Jan P. Dennis &lt;a href=&quot;\nhttp://www.amazon.com/Mulatos-Omar-Sosa/dp/B0002XB8Y2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mulatos-Omar-Sosa/dp/B0002XB8Y2&lt;/a&gt;\n\nTracks\n1- Ternura\n2- Nuevo Manto\n3- La Tra\n4- Reposo\n5- La Llamada\n6- Dos Caminos\n7- Iyawo\n8- L3zero\n9- El Consenso\n\nArtwork (300dpi scan), EAC log and CUE sheet included.\n\nTools used -\nExact Audio Copy 0.99 prebeta 3\nFLAC frontend 1.7.1\nFLAC encoder/decoder 1.2.1\nreference libFLAC 1.2.1 20070917\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:460d95e66382074ae64532c9afffd994f11b4451","amp;dn":"Omar+Sosa+-+Mulatos+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"460d95e66382074ae64532c9afffd994f11b4451","infoHashBuffer":{"type":"Buffer","data":[70,13,149,230,99,130,7,74,230,69,50,201,175,255,217,148,241,27,68,81]},"announce":[],"urlList":[]}}