{"title":"Nanotechnology and Oncology - Workshop Summary","uid":15400624,"size":1375759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:467ec97d62f3208e941124da9d5b8b0859462796&amp;dn=Nanotechnology+and+Oncology+-+Workshop+Summary&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469451254,"description":"Nanotechnology and Oncology - Workshop Summary - Margie Patlak, Christine Micheel (NAP, 2011).pdf\r\n\r\nOne way scientists are working to overcome challenges in cancer treatment and improve cancer care is through nanotechnology. Nanotechnology, engineered materials that make use of the unique physical properties, presents a new array of medical prospects that will revolutionize cancer prevention, diagnosis, and treatment practices. Giving new hope to patients, practitioners, and researchers alike, nanotechnology has the potential to translate recent discoveries in cancer biology into clinical advances in oncology. While public investments in nanotechnology for cancer continue to increase, medical products based on nanotechnology are already on the market. \r\n\r\nThe National Cancer Policy forum held a workshop July 12-13, 2010, to explore challenges in the use of nanotechnology in oncology. Nanotechnology and Oncology evaluates the ongoing discussion on the role of nanotechnology in cancer as it relates to risk management, treatment, and regulatory policy. Assessments on nanomedicine and the physical properties of nanomaterials were presented during the workshop, along with an appraisal of the current status of research and development efforts","torrent":{"xt":"urn:btih:467ec97d62f3208e941124da9d5b8b0859462796","amp;dn":"Nanotechnology+and+Oncology+-+Workshop+Summary","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"467ec97d62f3208e941124da9d5b8b0859462796","infoHashBuffer":{"type":"Buffer","data":[70,126,201,125,98,243,32,142,148,17,36,218,157,91,139,8,89,70,39,150]},"announce":[],"urlList":[]}}