{"title":"ZD Soft Screen Recorder v8.1 Final + Keys {B4tman}","uid":12602807,"size":2443642,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:46fca0e8343b536d65140bc3d3ce0df54ef871c4&amp;dn=ZD+Soft+Screen+Recorder+v8.1+Final+%2B+Keys+%7BB4tman%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AliPaK","files":5,"time":1445346622,"description":"ZD Soft Screen Recorder v8.1 Final + Keys {B4tman}\r\n \nhttp://s27.postimg.org/69auormsj/screen_recorder_box_png_itok_i_Am_H_LXx.png\r\n\r\nDescription:-\r\n\r\nZD Soft Screen Recorder is a handy and comprehensive application which captures what you see on screen and what you hear or say. It is usually used to create software demos, capture streaming videos and record game plays.\r\nYou can save your recordings and screen captures to various video and image formats, then you can add a watermark to the output files.\r\n\r\nFeatures:-\r\n\r\nDesktop Screen Recording:-\r\n\r\nWindows desktop recording is a basic feature of a screen recorder. Most of the other screen recorders implement this feature using traditional GDI screen capture techniques. This may cause slight frame lags on Windows Vista or later versions of Windows, because the UI rendering is accelerated by 3D graphics hardware and the traditional GDI screen capture techniques may stall the graphics pipelines. ZD Soft Screen Recorder implements advanced screen capture techniques to capture Windows desktop without lags. This guarantees the smoothest desktop recording experience.\r\n\r\nGame Screen Recording:-\r\n\r\nPC game screen recording is an advanced feature of a screen recorder. Most of the other screen recorders don't have this feature as they intend to capture everything using traditional GDI screen capture techniques, but it usually doesn't work well with PC games, especially with full screen 3D games. ZD Soft Screen Recorder implements different advanced screen capture techniques for different types of PC games. Most of the OpenGL/Direct 3D games are supported by ZD Soft Screen Recorder, so that smooth game recording experience can be guaranteed.\r\n\r\nWebcam Overlay Recording:-\r\n\r\nWebcam overlay is a useful feature for creating tutorial videos. A tutorial video with your image shown on the corner would be very appealing. This job is usually done by video editing software if you use a screen recorder without a webcam overlay feature, and it would be a cumbersome work. With ZD Soft Screen Recorder's webcam overlay feature, you can embed your image in a recording video simultaneously. This makes it a sharp tool for creating tutorial videos.\r\n\r\nVideo Sound Recording:-\r\n\r\nSound recording is an essential feature of a screen recorder, especially for capturing streaming videos and recording PC games. Most of the other screen recorders only support recording from a single audio source, so it's almost impossible for them to record both the system audio and your voice together. ZD Soft Screen Recorder supports recording from 2 audio sources simultaneously. This makes it possible to record both the system audio and your voice together.\r\n\r\nMore Features:-\r\n\r\n• Real time video compression enables unlimited recording length.\r\n• Arbitrary video resolutions and frame rates are supported.\r\n• Smooth screen recording without lagging your system.\r\n• Fully optimized for modern dual/quad•core CPUs.\r\n• Both AVI and WMV output formats are supported.\r\n• Perfect audio/video synchronization.\r\n• Capable of pausing/resuming a recording by hitting a hotkey at any time.\r\n• Capable of starting/stopping a recording automatically by a scheduled timer.\r\n• Capable of capturing OpenGL, DirectDraw, Direct3D 8/9/10/11 rendered screen content.\r\n• Capable of capturing multiple audio sources at the same time, e.g., both speaker and microphone.\r\n• Capable of capturing what you hear even if no &quot;Stereo Mix&quot; is available.\r\n• Capable of capturing screenshots by a hotkey.\r\n\r\nSystem Requirements:-\r\n\r\nOS: Windows XP/Vista/7/8/8.1/10\r\n• Intel/AMD Dual•Core 1.5GHz or faster CPU\r\n• 1GB or more RAM\r\n• 10GB or more free disk space\r\n• Windows Media Player 9 or higher version","torrent":{"xt":"urn:btih:46fca0e8343b536d65140bc3d3ce0df54ef871c4","amp;dn":"ZD+Soft+Screen+Recorder+v8.1+Final+%2B+Keys+%7BB4tman%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46fca0e8343b536d65140bc3d3ce0df54ef871c4","infoHashBuffer":{"type":"Buffer","data":[70,252,160,232,52,59,83,109,101,20,11,195,211,206,13,245,78,248,113,196]},"announce":[],"urlList":[]}}