{"title":"(ipod) Veggie tales Ester: the Girl Who Became Queen (ipod, mp4)","uid":4831179,"size":257518230,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:4712b4446abe17bc5b655f9b071dc2443171725c&amp;dn=%28ipod%29+Veggie+tales+Ester%3A+the+Girl+Who+Became+Queen+%28ipod%2C+mp4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"JWS0","files":1,"time":1239134825,"description":"Esther... The Girl Who Became Queen is the 14th episode in the VeggieTales animated series. Subtitled &quot;A Lesson in Courage&quot;, it conveys the message that you do not need to be afraid to do what is right. The story is taken from the Book of Esther in the Old Testament, in which Esther becomes Queen and must tell King Xerxes that his prime minister Haman is plotting to commit genocide against the Jews. The violence is, of course, removed for this VeggieTales production; murder is replaced by banishment to the &quot;Island of Perpetual Tickling,&quot; and the intended victims are limited to Esther and her family without reference to their race or creed.\n\nThe presentation of the story was inspired by The Godfather and Casablanca and has stylistic elements of a Film noir. The dramatic lighting, deep shadows, dark plot elements, and narrative voiceovers all contribute to the effect. The palace windows are even hung with Venetian blinds, an iconic element of the genre.\n\nThe story opens at a palace in Persia where Haman, the King's right-hand-man, is throwing the Queen out onto the street for insubordination (refusing to make a sandwich for the King at 3 am). A search is initiated to find a new Queen.\n\nThe following day, Esther and her cousin Mordecai are talking on the street. Esther is asking for Mordecai's advice, but his questions reveal that Esther knows what to do but that she lacks the courage to do it. He tells her that she should not be afraid to do what is right: to confront Esther's friend, who stole an apple.\n\nWhen Haman drives up in a favorite car-wagon (styled after modern &quot;low-rider&quot; automobiles) to collect the eligible maidens, Mordecai tries to hide. (Haman despises Mordecai and is determined to do him harm.) They confront each other, with Haman posturing and threatening Mordecai. Mordecai refuses to bow to anyone but God and Haman vows to banish him and his family to the &quot;Island of Perpetual Tickling.&quot; The relationship between Mordecai and Esther is kept secret, and Haman takes Esther to the palace with the other young women to participate in the beauty contest.\n\nAt the palace, King Xerxes and Haman audition the girls for a new Queen. When Esther takes the stage and sings, the King is left in awe and the decision is made. However, since Esther does not wish to be the Queen, she is crowned and ensconced in her new life against her will.\n\nOne day in the throne room of the Perisan place, the King is visited by the Peaoni brothers (the Royal bakers), who have brought a large cake to honor the King. Although unannounced visitors are not permitted, the King allows them to be heard. While one brother convinces the King to come look closely at the cake, the other brother is hanging onto a rope, the other end of which supports a grand piano suspended above the cake. Mordecai, who is hiding in a corner to avoid Haman, observes the plot and informs Esther. Esther warns the King in time and the piano crashes harmlessly onto the cake. The King thanks her for saving his life, but she indicates Mordecai, saying that the credit should be his. The Peaoni brothers at banished to the Island of Perpetual Tickling, escorted by a cartoonish charactor resembling &quot;Death.&quot;\n\nWith the Peaoni brothers banished, the King believes he is safe, but Haman convinces him that a greater threat awaits. Mordecai and his family cannot be trusted, he claims, and pose an imminent danger to the King. The King unwittingly authorizes a edict to have Mordecai and his family banished to the Island of Perpetual Tickling.\n\nMordecai finds the edict posted on the wall in the streets of Perisa and visits Esther on her balcony at the palace. He appeals to his cousin to reveal Haman's evil plans to the King, but she is afraid. She lacks the courage to confront the King and struggles with what to do. She knows she need not fear to do what's right, but action does not come easy for her. Twice she attempts to inform the King, and twice she fails, lamely Esther inviting King Xerxes and Haman to dinner instead.\n\nMeanwhile, Haman has been instructed by the King to throw a parade in honor of the man who saved his life, not realizing that this is Mordecai, the same man whose family Haman wishes to destroy.\n\nOn her third attempt Esther is able to muster up the courage to face the King. She reveals that Mordecai is her cousin and that Haman has been plotting to destroy him and his family, which includes her. The King, who respects Mordecai and loves Esther, believes her and turns on Haman. He banishes Haman to the Island of Perpetual Tickling.\n\nMordecai ends up filling in Haman's former position as the King's right-hand-man. Esther saves the people.\n\nThis episode does not include the usual &quot;VeggieTales Theme&quot; and &quot;What We Have Learned&quot; songs. It does contain the following songs:\n\n    * Tell Me Why, sung by Esther\n    * The Battle Prelude, sung by Esther\n    * Haman's Song, sung by Haman with King Xerxes\n    * The Battle Is Not Ours, sung by Esther\n    * Lost Puppies, sung by Miss Achmetha\n\n\n\nMP4\nIpod","torrent":{"xt":"urn:btih:4712b4446abe17bc5b655f9b071dc2443171725c","amp;dn":"%28ipod%29+Veggie+tales+Ester%3A+the+Girl+Who+Became+Queen+%28ipod%2C+mp4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4712b4446abe17bc5b655f9b071dc2443171725c","infoHashBuffer":{"type":"Buffer","data":[71,18,180,68,106,190,23,188,91,101,95,155,7,29,194,68,49,113,114,92]},"announce":[],"urlList":[]}}