{"title":"Home Thoughts from Abroad - Clifford T Ward","uid":4946374,"size":41139206,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4740080542dd9fc9b6f14fe996c3a0abf00c3640&amp;dn=Home+Thoughts+from+Abroad+-+Clifford+T+Ward&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pidsea","files":17,"time":1244673634,"description":"1. Gaye\n2. Wherewithal\n3. The Dubious Circus Company\n4. Nightingale\n5. Where Would That Leave Me\n6. The Traveller\n7. Home Thoughts From Abroad\n8. Where's It Going To End\n9. Time, The Magician\n10. Give Me One More Chance\n11. Cold Wind Blowing\n12. The Open University\n13. Crisis\n\n\nClifford T. Ward\nBiography (Encyclopedia of Popular Music\nCopyright Muze UK Ltd. 1989 - 2002)\n\nClifford T. Ward typified the early 70s bedsitter singer-songwriter with a series of albums that were at best delightful \nand at worst mawkish. Ward left grammar school before A-levels to work as a clerk, but by 1962 was fronting local beat \ngroup Cliff Ward and the Cruisers. The group changed their name to Martin Raynor and the Secrets and made their recording \ndebut for EMI Records in 1965, before recording several more tracks as the Secrets for CBS Records.\n\n\nIn 1967 Ward enrolled at Worcester teacher training college to study English and divinity, after which he taught at \nBromsgrove high school. His debut album appeared on disc jockey John Peel's brave-but-doomed Dandelion Records label in \n1972. His second album and his first release for Charisma Records, Home Thoughts, proved to be his finest work and gave \nhim wider recognition. Ward constructed each song as a complete story sometimes with great success.\n\nThe beautiful &quot;Gaye&quot; became a UK Top 10 hit but surprisingly the stronger &quot;Home Thoughts From Abroad&quot; and the infectious \nand lyrically excellent &quot;Wherewithal&quot; failed to chart. Mantle Pieces and Escalator contained a similar recipe of more \nharmless tales like the minor hit &quot;Scullery&quot; with affecting lyrics like; &quot;You're my picture by Picasso, you'd brighten up \nany gallery'.\n\nWard's refusal to tour and promote his songs did not help endear the singer to his record company, however, and he \nswitched to the Phonogram Records label for 1975&quot;s No More Rock 'N' Roll.\nIn later years although still recording the occasional album and still reluctant to perform live, Ward received kudos as \na songwriter with his material being recorded by artists such as Cliff Richard, Art Garfunkel and Justin Hayward.\n\nHe was struck down with multiple sclerosis in 1987 and his health rapidly deteriorated. He managed to record 1991's \nvinyl-only album Laugh It Off, and friends and colleagues pieced together two more albums of new songs, out-takes and \ndemos to give the ailing Ward some financial assistance. He finally succumbed to pneumonia in December 2001.","torrent":{"xt":"urn:btih:4740080542dd9fc9b6f14fe996c3a0abf00c3640","amp;dn":"Home+Thoughts+from+Abroad+-+Clifford+T+Ward","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4740080542dd9fc9b6f14fe996c3a0abf00c3640","infoHashBuffer":{"type":"Buffer","data":[71,64,8,5,66,221,159,201,182,241,79,233,150,195,160,171,240,12,54,64]},"announce":[],"urlList":[]}}