{"title":"Dietrich von Hildebrand - What Is Philosophy? (pdf)","uid":10168523,"size":1797321,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:474f6adf388595ba3fd5660e940a4c1274ea24c2&amp;dn=Dietrich+von+Hildebrand+-+What+Is+Philosophy%3F+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":3,"time":1400377210,"description":"Dietrich von Hildebrand - What Is Philosophy? (Franciscan Herald Press, 1960, 1973). 242 pp.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nExtremely scarce book by a conservative Catholic philosopher and spiritual writer not as well-known as he ought to be.\n\n\ndescription:\n\nIn &quot;What is Philosophy?&quot; the philosopher Dietrich von Hildebrand analyzes the datum of knowledge itself in its different forms, from the most casual perception of some object in our naive experience to &quot;a priori knowledge&quot;, taken as consisting of absolutely certain insights into &quot;necessary essences&quot;. Plato's central teaching about the kind of human knowledge which transcends the world of time and of becoming is here clarified and deepened. Precise lines are drawn which distinguish empirical knowledge, such as is found in the physical sciences, from a priori knowledge. Von Hildebrand also draws lines which distinguish fruitful a priori knowledge (synthetic a priori) from mere tautologies. Von Hildebrand's method is thus sharply opposed to the analytic school of philosophy. This book should be of interest to advanced students and teachers of philosophy.","torrent":{"xt":"urn:btih:474f6adf388595ba3fd5660e940a4c1274ea24c2","amp;dn":"Dietrich+von+Hildebrand+-+What+Is+Philosophy%3F+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"474f6adf388595ba3fd5660e940a4c1274ea24c2","infoHashBuffer":{"type":"Buffer","data":[71,79,106,223,56,133,149,186,63,213,102,14,148,10,76,18,116,234,36,194]},"announce":[],"urlList":[]}}