{"title":"Avivah Zornberg - Genesis: The Beginning of Desire (pdf)","uid":10465741,"size":9464786,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47b7158f3ef8653ee362e788cd02c08a4f6f1987&amp;dn=Avivah+Zornberg+-+Genesis%3A+The+Beginning+of+Desire+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1404188710,"description":"Avivah Gottlieb Zornberg - Genesis: The Beginning of Desire (Jewish Publication Society, 1995). 456 pp.\n\nMy own reprocessed version of a found djvu file. This one is a searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nAn intellectually stimulating and personally uplifting exploration of Genesis. Genesis: the Beginning of Desire breathes new life into the stories of Adam and Eve, Noah, Abraham and Sarah, Isaac, Jacob and Esau, Rachel, and Joseph. Zornberg brings biblical, midrashic, and literary sources together, weaving them into a seamless tapestry and illuminating the tensions that grip human beings as they search for and encounter God.\n\nreview:\n\nIn these reflections on Genesis, Cambridge scholar Zornberg combines the contributions of contemporary biblical criticism, in-depth exegesis, and prosaic exposition to produce spectacular readings of this first book of Torah. Basing this book on weekly lectures given in Jerusalem, Zornberg attempts to lead her hearers and readers beyond the fixed meanings so often ascribed to the biblical text. Instead, her readings urge readers to take seriously their task of cocreating the meanings of the text. A beautiful and arresting exercise in biblical literary criticism.\n","torrent":{"xt":"urn:btih:47b7158f3ef8653ee362e788cd02c08a4f6f1987","amp;dn":"Avivah+Zornberg+-+Genesis%3A+The+Beginning+of+Desire+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47b7158f3ef8653ee362e788cd02c08a4f6f1987","infoHashBuffer":{"type":"Buffer","data":[71,183,21,143,62,248,101,62,227,98,231,136,205,2,192,138,79,111,25,135]},"announce":[],"urlList":[]}}