{"title":"The Apache Relay - American Nomad [2011] [FLAC]","uid":8209105,"size":258778163,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:48287e51d7ece5ecdd8397ababe57930a031fbf7&amp;dn=The+Apache+Relay+-+American+Nomad+%5B2011%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":13,"time":1362192261,"description":"one of Dicks Americana collection\n\nArtist: The Apache Relay\nRelease: American Nomad\nDiscogs: 3769612\nReleased: 2011\nLabel: Nomadic Records\nCatalog#: NR002 / NR001\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Folk, World, &amp; Country, \n\nTracklisting:\n\n01. Can't Wake Up\n02. Power Hungry Animals\n03. Set Me Free\n04. Mission Bells\n05. State Trooper\n06. Lost Kid\n07. Watering Hole\n08. American Nomad\n09. When I Come Home\n10. Home Is Not Places\n11. Some People Change\n\nCredits: Show\n\nAs the Apache Relay's follow up to their critically lauded debut, American Nomad has been widely anticipated by many people who identified this band as one to watch. The previous album by this Nashville-based ensemble was produced by Doug Williams who has worked with the Avett Brothers. That album entitled 1988 reflected the Avett's warm acoustic sensibilities.\n\nAmerican Nomad is an ambitious step forward for this young band. Enlisting Mississippian Neilson Hubbard to produce gives a strong indication of what lies inside the grooves. Hubbard favors producing complex pop records that are intelligently done. It should be no surprise that he has ably built upon the Apache Relay's strong acoustic foundation to create something far beyond standard Americana fare.\n\nPerhaps the best example of this is on the second track &quot;Power Hungry Animals.&quot; It starts with only a voice and a strumming acoustic guitar before building into an orchestrated crescendo. Hubbard knows how far this band can go, and he intends to push their sonic boundaries to wonderful effect.\n\nThroughout this album, the Apache Relay, its leader Michael Ford Jr, and producer Neilson Hubbard all reveal their connection to the anthemic 80s. While its hard to believe that it has been 30 years since the world saw the ascendance of artists like Bruce Springsteen and U2, their mutual ability to write perform anthems still resonates today as the younger generation discovers them and finds ways to make them relevant today.\n\nSpringsteen's Nebraska remains highly influential in the way that its stripped down and raw acoustic format never hid the anthemic potential of the songs. Many artists have covered songs from Nebraska like &quot;Atlantic City&quot; and shown how lasting and powerful they are. Apache Relay's version of &quot;State Trooper&quot; creates a sharp sense of foreboding and building tension for the listener. It isn't surprising to see that the lone cover on American Nomad is this Nebraska track.\n\n&quot;State Trooper&quot; might provide context, but Ford doesn't need songwriting help. American Nomad contains strong songs throughout. &quot;Sets Me Free&quot; would stand out on nearly every radio format. &quot;Mission Bells&quot; and &quot;Watering Hole&quot; have the feel of old time soul mixed into Hubbard's modern production. &quot;Home Is Not Places&quot; probably has the strongest U2 connection with its Edge-like guitar riff while &quot;When I Come Home&quot; shows the band hasn't lost its ability to do quiet folk.\n\nThe title track shows the breadth and leap of American Nomad as it sounds like a Southern-tinged version of Coldplay. Apache Relay demonstrates how bands can be influenced by the radio while improving on it rather than resorting to mere mimicry. \n\nThe Apache Relay deserves credit for the big creative steps they have taken from their debut to American Nomad. Rock and roll is often about the grand statement. Ford and his bandmates have made one here.","torrent":{"xt":"urn:btih:48287e51d7ece5ecdd8397ababe57930a031fbf7","amp;dn":"The+Apache+Relay+-+American+Nomad+%5B2011%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48287e51d7ece5ecdd8397ababe57930a031fbf7","infoHashBuffer":{"type":"Buffer","data":[72,40,126,81,215,236,229,236,221,131,151,171,171,229,121,48,160,49,251,247]},"announce":[],"urlList":[]}}