{"title":"The Paul Hogan Collection","uid":5431249,"size":3686434157,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:48fc65e987bd273eb422364e48d07ef23d4abeff&amp;dn=The+Paul+Hogan+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Psychodad149","files":6,"time":1268420791,"description":"Long ago, in a continent far away, before the first draft scripts for &quot;Crocodile Dundee&quot; had been written, there was The Paul Hogan Show.  Sometimes called the Aussie Bennie Hill, Hogan was firmly established as Australia's quintessential comedian years before Mick &quot;Crocodile&quot; Dundee became an icon of Down Under to American audiences.  This is a collection of his best work.\n\nThe Paul Hogan Show debuted on American television in the early '80s, about the same time Benny Hill's perhaps more accessible show did.  American afficianados of British humor were already somewhat acquainted with English jargon and pop culture references via Monty Python, however, and perhaps both Python and Hill humor were more ecumenical than the pervasivley Australian wit of Paul Hogan.  Although the Crocodile Dundee films were instant hits in the US, The Paul Hogan Show never made a lasting impression on the American viewer.  This is a shame, as Hogan's humor is as sharp as anything that came over from the BBC and Thames Television.  Like Benny Hill, he portrays a number of recurring characters -- a typical Aussie &quot;Ocker&quot;, a disreputable police sergeant, a derelict wino, a hapless daredevil stuntman, and of course, himself.   Interestingly, one well-known sequence you will see here is &quot;Benny Five O&quot;:  Hogan's idea of what Benny Hill would do with the opening sequence of Hawaii Five-O.  Oh, and lots of cheesecake --  scantily dressed, lovely gilrls a-plenty!  ","torrent":{"xt":"urn:btih:48fc65e987bd273eb422364e48d07ef23d4abeff","amp;dn":"The+Paul+Hogan+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48fc65e987bd273eb422364e48d07ef23d4abeff","infoHashBuffer":{"type":"Buffer","data":[72,252,101,233,135,189,39,62,180,34,54,78,72,208,126,242,61,74,190,255]},"announce":[],"urlList":[]}}