{"title":"STEVE MARRIOTT (R.I.P.1947-1991)The Life&amp;Times Of S.Marriott","uid":9461441,"size":207557545,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:491ca334f2ac610ae02a20bed114fc8f94997446&amp;dn=STEVE+MARRIOTT+%28R.I.P.1947-1991%29The+Life%26amp%3BTimes+Of+S.Marriott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ghostdogz","files":-1,"time":1389361122,"description":"&quot;The Life and Times of Steve Marriott&quot; \n\nis a compelling documentary about one\nof rock's most dynamic, exciting, and sadly; unsung heroes of rock and roll.\nShowcasing revelatory interviews with Humble Pie's Peter Frampton, Jerry Shirley,\nand Greg Ridley, the Black Crowes's Chris Robinson, Rick Nielsen and Bun E. Carlos\nof Cheap Trick, John Waite, Bad Company/Free drummer Simon Kirke, Quiet Riot's \nKevin Dubrow, Ricky Byrd and Marriott historian John Heller among others,\nthe documentary vividly tells the tale of Steve's tragically short life via the\nuse of previously unseen photos, memorabilia, and home movies. Rare fiery\nperformance footage of The Small Faces and Humble Pie frames the action,\ndrawing the viewer closer to this wonderful and underrated artist. Track List:\nTin Soldier, Itchycoo Park, Lazy Sunday, Paradise Lost, Take Me Back,\nNatural Born Woman, Alabama 69, Sad Bag of Shaky Jake, Stone Cold Fever, \nFor Your Love, 4-Day Creep, 30-Days In The Hole, I Don't Need No Doctor,\nHot n' Nasty, Black Coffee, Bigger They Come, and I Won't Let You Down.\n\n\n\nAt last - something for the fans of probably the most dynamic live act and artist\nof the 70's. There never has been, and most likely never will be, anyone quite like\nMr Marriott, who's untimely death left an enormous void in the rock world. This dvd \nfocusses on the earlier days of Humble Pie. There is a badly cut version of \nI Don't Need No Doctor - taken, I believe, from an Old Grey Whistle Test.\nIt proves that somewhere out there in Archiveland there exists more footage of\nthe band. Bring it on - there is a huge market for Humble Pie fans (just check the\nnumber of bootlegs doing the rounds!) Peter Frampton, Jerry Shirley (whom I met with \nSteve at a Packet of Three gig in Leicester many years ago) Clem Clempson all make\npertinent and valuable contributions - but nothing from Greg Ridley, which is sad \nbecause he was/is (?) probably the best bassist around at the time. Where is Greg?!!\nTrack listing is good and worthy of the band. This offering could have done with more\nanecdotes, and of course, more live footage - what about the famous Charlton gig \nwith the Who and Maggie Bell? That was filmed - I have some of it on vhs! If you \nonly ever buy one dvd from the 70's - buy this one. If you buy loads - buy this one\nanyway. If you don't have a dvd player - buy this one because one day you will glad\nthat you did.\n\n\njust watch,listen and enjoy the video...","torrent":{"xt":"urn:btih:491ca334f2ac610ae02a20bed114fc8f94997446","amp;dn":"STEVE+MARRIOTT+%28R.I.P.1947-1991%29The+Life%26amp%3BTimes+Of+S.Marriott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"491ca334f2ac610ae02a20bed114fc8f94997446","infoHashBuffer":{"type":"Buffer","data":[73,28,163,52,242,172,97,10,224,42,32,190,209,20,252,143,148,153,116,70]},"announce":[],"urlList":[]}}