{"title":"Anthony de Mello - Sadhana: A Way to God (pdf)","uid":8167093,"size":1695573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:494e4f87f4132a5063cae94ca265463f3dd22634&amp;dn=Anthony+de+Mello+-+Sadhana%3A+A+Way+to+God+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361350948,"description":"Anthony de Mello - Sadhana: A Way to God: Christian Exercises in Eastern Form (Image, 1979). 140 pages.\n\nNew scan. Searchable pdf (clearscan), with contents in bookmarks, accurate pagination, metadata, etc. \n\nShort description:\n\nNow classic book of spiritual exercises by the Indian Jesuit priest who later got under the skin of conservative Catholics and earned a rebuke from the Vatican. A beautiful book from a gentle, beautiful soul.\n\nDescription:\n\n\nTruly a one-of-a-kind, how-to-do-it book, this small volume responds to a very real hunger for self-awareness and holistic living. It consists of a series of spiritual exercises for entering the contemplative state -- blending psychology, spiritual therapy, and practices from both Eastern and Western traditions.\n\nAnthony de Mello offers here an unparalleled approach to inner peace that brings the whole person to prayer -- body and soul, heart and mind, memory and imagination. In forty-seven exercises that teach things such as awareness of physical sensations, stillness, healing of hurtful memories, and consciousness of self and world, de Mello succeeds in helping all who have ever experienced prayer as difficult, dull, or frustrating. The essential key, he notes, is to journey beyond mere thought-forms and discover satisfying new depths in prayer from the heart. This allows for a greater sense of awareness amid silence, and disposes the one who prays to untold riches, spiritual fulfillment, and ultimately, a mystical experience of God-centeredness. Drawing on Scripture, as well as insights from Eastern and Western spiritual masters, the author has a unique appeal that transcends time, culture, and religious background.\n\nFor many years a bestseller in the English language, Sadhana has now been translated into more than two dozen foreign languages. Readers the world over have eagerly received this sincere spiritual leader, who has led many toward the wealth of insight and spirit that dwells within them.\n\n**Note: please help seed. I hope to upload more books of this kind, but I can't keep them all seeded indefinitely. If you like this kind of thing, help out! Thanks.**","torrent":{"xt":"urn:btih:494e4f87f4132a5063cae94ca265463f3dd22634","amp;dn":"Anthony+de+Mello+-+Sadhana%3A+A+Way+to+God+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"494e4f87f4132a5063cae94ca265463f3dd22634","infoHashBuffer":{"type":"Buffer","data":[73,78,79,135,244,19,42,80,99,202,233,76,162,101,70,63,61,210,38,52]},"announce":[],"urlList":[]}}