{"title":"The Woman in Red 1984 [H264 - Eng Ita Aac - Sub Eng Ita]","uid":8941524,"size":1016231974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a008a93c1d91e2f3ef95d5d64b42bee76946213&amp;dn=The+Woman+in+Red+1984+%5BH264+-+Eng+Ita+Aac+-+Sub+Eng+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"gemini9669","files":-1,"time":1379670131,"description":"The Woman in Red is a 1984 romantic comedy film starring and directed by Gene Wilder, who wrote the script, adapting it from a 1976 French film.\nIt co-stars Charles Grodin, Gilda Radner, Joseph Bologna, Judith Ivey and Kelly LeBrock, and won an Academy Award for an original song performed by Stevie Wonder.\n\nSan Francisco ad man Teddy Pierce is amused by, then obsessed with, a beautiful woman whose red dress goes whooshing over her head from a gust of wind as she crosses a grate. Teddy is happily married to Didi, but he can't get this woman out of his mind.\nEncouraged by his friends Buddy, Joe and Michael, he tries to ask her for a date but mistakenly phones Ms. Milner, a plain ad-agency employee who is flattered by his interest.\nTeddy ultimately does become acquainted with the woman in red, a model named Charlotte, going horseback riding with her and even inviting her to a relative's party. He radically alters his wardrobe and begins using elaborate ruses to see Charlotte socially. Meanwhile, he incurs the wrath of Ms. Milner, whom he stands up.\nEvents come to a head in Charlotte's high-rise apartment, where she invites Teddy into her bed. He is thrilled until her airline pilot husband suddenly comes home. Teddy ends up on a ledge, where passersby below believe he is a potential suicide about to jump, all captured on live TV.\nA subplot concerns Teddy's friends, one of whom is gay, another a philanderer whose wife throws him out.\n","torrent":{"xt":"urn:btih:4a008a93c1d91e2f3ef95d5d64b42bee76946213","amp;dn":"The+Woman+in+Red+1984+%5BH264+-+Eng+Ita+Aac+-+Sub+Eng+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a008a93c1d91e2f3ef95d5d64b42bee76946213","infoHashBuffer":{"type":"Buffer","data":[74,0,138,147,193,217,30,47,62,249,93,93,100,180,43,238,118,148,98,19]},"announce":[],"urlList":[]}}