{"title":"(PSX-PSP) Parasite Eve 1 &amp; 2 converted properly (Kingdom-games b","uid":4500678,"size":1631893980,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:4a68b6b91305ea95df268f842a59ae70a0dcb5bd&amp;dn=%28PSX-PSP%29+Parasite+Eve+1+%26+2+converted+properly+%28Kingdom-games+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"toxicjuggalo","files":7,"time":1226381445,"description":"Parasite Eve 1:\n\nA fateful night at the opera house triggers in one woman the power to cause all those around her to spontaneously incinerate, and in another woman an innate resistance to the attack. You assume the role of the second woman New York cop Aya Brea as she comes to realize that the fate of humanity will be determined by her actions.\n\nParasite Eve 2:\n\nThree years after &quot;the event&quot; in New York, Aya Brea has joined the FBI to help control the threat of another mitochondria outbreak. After encountering several Neo Mitochondrial Creatures (NMCs) in a Los Angeles office building, Aya starts on an investigation into the source of the situation. She will have to travel to a variety of locations and fight dozens of NMCs that don&amp;#039;t want her to discover the truth behind their existence. Luckily, Aya is trained in the use of several weapons including pistols, rifles, and machine guns. But when things get a little too hairy, she can call on the power of her own mitochondria and pull off special attacks or heal wounds. Your performance throughout the game determines which of the multiple ending you will get to see. It&amp;#039;s up to you to try to keep the mitochondria in check\n\n\nYOU MUST USE THE POPSLOADER FOR THIS RELEASE TO WORK!!!....The Proper pops to use to run the game is 3.30 pops\nfor BOTH GAMES.... This will bring you a graphics-glitch-free conversion... I have worked on these 2 games for\n1 week straight since there is no other working copies out there I have finally brought you one that is \nguaranteed to work..... All I ask in return is a &quot; Thank You &quot; comment........KloWn ( Kingdom RG )","torrent":{"xt":"urn:btih:4a68b6b91305ea95df268f842a59ae70a0dcb5bd","amp;dn":"%28PSX-PSP%29+Parasite+Eve+1+%26+2+converted+properly+%28Kingdom-games+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a68b6b91305ea95df268f842a59ae70a0dcb5bd","infoHashBuffer":{"type":"Buffer","data":[74,104,182,185,19,5,234,149,223,38,143,132,42,89,174,112,160,220,181,189]},"announce":[],"urlList":[]}}