{"title":"Mike Oldfield - Tubular Bells TQMP","uid":4816308,"size":240092299,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4aa043cf53bfc2ffd7ad13895b6005d2e4757961&amp;dn=Mike+Oldfield+-+Tubular+Bells+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":15,"time":1238585803,"description":"When I was a small boy (can not say young, cause I am still ) it was hard to get good music on vinyls in this part of the world. So me and my friends were buying LP's, mostly form UK, by post. It was not so easy as it is today Anyhow, we had a system: everyone of us was buying a different album (the artist could be the same, but the title not), cause our budget was low. We were then making copies on audiotapes, so we could listen at home to more different good music. One day a friend showed up with magazine and he said: guys we have to buy this! We aksed: buy what? And he showed us a very good cover with a bended tube on it. Who the hell is this guy? was the obvious question. Well, he said, Mike Odlfield! Mike who? What kind of music it is? He didn' have a clue, (neither of us did), but he said: the cover is great, so the music is too! I am sure! Three weeks later we got the record...and the rest is history! We were stoned by his music! It was 1982 and I was 15 (it happens when you have a jazzer father and a rocker mother and a couple of 2 to 3 years older friends ) Few years later I bought this cd for me, it was '86 or '87, so it is older than I was when I bought it...Oh, yes, you guessed right, it is Tubular Bells, on e of my favourite albums ever...\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)","torrent":{"xt":"urn:btih:4aa043cf53bfc2ffd7ad13895b6005d2e4757961","amp;dn":"Mike+Oldfield+-+Tubular+Bells+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa043cf53bfc2ffd7ad13895b6005d2e4757961","infoHashBuffer":{"type":"Buffer","data":[74,160,67,207,83,191,194,255,215,173,19,137,91,96,5,210,228,117,121,97]},"announce":[],"urlList":[]}}