{"title":"The Holy Reich (Thesis) - Richard Steigmann-Gall","uid":11727793,"size":32784375,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b0004a5261942b7bcaff496ff7a748e1669b5df&amp;dn=The+Holy+Reich+%28Thesis%29+-+Richard+Steigmann-Gall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1425145781,"description":"\nThis is the thesis the book was based on.\n\nThe Holy Reich: Nazi Conceptions of Christianity, 1919-1945\n\nAnalyzing the previously unexplored religious views of the Nazi elite, Richard Steigmann-Gall argues against the consensus that Nazism as a whole was either unrelated to Christianity or actively opposed to it. He demonstrates that many participants in the Nazi movement believed that the contours of their ideology were based on a Christian understanding of Germany's ills and their cure. A program usually regarded as secular in inspiration - the creation of a racialist 'people's community' embracing antisemitism, antiliberalism and anti-Marxism - was, for these Nazis, conceived in explicitly Christian terms. His examination centers on the concept of 'positive Christianity,' a religion espoused by many members of the party leadership. He also explores the struggle the 'positive Christians' waged with the party's paganists - those who rejected Christianity in toto as foreign and corrupting - and demonstrates that this was not just a conflict over religion, but over the very meaning of Nazi ideology itself.\n\n\nAbout the author:\n Richard Steigmann-Gall is Assistant Professor of History at Kent State University. He has earned fellowships and awards from institutions in Germany, Israel, and Canada, and he has published articles in Central European History, German History, Social History, and Kirchliche Zeitgeschichte","torrent":{"xt":"urn:btih:4b0004a5261942b7bcaff496ff7a748e1669b5df","amp;dn":"The+Holy+Reich+%28Thesis%29+-+Richard+Steigmann-Gall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0004a5261942b7bcaff496ff7a748e1669b5df","infoHashBuffer":{"type":"Buffer","data":[75,0,4,165,38,25,66,183,188,175,244,150,255,122,116,142,22,105,181,223]},"announce":[],"urlList":[]}}