{"title":"Financial Risk Manager Handbook","uid":6517709,"size":2337523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b4f7902473d3f9f0a8f4647cab1f0fae466485e&amp;dn=Financial+Risk+Manager+Handbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309885685,"description":"Financial Risk Manager Handbook\n Publisher: Wiley | 2003 | ISBN: 047143003X | Pages: 734 | PDF | 2.23 MB\n\n An essential guide to financial risk management as well as the only way to ace the GARP FRM Exam\n The Financial Risk Management Exam (FRM Exam) was developed by the Global Association of Risk Professionals (GARP) as a means of establishing an industry standard of minimum professional competence in the field. It is given annually in November for risk professionals who want to earn FRM certification. Authored by renowned financial risk management guru Phillipe Jorion, with the full support of the GARP, this is the definitive guide for those preparing to take the FRM Exam. With the help of questions (and solutions) taken from previous exams, Jorion coaches readers on quantitative methods, capital markets, and market, credit, operational, and risk management concepts and assessment techniques. In addition to being the indispensable guide for those aspiring to FRM certification, Financial Risk Manager Handbook also serves as a valued working reference for risk professionals.\n Phillipe Jorion, PhD (Irvine, CA), is a Professor of Finance at the Graduate School of Management at UC Irvine. He has also taught at Columbia University, Northwestern University, the University of Chicago, and the University of British Columbia.","torrent":{"xt":"urn:btih:4b4f7902473d3f9f0a8f4647cab1f0fae466485e","amp;dn":"Financial+Risk+Manager+Handbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b4f7902473d3f9f0a8f4647cab1f0fae466485e","infoHashBuffer":{"type":"Buffer","data":[75,79,121,2,71,61,63,159,10,143,70,71,202,177,240,250,228,102,72,94]},"announce":[],"urlList":[]}}