{"title":"Storm Chasers   Season 4   EoD","uid":6040240,"size":3519731722,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4b7b8f39b9e48b5bf8bccb46bb6bea07797c8931&amp;dn=Storm+Chasers+++Season+4+++EoD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"5150EOD","files":-1,"time":1292363883,"description":"                              Storm Chasers\n\n\n                                 Season 4 \n\n\n\n       &lt;a href=&quot;\nhttp://dsc.discovery.com/tv/storm-chasers/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dsc.discovery.com/tv/storm-chasers/&lt;/a&gt;\n\n\n\nTelevision's most electrifying hour returns with bigger storms and higher stakes. STORM CHASERS' teams are on the scene recording data and gathering research in order to improve early warning systems. This fall, viewers will get a front row seat to nature's fury in the heart of &quot;Tornado Alley&quot; as scientists, researchers and weather enthusiasts gear up and strap in for their pursuit of the ultimate tornado footage.\n\nThis season, viewers witness how the courageous STORM CHASERS used science to save lives last spring, which was one of the most violent storm seasons on record. Extreme meteorologist Reed Timmer reunites with chasing partner Joel Taylor in their armored chase vehicle &quot;The Dominator&quot; for the exciting fourth season joined IMAX filmmaker Sean Casey and his monster tank-like TIV (Tornado Intercept Vehicle) and veteran researcher and storm chaser Tim Samaras.\n\n\n\n\nEpisode 1: What Goes Around...\n\nReed and Joel bury the hatchet to face a new tornado season, but armor offers little protection when the roof blows off the new Dominator. Sean mixes up his crew and unleashes tension in the path of a west Texas twister.\n\n\nEpisode 2: Why We Chase\n\nThe deadliest tornado of the season tears a hundred mile long path across Mississippi, destroying 600 homes and the town of Yazoo City. For Reed, Joel and Chris, an epic chase turns into a race to save lives, and changes their own lives forever.\n\n\nEpisode 3: Back Seat Driver\n\nAfter the worst tornado in his life, Reed pursues a new force of nature in TV weather woman Ginger Zee. But chasing more than weather leaves teammates out in the cold. As twisters rip through the Ozarks, one long-time chaser calls it quits.\n\n\nEpisode 4: Dedication\n\nSean finally gives the reigns to his meteorologist and navigator Matt Hughes, who leads the team to their best tornado intercept ever. Then triumph turns to tragedy as Storm Chasers loses one of its own.\n\n\nEpisode 5: Smoke Monster\n\nSean's team struggles with the death of a teammate, and heightened emotions lead to questionable driving. Reed arms the Dominator with probe cannons, while Tim smokes out a South Dakota monster that just keeps growing, and discovers there's no way out when you're in the path of a perfect storm.\n\n\nEpisode 6: Perfect Storm\n\nThe supercell system tearing across South Dakota spawns a massive tornado that gives all the teams plenty of almost non-stop intercept action.\n\n\nEpisode 7: Twilight Zone\n\nReed's air cannons are locked and loaded, but multiple tornadoes prove a hard target for an itchy trigger finger. Tim's team chases in the tornado twilight zone, while Sean weathers a storm of controversy.\n\n\nEpisode 8: Judgment Day\n\nStorm and chasers collide in Minnesota for a final showdown. As a ferocious EF-4 twister targets the town of Wadena, one team finds themselves in the wrong place at the right time, and Sean's trial by fire becomes a race to save others.\n\n\nBonus Episode 9: Behind the Storm\n\nBonus Storm Chasers Special 2010 Greatest Storms\n\n\n\n\n\n\n\n\n\n\n\n                                 ****EOD****\n\n                         Even Firefighters need Heroes\t","torrent":{"xt":"urn:btih:4b7b8f39b9e48b5bf8bccb46bb6bea07797c8931","amp;dn":"Storm+Chasers+++Season+4+++EoD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b7b8f39b9e48b5bf8bccb46bb6bea07797c8931","infoHashBuffer":{"type":"Buffer","data":[75,123,143,57,185,228,139,91,248,188,203,70,187,107,234,7,121,124,137,49]},"announce":[],"urlList":[]}}