{"title":"Jay Allan - Enemy in the Dark (Far Star Trilogy #2)","uid":13099723,"size":239740128,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b99eb29289f688dc53e359404389e2e66abc342&amp;dn=Jay+Allan+-+Enemy+in+the+Dark+%28Far+Star+Trilogy+%232%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Cybotage","files":34,"time":1451212169,"description":"The second book in the Far Star series follows Blackhawk and the crew of the Wolf's Claw as they are gradually (and unwillingly) drawn more deeply into Marshal Lucerne's campaign to form a united power bloc in the Far Stars to resist imperial encroachment.\r\n\r\nSuccessfully completing their mission to rescue Marshal Augustin Lucerne's daughter, Astra, the crew of the Wolf's Claw are enjoying some well-deserved rest - all, that is, except Blackhawk. The space gun for hire cannot escape Lucerne's relentless pleas for help against growing imperial control in the Far Stars. While Blackhawk deeply respects his friend, he fears that the power Lucerne offers will lead him back to his old dark ways.\r\n\r\nHis resistance crumbles, however, when Lucerne presents evidence that the imperial governor has been manipulating the conflicts in the Far Stars. Convinced of the deadly danger of imperial domination, Blackhawk and his crew board the Wolf's Claw once more and set out to gather intelligence on the Empire's movements - the proof Lucerne needs to unite the fractured and feuding worlds of the Far Stars into a single power bloc capable of resisting imperial aggression. But deep in the sparsely populated territory of the Far Stars, he discovers that the imperial governor's machinations are far reaching - and threaten the independence of every world this side of the Void.\r\n\r\nA man seemingly running from himself, Blackhawk is beginning to realize he can no longer remain a prisoner to his own past while the future of the Far Stars is in jeopardy.\r\n\r\n\r\n\r\nRead by Jeffrey Kafer\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 11 hrs\r\nUnabridged Audiobook\r\nRelease Date:12-01-15\r\nPublisher: HarperAudio","torrent":{"xt":"urn:btih:4b99eb29289f688dc53e359404389e2e66abc342","amp;dn":"Jay+Allan+-+Enemy+in+the+Dark+%28Far+Star+Trilogy+%232%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b99eb29289f688dc53e359404389e2e66abc342","infoHashBuffer":{"type":"Buffer","data":[75,153,235,41,40,159,104,141,197,62,53,148,4,56,158,46,102,171,195,66]},"announce":[],"urlList":[]}}