{"title":"Half-Life incl. Opposing Force, Blue Shift, Decay RePack-Eqa5cro","uid":5146578,"size":290473057,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4bcf00bf3c4891a7dd1132a2d81bb1ac00312efa&amp;dn=Half-Life+incl.+Opposing+Force%2C+Blue+Shift%2C+Decay+RePack-Eqa5cro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Eqa5cro","files":-1,"time":1257291502,"description":".                  -----              ----\n                  |                  |\n                  |       ---   ---  |       ---   ---   ---\n                  |----  |   | |   |  ----  |     |   | |   |\n                  |      |   | |---|      | |     |---  |   |\n                  |      |   | |   |      | |     |  \\  |   |\n                   -----  ---\\        ----   ---         ---\n\n                       ....:::  p r e s e n t s  :::....\n\n\n                               Half-Life RePack\n\n                           Release date: 2009/11/02\n\n\n------------------------------------------------------------------------------ \nGame Info\n------------------------------------------------------------------------------\n\nHalf-Life is a science fiction first-person shooter video game developed by\nValve Software. Players assume the role of Dr. Gordon Freeman, a graduated\ntheoretical physicist who must fight his way out of a secret underground\nresearch facility, whose research and experiments into teleportation\ntechnology have gone wrong. It was released on November 19, 1998.\n\nOpposing Force is the first expansion for Half-Life. It portrays the events\nfrom the perspective of a US Marine, one of the enemy characters in the\noriginal game. The player character, Adrian Shephard, is sent in to neutralize\nthe Black Mesa Research Facility after a scientific mishap causes it to be\ninvaded by aliens, but quickly finds that the Marines are outnumbered and\nslowly being beaten back by a second alien race and black operations units.\nIt was released on November 1, 1999.\n\nBlue Shift is the second expansion for Half-Life. You play as Barney Calhoun,\nsecurity guard employed by the Black Mesa Research Facility. After a\nscientific mishap causes Black Mesa to be invaded by aliens, Calhoun must\nfight his way to safety. It was released on Jun 12, 2001.\n\nDecay is the third expansion for Half-Life. Like first two expansions it\nreturns to the setting and timeline of the original story, albeit it portrays\nthe story from the viewpoint of a different set of protagonists: two female\nscientists working in the Black Mesa Research Facility. Decay is a cooperative\nmultiplayer game, designed to be played by two people working together to\npass through the game's levels. It was released on November 14, 2001.\n\n\n------------------------------------------------------------------------------\nTorrent Info\n------------------------------------------------------------------------------\n\n- all four games packed into one single installer\n- Uplink levels have been integrated in the Half-Life itself\n- all language files except those for english were removed\n- all four games have been updated with HD textures\n- this is the latest version of Half-Life (v1.1.1.1)\n- no cracks, no serials, and no steam are required to play\n\nThis homemade Half-Life release contains all the levels of the original\nHalf-Life games, and is meant to be played as a singleplayer.\n\nAs for multiplayer, these games can be played over the internet through VPN,\nthat is using Hamachi for example. You can refear to guide I included.\n\nIt is also possible to play normally, but only on cracked servers,\nand of course, you can play over your home LAN as well.\n\nThese four games have been repacked all by me (Eqa5cro).\nI can assure you that it will work fine.\n\nPlease note that I cannot take all the credit\nsince without others I wouldn't be able to make this repack.\nThese are the people mentioned in &quot;Special Thanks&quot; section.\n\nJust install and use the shortcuts located on\nyour desktop to start the game you want.\n\nAny questions/comments are welcome.\n\n\n------------------------------------------------------------------------------\nInstallation Notes\n------------------------------------------------------------------------------\n\n1. Download the torrent.\n\n2. Run Half.Life.RePack.Setup-Eqa5cro.exe and install the game.\n\n3. Play the game by running the corresponding\n   shorcut located on your desktop.\n\n4. Have fun!\n\n\n------------------------------------------------------------------------------\nFrequently Asked Questions\n------------------------------------------------------------------------------\n\nQ: My antivirus software detected a virus. Is this torrent virus free?\n\nA: Some antivirus tools tend to detect file called DQ2249.ICD as malware.\n   This file is the part of the Opposing Force, and it is present on the\n   original disc. As for being a part of the game I didn't removed this file.\n\n   Here is a link to the scan results:\n  &lt;a href=&quot; http://www.virustotal.com/analisis/654b8ec5f6ff27f9facb1646e48036ae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.virustotal.com/analisis/654b8ec5f6ff27f9facb1646e48036ae&lt;/a&gt;\n\n   If you are suspicious you can delete this file after the game has been\n   installed, and try to play without it. But I can assure you that this\n   file won't do you any harm.\n\nQ: In one level in Half-life just after having met the marines for the first\n   time I go up an elevator. It goes fine till the loading message but after\n   it loads I became stuck and can't move. What should I do?\n\nA: There are two ways to bypass this bug.\n\n   The first one is to save your game when you became stuck.\n   Then, you need to load that save and you will be able to move.\n\n   The second one is to jump right before it starts to load so that you are\n   in the air when it loads. When loading finishes you will be able to move.\n\nQ: Why does Decay have so many bugs?\n\nA: Decay was officially released only for Sony PlayStation 2.\n   Thanks to a small group of fans, it was ported to a PC.\n\n   Game included is the first release of Decay for PC\n   and it's full of bugs, but it's playable and can be completed.\n\n   For all the bugs you encounter, you'll need to try to\n   find a way around by yourself.\n\nQ: When I use Change Game to switch between games, \n   it crashes right after another game has started. Why?\n\n   I don't know why, but Change Game doesn't work for me either.\n\n   The game you are switching to is being crashed instantly,\n   but I don't know what is the cause.\n\n   But, for example, it works on my brother's computer.\n   If it doesn't work for you, use shorcuts to start the game.\n\n\n------------------------------------------------------------------------------\nSpecial Thanks\n------------------------------------------------------------------------------\n\n- to Valve Software for creating Half-Life\n\n- to Gearbox Software for creating Opposing Force, Blue Shift, and Decay\n\n- to Vyacheslav Dzhura for porting Decay to the PC,\n  which was originally developed only for Sony PlayStation 2\n\n- to Werner Spahl for creating Uplink Addon, which allowed me to\n  seamlessly add the Uplink levels into the gameflow of Half-Life itself\n\n\n------------------------------------------------------------------------------\nBlack Mesa (Half-Life Remake)\n------------------------------------------------------------------------------\n\nI am using this opporunity to inform you about the game called Black Mesa.\n\nBlack Mesa (previously known as Black Mesa: Source) is both a third-party\ntotal conversion mod for Half-Life 2 and remake from 1998 video game\nHalf-Life. The ultimate goal of the mod is to recreate the original Half-Life\nfrom the ground up, using the advanced capabilities of the Source engine,\nthe improved graphics quality of Half-Life 2 and enhanced character AI,\nto create a new and more engrossing in-game world by introducing more varied,\ncomplex environments and more challenging, realistic gameplay. Black Mesa\nwill be playable by anyone who owns any Source engine game.\n\nMore information about the game can be found on its official web-site:\nhttp://www.blackmesasource.com/about.html\n\n\n------------------------------------------------------------------------------\nFinal Words\n------------------------------------------------------------------------------\n\nPlease, help me seed after you have finished downloading,\nat least until your ratio is 1.000, to keep this torrent alive.\nThink about other downloaders.\n\nCheck out my other torrents:\nhttp://thepiratebay.se/user/Eqa5cro\n\nGreetings from Eqa5cro.\n\n","torrent":{"xt":"urn:btih:4bcf00bf3c4891a7dd1132a2d81bb1ac00312efa","amp;dn":"Half-Life+incl.+Opposing+Force%2C+Blue+Shift%2C+Decay+RePack-Eqa5cro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bcf00bf3c4891a7dd1132a2d81bb1ac00312efa","infoHashBuffer":{"type":"Buffer","data":[75,207,0,191,60,72,145,167,221,17,50,162,216,27,177,172,0,49,46,250]},"announce":[],"urlList":[]}}