{"title":"Feasts and Fasts: A History of Food in India[MyebookShelf]","uid":11668406,"size":10007876,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c9170e05900bc3b83a4233c1bb02caaf6f2eefa&amp;dn=Feasts+and+Fasts%3A+A+History+of+Food+in+India%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1418094695,"description":"Feasts and Fasts: A History of Food in India[MyebookShelf]\nEnglish | ISBN: 1780233523 | 2015 | 336 pages | PDF | 10 MB\nThe second most populous country in the world after China and the seventh largest in area, India is unique among nations in its diversity of climates, languages, religions, tribes, customs and, of course, cuisines. Yet what is it that makes Indian food so recognizably Indian, and how did it get that way? India is at the centre of a vast network of land and sea trade routes - conduits for plants, ingredients, dishes and cooking techniques to and from the rest of the world. Foreign visitors have long marvelled at India's agricultural bounty, including its ancient indigenous plants such as lentils, aubergines, turmeric and pepper, all of which have been central to the Indian diet for thousands of years. Feasts and Fasts: A History of Indian Food is an exploration of Indian cuisine in the context of the country's religious, moral, social and philosophical development. It addresses topics such as dietary prescriptions and proscriptions, the origins of vegetarianism, culinary borrowings and innovations, the use of spices and the inseparable links between diet, health and medicine.This lavishly illustrated book gives a mouth-watering tour of India's regional cuisines, containing numerous recipes to interest and excite readers","torrent":{"xt":"urn:btih:4c9170e05900bc3b83a4233c1bb02caaf6f2eefa","amp;dn":"Feasts+and+Fasts%3A+A+History+of+Food+in+India%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c9170e05900bc3b83a4233c1bb02caaf6f2eefa","infoHashBuffer":{"type":"Buffer","data":[76,145,112,224,89,0,188,59,131,164,35,60,27,176,44,170,246,242,238,250]},"announce":[],"urlList":[]}}