{"title":"Archeologists of Shadows","uid":8582865,"size":269608230,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4cb17978c346945fca9618c4ad75ca508615d09f&amp;dn=Archeologists+of+Shadows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1371453713,"description":"Archeologists of Shadows V1 The Resistance\n\nSeptagon Studios, 2011, 115 pages\n\nCreated, Written and Illustrated by Lara Fuentes and Patricio Clarey\n\nIn a world where every living thing is forced to become mechanical, the Authorities punish those who resist the transformation, although all wonder about the real reason for the changes. Archeologists Of Shadows, Volume 1 The Resistance, is a Graphic Novel that has been in development for more than 4 years. It contains well over 100 pages of story and art that combines drawing, sculpture, photography, photo manipulation and digital painting with a 3D quality to it. This edition includes the first 4 chapters of the story along with a full Art book documenting the making of Archeologists Of Shadows. Fans of the Matrix or Lord of the Rings will be captivated by this Sci-Fi Steampunk Fantasy.\n\n\nArcheologists of Shadows V2 Once a Nightmare\n\nSeptagon Studios, 2012, 102 pages\n\nArcheologists of Shadows is set in a world where every living thing is becoming mechanical. Some think that the phenomenon is the will of the gods, and so the Authorities punish those who resist the transformation, although all wonder about the real reason for the changes. Archeologists of Shadows, Volume 2: Once A Nightmare is the second installment of a graphic novel series that has been in development for more than five years. Writer Lara Fuentes and artist Patricio Clarey, based out of Spain, have collaborated with Septagon Studios to publish Archeologists of Shadows, with editing and adaptation by Preston Park Cooper. This volume continues where volume one left off with over 100 pages of immersive story and art that combine drawing, sculpture, photography, photo manipulation, and digital painting. A visually stunning comic that will wow you with vivid imagery and a compelling story, going beyond the great foundation built up in the first issue. Visit the Archeologists of Shadows website to learn more about the Archeologists Of Shadows series, art, and creators.","torrent":{"xt":"urn:btih:4cb17978c346945fca9618c4ad75ca508615d09f","amp;dn":"Archeologists+of+Shadows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb17978c346945fca9618c4ad75ca508615d09f","infoHashBuffer":{"type":"Buffer","data":[76,177,121,120,195,70,148,95,202,150,24,196,173,117,202,80,134,21,208,159]},"announce":[],"urlList":[]}}