{"title":"RemoveWGA 1.2 -  FREE","uid":7035079,"size":13824,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d91027dd05dd65bb5e5c9dd0161467505479bd0&amp;dn=RemoveWGA+1.2+-++FREE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Dirty.R.L","files":1,"time":1329347438,"description":"\n\nDescription:\n\nRemoveWGA will enable you to easily remove the Microsoft &quot;Windows Genuine Advantage Notifications&quot; tool, which is calling home and connects to MS servers every time you start your system.\n\nOnce the WGA Notification tool has checked your OS and has confirmed you had a legit copy, there is no decent point or reason to check it again and again every boot.\n\nMoreover, connecting to Microsoft brings security issue for corporate networks, and privacy issues for everyone. It is also unclear which information are transmitted (Microsoft published an official answer, but an individual study brought some questions).\n\nAll of that, along the fact that Microsoft used deceptive ways to make you install this tool (it was told you it was an urgent security update, whereas it is a new installation giving you no extra security) makes me calling this tool a spyware.\n\nAlso, Windows Genuine Advantage Notifications is different than Windows Genuine Advantage Validation. RemoveWGA only removes the notification part, phoning home, and does not touch the Validation part.\n\n\n\nNote:\n\nSome antivirus and antispyware programs flag RemoveWGA as being infected/malware, although the application is perfectly safe and does not pose a threat to your system. This is called a 'false positive'. The term false positive is used when antivirus software wrongly classifies an innocuous ( inoffensive ) file as a virus. The incorrect detection may be due to heuristics or to an incorrect virus signature in a database. [Similar problems can occur with antitrojan or antispyware software.]\n\n\nOS:\n\n1) Windows XP \n2) Vista\n3) 7\n4) 7 x64","torrent":{"xt":"urn:btih:4d91027dd05dd65bb5e5c9dd0161467505479bd0","amp;dn":"RemoveWGA+1.2+-++FREE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d91027dd05dd65bb5e5c9dd0161467505479bd0","infoHashBuffer":{"type":"Buffer","data":[77,145,2,125,208,93,214,91,181,229,201,221,1,97,70,117,5,71,155,208]},"announce":[],"urlList":[]}}