{"title":"GuitarFX 3","uid":4037313,"size":2273533,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4da69f6e23711f8a6e25a316fbca5ff3e2a3890c&amp;dn=GuitarFX+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"electroacoustic","files":3,"time":1203503613,"description":"GuitarFX? guitar software (it&amp;#039;s on the market since 1997!) enable you to turn your computer into a guitar effects processor. Simply plug your guitar into the microphone or line input of your sound card, run this software, then press &quot;Start&quot; button. To stop playbacking pre-recorded guitar sounds click once on a picture of a small red lamp placed left to fx-slot with &quot;Playback wav&quot; title. Enjoy real-time crazy distortion smoothed by power filters and shaped by multi-band equalizers! Author of GuitarFX? offers several presets, including &quot;hard rock&quot;, &quot;high gain lead&quot; and &quot;solo&quot; effects. However, you can click through several menus to easily create custom tones. They can be saved as pre-sets for future use. Pre-sets can be assigned to &quot;hot keys&quot; F1..F12. Among the effects, you can apply 4 types of distortion, noise gate, wah-wah, compressor, EQ, flanger, reverb, chorus, delay and a number of other filters and effects. You can save your recordings to your hard drive. GuitarFX has the &quot;software effects chain builder&quot; with 16 fx slots. Clean guitar signals go to the top fx slot, then they are passed through all fx slots from the top to the bottom and go to the sound card output from the bottom fx slot. You can move any fx slot up. To do this place your mouse cursor on the top part of the appropriate &quot;Tune&quot; button and then do right mouse button click. Also you can move any fx slot down. To do this place your mouse cursor on the low part of the appropriate &quot;Tune&quot; button and then do right mouse button click.","torrent":{"xt":"urn:btih:4da69f6e23711f8a6e25a316fbca5ff3e2a3890c","amp;dn":"GuitarFX+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da69f6e23711f8a6e25a316fbca5ff3e2a3890c","infoHashBuffer":{"type":"Buffer","data":[77,166,159,110,35,113,31,138,110,37,163,22,251,202,95,243,226,163,137,12]},"announce":[],"urlList":[]}}