{"title":"Toyah Desire FLAC","uid":6935219,"size":273611782,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4da8fcd190cb78d5c96200f2f1a2ef30bf828b85&amp;dn=Toyah+Desire+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"farty","files":-1,"time":1325799147,"description":"Desire is the second album released by Toyah Willcox as a solo artist.\n\nIt is more typical of her band's earlier albums rather than its more commercial predecessor Minx, although it didn\\'t entirely escape the imposition of cover versions, including &quot;Echo Beach&quot;, originally recorded by Martha and the Muffins, and, somewhat incongruously, &quot;Love's Unkind&quot;, originally by Donna Summer. However, most of the songs are once again co-written by Willcox, and while the original release of the album does not feature any musician credits, it does however benefit from a consistent band line-up [as detailed on Toyah Willcox's official website], rather than the large number of session musicians involved in Minx.\n\nTwo singles were released from the album, &quot;Echo Beach&quot;, which became a minor hit in the UK and &quot;Moonlight Dancing&quot;. \n\nIn her autobiography, Willcox stated that she was forced to record &quot;Love's Unkind&quot; by her record label, but she was fiercely opposed to it. E.G. Records threatened to cancel the album's release if she did not.\n\nTo date, the album has yet to be reissued - so cd copies are rare and tend to be very expensive. However, Toyah has stated in her webletters that a reissue is on the cards for the future.\n\nFor the first time on the Internet in FLAC.\n\nEnjoy!","torrent":{"xt":"urn:btih:4da8fcd190cb78d5c96200f2f1a2ef30bf828b85","amp;dn":"Toyah+Desire+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da8fcd190cb78d5c96200f2f1a2ef30bf828b85","infoHashBuffer":{"type":"Buffer","data":[77,168,252,209,144,203,120,213,201,98,0,242,241,162,239,48,191,130,139,133]},"announce":[],"urlList":[]}}