{"title":"Report on Conspiracy to Rule the World(British Israelitism)(1984","uid":4640697,"size":3672007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e272bad1f1d88d0d64534e1aaa7b313f8c608b4&amp;dn=Report+on+Conspiracy+to+Rule+the+World%28British+Israelitism%29%281984&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1231703000,"description":"This is an amazing issue of Frontiers of Freedom newsletter entitled Report on the Conspiracy to Rule the World (1984) which exposes the doctrine of the &quot;chosen people&quot; as a product of British Israelitism. This doctrine found special appeal in millions of people all around the world but didn't bring them (or anyone else) any happiness at all. In contrary, they ended in total destruction.\nContents:\n- Manasseh Ben Israel's Proposal to Cromwell for persecuted Jews and British Royalty (as leaders of a &quot;Lost Tribe&quot; of Israel) to ally to rule the World and be re-admitted to Britain\n- &quot;The Ten Lost Tribes&quot; Facts and Fiction\n- British Israle World Federation:  In 1935 Anglo Israel Movement Still Included the Jews\n- Excerpts from Anglo Saxon World\n- The Anglo-Saxon-Celtic Israel Belief\n- Cecil Rhodes &amp; British Israelism\n- Anglo-Saxon Federation of America\n- DESTINY Edited by Howard B. Rand\n- The Communist Capitalist:  Freidrich Engels\n- Nicholas Murray Butler\n- Scofield Reference Bible, Bedrock of British Israel\nIn this short but informative survey, find out how a certain group of extremely rich people that are neither Jews nor Germans have produced and tirelessly promoted both of Zionist and Nazi ideologies of &quot;chosen people&quot; all around the world. Their plan was to create mass movements that would eventually led to their own destruction. Nazism attracted millions of Germans while Zionism greatly appeals to many Jews especially in Israel. And what do all these people like in such fancyful ideologies? It seems that this very idea of being chosen for some reason appeals to them as they begin to feel special compared to others. Once you are duped into believing, you will easily be manipulated by &quot;great leaders&quot; and ultimately destroyed. As Nazism has already bitten the dust so will Zionism soon to follow in the &quot;final battle&quot; with the &quot;second coming&quot; inevitably to follow. But only if you believe ofcourse. 10 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:4e272bad1f1d88d0d64534e1aaa7b313f8c608b4","amp;dn":"Report+on+Conspiracy+to+Rule+the+World%28British+Israelitism%29%281984","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e272bad1f1d88d0d64534e1aaa7b313f8c608b4","infoHashBuffer":{"type":"Buffer","data":[78,39,43,173,31,29,136,208,214,69,52,225,170,167,179,19,248,198,8,180]},"announce":[],"urlList":[]}}