{"title":"Mario Party 9 USA","uid":7206852,"size":834666496,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:4e9a308bebaff10992d4352b2638f4526326e21a&amp;dn=Mario+Party+9+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"edgar2020","files":1,"time":1335123589,"description":"Modes\n\n\n\nThe Main Menu.\nMario Party 9 has 5 modes in all. They are:\n\nParty Mode\nSolo Mode\nMinigame Mode\nExtras Mode\nMuseum\nMinigame Mode\n\n\n\nFree Play mode.\nBlue Toad is the host of Minigame Mode.\n\nFree Play: In the Free Play mode, the players can play unlocked minigames freely.\nStep It Up: In this mode, players must win minigames to climb stairs. The player who reaches on the top first wins.\nGarden Battle: The players must get puzzle pieces to fill their gardens winning minigames. The player who completes it first wins.\nChoice Challenge: All the players choose three minigames from a group of five that they would like to play. These minigames are played and the player who get more points wins.\nHigh Rollers: In this mode, the players must win minigames to roll a Dice Block to pass through a panel floor. The player who gets 500 points first wins.\nTime Attack: The player must try to win 10 minigames as fast as he or she can.\nBoss Rush: The players must defeat a series of bosses to win, similar to Boss Bash in Mario Party DS.\nParty Mode\n\nOnce again returning from previous Mario Party games, Party Mode involves the players going around the board like with the previous games, but changed due to the new gameplay mechanics of Mario Party 9.\n\nSolo Mode\n\nThe game's story mode, Solo Mode involves the players traveling across all six boards to defeat Bowser and save the Mini Stars.\n\nExtras Mode\n\nIn Extras Mode, the player can play through various extra minigames such as Goomba Bowling, Castle Clearout, or Shell Soccer. There is also a mode called Perspective Mode, in which the player plays through various minigames with a changed camera angle.\n\nMuseum\n\nThe Museum is where the player can spend Party Points on various things such as constellations, game sounds, vehicles, extra game modes, or watch the credits. Once they return a constellation into the sky, the player can go back and see it in the sky.\n","torrent":{"xt":"urn:btih:4e9a308bebaff10992d4352b2638f4526326e21a","amp;dn":"Mario+Party+9+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e9a308bebaff10992d4352b2638f4526326e21a","infoHashBuffer":{"type":"Buffer","data":[78,154,48,139,235,175,241,9,146,212,53,43,38,56,244,82,99,38,226,26]},"announce":[],"urlList":[]}}