{"title":"Welcome to the Dollhouse 1995 DVDRip Sonata Premiere","uid":8324800,"size":732892875,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ec6913230059b7a2a75877e2a2e23c3ff7a2f53&amp;dn=Welcome+to+the+Dollhouse+1995+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"klinho","files":5,"time":1364768594,"description":"Twelve-year-old Dawn Wiener (Heather Matarazzo) is perhaps the most put-upon adolescent in film history in Todd Solondz's bitterly hilarious black comedy Welcome to the Dollhouse. Dawn is bright but awkward, both physically and socially, and is appallingly unpopular among her peers, to whom she's better known as &quot;Wienerdog.&quot; Possessing little charm or grace and perhaps the most misguided fashion sense of her generation, Dawn is not an easy girl to like and practically no one seems interested in making the effort. If life is tough for Dawn at school, it's hardly any better at home. While her folks dote on her gratingly cute younger sister Missy (Daria Kalinina) and look with pride to her bookish older brother Mark (Matthew Faber), Dawn is either ignored or treated as an annoyance. Dawn has developed a crush on Steve (Eric Mabius), the hunky guitarist Mark has drafted into his rock band (significantly, Mark is less interested in making cool noise or unloading teenage angst than in having another extracurricular activity to put on his college applications); Steve is polite but obviously not interested in her. However, Dawn has attracted the attention of a boy at school -- Brandon (Brendan Sexton), a mean-spirited junior thug whose idea of a good time is threatening Dawn with rape. A painfully accurate account of life in junior high (what Matt Groening called &quot;the lowest pit of hell&quot;), Welcome to the Dollhouse is also very funny, but writer and director Todd Solondz never lets the film's humor dilute the agony of its leading character; anyone who has ever been 12 years old will doubtless laugh at Dawn while uncomfortably recalling the horror of their own preteen years.\n\n\nSubs srt: Portuguese / Spanish / Italian / French\n","torrent":{"xt":"urn:btih:4ec6913230059b7a2a75877e2a2e23c3ff7a2f53","amp;dn":"Welcome+to+the+Dollhouse+1995+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec6913230059b7a2a75877e2a2e23c3ff7a2f53","infoHashBuffer":{"type":"Buffer","data":[78,198,145,50,48,5,155,122,42,117,135,126,42,46,35,195,255,122,47,83]},"announce":[],"urlList":[]}}