{"title":"Seven Black Diamonds by Melissa Marr (ePub)","uid":13704894,"size":1502911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f06ed42da96f715618705b2f97315c7135f8020&amp;dn=Seven+Black+Diamonds+by+Melissa+Marr+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Bookz-BB","files":2,"time":1456815369,"description":"Seven Black Diamonds (Untitled #1) by Melissa Marr\r\n\r\n-----------------\r\n\r\nThis riveting fantasy marks Melissa Marr’s return to the world of faery courts that made her Wicked Lovely series an international phenomenon.\r\n\r\nLilywhite Abernathy is a criminal—she’s half human, half fae, and since the time before she was born, a war has been raging between humans and faeries. The Queen of Blood and Rage, ruler of the fae courts, wants to avenge the tragic death of her heir due to the actions of reckless humans.\r\n\r\nLily’s father has always shielded her, but when she’s sent to the prestigious St. Columba’s school, she’s delivered straight into the arms of a fae sleeper cell—the Black Diamonds. The Diamonds are planted in the human world as the sons and daughters of the most influential families and tasked with destroying it from within. Against her will, Lilywhite’s been chosen to join them...and even the romantic attention of the fae rock singer Creed Morrison isn’t enough to keep Lily from wanting to run back to the familiar world she knows.\r\n\r\nMelissa Marr returns to faery in a dramatic story of the precarious space between two worlds and the people who must thrive there. The combination of ethereal fae powers, tumultuous romance, and a bloodthirsty faery queen will have longtime fans and new readers at the edge of their seats","torrent":{"xt":"urn:btih:4f06ed42da96f715618705b2f97315c7135f8020","amp;dn":"Seven+Black+Diamonds+by+Melissa+Marr+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f06ed42da96f715618705b2f97315c7135f8020","infoHashBuffer":{"type":"Buffer","data":[79,6,237,66,218,150,247,21,97,135,5,178,249,115,21,199,19,95,128,32]},"announce":[],"urlList":[]}}