{"title":"Amy LaVere - This World Is Not My Home [2005][EAC/FLAC]","uid":10245577,"size":235952760,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4f081d55fa877c225963dea4af9889459bccfddd&amp;dn=Amy+LaVere+-+This+World+Is+Not+My+Home+%5B2005%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":15,"time":1401293845,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Archer Records #ARR 31924\nCountry: USA\nYear: April 18, 2006\nGenre: Pop,Rock\nFormat: CD,Album\n\n\n01. Day Like Any\n02. Nightingale\n03. Leaving\n04. Never Been Sadder\n05. Innocent Girl\n06. Take 'Em or Leave 'Em\n07. Last Night\n08. Set It Down\n09. This World Is Not My Home\n10. We Went Sailing\n\n\n\n\nThis World Is Not My Home gets a lazy, relaxed start with &quot;Day Like Any,&quot; a rhythmically compelling song highlighted by Jimbo Mathus' guitar work and Amy LaVere's country-flavored girlish vocals. &quot;Nightingale&quot; veers much closer to folk, while &quot;Leaving&quot; is straight old-school country. Perhaps the element that stands out most and ties these various styles together under some kind of alternative country banner is LaVere's light, slightly breathy vocal tone. She coos and croons, stretching syllables and adding emotional flourishes, and shows herself to be quite comfortable with the material at hand. And LaVere has surrounded herself with a crack band that includes Mathus, pianist Jim Dickinson, drummer Paul Buchignani, and several other fine players. The songs, mostly written by LaVere and Mathus, are also solid, though the best stuff is on the first half of the album. While This World Is Not My Home will probably be filed under alternative country, the album never sounds like anything that might typically be given that label (she's a female, first of all, and doesn't mumble her lyrics against a clash of twangy guitars). Instead, LaVere's style seems closer in spirit to the simpler values of older country and folk. As an added bonus, the CD design, featuring several black-and-white photographs by Monty Johnson, is absolutely lovely. This World Is Not My Home will serve as a fine introduction to a distinctive singer.","torrent":{"xt":"urn:btih:4f081d55fa877c225963dea4af9889459bccfddd","amp;dn":"Amy+LaVere+-+This+World+Is+Not+My+Home+%5B2005%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f081d55fa877c225963dea4af9889459bccfddd","infoHashBuffer":{"type":"Buffer","data":[79,8,29,85,250,135,124,34,89,99,222,164,175,152,137,69,155,204,253,221]},"announce":[],"urlList":[]}}