{"title":"Material Selection for Thermoplastic Parts - Michel Biron","uid":15466697,"size":14786340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f53e82dd76e3aac7b33d03f4cd353b7197b05c3&amp;dn=Material+Selection+for+Thermoplastic+Parts+-+Michel+Biron&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470103944,"description":"Material Selection for Thermoplastic Parts - Michel Biron (WA, 2016).pdf\r\n\r\nAs new applications are developed and plastics replace traditional materials in a widening spectrum of existing applications, the potential personal injury, property damage, financial and legal consequences of failure can be high. However, nearly half of plastics failure can be traced back to the original specification and selection of the material.\r\n\r\nThis book gives engineers the data they need to make an informed decision about the materials they use in their products, imparting a thorough knowledge of the advantages and disadvantages of the various materials to choose from. The data also suggests other candidate materials which the reader may not have originally considered. More than 30,000 thermoplastics grades are grouped into circa. 300 subfamilies, within which over 20 properties are assessed.\r\n\r\nThe abundance or scarcity of a material and its cost are also often important deciding factors. In this book, an economical overview of the plastics industry helps clarify the actual consumption and costs of thermoplastics including bioplastic, and the relationship of cost vs. performance is also examined for each thermoplastic subfamily. Immediate and long-term common properties are reviewed, including mechanical behavior, impact, thermal properties, and many more. Environmental considerations are also covered, including ease of recycling and sustainability.\r\n\r\n\r\n\r\nHelps engineers to implement a systematic approach to material selection in their work\r\nIncludes more than 300 subfamilies of thermoplastic, and a wide range of properties including chemical resistance, thermal degradation, creep and UV resistance\r\nEvaluates cost/performance relations and environmental considerations","torrent":{"xt":"urn:btih:4f53e82dd76e3aac7b33d03f4cd353b7197b05c3","amp;dn":"Material+Selection+for+Thermoplastic+Parts+-+Michel+Biron","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f53e82dd76e3aac7b33d03f4cd353b7197b05c3","infoHashBuffer":{"type":"Buffer","data":[79,83,232,45,215,110,58,172,123,51,208,63,76,211,83,183,25,123,5,195]},"announce":[],"urlList":[]}}