{"title":"Giardini_Di_Miro-Dividing_Opinions-2007-SAW","uid":3865292,"size":67812665,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4f7d95cfc899eb152082c0e52e57a04165a3d4d2&amp;dn=Giardini_Di_Miro-Dividing_Opinions-2007-SAW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Keckis","files":12,"time":1193760307,"description":"Artist : Giardini Di Mir\nAlbum : Dividing Opinions\nLabel : Homesleep\nGenre : Rock\nBitrate : 211 kbps avg\nSource : CD (LP)\nPlaytime : 00:42:45 (67 MB)\nRls date : 2007-01-26\nStore date : 2007-01-26\n\n[Track List]\n1. Dividing Opinions 2:07\n2. Cold Perfection 5:02\n3. Embers 4:28\n4. A Guide To Rebellion 4:35\n5. Spectral Woman 4:04\n6. Broken By 5:50\n7. Clairovoyance 4:09\n8. Self Help 3:59\n9. Petit Treason 8:31\n\nOpinioni che dividono e attese che separano. Questo il disco dei Giardini di\nMir, in pochissime parole. Band che, pur essendosi\nfatta sovente viva nel tempo passato da Punk... Not Diet, mancava: qualche\nsegnale di vita a volte non basta. Qualche data in\ngiro non soddisfa appieno, come un caff preso di fretta con qualcuno con cui\nhai condiviso cose per poi partire e, di nuovo, non\nvedersi per molto tempo.\nMolto per si detto su di loro, questo s. Nessuno\nstato con le mani in mano e con le dita ferme: forum, blog e tutte le\npossibili sorgenti di comunicazione della scena\nalternativa italiana hanno chiamato a gran voce per sapere cosa sarebbe\naccaduto, per dire che le quotazioni erano in\ndiscesa/salita a seconda della personale disposizione. Non sono stati anni di\npace per dirla con Riccardo Sinigallia, anche se qui\nparliamo di voci che si rincorrono e non di inquietudini profonde.\n\nOra manca poco, anzi non manca niente: il disco qui che suona, e non so se\navete presente le prime reazioni a qualcosa che\naspettavi, quando non conta realmente la qualit reale della cosa, quando\nlimportante la presenza delloggetto, del suono,\ndel colore. C e ti infonde sicurezza, anche solo per un attimo. Poco dopo\nviene il tempo per guardarlo con occhi critici e\ndisincantati.\nVoglio guardare questo disco con tali occhi, ora, e\ntenere molto del resto per me.\n\nDividing Opinions, allora, in due minuti (i primi) fa gi capire molto: certe\ncose, ora, Jukka e soci le vogliono dire senza\nintermediari, c lurgenza di metterci la faccia e vedere leffetto che fa. Ed\nla cosa pi lampante, che poi si traduce anche in\nun impatto sonoro decisamente meno crescente sulla lunga distanza: si va subito\nsu di giri per frenare quando sarebbe lecito\naspettarsi che il motore esploda. E invece non esplode, lasciando nel limbo una\nchitarra sporca e sola.\nSulla sua coda ne arriva unaltra a introdurre Cold Perfection, dove ancora\nJukka a cantare, dove la batteria dritta e il\npiglio quello della canzone pop, naturalmente imbastardita sul finale con un\nbeat electro e attraversata per tutto il suo corso da\nquesto senso di mancanza, sempre dietro langolo.\nCos come ci sono i Blonde Redhead di Misery Is A\nButterfly dietro Embers: quel senso di linearit circolare, la voce un po\nnasale di Corrado a ricordare quella di Amedeo Pace,\nle parti orchestrali gentili.\nArchi che proprio dolci non sono in Julys Stripes,\nanzi: la tensione sale, le chitarre si fanno cupe. Qui fanno capolino i Godspeed\nYou Black Emperor, da sempre amore dichiarato dei\nragazzi di Cavriago.\n\nQuesta volta per il gioco dei rimandi non vuol essere destabilizzante\nallitaliana perch, diciamolo, il nostro, a volte,\nun po un parlare di musica per somiglianze, come a dire che se ci sono\ninfluenze dichiarate o esplicite, la proposta perde\nautomaticamente potenza e bellezza. E un cercare corrispondenze nostrane ai\ngrossi nomi inglesi/americani, vedere queste realt\ncrescere per poi vanificare un po i loro sforzi cos, paragonando in modo\ndistruttivo, volgarizzando il senso stesso\ndellascoltare un disco o dellandare a un concerto. Ed quasi ora di cambiare\ndirezione.\nAllora, questo disco intriso di amore per alcune band, dai Sonic Youth (la\nconclusiva, lunga e dal tambureggiare tribale Petit\nTreason) ai Blonde Redhead, dai Godspeed You! Black Emperor agli Slowdive (il\nsingolo Broken By ricorda molto le atmosfere di\nSouvlaki). Sappiatelo. Ci sono momenti di differente intensit, cose riuscite,\nbelle, profonde. Altre un po meno.","torrent":{"xt":"urn:btih:4f7d95cfc899eb152082c0e52e57a04165a3d4d2","amp;dn":"Giardini_Di_Miro-Dividing_Opinions-2007-SAW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f7d95cfc899eb152082c0e52e57a04165a3d4d2","infoHashBuffer":{"type":"Buffer","data":[79,125,149,207,200,153,235,21,32,130,192,229,46,87,160,65,101,163,212,210]},"announce":[],"urlList":[]}}