{"title":"The Sure Word of Prophecy - Dr. Peter S. Ruckman","uid":11773647,"size":484632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ff3dbbd5d951ff366c09867b4bdde7f407b198b&amp;dn=The+Sure+Word+of+Prophecy+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427179321,"description":"Formerly titled &quot;The Kingdom of God verses the Kingdom of Heaven,&quot; this book gives a Christian philosophy of history and politics from a uniquely Biblical perspective. Tracing the origin, development, and consummation of the spiritual Kingdom of God and the physical Kingdom of Heaven, Dr. Ruckman proves conclusively that the two are different and reveals the horrendous consequences of believing and treating them as if they were the same. The origin, development, history, and consummation of both Kingdoms are given, and then secular history is placed alongside for an enlightening comparison.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:4ff3dbbd5d951ff366c09867b4bdde7f407b198b","amp;dn":"The+Sure+Word+of+Prophecy+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff3dbbd5d951ff366c09867b4bdde7f407b198b","infoHashBuffer":{"type":"Buffer","data":[79,243,219,189,93,149,31,243,102,192,152,103,180,189,222,127,64,123,25,139]},"announce":[],"urlList":[]}}