{"title":"Keith Jarrett  - The Art of Improvisation","uid":5081786,"size":1490347934,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:502e4c6225e7f71df736cec85f1fea2b80cff156&amp;dn=Keith+Jarrett++-+The+Art+of+Improvisation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eddie1969","files":9,"time":1252368252,"description":"Music Videos : Jazz : DVD quality\n\n\nKeith Jarrett is one of the few jazz superstars, whose concerts sell out almost immediately, wherever he plays. But Keith is much more than just a jazz musician. Through an exploration of his life and work, and close encounters with the man himself, this documentary offers an exceptional opportunity to examine the contrasting worlds of jazz and classical music. At the same time it will present a fascinating and analytical portrait of a complex but remarkable musician whose interests and influences range from jazz, ethnic and folk music, to Bach, Mozart, Stravinsky and Samuel Barber. \n\nThe film explores, through a collage of interviews and performance, the complete range of Keith Jarrett's life and work. Great archive material is interweaved with original and richly detailed filmed interviews, not only with Keith himself, but with all the musicians he has played with over the years, as well as with members of his family, tour managers and other close musical and recording associates. &quot;Keith Jarrett - The Art of Improvisation&quot; - produced and directed by Mike Dibb, in collaboration with Jarrett's biographer Ian Carr - is the first ever major documentary about Keith Jarrett to be made with the full co-operation of Jarrett himself.\n\n\nPerformers: With Manfred Eicher, Gary Peacock, Jack DeJohnette, Steve Cloud, Scott Jarrett, George Avakian, Charles Lloyd, Gary Burton, Miles Davis, Toshinari Koinuma, Chick Corea, Charlie Haden, Dewey Redman, Rose Anne Jarrett, Jan Garbarek, Jon Christensen and Palle Danielsson\n\n\nProgram length - 84 minutes, plus 42 minutes (bonus with performances and exclusive interviews).\n\n\nContents\n\nKeith Jarrett The Art of Improvisation.avi\nExtra Interview.avi\nThe Keith Jarrett Trio Live in Concert.avi\nThe Keith Jarrett Trio Live in Concert.mp3\nInfo.txt\nScans - covers front-back\n\n\nMediaInfo\n\nFormat: AVI\nSize: 1GB\n\nVideo: AVC at 1333 Kbps\n688 x 384 (1.792) at 25.000 fps\nAudio: MP3 at 320 Kbps\n2 channels, 48.0 KHz\n\n*Extras also in AVC\n*mp3 is in 320kbps CBR\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:502e4c6225e7f71df736cec85f1fea2b80cff156","amp;dn":"Keith+Jarrett++-+The+Art+of+Improvisation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"502e4c6225e7f71df736cec85f1fea2b80cff156","infoHashBuffer":{"type":"Buffer","data":[80,46,76,98,37,231,247,29,247,54,206,200,95,31,234,43,128,207,241,86]},"announce":[],"urlList":[]}}