{"title":"Enrique Iglesias - Enrique 320cbr (Big Papi) 1999","uid":9476820,"size":129361952,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:50e2d82b08b89e0b038d59d0ef5299ba95ff39f4&amp;dn=Enrique+Iglesias+-+Enrique+320cbr+%28Big+Papi%29+1999&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389716760,"description":"Enrique Iglesias - Enrique 320cbr (Big Papi) 1999 (Size: 123.37 MB)\n\nSource: 1999 CD\n\n\n\n \t\t\n01 Enrique Iglesias - Rhythm Divine.mp3\t8.02 MB\n \t\t\n02 Enrique Iglesias - Be with You.mp3\t8.42 MB\n \t\t\n03 Enrique Iglesias - I Have Always Loved You.mp3\t10.09 MB\n \t\t\n04 Enrique Iglesias - Sad Eyes.mp3\t9.51 MB\n \t\t\n05 Enrique Iglesias - I'm Your Man.mp3\t10.83 MB\n \t\t\n06 Enrique Iglesias - Oyeme.mp3\t10.05 MB\n \t\t\n07 Enrique Iglesias - Could I Have This Kiss Forever.mp3\t10.01 MB\n \t\t\n08 Enrique Iglesias - You're My #1.mp3\t10.31 MB\n \t\t\n09 Enrique Iglesias - Alabao.mp3\t9.2 MB\n \t\t\n10 Enrique Iglesias - Bailamos.mp3\t8.19 MB\n \t\t\n11 Enrique Iglesias - Ritmo Total.mp3\t8.01 MB\n \t\t\n12 Enrique Iglesias - Mas Es Amar (Sad Eyes).mp3\t9.72 MB\n \t\t\n13 Enrique Iglesias - No Puedo Mas Sin Ti (I'm Your Man).mp3\t10.99 MB\n\n\nBy &quot;elyjar&quot;\nThis CD caught be completely off guard when i first listened to it. &quot;ENRIQUE&quot; is the self titled album from this young dynamic latino sensation. This is his forth and perhaps his most impressive release to date. Leaving the good looks and charisma aside, this album is evidence that this exciting young performer is more than just a pretty face. In fact, this guy is major talent!\n\nIn this album, Enrique demonstrates his maturity and versatlity well beyond his youth. This album has a quality that very few albums have, that is originality and the courage to experiment with different musical styles. He doesn't just adhere to his latin roots, but ventures into pop, rock and ballads with a new found confidence and inspiration under his belt. His mezmerizing vocals are an extension of his soul and what he's feeling deep down inside. This wonderful and emotional voice quivers like the wings of a moth in the fire and trembles like a falling leaf in the wind. This passion and exuberance flow right through the album from start to finish with honesty and an unpretetious quality that is un-matched by any other artist today.\n\n'Rhythm Divine' is just that - Divine Rhythm that captures your soul and takes your cares away. The frank and sexy lyrics in 'Oyeme' and 'Alabao' will take your breath away and leave you wanting more. More is what you get, with tracks like 'Be with you' and 'Bailamos' which are just fantastic with an up-beat tempo best described as pop with a spanish/latin sound. A surprizing departure from his usual is the cover of Bruce Springteen's 'Sad Eyes', which he does so brilliantly(almost passes for Chris Isaak). Other winners in this bunch include the pop ballads 'I'm your man' and 'You're my No. #1'.\n\n&quot;Enrique&quot; the album is also laced with some of musics' hottest stars. Included in the guestlist are Diane Warren, David Foster, Whitney Houston and Patrick Leonard. However, even the best producers and composers can only do so much, and in this case, the major success of this stunning album lies in the hands of the singer and writer, whose talant, passion and relentless drive for perfection has only produced one of the best releases of the year.\n\nLike all other albums from Enrique, this one's unpretentious and comes straight from the heart.\n\n5 Stars for a class act!","torrent":{"xt":"urn:btih:50e2d82b08b89e0b038d59d0ef5299ba95ff39f4","amp;dn":"Enrique+Iglesias+-+Enrique+320cbr+%28Big+Papi%29+1999","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50e2d82b08b89e0b038d59d0ef5299ba95ff39f4","infoHashBuffer":{"type":"Buffer","data":[80,226,216,43,8,184,158,11,3,141,89,208,239,82,153,186,149,255,57,244]},"announce":[],"urlList":[]}}