{"title":"ScoreHD - Alyssa Lynn - Private Lap Grinder","uid":11751101,"size":686815064,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5160d9374819e9d8a856ac5bb5ecdd999e280c5e&amp;dn=ScoreHD+-+Alyssa+Lynn+-+Private+Lap+Grinder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"chkm8te","files":1,"time":1426216143,"description":"ScoreHD - Alyssa Lynn - Private Lap Grinder\n\nHottie with a body, Alyssa Lynn (SCORE Holiday '14, February '15) has a special reason she's going to boff for you in &quot;Private Lap Grinder&quot; but Alyssa will explain all that before she raises the wood and sits on Tony Rubino's lap. What a babe. Pretty, stacked and eager to tease then please. Tony dive-bombs for Alyssa's big, jutting tits once he sees them and does a face-plant on them, something every dude who sees her stripping on stage fantasizes about doing. They strip their clothes off for action and the first thing Alyssa does is kneel and wrap her sexy lips around his beef-stick to give him a sloppy, gooey, saliva-dripping-down-her-chin blow job--the very best kind. Alyssa gets into bed and lies on her back, ready to get her tits fucked. Tony mounts her, straddling her chest and sandwiching his cock between her hot hooters, something strip club dudes want to do also. This is real global warming. Alyssa urges him on with pillow talk and raises her head up to catch the tip of his dick in her mouth. Her lips make loud popping sounds when the cock pulls out and slides back in. They go from tit-fucking right to pussy-fucking in the missionary position. Totally naked except for her heels, Alyssa is very vocal and that adds to the heat. They move into a sideways bang so Tony can stuff Alyssa again. Alyssa gets on Tony's lap in a reverse cowgirl and her dancer experience and fitness level are clear when she grinds all the way up and down on his pole in a standing squat with her heels still on. &quot;I like being more submissive, but then again, I sometimes like being more aggressive,&quot; Alyssa said the first time she visited SCORELAND. Alyssa wants more sexing, this time in a cowgirl. She really knows how to ride it to cum-town and she's a screamer. In cowgirl she's aggressive but when they switch to doggie, Alyssa becomes submissive as he drills into her pink. &quot;What I do on-camera is what I like,&quot; says Alyssa. And what Alyssa does on-camera is what we like.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=iu6sdgfw5hydclegl7ig.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=iu6sdgfw5hydclegl7ig.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=xwewrwc2nrd09w7a1rix.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=xwewrwc2nrd09w7a1rix.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:5160d9374819e9d8a856ac5bb5ecdd999e280c5e","amp;dn":"ScoreHD+-+Alyssa+Lynn+-+Private+Lap+Grinder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5160d9374819e9d8a856ac5bb5ecdd999e280c5e","infoHashBuffer":{"type":"Buffer","data":[81,96,217,55,72,25,233,216,168,86,172,91,181,236,221,153,158,40,12,94]},"announce":[],"urlList":[]}}