{"title":"Animal Collective -  Merriweather... [24 bit FLAC] vinyl","uid":8182977,"size":1196891632,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51bd640002fd9b0a9ec669a0f990047cff66fc1b&amp;dn=Animal+Collective+-++Merriweather...+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"24.96","files":-1,"time":1361664179,"description":"  Animal Collective -  Merriweather Post Pavilion (2009) [24 bit FLAC] vinyl\n\n  Released: 2009\n  Genre: Pop/Rock\n  Style: Experimental Rock, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. In the Flowers\n  02. My Girls\n  03. Also Frightened\n  04. Summertime Clothes\n  05. Daily Routine\n  06. Bluish\n  07. Guys Eyes\n  08. Taste\n  09. Lion in a Coma\n  10. No More Runnin\n  11. Brothersport\n\n  Animal Collective have brought the celestial down to earth with each record, but they've never sounded simultaneously otherworldly and approachable quite like they do on Merriweather Post Pavilion. Their eighth studio LP, it finds them at their best -- straining farther away from conventional song structure and accompaniment, even while doubling back to reach lyrical themes and modes of singing at their most basic or child-like. Where before AC expertly inserted experimental snippets into relatively straight-ahead songs, Merriweather Post Pavilion sees them reach some kind of denouement where pop music ends and pure sonic experience begins -- the sound is the only structure. Dismantling the framework of a pop song almost entirely (but using recurring passages in a very poppy way), the group offer a series of overlapping circular elements, all of which occasionally come together for a chorus but then break apart just as quickly. The music itself, at least what's describable about it, consists of deep bass pulses and art-damaged guitars with overlapping vocal harmonies that rise in a holy chorus. This may sound much like previous Animal Collective highlights, but where those records seemed like a series of accidental masterpieces -- the type of work that sounds brilliant only because it's been culled from hundreds of hours of tape -- Merriweather Post Pavilion is a perfectly organized record, not a note out of place, not a second wasted. It has the excitement and energy of Sung Tongs, the ragged sonic glory of Feels, and Strawberry Jam's ability to make separate parts come together in a glorious whole. Like the best experimental rockers surging toward nirvana -- from the Beach Boys to Mercury Rev -- Animal Collective have not only created a private soundworld like none other, they've also made it an inviting place to visit.","torrent":{"xt":"urn:btih:51bd640002fd9b0a9ec669a0f990047cff66fc1b","amp;dn":"Animal+Collective+-++Merriweather...+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51bd640002fd9b0a9ec669a0f990047cff66fc1b","infoHashBuffer":{"type":"Buffer","data":[81,189,100,0,2,253,155,10,158,198,105,160,249,144,4,124,255,102,252,27]},"announce":[],"urlList":[]}}