{"title":"Making History New: Modernism and Historical Narrative","uid":11179441,"size":2111446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51d185e627de7cde46385ee3e16fd5558d1aba35&amp;dn=Making+History+New%3A+Modernism+and+Historical+Narrative&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hello505","files":1,"time":1412842209,"description":"Making History New explores how several British modernists applied the experimental methods of literary modernism to the writing of narrative history and historical novels. The historical novel is usually assumed to be only a concern of either nineteenth century realism or postmodernism, but the historical works of Joseph Conrad, Ford Madox Ford and Rebecca West evidence a modernist obsession with historical narrative. Works like Nostromo, Parade's End and Black Lamb and Grey Falcon utilized literary techniques we have come to associate with modernism-fragmentation, subjectivity, nonlinearity-in their effort to narrate the past, but unlike many of their contemporaries they never jettisoned narrative as the primary means for textual engagements with the historical past. Such a divisioning between narrative and non-narrative modes of writing history also mark the field of historiography in the wake of the Holocaust, with poststructural challenges to narrative history compelling many historians to deprioritize the role of narrative. By contrast, many historians have experimented in &quot;creative history,&quot; works of history that acknowledge the possible limitations of narrative but that attempt to ingest such problems into the very form of historical recreation. The modernist historians can provide models for such an enterprise, as they were aware of the pitfalls of narrative, but were also driven by an ethical imperative to relate the past in the forms of stories, and so employed modernist techniques to both signal the past but also stage the difficulties of the recreation of history in language.","torrent":{"xt":"urn:btih:51d185e627de7cde46385ee3e16fd5558d1aba35","amp;dn":"Making+History+New%3A+Modernism+and+Historical+Narrative","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51d185e627de7cde46385ee3e16fd5558d1aba35","infoHashBuffer":{"type":"Buffer","data":[81,209,133,230,39,222,124,222,70,56,94,227,225,111,213,85,141,26,186,53]},"announce":[],"urlList":[]}}