{"title":"WordWeb Pro v6.03","uid":5551807,"size":206540205,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:529ac0394481f90fdf1bfa41e9e4b6c9190f0098&amp;dn=WordWeb+Pro+v6.03&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MAYURG","files":9,"time":1273572433,"description":"Wordweb is a feature rich software that does much more than a paper dictionary or thesaurus. WordWeb is truly a Word Web - each set of synonyms is linked to other related sets. Look up &quot;tree&quot;, click on the &quot;Types&quot; tab and you'll have a list of different types of tree. Click on &quot;Part of&quot; and WordWeb will tell you that a tree can be part of a &quot;forest&quot; or &quot;wood&quot;.\n\nCan connect dictionaries on CD from other razrabotchikov.Professionalnaya version can even search for words with given letters in certain positions (for guessing crossword puzzles). Select the configuration for the American, British, Canadian, Australian or Asian English yazyka.Plotno kontachit with Word 'Q and other Vindovoznymi prilozheniyami.Eta version is not friendly with the Mac, Palm or Pocket PC.\nDatabase tezariusa WordWeb belongs Princeton University.\n\nWhat's New\n\nVersion 6 is a major upgrade from previous versions, with extensive database revisions and many new features.\n\nPronunciations\nWordWeb Pro now comes with 70 000 professionally-recorded audio pronunciations. These include both American and British variants (your language settings determine which show). The text pronunciations have also been completely revised, and now include syllable information.\n\nMore word links\nWords now show derived forms underneath the definitions, and there are new links between often-confused words. New &quot;On Topic&quot; links list words related to particular topics (eg under statistics you see distribution, covariance, etc.)\n\nAdd extra optional dictionaries\nYou can now purchase additional dictionaries, displayed on separate tabs for easy access like the web references.\n\nImport and Export definitions\nYou can now import and export both custom definitions and custom glossaries from tab or comma-separated text files. There's improved support for shared databases, and a feature to remove sets of entries (eg to revert an import).\n\nDatabase revisions\nThe database has been extensively revised, including thousands of new definitions and synonyms, as well as many clarifications and improvements in core senses. There are also over 20 000 new example sentences.\n\nProgram enhancements\nGlossaries and custom definitions now fully support unicode, so you can use almost any language. You can edit the order of the web and other reference tabs, and there's an option to pre-load web references to make them load faster. Support for shared databases is improved, with new support for shared custom definitions as well as glossaries.","torrent":{"xt":"urn:btih:529ac0394481f90fdf1bfa41e9e4b6c9190f0098","amp;dn":"WordWeb+Pro+v6.03","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529ac0394481f90fdf1bfa41e9e4b6c9190f0098","infoHashBuffer":{"type":"Buffer","data":[82,154,192,57,68,129,249,15,223,27,250,65,233,228,182,201,25,15,0,152]},"announce":[],"urlList":[]}}