{"title":"The Central Construction Office of the Waffen-SS and Police -Aus","uid":11566790,"size":7290335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5328d372222a8470ee14762af54e156d1ec6ac19&amp;dn=The+Central+Construction+Office+of+the+Waffen-SS+and+Police+-Aus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416963299,"description":"Ever since the Russian authorities granted western historians access to their state archives, the files of the Central Construction Office of the Waffen-SS and Police Auschwitz, stored in a Moscow archive, have attracted the attention of scholars who are researching the history of this most infamous of all German war-time camps. Despite this interest, next to nothing was really known about this very important office, which was responsible for the planning and construction of the Auschwitz-Birkenau camp complex. This emphasizes the importance of the present study by Carlo Mattogno, which not only sheds light into this hitherto hidden aspect of this camps history, but also provides a deep understanding of the organization, tasks, and procedures of this office. This pioneering study, which is based on mostly hitherto unpublished Moscow documents, is indispensable for all those, who wish to avoid misinterpretations of Auschwitz documents, as they are frequently made by many Holocaust historians","torrent":{"xt":"urn:btih:5328d372222a8470ee14762af54e156d1ec6ac19","amp;dn":"The+Central+Construction+Office+of+the+Waffen-SS+and+Police+-Aus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5328d372222a8470ee14762af54e156d1ec6ac19","infoHashBuffer":{"type":"Buffer","data":[83,40,211,114,34,42,132,112,238,20,118,42,245,78,21,109,30,198,172,25]},"announce":[],"urlList":[]}}