{"title":"UK - 2016 - Father Brown - Series 04 - 10 (1280x720) Episodes","uid":13507021,"size":7594439964,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:536a7e1bcc1bf7dfe72fe86ed8d1232f99095db5&amp;dn=UK+-+2016+-+Father+Brown+-+Series+04+-+10+%281280x720%29+Episodes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":6,"uploader":"bnaron","files":12,"time":1455245906,"description":"UK - 2016 - Father Brown\r\nSeries 04 - 10 Episodes\r\n\r\nShow and Episode Descriptions Courtesy of Wikipedia https://en.wikipedia.org/wiki/Father_Brown_(2013_TV_series)\r\n\r\nThe series is set during the early 1950s, in the fictional Cotswold village of Kembleford, where Father Brown is the parish priest at St Mary's Catholic Church solving crimes to the exasperation of a baffled police inspector who often arrests the wrong suspect. Father Brown uses his closest friends' abilities to solve a case even when they are suspected of the crime; and his vocation as a priest often gives him an insight to the truth, so that justice but occasionally not the letter of the law may be served. The time period is during Britain's emergence from the hardships of the Second World War, and the death penalty is still in effect for capital crimes such as murder.\r\n\r\n\r\nSeries 4 Episode Descriptions\r\n\r\n2016-01-04 - The Mask of the Demon\r\n\r\nLady Felicia knows the Hollywood star Rex Bishop who is in Kembleford filming a &quot;B&quot; movie The Brides of the Demon. He invites Father Brown and Mrs McCarthy, a fan of Bishop, to view the filming. Tensions are evident between the film's participants, the director, his actress wife, a starlet, Rex Bishop, and the writer. The director is found dead wearing a demon's mask and Inspector Mallory does not appreciate Father Brown's help.\r\n\r\n\r\n2016-01-05 - The Brewer's Daughter\r\n\r\nSid falls for Grace Fitzgerald, the married heiress to a brewery and is her alibi when Mallory arrests her for murdering her father in a fire. Fitzgerald refusing to use Sid as an alibi asks Father Brown to search for the real killer and he uncovers evidence that Fitzgerald's husband and her younger sister killed the father. The suicide and a note left by another lover of Fitzgerald complicates the issue as he had been sacked by her husband when he caught them kissing.\r\n\r\n\r\n2016-01-06 - The Hangman's Demise\r\n\r\nA mother confronts a former hangman, Henry Lee, at his wedding anniversary about her son he executed, for murdering a court secretary, a year ago. An execution where the condemned man whispered to Lee who the killer was. The following morning Lee is poisoned with Hemlock. His friend George, an ex policeman, is arrested and released. The mother, recently released from prison, is arrested and a motive for Lee's wife emerges. Father Brown untangles a web of deceit and corruption in the police as Lee lays dying.\r\n\r\n\r\n2016-01-07 - The Crackpot of the Empire\r\n\r\nFather Brown is apprehensive when he receives an invitation to a party given by the recently released Uncle Mirth, a former music hall comedian, Brown helped to put in an asylum. When Brown and the other invitees arrive at the venue, a derelict warehouse, he and Mirth's brother find envelopes containing their death certificates. Inspector Mallory finds another death certificate for a second brother who had died of a heart attack outside the Presbytery the previous day.\r\n\r\n\r\n2016-01-08 - The Daughter of Autolycus\r\n\r\nFather Brown knows the Pope's coronation gift to the Queen of a priceless cross is too tempting to Flambeau and Brown convinces the Bishop to let him guard it. Flambeau arrives on Brown's doorstep seeking his help to steal the cross to save the life of his daughter he has never met; kidnapped by Flambeau's criminal partner he once left for dead. Before they can steal the cross it goes missing from the Bishop's Palace. Brown has underestimated Papal politics, Flambeau's daughter, and the consciences of men.\r\n\r\n\r\n2016-01-11 - The Rod of Asclepius\r\n\r\nLady Felicia's reckless driving lands her and Mrs McCarthy in adjoining hospital beds. A new admittance to the ward dies the following morning on the operating table. A nurse claims it is murder and is found dead the same afternoon forcing Inspector Mallory to do more than his first cursory investigation. Father Brown follows a different line of inquiry and Lady Felicia and Mrs McCarthy's snooping put the latter in danger on the same operating table.\r\n\r\n\r\n2016-01-12 - The Missing Man\r\n\r\nA pilot returns from the dead after eight years as Father brown is about to marry his wife to his brother. No one, except his daughter, is pleased to see him; especially his father who believes him to be a deserter. When he is found shot in the head, Inspector Mallory charges his wife after blood stained women's clothing are found; while the daughter's claims another woman entered the house are dismissed. Father Brown finds a visiting card for a cross-dressing bar and realises who the real killer is and that they cannot be exposed.\r\n\r\n\r\n2016-01-13 - The Resurrectionists\r\n\r\nFather Brown is puzzled when the grave of a recent burial is opened and the body is missing; only for it to turn up at a different undertakers. Inspector Mallory is even more mystified as the victim died of decapitation, in a motor cycle accident, with no sign of the injury. The undertaker is arrested and the animosity between him and the victims mother is for all to see. Father Brown uncovers the reason behind their hatred and the forbidden love the victim had for the undertakers daughter.\r\n\r\n\r\n2016-01-14 - The Sins of the Father\r\n\r\nRobert Twyman a leading aeronautics magnate receives a note that his son, a piano player and contestant in a local variety show, would be killed if he does not confess. Next morning the son is found strangled by his piano in a locked house with only his father and butler present. Twyman is convinced a journalist and his son's rival piano player is the killer. Inspector Mallory arrests Twyman after Lady Felicia finds him standing over the dead body of the journalist by her piano. Father Brown notices both pianists had been somehow playing the same music and the answer is in a book given to him by Doctor Mordaunt Jackson; a psycho-analyst in Kembleford giving a lecture.\r\n\r\n\r\n2016-01-15 - The Wrath of Baron Samdi\r\n\r\nBaron Samdi is the voodoo spirit of the dead that Emmanuel Jannite invokes when he follows his love, Yveline Lafond, to Kembleford. Lafond is working as lead singer in a Haitian jazz band. The band leader in love with Lafond is found dead in a swimming pool poisoned, and Jannite dies following a police chase. Inspector Mallory believes the case closed but Father Brown's snooping uncovers the killer. As he confronts him, Brown collapses as the killer tells him he has already poisoned him that morning","torrent":{"xt":"urn:btih:536a7e1bcc1bf7dfe72fe86ed8d1232f99095db5","amp;dn":"UK+-+2016+-+Father+Brown+-+Series+04+-+10+%281280x720%29+Episodes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536a7e1bcc1bf7dfe72fe86ed8d1232f99095db5","infoHashBuffer":{"type":"Buffer","data":[83,106,126,27,204,27,247,223,231,47,232,110,216,209,35,47,153,9,93,181]},"announce":[],"urlList":[]}}