{"title":"September 11 Movie Pack - Conspiracy - DVD","uid":6297031,"size":4535590912,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:542a3f93a0d1a3f77d53baa820939fc63fa5aea0&amp;dn=September+11+Movie+Pack+-+Conspiracy+-+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":36,"time":1302030995,"description":"On this DVD we have several films that help unfold the mysteries of what happened that day nearly 10 years ago.  If the info in these movies is hard to grasp please watch it again.  Aluminum planes cannot crash through steel buildings, on 9/11 the nose of the first plane exited the building! A PHYSICAL IMPOSSIBILITY.  Planes are made out of aluminum a very soft but strong metal, the building is made of THICK steel many times stronger than the aluminum, the plane would have shredded and crumpled as it struck the building.  This can only mean the plane was not real.  Also using the video footage we can calculate the speed of the plane, over 550MPH.  Consulting an aeronautical engineer we now that at the altitude of the building a plane cannot go this fast due to the fact that the engines cannot intake the dense air, a more realistic speed would have been 220MPH.  In order for a plane to reach 550+MPH it has to be 15,000ft or higher.  The plane wold have shook itself to pieces well before it hit the building.  There were no plane pieces at the pentagon just a few un-charred scraps, there should have been seats, luggage, engines, fuselage, wings, tail section, and bodies.  But the only bodies identified that day were of the patriots working in the pentagon.  Also the plane in Shanksville PA, nothing found there either, just some strategically placed bits.\n\nOn this DVD:\n\nSeptember Clues - Definitive Edition\n\nThe Great Conspiracy The 9-11 News Special You Never Saw\n\nLoose Change Second Edition\n\nPaul O'Neil - 60 Minutes Interview\n\nPaul Lemos - Bombs Exploding Witness\n\nTom Sullivan - Explosives Loader\n\nImpossible Plane Speed With Boeing\n\nFabled Enemies\n\n\n\nThis was a false flag attack, to spur the war against Iraq.  For OIL, For IMPERIALISM, For THE MILITARY INDUSTRIAL COMPLEX, For WORLD DOMINATION.  All done on the backs of the American people.\n\nTo watch this movie on a PC you can use Media Player Home Cinema  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt;  Just drag and drop the video-ts folder in the players window.\n\nTo burn a DVD you can use www.IMGburn.com\n\nIf you want to help spread the word please seed this torrent for at least 2 copies.  You can also burn the DVD and freely distribute them to the millions of clueless that are still out there.","torrent":{"xt":"urn:btih:542a3f93a0d1a3f77d53baa820939fc63fa5aea0","amp;dn":"September+11+Movie+Pack+-+Conspiracy+-+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"542a3f93a0d1a3f77d53baa820939fc63fa5aea0","infoHashBuffer":{"type":"Buffer","data":[84,42,63,147,160,209,163,247,125,83,186,168,32,147,159,198,63,165,174,160]},"announce":[],"urlList":[]}}