{"title":"Knute Rockne: All American (1940)","uid":4614354,"size":733771776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5462c8d1ddeed398b789b1e0e9de6ae85dd10e6e&amp;dn=Knute+Rockne%3A+All+American+%281940%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"amber11585","files":-1,"time":1230757325,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0032676/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0032676/&lt;/a&gt;\n\nThis film tells the tale of the legendary Knute Rockne who coached football at Notre Dame from 1918 to 1930, losing just 12 games and winning six national championships. Rockne was tragically killed in a plane crash in Kansas on March 31st, 1931. He as only 43 years of age. Knute was known as one of the most innovative and charismatic coaches of his era. He was the first football coach to initiate intersectional rivalries and build a national schedule. Knute is well known for coaching the most dazzling, dramatic, idolized athlete of all time, George &quot;Gipper&quot; Gipp, played in the film by the late President Ronald Reagan. Gipp's running, passing, kicking and leadership lifted Notre Dame to fame. George Gipp became Notre Dame's first All-American and the famous subject of Rockne's motivating pre-game speech, &quot;Win one for the Gipper.&quot; \n\nThe movie did a good job of displaying football action although it is a very different game than we see today. Rockne actually pioneered many of the offensive schemes seen today with men in motion and backfield alignments. \n\nDonald Crisp turns in a fine performance as Father Callahan and there's even the legendary four horseman in the film as well. The film is certainly dated by today's standards but it's a well done sports biography at a time when historical accuracy was not always important.\n\n\nRunning Time:  98 Minutes\nVideo:  Xvid avi\nLanguage:  English\nAudio:  AC3\nResolution:  512x384","torrent":{"xt":"urn:btih:5462c8d1ddeed398b789b1e0e9de6ae85dd10e6e","amp;dn":"Knute+Rockne%3A+All+American+%281940%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5462c8d1ddeed398b789b1e0e9de6ae85dd10e6e","infoHashBuffer":{"type":"Buffer","data":[84,98,200,209,221,238,211,152,183,137,177,224,233,222,106,232,93,209,14,110]},"announce":[],"urlList":[]}}