{"title":"Ketone Power by Cristian Vlad Zot","uid":11127219,"size":42350682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54bab1aa24fd6dbc2754bbae0559497a1c83556a&amp;dn=Ketone+Power+by+Cristian+Vlad+Zot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":-1,"time":1411986102,"description":"In Ketone Power, Cristi Vlad, self-experimenter and avid researcher outlines a common denominator in terms of nutrition, health, and physical performance. After all, human DNA is 99% exactly the same. So, there should be a prescription (Rx) that works for the majority of us.\n\nCristi himself, fed up with not being able to lose the last few pounds of his belly fat, has started studying and experimenting with ketogenic nutrition and ketosis.\n\nKetosis is the metabolic state where your body uses fat and ketone bodies (by-products of fat) as the main source of fuel and it is achieved by drastically eliminating sugar from the diet. Long-term constant ketosis leads to keto-adaptation.\n\nKeto-adaptation brought various improvements in Cristi Vlad's existence, such as: fat loss, elimination of hunger, elimination of cravings for high-carbohydrate foods, improved mental performance, ultra-high energy levels, less sleep required per night, better sleep, enhanced endurance and strength training output, and probably the most important: ability to eat chocolate every day.\n\nIn Ketone Power, Cristi Vlad, inspired by his mentors and armed with extensive research and personal experience outlines:\n\n1. How he lost 10 pounds of fat in 2 months eating 70% of his calories from fat and consuming 2,000-3,000 kcals per day. His exercising routine was reduced from 5-6 times/week to 1-2 times/week. Before/after photos are included.\n\n2. How the human body works differently when running on a fat metabolism compared to a carbohydrate metabolism (that which most of the people are in).\n\n3. How his 2 month experiment became his new lifestyle due to the benefits of keto-adaptation.\n\n4. How ketogenic nutrition is a powerful therapeutic approach to diabetes, obesity, neurodegenerative diseases, cancer, and other health issues.\n\n5. Protocols for strength training and endurance training.\n\n6. His shopping list and the foods he consumes daily to support keto-adaptation. Fat-bombs are included.\n\n7. His virtual academy consisting of mentors, websites, courses, MOOC sites, and Youtube channels all of which helped him achieve knowledge on ketogenic nutrition and human biochemistry.\n\nAll of what Cristi Vlad did and keeps doing does not include fancy and expensive gadgets or pockets full of cash. It only requires willingness to improve one's existence and enjoy life every second that passes. You can do this by yourself as well. This book is the prescription.","torrent":{"xt":"urn:btih:54bab1aa24fd6dbc2754bbae0559497a1c83556a","amp;dn":"Ketone+Power+by+Cristian+Vlad+Zot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54bab1aa24fd6dbc2754bbae0559497a1c83556a","infoHashBuffer":{"type":"Buffer","data":[84,186,177,170,36,253,109,188,39,84,187,174,5,89,73,122,28,131,85,106]},"announce":[],"urlList":[]}}