{"title":"Art Of Noise - And What Have You Done With My Body, God (2006) (","uid":4220347,"size":504426406,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5509f1e48327cb7ed105745f91837a744971416a&amp;dn=Art+Of+Noise+-+And+What+Have+You+Done+With+My+Body%2C+God+%282006%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"bigsimon","files":73,"time":1212560262,"description":"Music : Electro / Techno : MP3/Over 256Kbps\n\n\n\n\n\n\n\n\nArt Of Noise - And What Have You Done With My Body, God ? (2006) (MP3-EAC-320 kBs)\n\n\n\n\n\n\n\nA biography of The Art Of Noise from allmusic.com\n\n\n\nBiography by Stephen Thomas Erlewine\n\nAnne Dudley, Gary Langan, and Paul Morley were members of producer Trevor Horn&amp;#039;s in-house studio band in the early &amp;#039;80s before they formed the Art of Noise, a techno-pop group whose music was an amalgam of studio gimmickry, tape splicing, and synthesized beats. The Art of Noise took material from a variety of sources: hip-hop, rock, jazz, R&amp;B, traditional pop, found sounds, and noise all worked their way into the group&amp;#039;s distinctly postmodern soundscapes.\n\nDudley was the center of the group, having arranged and produced material for Frankie Goes to Hollywood, ABC, and Paul McCartney before forming the Art of Noise. The trio signed with Trevor Horn&amp;#039;s ZTT label, releasing their first EP, Into Battle With the Art of Noise, in 1983. The following year, the group released the full-length (Who&amp;#039;s Afraid Of?) The Art of Noise!, which featured the hit single &quot;Close (To the Edit).&quot;\n\nAfter &quot;Close (To the Edit),&quot; the group parted ways with Horn and ZTT, releasing In Visible Silence in 1986; the album included the U.K. Top Ten hit &quot;Peter Gunn,&quot; which featured Duane Eddy on guitar. Re-works of the Art of Noise, an album of remixes and live tracks, was released that same year. In No Sense? Nonsense!, released in 1987, saw the band experimenting with orchestras and choirs, as well as horns and rock bands. The next year, the Art of Noise released a greatest-hits collection, The Best of the Art of Noise, which featured their collaboration with Tom Jones on Prince&amp;#039;s &quot;Kiss.&quot;\n\nBelow the Waste (1990) captured the band experimenting with world music; it received a lukewarm critical and commercial reception. The following year, a low-key remix album directed by Killing Joke&amp;#039;s Youth called The Ambient Collection appeared. Later in the year, the Art of Noise broke up. Dudley eventually worked with Killing Joke&amp;#039;s Jaz Coleman and Phil Collins. Horn, Dudley, and Morley reunited in 1999 for a new album, The Seduction of Claude Debussy. Kevin Godley and Lol Creme were added to the lineup.\n\n\n\n\n\n\n\nAnd What Have You Done With My Body, God album review from cduniverse.com\n\n\n&quot;the NOISE taken to an ARTful level&quot;\n\n\nAnd What Have You Done With My Body God? is a very comprehensive look at Art Of Noise in their infancy. It covers the two years that they were on ZTT, the label that gave them life, and fans are able to hear rough mixes, demos, outtakes, and what were assumed to be discarded masters. Those who were impacted by the influence of their &quot;Into Battle&quot; EP and the &quot;(Who&amp;#039;s Afraid Of) The Art Of Noise&quot; album will enjoy hearing the development of such songs as &quot;Beat Box&quot;, &quot;Close (To The Edit)&quot;, &quot;Moments In Love&quot;, &quot;A Time For Fear (Who&amp;#039;s Afraid)&quot;, and &quot;Snapshot&quot;.\n\nThe booklet features interviews with all five original members (Trevor Horn, Anne Dudley, Jonathan &quot;J.J.&quot; Jeczalik, Gary Langan, and Paul Morley) talking about their music, their goals, and their anti-image, since in the early days they were represented with masks, statues, and wrenches. The reasons as to why are touched upon here. Also touched upon are the reasons as to why the core of the group left their label in order to find recognition and perhaps hit songs. They were able to find both, and not always with good results.\n\n&quot;And What Have You Done With My Body God&quot; features over 40 unreleased tracks on three CD&amp;#039;s. The fourth CD features the complete &quot;Into Battle&quot; EP (although the mix for &quot;Moments In Love&quot; is the single edit, not the full length version), along with the programs originally released on the cassingles for &quot;Close (To The Edit)&quot; and &quot;Moments In Love&quot;. Beat junkies, cratediggers, and bedroom producers will also love the insight of some of the secrets revealed within the AoN empire. An appropriate box set from one of the best &quot;non-groups&quot; in the world.\n\nSubmitted by johnbook9\n\n\n\n\n\n\n\nCD Pressing Information\n\n\nLabel: ZTT\nCatalog#: ZTT 201 CD\nFormat: 4 x CD\nCountry: UK\nReleased: 07 Aug 2006\nGenre: Electronic\nStyle: Abstract, Experimental\n\n\nCredits:\n\nArtwork By - Steve Gibson\nCompilation Producer - Pete Gardiner\nCompilation Producer [Assistant] - Vicky Ball\nCompiled By [And Curated By] - Ian Peel\nEdited By [Additional 2006 Edit], Producer [Additional 2006 Production] - Anne Dudley (tracks: 1-11, 1-13, 2-1, 2-5, 2-7, 3-4)\nMastered By [Digital Remaster] - Dennis Smith (3)\nWritten-By, Recorded By, Engineer, Producer - Art Of Noise, The\n\n\n\nNotes:\n\n4 CD hardbound digi-book set including 56 tracks, 41 previously unreleased with 36 page booklet containing track-by-track commentary by all five original members.\n\nCD1: The Very Start of Noise - early demos and tests.\nCD2: Found Sound and Field Trips - experimental recordings.\nCD3: Who?s Afraid of? Goodbye? - alternate recordings from the Who&amp;#039;s Afraid album, and final ZTT-era tracks.\nCD4: Extended Play - rare EPs, including Into Battle (tracks 4-1 to 4-9), That Was Close (track 4-10) and The Tortoise And The Hare (tracks 4-11 to 4-13).\n\n\n\n\nRetail release: 7th August 2006.\n\nCopies were available to order via ztt.com from 19th July 2006, and shipped shortly after.\nA promo sampler CD was bundled with ztt.com orders placed before 21st August 2006.\n\nArt Of Noise were: Anne Dudley, Trevor Horn, JJ Jeczalik, Gary Langan and Paul Morley.\n\n&quot;This Ars Nova edition is number six in Zang Tumb Tuum&amp;#039;s artefact series, previously hidden away as number 102 in the Incidental Series.&quot;\n\n\n\n\nBook foreword (edited):\n\n&quot;1983 to &amp;#039;85, when these early sessions took place, was an intense period. The finished recordings have become ubiquitous - and are regularly re-sampled and referenced by artists as diverse as Janet Jackson and The Prodigy - but the demos, alternative mixes and studio experiments, the very genesis of the Art Of Noise, have never been heard since. Did they even exist? It was thought not. After all, Trevor Horn has a reputation for not saving anything if a recording session doesn&amp;#039;t work out - if you change course, erase the tapes and move on. Don&amp;#039;t look back.\n\nBut Zang Tuum Tumb went on a search. Into the vaults of London&amp;#039;s recording studios - Sarm East, Sarm West, Angel Studios, Utopia and Mayfair, all of which hosted these early sessions. Tomb Raiders of the Lost Ark, Zang Tumb Tuum was on a mission? and struck gold. The complete Art Of Noise sessions, 1983 to 1985, as presented here, for the first time, never before heard or released.&quot;\n\n\n\n\n\n\nTrack List\n\n\n\nArt of Noise - And What Have You Done With My Body, God? (2006)\n\nDisc 1 - &quot;The Very Start Of Noise&quot;\n\n\n01. Beat Box (One Made Earlier) 02:18\n02. Once Upon a Lime 03:21\n03. War (Demo 2) 01:27\n04. Close to the Edge 02:19\n05. Confession 01:02\n06. Moments in Love 07:52\n07. Sign of Relief 01:27\n08. Who&amp;#039;s Afraid of Scale 04:36\n09. So What Happens Now? (Take 2) 04:23\n10. The Subject Has Moved Left 01:43\n11. It&amp;#039;s Not Fair 04:27\n12. Close to the Edge (Ruff Mix) 05:54\n13. A Time for Fear (Who&amp;#039;s Afraid?) 04:33\n14. Moments in Bed 06:11\n15. Untitled Track 00:55\n\n\n\n\n\n\nDisc 2 - &quot;Found Sounds And Field Trips&quot;\n\n\n01. Moments in Love (12&quot; B side idea) 03:10\n02. Tears Out of a Stone 02:56\n03. Samba #2 00:39\n04. The Chain of Chance 04:36\n05. Fairlight-In-The-Being 04:37\n06. Diversions 3 03:53\n07. Close (to Being Compiled) 03:47\n08. Diversion 5 03:46\n09. Damn It All! 01:42\n10. Structure 01:13\n11. The Angel Reel: Hymn 1 (Take 2) 00:36\n12. The Angel Reel: Hymn 3 01:20\n13. The Angel Reel: Fairground 00:43\n14. And What Have You Done With My Body, God? 04:40\n15. Klimax 01:48\n16. Who Knew? 02:36\n\n\n\n\n\n\nDisc 3 - &quot;Who&amp;#039;s Afraid Of ...Goodbye&quot;\n\n\n01. War (Demo 4) 04:39\n02. The Focus Of Satisaction 11:01\n03. Moments In Love (7&quot; Master Rejected) 03:44\n04. It Stopped 04:27\n05. The Uncertainty Of Syrup 01:21\n06. The Long Hello 04:34\n07. The Vacuum Divine 00:47\n08. The Ambassador Reel: Beatbox 03:54\n09. The Ambassador Reel: Medley 10:56\n10. The Ambassador Reel: Oobly 01:20\n11. Goodbye Art Of Noise 00:37\n12. untitled 01:06\n\n\n\n\n\n\nDisc 4 - &quot;Extended Play&quot;\n\n\n01. Battle 00:27\n02. Beat Box 04:49\n03. The Army Now 02:03\n04. Donna 01:45\n05. Moments In Love 05:11\n06. Bright Noise 00:05\n07. Flesh In Armour 01:24\n08. Comes And Goes 01:19\n09. Moment In Love 01:27\n10. Diversion 8, Diversion 2, Closest, Close-Up,\nClose (To The Edit), Closed 20:44\n11. Moments In Love (From Battle To Beaten) 14:28\n12. Love Beat 05:16\n13. In Case We Sneezed 00:31\n14. A Time To Hear (Who&amp;#039;s Listening) 03:32\n15. (Do) Donna (Do) 03:12\n16. Hidden Track 00:25\n\n\n\n\n\n\n\n\n\nENJOY .......................................................................... \n\n\n","torrent":{"xt":"urn:btih:5509f1e48327cb7ed105745f91837a744971416a","amp;dn":"Art+Of+Noise+-+And+What+Have+You+Done+With+My+Body%2C+God+%282006%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5509f1e48327cb7ed105745f91837a744971416a","infoHashBuffer":{"type":"Buffer","data":[85,9,241,228,131,39,203,126,209,5,116,95,145,131,122,116,73,113,65,106]},"announce":[],"urlList":[]}}