{"title":"Chaman - Noath Gordon [Ebook][Spanish]","uid":6702287,"size":2251747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:550ce500a6b7339679d82377e91dcbe501f1bfe8&amp;dn=Chaman+-+Noath+Gordon+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virana","files":-1,"time":1317023175,"description":"ChamÃƒÂ¡n - Noah Gordon\nTitulo: ChamÃƒÂ¡n\nAutor: Noah Gordon\nFecha de Publicacion: 1992\nPaÃƒÂ­s: Estados Unidos\nIdioma original: Ingles\nTÃƒÂ­tulo Original: Shaman\n\nSinopsis: EscocÃƒÂ©s y vÃƒÂ¡stago de una familia que ha practicado la medicina a lo largo de generaciones, Rob J. Cole debe emigrar por razones polÃƒÂ­ticas a las nuevas tierras de AmÃƒÂ©rica. Tras trabajar en Boston con el eminente cirujano Oliver Wendell Holmes, Cole partirÃƒÂ¡ rumbo al Oeste, hacia un territorio que los colonos todavÃƒÂ­n no han podido arrebatar a los indios sauk, y donde le esperan las experiencias mÃƒÂ¡s intensas de su vida profesional y sentimental. \n\nChamÃƒÂ¡n, esta maravillosa novela acerca de un doctor rural y su familia, presenta una visiÃƒÂ³n fascinante del siglo XIX norteamericano.\nEscocÃƒÂ©s y vÃƒÂ¡stago de una familia que ha practicado la medicina a lo largo de generaciones. Rob J. Cole se convierte a causa de sus opiniones polÃƒÂ­ticas en un hombre seÃƒÂ±alado como futura vÃƒÂ­ctima y decide huir a la nueva tierra de AmÃƒÂ©rica. Llega solo a Boston y encuentra trabajo como asistente de un eminente cirujano llamado Oliver Wendell Holmes. Pero no falta mucho para que el joven Rob J. se dirija al Oeste, a una tierra en que los colonos todavÃƒÂ­a no han vencido a los indios sauk.\nY asÃƒÂ­ se inicia la interesante saga de los Cole, una familia entregada a la medicina, un relato que abarca la vida y muerte, el amor y la violencia, la amistad duradera y la amarga rivalidad. ChamÃƒÂ¡n es la historia de un doctor blanco y de una mujer india que posee el don de curar, de la pasiÃƒÂ³n de un hombre por la hermosa mujer cuya vida salva, y del amor de un padre por el hijo que un dÃƒÂ­a recibe la herencia de una orgullosa tradiciÃƒÂ³n mÃƒÂ©dica. Al seguir la frontera de dos generaciones. ChamÃƒÂ¡n constituye una representaciÃƒÂ³n detallada y absorbente de la joven AmÃƒÂ©rica y de los hombres y mujeres que se establecieron allÃƒÂ­.\n---------------------------","torrent":{"xt":"urn:btih:550ce500a6b7339679d82377e91dcbe501f1bfe8","amp;dn":"Chaman+-+Noath+Gordon+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"550ce500a6b7339679d82377e91dcbe501f1bfe8","infoHashBuffer":{"type":"Buffer","data":[85,12,229,0,166,183,51,150,121,216,35,119,233,29,203,229,1,241,191,232]},"announce":[],"urlList":[]}}