{"title":"The Bitcoin Primer: Risks, Opportunities, And Possibilities","uid":9291206,"size":2138272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:553af4e5eef01d62a15c6e70ec7c2fa8fe81ef5f&amp;dn=The+Bitcoin+Primer%3A+Risks%2C+Opportunities%2C+And+Possibilities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"smimsin","files":1,"time":1386095462,"description":"Generously made free by the author, David Seaman:\n\n\nThe Bitcoin Primer is an intuitive, easy to understand, fast guide to global digital currency Bitcoin.\n\nThis e-booklet is designed to bring readers up to speed on the rapidly growing Bitcoin global payment technology. The booklet discusses the origins of Bitcoin, why digital currency is becoming desirable, best practices for business owners and freelancers to accept Bitcoin successfully, where to buy/sell coins safely, and a wide range of security considerations -- how to store your coins in a way that reduces risk of accidental loss, create offline paper backups, prevent theft, etc.\n\nI first became interested in Bitcoin back in October 2012, when I had an early investor on my show. Since then, it has been a wild ride and I've learned a tremendous amount about the unprecedented growth opportunities Bitcoin enables. I feel Bitcoin is one of the most important technologies of our lifetimes -- certainly right up there with the World Wide Web, email, and the smartphone. The disruptive potential of digital currency is difficult to overestimate.","torrent":{"xt":"urn:btih:553af4e5eef01d62a15c6e70ec7c2fa8fe81ef5f","amp;dn":"The+Bitcoin+Primer%3A+Risks%2C+Opportunities%2C+And+Possibilities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"553af4e5eef01d62a15c6e70ec7c2fa8fe81ef5f","infoHashBuffer":{"type":"Buffer","data":[85,58,244,229,238,240,29,98,161,92,110,112,236,124,47,168,254,129,239,95]},"announce":[],"urlList":[]}}