{"title":"Champions v1 01-17 (1975-1978|Digital|AnPymGold-Empire)","uid":10060470,"size":157876998,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:55734f57db85f448ecdc33161a3ebef817409ed5&amp;dn=Champions+v1+01-17+%281975-1978%7CDigital%7CAnPymGold-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1398719208,"description":"A fun little classic series that featured some great talents - among them Bill Mantlo, Jim Shooter and the great Don Heck on art. Summary from Comicvine - &quot;The short-lived, but legendary superhero team known as the Champions, starring a variety of superheroes such as Hercules, Ghost Rider, Iceman, Angel, Dark Star and the Black Widow!&quot;\n\nPromotional info for the first collected edition - &quot;Okay, a god, a demon, a spy and two mutants walk into... some of the strangest scenarios of the '70s! It's gods vs. heroes in the City of Angels! With mad scientists, Russian super-spies and guest-stars from Marvel's western and horror eras! Plus: the secrets of the Black Widow! Featuring Hawkeye!&quot;\n\nPromotional info for the second collected edition - &quot;Demon-gods, alien monsters and killer bees - it only goes to show that Angel, Iceman, Hercules, Black Widow and Ghost Rider did more before #17 than some teams get done by #50! The short-lived super-team squeezed multiple mayhem into mere months of masked marvelry! Featuring the Stranger and the Stilt-Man! Magneto and Modok! The world reign of Doctor Doom! The Sentinels and the Brotherhood of Evil Mutants! Guest-starring Spider-Man and the Avengers! Plus: destined for the pages of Punisher War Journal... Rampage!&quot;\n\nThanks to AnPymGold-Empire for the awesome digital copies of this series; they look great (especially after reading old scans for years). Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:55734f57db85f448ecdc33161a3ebef817409ed5","amp;dn":"Champions+v1+01-17+%281975-1978%7CDigital%7CAnPymGold-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55734f57db85f448ecdc33161a3ebef817409ed5","infoHashBuffer":{"type":"Buffer","data":[85,115,79,87,219,133,244,72,236,220,51,22,26,62,190,248,23,64,158,213]},"announce":[],"urlList":[]}}