{"title":"THE LAST VALLEY (M.Caine,O.Sharif) Dvd9 Spanish,English","uid":3714770,"size":7445596299,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5575ae53abc1b02472d66d46bfb1400b061fbf49&amp;dn=THE+LAST+VALLEY+%28M.Caine%2CO.Sharif%29+Dvd9+Spanish%2CEnglish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jousmari","files":41,"time":1181923579,"description":"SOLODVD ORG\n\nDirector: James Clavell\n\nCast: Michael Caine, Omar Sharif, Florinda Bolkan, Nigel Davenport, Per Oscarsson, Arthur O&amp;#039;Connell, Madeleine Hinde, Yorgo Voyagis\n\nLength: 125 min\n\nVideo: Pal 4:3, 1.85:1\n\nLanguages: Spanish, English\n\nSubtitles: Spanish\n\nSynopsis: James Clavell&amp;#039;s The Last Valley is a heartfelt film of paradise found and lost in the midst of the bloody Thirty Years War, a senseless religious conflict long since degenerated into a rabble of looters preying on peasants. It&amp;#039;s also a triumph of passion over style. Michael Caine stars as the Captain, a happily tolerant leader whose army of mercenaries--a mix of Protestants and Catholics--murders, pillages and rapes side by side for whichever faction is paying more at the time. Omar Sharif is Vogel, a lone refugee whose flight from the marauding band leads them all to a beautiful village in the mountains. The Captain and Vogel make an unlikely pair: the shrewd mercenary with the dream of peace, and the philosopher-peasant hanging on to his own life in the face of certain death--and their alliance to preserve this Eden and her people stands in contrast to the soldiers who soon become splintered by greed, lust and religious zealotry. Clavell isn&amp;#039;t exactly subtle, but his sense of irony is biting: one Christian soldier is ready to lead a mob in righteous battle after a perceived blaspheme, and in the next scene attacks and rapes an innocent Christian maiden he&amp;#039;s sworn to protect. The film falters in clumsy battle scenes and awkward dramatic staging, but Caine&amp;#039;s complex characterisation of the guarded Captain and Sharif&amp;#039;s haunted performance keep the story alive, and the beautiful photography fixes the film like a jewel into its setting.\n\nOther features: Interactive Menus, Scene Access, Film credits, Biographies\n\n\nDvd9 Untouched.","torrent":{"xt":"urn:btih:5575ae53abc1b02472d66d46bfb1400b061fbf49","amp;dn":"THE+LAST+VALLEY+%28M.Caine%2CO.Sharif%29+Dvd9+Spanish%2CEnglish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5575ae53abc1b02472d66d46bfb1400b061fbf49","infoHashBuffer":{"type":"Buffer","data":[85,117,174,83,171,193,176,36,114,214,109,70,191,177,64,11,6,31,191,73]},"announce":[],"urlList":[]}}