{"title":"Foo Fighters Live At The Wembley Stadium -- ISO","uid":4825011,"size":8050675712,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5589322945073436f3efed9adbef1cbb6ac39c08&amp;dn=Foo+Fighters+Live+At+The+Wembley+Stadium+--+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SydMosh","files":1,"time":1238913891,"description":"Foo Fighters have now immortalized for posterity their biggest ever headline stand with this 18-song DVD documenting their two sold out Wembley Stadium shows. The Wembley concerts, which took place Friday and Saturday June 6 and 7 of 2008, sold out within 24 hours, making them the biggest headline performances of the band's illustrious career--as well as the biggest Rock shows staged at the new Wembley to date. Live At Wembley Stadium is a career-spanning live opus, drawing on all six of Foo Fighters' studio albums, featuring classics &quot;Times Like These,&quot; &quot;Everlong,&quot; &quot;Monkey Wrench,&quot; &quot;All My Life&quot; and &quot;Learn To Fly&quot; as well as new live staples including &quot;Long Road To Ruin.&quot; The DVD also includes night two's historic encore, for which Jimmy Page and John Paul Jones of Led Zeppelin joined Grohl and Hawkins for renditions of &quot;Rock and Roll&quot; (with Hawkins on vocals and Grohl on drums) and &quot;Ramble On&quot; (with Grohl on vocals and Hawkins on drums). It concludes with a triumphant and highly emotional &quot;Best Of You&quot; with a closing chorus of 85,000 fans leaving Grohl visibly moved.","torrent":{"xt":"urn:btih:5589322945073436f3efed9adbef1cbb6ac39c08","amp;dn":"Foo+Fighters+Live+At+The+Wembley+Stadium+--+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5589322945073436f3efed9adbef1cbb6ac39c08","infoHashBuffer":{"type":"Buffer","data":[85,137,50,41,69,7,52,54,243,239,237,154,219,239,28,187,106,195,156,8]},"announce":[],"urlList":[]}}