{"title":"Sexually BrokenFormer Collegian Gymnast fucked  Wenona ","uid":8363971,"size":1230087435,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:55d276c4454cc6d91a1896bbb203b9160e6ec2cf&amp;dn=Sexually+Broken%5CFormer+Collegian+Gymnast+fucked++Wenona+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"merzedes","files":-1,"time":1365715820,"description":"Sexually BrokenFormer Collegian Gymnast gets roughly fucked, deep throated, made to orgasm over and over!  Wenona  Matt Williams\n\n \nMP4 only.\n\n \nWelcome Wenona back to the pagers of Sexually Broken. This former Collegian Gymnast is flexible, strong and is packing a set of 12 pack abs. Sexually Broken is also the only place on the net where you can find Wenona bound and getting real cock.\n\n Wenona is completely helpless, bound with leather and wooden poles trapping her to the bed in the perfect &quot;fuck me&quot; position. Her tight pussy is humiliatingly exposed. Her huge nipples feel the abuse of tight wooden clamps and her tongue is trapped in a Japanese wooden trap. \n\nThis is her first boy/girl bondage day. She has been a bondage model since 1999, but today is the first time she takes real cock while bound. The hard cock teases her pussy at first, but then drives home hard, causing Wenona to cum and cum quickly. We fuck her hard and deep, punishing her cervix and causing Wenona to moan like a common whore while the cock destroys her pussy. \n\nThe poles are removed and we manhandle her around so her head is upside down off the bed. The cock fucks her mouth hard, going deep down her helpless throat. Wenona fights for air as the cock brutally skull fucks her. Deep throat spit covers her face and glazes over her eyes as we fuck the shit out of Wenona's pretty face. \n\nWe fuck her mouth, spin her around, and fuck her pussy back and forth. This is cock overload for our helpless gymnast. In the end we vet wrap Wenona's long sexy legs behind her head, and cover the entire upper half of her body, mummifying her from toes to tits. She is stuck in a vertical piledriver, her ass and pussy exposed for anything we dare to imagine.\n\n We finger fuck, dildo and vibrate Wenona to a countless number of intense and screaming orgasms! So many that Wenona is reduced to a babbling drooling shell of her former self. She is cum drunk, deep in subspace and completely sexually overloaded and helpless. We leave Wenona with a &quot;g spot&quot; metal dildo jammed in her shaved cunt. She must push it out before we return, using only her pussy muscles. A task she is doomed to fail despite a heroic effort. \n\n\nScreens  &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/index.php?&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/index.php?&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\t","torrent":{"xt":"urn:btih:55d276c4454cc6d91a1896bbb203b9160e6ec2cf","amp;dn":"Sexually+Broken%5CFormer+Collegian+Gymnast+fucked++Wenona+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d276c4454cc6d91a1896bbb203b9160e6ec2cf","infoHashBuffer":{"type":"Buffer","data":[85,210,118,196,69,76,198,217,26,24,150,187,178,3,185,22,14,110,194,207]},"announce":[],"urlList":[]}}