{"title":"The Money Masters","uid":6473651,"size":1470868844,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56651ae24bd8b89bc98c0c5bac356f19c75d15ba&amp;dn=The+Money+Masters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"naba888","files":3,"time":1308233873,"description":"The Money Masters - How International Bankers Gained Control of America\n\nThe Money Masters is a 3 1/2 hour non-fiction, historical documentary that traces the origins of the political power structure. The modern political power structure has its roots in the hidden manipulation and accumulation of gold and other forms of money. The development of fractional reserve banking practices in the 17th century brought to a cunning sophistication the secret techniques initially used by goldsmiths fraudulently to accumulate wealth. With the formation of the privately-owned Bank of England in 1694, the yoke of economic slavery to a privately-owned &quot;central&quot; bank was first forced upon the backs of an entire nation, not removed but only made heavier with the passing of the three centuries to our day. Nation after nation has fallen prey to this cabal of international central bankers. Ask yourself: Why have you never been taught this highly important knowledge in your school?\n\nFiles: \n1) avi, Xvid (Perian), 720 x 480, Millions, MPEG Layer 3, Stereo, 44.100 kHz, 973.29 kbits/s, 01:43:15.98\n2) avi, Xvid (Perian), 720 x 480, Millions, MPEG Layer 3, Stereo, 44.100 kHz, 884.63 kbits/s, 01:46:20.98\n\ntags: money, bank, American, US, political, power, gold, FED, nwo, conspiracy, nation, illuminati, lucifer, 666, constitution, history, Rothschild, Rockefeller, elite, England, mason, secret","torrent":{"xt":"urn:btih:56651ae24bd8b89bc98c0c5bac356f19c75d15ba","amp;dn":"The+Money+Masters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56651ae24bd8b89bc98c0c5bac356f19c75d15ba","infoHashBuffer":{"type":"Buffer","data":[86,101,26,226,75,216,184,155,201,140,12,91,172,53,111,25,199,93,21,186]},"announce":[],"urlList":[]}}