{"title":"The Tunguska Mystery {BBS}","uid":7688654,"size":3256084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:575ade454ee56c108962285b91aa2643adfef875&amp;dn=The+Tunguska+Mystery+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1349032650,"description":" The summer of 1908 witnessed the arrival of an unknown space body and an explosion over the Tunguska forest in Central Siberia that could have flattened any major city on Earth. Most people think that the Tunguska event was explained long ago by scientists who study meteorites - that it was either a stony meteorite or the icy core of a comet. But these assumptions are not so tenable as their supporters would like to think. The Tunguska event remains an enigma in its second century of existence as perplexing as it has been throughout the past century. And what Russian scientists have discovered in recent decades is both astounding and reliable, and will cause some eyebrows to be raised.\n     The Tunguska Mystery is the first truly comprehensive and popular exposition of this century-long enigma written specially for western readers. It is objective and pays attention to both conventional and unconventional theories of the Tunguska space body's origin. Also, this is the only book written in the English language on Tunguska studies in the former Soviet Union and the new independent states that is entirely based on firsthand accounts of serious researchers directly engaged in these studies. The book's language is simple, The Tunguska Mystery is meant not only for specialists, but first of all for any reader who is interested in the fascinating mysteries of the world we live in.\n      As a reader noted on Amazon.com, the book is &quot;very well written. The illustrations and photographs help the reader to understand the great importance of this study. I found this book to be a fine addition to anyone's library. Who does not enjoy a good mystery... a true scientific mystery which may help us someday to protect our Earth from future Tunguska events. I wish to add that it was very enjoyable from beginning to end, with a touch of humor and many interesting facts!&quot;\n\n\n# Hardcover: 328 pages\n# Publisher: Springer; 2009 edition (August 31, 2009)\n# Language: English\n# ISBN-10: 0387765735\n# ISBN-13: 978-0387765730","torrent":{"xt":"urn:btih:575ade454ee56c108962285b91aa2643adfef875","amp;dn":"The+Tunguska+Mystery+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"575ade454ee56c108962285b91aa2643adfef875","infoHashBuffer":{"type":"Buffer","data":[87,90,222,69,78,229,108,16,137,98,40,91,145,170,38,67,173,254,248,117]},"announce":[],"urlList":[]}}