{"title":"The Anthony Cumia Show 2015-02-19 MP4 MP3 combo","uid":11713738,"size":305034724,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:57d7d9d1709c1ae39b19b9276034a9ab04fb1383&amp;dn=The+Anthony+Cumia+Show+2015-02-19+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mothergoose58","files":2,"time":1424444661,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 114: Another TACS week comes to a close with a reminder that Anthony will be on The Corrigan Show tonight, we hear what Obama has to say this time about ISIS, Ant gives his thoughts and views on the whole situation, and a few callers get their opinions in as well. The guys reminisce about how fun banking used to in the &quot;oldie days&quot;, we watch a Today Show clip with Colin Quinn, Ant tells us he enjoys acting but it's a bitch to memorize lines, and we go through a few of Norm MacDonald's tweets from last night regarding the SNL 40th anniversary show. We're then treated to a little Joe Piscopo action with a clip from &quot;Club Piscopo&quot;, and some hilariously cringe worthy audio from his morning radio show, talk about the Chinese New Year, and Ant partakes in a some very dishonorable commentary while watching perverted clips from TV in China. We then see a dash cam video, talk about the new Alien movie, watch a video diary from a crying crazy chick that ends with a sad pole dance, and hear a couple more brilliant entries for the &quot;Most Offensive Song&quot; contest.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:57d7d9d1709c1ae39b19b9276034a9ab04fb1383","amp;dn":"The+Anthony+Cumia+Show+2015-02-19+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d7d9d1709c1ae39b19b9276034a9ab04fb1383","infoHashBuffer":{"type":"Buffer","data":[87,215,217,209,112,156,26,227,155,25,185,39,96,52,169,171,4,251,19,131]},"announce":[],"urlList":[]}}