{"title":"Mastering Mobile Learning [2014] [PDF]","uid":12047039,"size":6757741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57e1740622c62cf0f34cae5fdae9f3f72c1927b5&amp;dn=Mastering+Mobile+Learning+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"NoctDeath","files":3,"time":1434920877,"description":"Title: Mastering Mobile Learning \nAuthor: Chad Udell \nFormat: PDF \nHardcover: 360 pages \nPublisher: Pfeiffer; 1 edition (October 13, 2014) \nLanguage: English \nISBN: 978-1118884911 \n\n\nDiscover the strategies, tools, and technologies necessary for developing successful mobile learning programs\nIn the modern, rapidly-expanding mobile learning environment, only clear guidelines and state-of-the-art technologies will stand up to the challenges that lie ahead. With a smart focus that combines a proven process with all-important strategies and practical applications, Mastering Mobile Learning stands as the most modern, comprehensive resource on the subject. It also features unique technical content previously unavailable among the literature of the mobile learning field. This book will help you turn concept into reality.\n\nThis book will show you best practices for obtaining and providing educational, training, and professional development content on devices like smartphones, tablets and other mobile devices. Trainers, educators, designers, instructional technologists, workplace learning professionals, and HR professionals will learn how mobile learning differs from other forms of e-learning, and will be introduced to the challenges and more importantly the advantages of mobile learning strategies and technologies for 21st century business environments. The book provides: * An overview of mobile learning, including evolving definitions and reasons for executives to embrace this approach * A discussion of the business drivers of mobile learning, advice for creating a mobile learning content strategy, and easy ways to inexpensively launch mobile learning * Valuable tips on how to use unique affordances of mobile devices to better serve your learners while they are on the go * Information on the ROI of mobile learning, using mobile devices as research tools, and why training in mobile development is critical * An overview of the technical aspects of the design and development of mobile learning\n\nWritten by experts in this burgeoning field, Mastering Mobile Learning provides a roadmap for creating the most effective learning content, strategies, and applications possible","torrent":{"xt":"urn:btih:57e1740622c62cf0f34cae5fdae9f3f72c1927b5","amp;dn":"Mastering+Mobile+Learning+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57e1740622c62cf0f34cae5fdae9f3f72c1927b5","infoHashBuffer":{"type":"Buffer","data":[87,225,116,6,34,198,44,240,243,76,174,95,218,233,243,247,44,25,39,181]},"announce":[],"urlList":[]}}