{"title":"Understanding Renewable Energy Systems - (Malestrom)","uid":4951508,"size":5402593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:580c082a67e5c373305c4adf7519ec24b30d3901&amp;dn=Understanding+Renewable+Energy+Systems+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1244909523,"description":" &lt;a href=&quot;http://bayimg.com/PAalfaAcP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PAalfaAcP&lt;/a&gt;\n\nVolker Quaschning, &quot;Understanding Renewable Energy Systems &quot;\nEarthscan Publications Ltd | 2005 | ISBN: 1844071367 | 192 pages | PDF \n\n* Provides technical details on different renewable energy systems plus background information on climate change and related economics\n* Ideal as a student text, including worked examples\n\nBeginning with an overview of renewables (including biomass, hydroelectricity, geothermal, tidal, wind, and solar power) this book explores the fundamentals of various renewable energy systems. The main focus is on technologies with high development potential such as solar thermal systems, photovoltaics, and wind power.\nThis text not only describes technological aspects but also deals consciously with problems of the energy industry. In this way, the topics are treated in a holistic manner, enabling readers to gain a broad understanding of renewable energy technology and its potential.\n\nReview\n&quot;Quaschning (Berlin Univ. of Applied Science, Germany) offers this latest effort to draw together the several technologies that comprise renewable energy. The book was first published in German in 1998. The author has now produced a very readable English edition with a number of very current projects used as examples. \nChapter 1 treats energy, climate change, and renewable energy sources. \nChapter 2 explains solar radiation\nChapter 3 solar thermal water heating. \nChapter 4 discusses photovoltaics \nChapter 5 windpower. \n\nThe final chapter treats economics. Excellent illustrations and graphs are complemented by an accompanying CD-ROM that displays all of the figures in the book plus 19 relevant software programs. The bibliography is extensive. This work is for all students of the world's energy dilemma. Summing Up: Highly recommended. All levels.&quot; -- J. C. Comer, emeritus, Northern Illinois University in CHOICE.","torrent":{"xt":"urn:btih:580c082a67e5c373305c4adf7519ec24b30d3901","amp;dn":"Understanding+Renewable+Energy+Systems+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"580c082a67e5c373305c4adf7519ec24b30d3901","infoHashBuffer":{"type":"Buffer","data":[88,12,8,42,103,229,195,115,48,92,74,223,117,25,236,36,179,13,57,1]},"announce":[],"urlList":[]}}