{"title":"Jaideva Singh - 1979 - Vijnana Bhairava OCR","uid":11678400,"size":10399950,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:581eb1758bf879b933fb0ed3b1ae43e4e01477af&amp;dn=Jaideva+Singh+-+1979+-+Vijnana+Bhairava+OCR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anomalous","files":1,"time":1422973046,"description":"Jaideva Singh - 1979 - Vijnana Bhairava or Divine Consciousness (OCR) (207p)\n\nLanguage: Sanskrit, Transliteration, English Translation, Exegesis\nPaperback: 173 pages\nPublisher: Motilal Banarsidass, (February 5, 2002)\nLanguage: English\nISBN-10: 8120808207\nISBN-13: 978-8120808201\n\nDescription:\nThis book is like a Rosetta stone of all of yoga condensed into 108 dharanas or centering techniques. When I first bought this book, I found some of these dharanas were very easy; others I found obscure. The deeper my practice has gone the more I learn.\nThe key is to absorb the dharanas (centering techniques) that are obvious. Over time, as one's yogic study deepens, many of the others will become apparent. The Vijnana-bhairava was written as the original home-study, Self-study course revealed by Bhairava (God). The practice of any tantric technique is by it's very nature done by oneself as each of our relationships to the Divine is a personal affair.\nThe amazing thing that this book conveys is a deep understanding of how we can find our connection with the Divine in our moment to moment existence. For the serious student there is no book I recommend more strongly. \n\nVijnanabhairava is a very ancient book on Yoga. It studiously eschews mechanical worship, external rites and ceremonies and goes directly to the heart of the problem of the union of human consciousness with the Divine. There is no theoretical discussion in the book. It describes 112 types of Yoga each of which is a precious gem delineating the mystic approach to the Divine. For this purpose, it makes full use of all the aspects of human life-prana, manas, imagination and intuition","torrent":{"xt":"urn:btih:581eb1758bf879b933fb0ed3b1ae43e4e01477af","amp;dn":"Jaideva+Singh+-+1979+-+Vijnana+Bhairava+OCR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"581eb1758bf879b933fb0ed3b1ae43e4e01477af","infoHashBuffer":{"type":"Buffer","data":[88,30,177,117,139,248,121,185,51,251,14,211,177,174,67,228,224,20,119,175]},"announce":[],"urlList":[]}}