{"title":"The Lifecycle of Software Objects by Ted Chiang","uid":9372599,"size":109235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5837f691034632a5ea9e8f035fc04ba4bf334bab&amp;dn=The+Lifecycle+of+Software+Objects+by+Ted+Chiang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":5,"time":1387558230,"description":"What's the best way to create artificial intelligence? In 1950, Alan Turing wrote, 'Many people think that a very abstract activity, like the playing of chess, would be best. It can also be maintained that it is best to provide the machine with the best sense organs that money can buy, and then teach it to understand and speak English. This process could follow the normal teaching of a child. Things would be pointed out and named, etc. Again I do not know what the right answer is, but I think both approaches should be tried.'\n\nThe first approach has been tried many times in both science fiction and reality. In this new novella, at over 30,000 words, his longest work to date, Ted Chiang offers a detailed imagining of how the second approach might work within the contemporary landscape of startup companies, massively-multiplayer online gaming, and open-source software. It's a story of two people and the artificial intelligences they helped create, following them for more than a decade as they deal with the upgrades and obsolescence that are inevitable in the world of software. At the same time, it's an examination of the difference between processing power and intelligence, and of what it means to have a real relationship with an artificial entity.","torrent":{"xt":"urn:btih:5837f691034632a5ea9e8f035fc04ba4bf334bab","amp;dn":"The+Lifecycle+of+Software+Objects+by+Ted+Chiang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5837f691034632a5ea9e8f035fc04ba4bf334bab","infoHashBuffer":{"type":"Buffer","data":[88,55,246,145,3,70,50,165,234,158,143,3,95,192,75,164,191,51,75,171]},"announce":[],"urlList":[]}}