{"title":"Illustrated Guide to Door Hardware - 1st Ed (2015) Gooner","uid":12518596,"size":10077318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:588b9a9149021ad5bef8e65934a5c12377cb5cc1&amp;dn=Illustrated+Guide+to+Door+Hardware+-+1st+Ed+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1443809541,"description":"Publisher: Wiley; 1 edition (April 13, 2015)\r\nLanguage: English\r\nISBN-10: 111811261X\r\nISBN-13: 978-1118112618\r\n\r\nYour one-stop, comprehensive guide to commercial doors and door hardware from the brand you trust\r\nIllustrated Guide to Door Hardware: Design, Specification, Selection is the only book of its kind to compile all the relevant information regarding design, specifications, crafting, and reviewing shop drawings for door openings in one easy-to-access place. Content is presented consistently across chapters so professionals can find what they need quickly and reliably, and the book is illustrated with charts, photographs, and architectural details to more easily and meaningfully convey key information. Organized according to industry standards, each chapter focuses on a component of the door opening or door hardware and provides all options available, complete with everything professionals need to know about that component.\r\n\r\nWhen designing, specifying, creating, and reviewing shop drawings for door openings, there are many elements to consider: physical items, such as the door, frame, and hanging devices; the opening's function; local codes and standards related to fire, life safety, and accessibility; aesthetics; quality and longevity versus cost; hardware cycle tests; security considerations; and electrified hardware requirements, to name a few. Until now, there hasn't been a single resource for this information. * The only resource available that consolidates all the door and hardware standards and guidelines into one comprehensive publication * Consistently formatted across chapters and topics for ease of use * Packed with drawings and photographs * Serves as a valuable study aid for DHI's certification exams\r\n\r\nIf you're a professional tired of referring to numerous product magazines or endless online searches only to find short, out-of-date material, Illustrated Guide to Door Hardware: Design, Specification, Selection gives you everything you need in one convenient, comprehensive resource","torrent":{"xt":"urn:btih:588b9a9149021ad5bef8e65934a5c12377cb5cc1","amp;dn":"Illustrated+Guide+to+Door+Hardware+-+1st+Ed+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"588b9a9149021ad5bef8e65934a5c12377cb5cc1","infoHashBuffer":{"type":"Buffer","data":[88,139,154,145,73,2,26,213,190,248,230,89,52,165,193,35,119,203,92,193]},"announce":[],"urlList":[]}}