{"title":"A World Gone Social - Ted Coine and Mark Babbitt - Audiobook MP3","uid":11196616,"size":302485669,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:58ed4e59e3e42f5f85c3dd6b3e0dc741f905934a&amp;dn=A+World+Gone+Social+-+Ted+Coine+and+Mark+Babbitt+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413099414,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nA World Gone Social: How Companies Must Adapt to Survive\n\nWritten by: Ted Coine, Mark Babbitt\nNarrated by: Tim Andres Pabon\nLength: 10 hrs and 28 mins\nUnabridged Audiobook\nRelease Date:08-20-14\n\nJust like the meteor that likely precipitated the end of the dinosaurs, social media is having a monumental impact on the world's economy; a change so dramatic that it has created a new business era. Welcome...to the Social Age.\n\nWhat does the Social Age mean for your business? Containing stories, analysis of real-world scenarios, and indispensable guidance, A World Gone Social gives you the tools and information you need to survive - and thrive - in a business climate in which customers hold all the cards... jobseekers have the power to easily find out what working at your company isreally like...and expertise has become more democratic than ever as employees collaborate with each other, as well as with vendors, customers, and even competitors.\n\nYou'll discover what the &quot;Death of Large&quot; and &quot;Flat: The New Black&quot; mean for you and your organization, how to build a socially enabled team that puts the customer experience first, and what it means to create an &quot;OPEN&quot; network of partners, collaborators, and brand champions. Filled with fascinating stories of success and failure at organizations including Barilla, Zappos, Bank of America, Lululemon, Abercrombie &amp;;amp Fitch, Southwest Airlines, and more, the book reveals how to avoid the dangers of insincerity as well as what it takes to become a &quot;Blue Unicorn&quot; - the social leader. Finally, you'll learn how to objectively assess the fitness of your company's current culture and social presence.\n\nIn the Social Age, companies unwilling to change will play the role of the dinosaurs: destined for extinction. A World Gone Social gives you the keys to avoid this fate - and lead your organization into this exciting business climate.","torrent":{"xt":"urn:btih:58ed4e59e3e42f5f85c3dd6b3e0dc741f905934a","amp;dn":"A+World+Gone+Social+-+Ted+Coine+and+Mark+Babbitt+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58ed4e59e3e42f5f85c3dd6b3e0dc741f905934a","infoHashBuffer":{"type":"Buffer","data":[88,237,78,89,227,228,47,95,133,195,221,107,62,13,199,65,249,5,147,74]},"announce":[],"urlList":[]}}