{"title":"Ultimate Viking EU4 mod","uid":10620624,"size":348589,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:59245e8b338a4b654acfdc063d7cb4a7a9508d80&amp;dn=Ultimate+Viking+EU4+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1406166977,"description":"Ultimate Viking EU4 mod\n\nExtract rar file to your 'C:Users[user]Documents Paradox Interactive Europa Universalis IV mod' folder\n\n\nDESCRIPTION\nThis mod IS COMPATIBLE with patch 1.7! The mod is NOT compatible with using the random new world.\n\nAdds the Vikings to the game in the area of Greenland and Northern America, reflecting the believed historical colonization areas of the New World.\n\nThis mod is incompatible with any mod that either:\nModifies/adds/removes Tech Groups (technology.txt)\nModifies/adds/removes Military tech group techs (mil.txt)\nModifies/adds/removes any other file in this mod that shares a name with the base game\nIf you are experiencing issues with this mod, be sure that mods that do the above are disabled and you are running the game in the English language.\n\nThis &quot;Ultimate&quot; version of the mod adds a new tech group, unique religion, and two new trade resources to the game. You will start off as the Viking Empire falling apart from internal strife. Start the game by making a choice between Vinland, Markland, or Greenland to reform as the United Viking Empire before going forth and spreading across the North. Go forth and reclaim Scandinavia to form the Nordic Pagan Empire if you chose to not be tempted to convert to Catholicism. Also added are unique new Viking units that focus on Shock and attack stats.\n\nThe Vikings feature their own unique National Ideas: Viking Empire (VIK): //Note - is dismantled at the start of the game. Traditions: Land Morale +10%, Leader Shock +5 Ambitions: Ship Recruitment Speed = -10% Born to Expand: Colonial Range +25% Way of the Waves: Naval Maintenance -10% Coastal Raiders: War Exhaustion -0.05/month Hardy Seamen: Naval Morale +5%, Heir Chance +15% Nordic Trade Empire: Global Trade Income +10% Ice Dwellers: Land Attrition -10% Modern Nordic Empire: Discipline +10% Vinland (VNL): Traditions: Land Morale +10%, Leader Siege +1 Markland (MRL): Traditions: Land Morale +10%, Land Leader Manuever +1 Greenland (GNL): Traditions: Land Morale +10%, Leader Land Shock +1 United Viking Empire (VIZ): Traditions: Colonist +1, Land Morale +10% Nordic Pagan Empire (NPE): Traditions: Colonist +1, Missionary Strength +3% They have their own Tech Group, Viking, which increases tech cost by 50%. This tech group uses Eastern military unit models. Their unique religion is Nordic Paganism. However, they will get an event that gives the choice of converting to the Catholic faith or stay Nordic and gain powerpoints. The choice will be tricky if you want to continue with fast colonization, as staying with Nordic Paganism will keep you in the Pagan religious group and mean you are subject to constant attack by other colonizing countries! On top of all of that, two new resources have been added to the game: Whale Oil and Seal Fur. Whale Oil will only be found in port provinces and Seal Fur will only appear in the Viking Northern America regions, but can appear in provinces without a port. Compatibility Notes: Mods that add trade goods and/or religions will cause issues with their respective icons. Mods that add tech groups are completely incompatible at this time. Recently Added: Version 6 has launched - refer to changelog. Version 5 has launched - refer to changelog. Version 4 has launched - refer to changelog.","torrent":{"xt":"urn:btih:59245e8b338a4b654acfdc063d7cb4a7a9508d80","amp;dn":"Ultimate+Viking+EU4+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59245e8b338a4b654acfdc063d7cb4a7a9508d80","infoHashBuffer":{"type":"Buffer","data":[89,36,94,139,51,138,75,101,74,207,220,6,61,124,180,167,169,80,141,128]},"announce":[],"urlList":[]}}