{"title":"Drunk with Blood - God's Killings in the Bible by Steve Wells","uid":11954387,"size":1830836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5924688e82a044987927751dd7cbfd70a651fa86&amp;dn=Drunk+with+Blood+-+God%27s+Killings+in+the+Bible+by+Steve+Wells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"twp6045","files":1,"time":1432327544,"description":"&quot;An eye-opening look at the rapes, genocides, and murders that are recounted with relish and approval in the so-called Good Book, and a nice reminder of how modern secular morality, based on human rights and human flourishing, is so much father advanced than the traditional morality of religion.&quot;\n-Steven Pinker, Johnstone Family Professor, Harvard University, and the author of The Better Angels of Our Nature: Why Violence Has Declined.\n\nIf you ask Christians to describe the God they believe in, they'll tell you he's kind, merciful, and perfect. In this book, Steve Wells reveals the God of the Bible for what he really is: a bloodthirsty killer. In this meticulously documented book, we're taken through a series of slaughters that will make you rethink everything you learned in Sunday School. If you still worship God by the end of it, you have some explaining to do.\n-Hemant Mehta, editor of FriendlyAtheist.com and author of The Young Atheist's Survival Guide\n\nDrunk With Blood includes a separate account for each of God's 158 killings. These stories fill the pages of the Bible, yet they are seldom read in church and are ignored by most Bible believers, which is a shame because God is so proud of his killings:\n&quot;I kill ... I wound ... I will make mine arrows drunk with blood and my sword shall devour flesh.&quot; Deuteronomy 32:39-42\nYou've probably hear of a few of God's killings. Noah's Flood,Sodom and Gomorrah, David and Goliath, maybe. But there are over 150 others that are unknown to pretty much everyone, believer and nonbeliever alike.\nDid you know, for example, that God:\n*Forced friends and family to kill each other for dancing naked around Aaron's golden calf?\n*Burned Aaron's sons to death for offering him strange fire?\n*Burned complainers to death, forced the survivors to eat quail until it literally came out their noses, sent &quot;fiery serpents&quot; to bite people for complaining about the lack of food and water, and killed 14,700 for complaining about his killings?\n*Buried alive those that opposed Moses (along with their families)?\n*Burned 250 men to death for burning incense?\n*Rewarded Phinehas for throwing a spear though the bellies of an inter-tribal couple while they were having sex?\n*Ordered, assisted in, or approved of dozens of complete genocides?\n*Accepted human sacrifice in the cases of Jephthah's daughter and Saul's seven sons?\n*Helped Samson murder thirty men for their clothes, slaughter 1000 with the jawbone of an ass, and kill 3000 civilians in a a suicide terrorist attack?\n*Smote the Philistines of several cities with hemorrhoids in their secret parts?\n*Killed a man for trying to keep the ark of the covenant from falling and 50,070 for looking into the ark?\n*Approved when David bought his first wife with 200 Philistine foreskins?\n*Killed King Saul for not killing every Amalekite as he told him to do?\n*Slowly killed a baby to punish King David for committing adultery?\n*Killed 70,000 because David had a census that he (or Satan) told him to do?\n*Sent a lion to kill a prophet for believing another prophet's lie, another lion to kill a man for not smiting a prophet, and some more lions to kill people that didn't fear him enough?\n*Killed 450 religious leaders who lost a prayer contest with Elijah and burned 102 men to death for asking Elijah to come down from his hill?\n*Sent two bears to rip apart 42 boys for making fun of Elisha's bald head?\n*Killed 27,000 Syrians by having a wall fall on them, sent an angel to kill 185,000 sleeping soldiers, interfered in human battles to kill a half million Israelite and a million Ethiopian soldiers?\n*Killed King Ahab for not killing a captured king, and then sent King Jehu on a series of mass murders to kill all of Ahab's family and friends who had ever &quot;pissed against a wall?&quot;\n*Killed Job's ten children in a bet with Satan?\nAll of these killings, and more, are found in the Bible, and their stories are told in the in the 2nd Edition","torrent":{"xt":"urn:btih:5924688e82a044987927751dd7cbfd70a651fa86","amp;dn":"Drunk+with+Blood+-+God%27s+Killings+in+the+Bible+by+Steve+Wells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5924688e82a044987927751dd7cbfd70a651fa86","infoHashBuffer":{"type":"Buffer","data":[89,36,104,142,130,160,68,152,121,39,117,29,215,203,253,112,166,81,250,134]},"announce":[],"urlList":[]}}