{"title":"American deception pdfs entire site as february 2009","uid":5156034,"size":6016212490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:594f4cece23cfcdc0b256ca2024b5611f34ef296&amp;dn=American+deception+pdfs+entire+site+as+february+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"john41q","files":435,"time":1257858701,"description":"This is the whole site content of  wwwamericandeceptioncom by Charlotte Iserbyte as of february 2009 (PDFS).\n\nFor reminders, these rare books in pdf format are entirely free to download there.\n\nSubjects included: \n\nBolshevism \nCivilization  \nCommunism  \nEconomics  \nEducation  \nGovernment  \nHistorical  \nMagic  \nMysticism  \nOccult  \nPhilosophical  \nPhysics  \nPolitical  \nPsychology  \nReligion  \nScientific  \nSecret Societies  \nSocialism  \nSociology  \nSoviet  \nSpiritualist \n\nDonations of 50$ will receive 2 DVDs with all the site content in slightly better quality, as well as fully searchable pdfs.\n\nPlease support them; when was the last time you received so much absolutely free of charge ?\n\nI have a fast pipe at the moment, so this will get seeded fast.\n\nFor those who don't know this site: \n\n&quot;Welcome to American Deception. This website is committed to exposing the deceptively hidden truths that have brought America, and the world as a whole, to the present situation where individual freedom is becoming a thing of the past. Little of what has occurred throughout history has been by mistake; yet there is a wide belief amongst the majority of people that &quot;bad things just happen for no reason at all.&quot; Seen as more of a faulty and clumsy political dance, it is easier for many people to believe that most unfortunate happenings are a result of misjudgments or error.\n\nWe have changed to a Donation Model so that the site content will be open for all to access. We do not and will not advertise so that this site will always remain independent. Should you find A.D. of historical value, we ask that donations are made to help cover the high cost of its creation and continued development. It did not come to us for free and any donations that are made will be greatly appreciated toward the line of one day breaking even. Donating is easy and can be done via the Donations link.\n\nAs our visitors will quickly notice, the informational content has rarely if ever been covered by the Major Media. This is of no surprise since the triangle is as one. It is hardly a complicated reality that the corporations own the government as well as the media. Therefore one should not be surprised that what is called news in this country is more omission than commission, and therefore does not reflect accurately what is happening here in the U.S. or elsewhere in the world.\n\nWhen the truth has been burned or hidden one immediately suspects connivance among those in charge, or to use a &quot;dirty&quot; word: &quot;conspiracy&quot;. We have been conditioned to believe that those who attribute certain actions to conspiracy should not be taken seriously in regard to the particular issue at hand or, more importantly, any issue they may discuss in the future. The media has been highly successful in limiting discussion of important issues simply by rejecting out of hand any mention of the role of conspiracy or planning in the economic, social, and political transformation of the globe as a whole. Its continued success in controlling the news has had a devastating impact on the ability of the average citizen to know what is going on, which would enable us to participate in public policy or as elected officials. Conspiracy is nothing more than a fancy word for &quot;planning&quot; in which the citizens have deliberately been excluded from the early stages thereby leaving them in the dark as to the ultimate goal of the project. This website contains a vast amount of information regarding the who, where, what, and how of recent history, most of which has not been easily available to the public until very recently. The expanding collection available on this website spans from the 1700's to the present. It deals with masterminding behind the scenes and, most important of all, many of the entries were written by the planners themselves. Most of the information was intended for &quot;internal&quot; use only; &quot;for THEIR eyes only&quot;, one would say. Fortunately, throughout history, secret documents have made their way into the hands of those outside the &quot;inner circle.&quot;\n\nMany of these historical documents have been hidden away due to the fear that they would be destroyed by the planners. The Internet has changed this situation for the better. Important documents, long held secret, are now available on the web and no one can destroy them. Once on the web, they travel far and wide Every time a file is downloaded it becomes a whole new copy. There will be no way to make it vanish. Before long there will be millions of copies of each book and/or document readily available for whoever is interested in &quot;real&quot; history and who cares about the future of generations to come. We can only hope that such easy dispersion of the truth will help citizens understand what has taken place without their knowledge or consent. An understanding which will enable them to take action to reverse the present course of history.\n\nMany visitors to this site are aware that something has been amiss for quite some time. We are happy to provide you with an informational machine that will confirm your suspicions. To those who are bewildered by what is going on, we welcome you to the truth. It will often be shocking for many of you who, up until now, thought our leaders had our best interests in mind. Our elected leaders are not in the driver's seat; they are nothing but puppets, with the &quot;planners&quot; pulling the strings behind the scenes.\n\nAs you will notice, this site is rather neutral with regard to the existence or non-existence of an agenda. Our interest is primarily to inform from all angles so that you may gain an objective understanding of what has really been going on. As you can see from the content menu, there are many categories involved. When assembled they allow us to see the whole picture, not just to be diverted into focusing on isolated pieces of this vast historical puzzle, important as they may be.&quot;","torrent":{"xt":"urn:btih:594f4cece23cfcdc0b256ca2024b5611f34ef296","amp;dn":"American+deception+pdfs+entire+site+as+february+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"594f4cece23cfcdc0b256ca2024b5611f34ef296","infoHashBuffer":{"type":"Buffer","data":[89,79,76,236,226,60,252,220,11,37,108,162,2,75,86,17,243,78,242,150]},"announce":[],"urlList":[]}}