{"title":"The Christian Liar's Library - Dr. Peter S. Ruckman","uid":11773651,"size":626236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a27ef4b4b59c5b61765156380854ec347f0aad1&amp;dn=The+Christian+Liar%27s+Library+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427179396,"description":"An examination of popular Christian &quot;celebrities&quot; in the Laodicean Church Age and their lies.\n\nIt is expedient that someone right before the close of the Church Age gives you a ?print out? on the so-called ?godly scholars? who have passed on three outrageous lies from generation to generation of Christians. It is high time that you see the extent, intensity, and durability of those three lies by which these professional liars made their living. This work is a ?Who?s Who? of the Christian celebrities who will lie about the Bible while using it to earn their ?bread and butter.? They are professional liars who pose as leaders and guides for the body of Orthodox Christianity. This book identifies and examines the men in the Nineteenth and Twentieth Centuries who were responsible for replacing the Christian?s final authority (the Holy scriptures) with the opinions and preferences of higher Christian education.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:5a27ef4b4b59c5b61765156380854ec347f0aad1","amp;dn":"The+Christian+Liar%27s+Library+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a27ef4b4b59c5b61765156380854ec347f0aad1","infoHashBuffer":{"type":"Buffer","data":[90,39,239,75,75,89,197,182,23,101,21,99,128,133,78,195,71,240,170,209]},"announce":[],"urlList":[]}}