{"title":"The Training Of O--ToO-33306 Simone Sonay and Steven St. Croix M","uid":9067965,"size":1903840958,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5a306486797f070a0746a9422e0fd15be1498c5f&amp;dn=The+Training+Of+O--ToO-33306+Simone+Sonay+and+Steven+St.+Croix+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"merzedes","files":-1,"time":1382140701,"description":"The Training of a Domestic MILF, Day Two\n\nOct 18, 2013 - Performers: Steven St. Croix  and  Simone Sonay \n\n\nMP4 only. WMV + Pics later.\n \n\nYou know the story: you work your nuts off all day for some prick in a suit. You come home to chill out and relax, but NO - the house is a fucking mess, there is no food in the fridge, you can smell the laundry pile from the front door, the trash is overflowing, and there is no cold beer. And there is your so called slave, twittering herself and stroking her face-fuck-book account. So much for a after work blow job and beer. Well I say - Fuck That. Not in My House. \n\nI want a slave to Do The Work in more ways than just bouncing on my dick. I want my House clean, organized and stocked. I put up with enough shit from assholes all week long - my House is my Retreat - My Fucking Castle - I say treat it that way. \n\nWhen my MILF is not keeping the place up to par, I first bend that fine ass over the bed and spank the shit of her with that wooden spoon that she should have been cooking my fucking chow with - now I feed it to her instead. And talk about fucking dust bunnies - we got dirt elephants up in this mother fucker! I get her down on all fours to clean that shit up at the tip of my fucking whip! \n\nAs far as my dick goes, she can suck that when her chores are done. And keep that hot fucking pussy in the air while she does it, cuz that's where I'm going next. I make that doggie fucking slut slide that wet cunt of mine up and down the shaft till I'm ready to look at her face and blow jizz all over it. And don't forget to say thank you Sir.\n\nScreens &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=33306&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=33306&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:5a306486797f070a0746a9422e0fd15be1498c5f","amp;dn":"The+Training+Of+O--ToO-33306+Simone+Sonay+and+Steven+St.+Croix+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a306486797f070a0746a9422e0fd15be1498c5f","infoHashBuffer":{"type":"Buffer","data":[90,48,100,134,121,127,7,10,7,70,169,66,46,15,209,91,225,73,140,95]},"announce":[],"urlList":[]}}