{"title":"The Cambridge Ancient History Vol 03, Part 01 - The Prehistory o","uid":6572214,"size":40918254,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a7989afa9b21802adc371119b52d848721ab9a7&amp;dn=The+Cambridge+Ancient+History+Vol+03%2C+Part+01+-+The+Prehistory+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1312023144,"description":"The Prehistory of the Balkans; and the Middle East and the Aegean world, tenth to eighth centuries B.C.\nSeries: The Cambridge Ancient History, Volume 3, Part 1\nEdited by: John Boardman, I. E. S. Edwards, N. G. L. Hammond and E. Sollberger\nPublication Date: 1982\nHardback ISBN-10 0521224969, Hardback ISBN-13 9780521224963\nDigital Object Identifier (DOI): 10.1017/CHOL9780521224963\n\nOverview:\nVolume III of The Cambridge Ancient History was first published in 1925 in one volume. The new edition has expanded to such an extent, owing to the immense amount of new information now available, that it has had to be divided into three parts. Volume III Part 1 opens with a survey of the Balkans north of Greece in the Prehistoric period. This is the first time such a survey has been published of this area which besides its intrinsic interest is important for its influence on the cultures of the Aegean and Anatolia. The rest of the book is devoted to the tenth to the eigth centuries B. C. In Greece and the Aegean the main theme is the gradual regeneration from the Dark Age and the emergence of a society in which can be seen the beginnings of the city-state. During the same period in Western Asia and the Middle East the Kingdoms of Assyria and Babylonia rise to power, the Urartians appear, and in Palestine the kingdoms of Israel and Judah flourish. In Egypt the country's fortunes revive briefly under Shoshenq I. The final chapter in this part deals with the languages of Greece and the Balkans and with the invention and spread of alphabetic writing.","torrent":{"xt":"urn:btih:5a7989afa9b21802adc371119b52d848721ab9a7","amp;dn":"The+Cambridge+Ancient+History+Vol+03%2C+Part+01+-+The+Prehistory+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a7989afa9b21802adc371119b52d848721ab9a7","infoHashBuffer":{"type":"Buffer","data":[90,121,137,175,169,178,24,2,173,195,113,17,155,82,216,72,114,26,185,167]},"announce":[],"urlList":[]}}