{"title":"Gay Classic  William Higgins The Pizza Boy 'He Delivers'","uid":4219327,"size":547315948,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5a9094abdeb3759ffe7e71d079c63d63247e2273&amp;dn=Gay+Classic++William+Higgins+The+Pizza+Boy+%5C%27He+Delivers%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TopsyCrett","files":1,"time":1212516414,"description":"\nLaguna Pacific, 1985\nDirected by William Higgins\n\nCast:Steve Hanson, Grant Fagan, Lee Mann, David Ashfield, Michael Gere, Brent Woods, Art Williams, Chad Johnson, Tim Barnes, Tony Stefano, Troy Ramsey\n\n\n&quot;Master director William Higgins brings together a bevy of the most beautiful young guys with shaggy hair and second-skin denim and places them in a world of carefree sexuality where guys mess around because they&amp;#039;re horny, because they&amp;#039;re young, because they&amp;#039;re beautiful, because they can. Most of the &amp;#039;plot&amp;#039; revolves around a pizza place and the men who work and eat there. Co-workers seduce each other over a beer, delivery boys are tricked into doing it with their customers, and friends share their stories of sexual conquest. Rare is it that a porn can naturalistically render the awkward anticipation of a random hook-up; this film does. It rules. For men of a certain age it might bring on an awful case of nostalgia, as everybody looks like those heavenly creatures that hung out with your older siblings. There are only a few things worth remembering about the Eighties?this film has all of them. \nFresh-faced jock David Ashfield asks his buddy Grant Fagan to close the pizza shop. Fagan asks for a ride home and Ashfield suggests they get some beer and hang out in the park. Over cans of Budweiser the two chat about motorcycles and saving up for a car. Ashfield, who speaks with the most devastatingly sexy half-whisper, obviously rubs the growing bulge in his dungarees. Fagan appears uncomfortable, he even asks Ashfield what his problem is. Ashfield explains that he&amp;#039;s always horny and tells Fagan that he needs to masturbate, right now. Fagan tells him that he can go to the car, but Ashfield assures him that they are friends so he doesn&amp;#039;t mind if he hangs around. Ashfield unzips his jeans and releases the literal manifestation of a horse cock. He talks normally as he jerks off, but Fagan can&amp;#039;t keep his eyes off of Ashfield&amp;#039;s majestic sword. Soon enough, Fagan has pulled out his even larger cock and strokes in tandem with Ashfield. Ashfield slyly reaches over and touches Fagan&amp;#039;s pole. Fagan quivers, &quot;don&amp;#039;t do that it makes me shake.&quot; Ashfield convinces Fagan to let him suck his cock, which Fagan seems to absolutely love. Fagan orgasms and Ashfield catches some of the jizz in his mouth. Later in the film, they hang out in the same park, this time drinking Heineken, and Fagan demonstrates his new-found ability to self-fellate. This really gets Ashfield worked up so he asks Fagan if he can fuck him. They debate the issue for a few minutes, with an all-too convincing nervous innocence, and finally Fagan agrees. Ashfield plunges his over-sized manhood completely inside Fagan, causing a body-jerking wince and a cry. When Ashfield pulls out, his milk sails over Fagan&amp;#039;s body and hits him square on the face! Now that&amp;#039;s a delivery! Every other scene carries the same erotic weight and some are just unbelievable. Delivery boy Troy Ramsey and Steve Henson fuck in a bathroom after Henson spills red wine on Ramsey&amp;#039;s jeans. Their sultry tangle will blow your mind, if nothing else blows first. The video climaxes with an incredible scene that incorporates weightlifting, voyeurism, and more young flesh than you could ever want. Two boys set up a video camera with a television feed and watch two hot bucks get it on with a pizza delivery guy. Meanwhile, they masturbate as the threesome reaches obscene heights. One of the participants tears the delivery guy&amp;#039;s white fishnet panties and shoves his boner into his ass. There are miles and miles of cock among the five beauties, so much that you&amp;#039;ll absolutely have to watch this scene a few times just to appreciate all of it. In fact, you&amp;#039;ll watch this entire video more than a few times. \n","torrent":{"xt":"urn:btih:5a9094abdeb3759ffe7e71d079c63d63247e2273","amp;dn":"Gay+Classic++William+Higgins+The+Pizza+Boy+%5C%27He+Delivers%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a9094abdeb3759ffe7e71d079c63d63247e2273","infoHashBuffer":{"type":"Buffer","data":[90,144,148,171,222,179,117,159,254,126,113,208,121,198,61,99,36,126,34,115]},"announce":[],"urlList":[]}}