{"title":"(Blues) Sonny Terry And Brownie McGhee - At Sugar Hill","uid":6048192,"size":107774596,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5aed7b78825245c21019f089fafeae6c56606e7b&amp;dn=%28Blues%29+Sonny+Terry+And+Brownie+McGhee+-+At+Sugar+Hill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1292632673,"description":"mp3   320kbps\n\n\nLabel: Fantasy/OBC\nStyles: Country blues, Piedmont blues, Folk-blues, East Coast blues\nYear: 1961 \nArt: Front \n\n\n[2:22] 1. Hooray, Hooray, This Woman Is Killing Me\n[3:48] 2. Born To Live The Blues\n[3:00] 3. Just About Crazy\n[4:00] 4. Up, Sometimes Down\n[3:56] 5. Baby, I Knocked On Your Door\n[4:35] 6. Keep On Walking\n[3:33] 7. Baby, I Got My Eye On You\n[4:13] 8. I Got A Little Girl\n[5:06] 9. I Feel Alright Now\n[4:49] 10. Worry, Worry, Worry\n[4:27] 11. Sweet Woman Blues\n\n\nAs anyone who knows their work is aware, there is no shortage of live recordings of Sonny Terry and Brownie McGhee (indeed, it sometimes seems as though tapes exist of every show they ever played). Still, the 11 songs here, recorded at the famous San Francisco nightclub, and originally released as Fantasy LP 3340, catch the duo very near -- if not quite at -- their peak on a very good night. Both musicians get chances to sing some of their standards, including &quot;Sweet Woman Blues,&quot; &quot;Born to Live the Blues,&quot; &quot;Baby, I Knocked on Your Door,&quot; and &quot;I Got a Little Girl.&quot; It's a fine showcase for their interplay -- which is always a joy to hear -- as McGhee's guitar serves an inventive rhythm function around Terry's lead on the harp, and the two voices alternately mesh with and weave around each other. And the lineup of material is also extremely strong, with first-rate pieces such as &quot;Up, Sometimes Down&quot; and &quot;Hooray, Hooray, This Woman Is Killing Me&quot; all over the song list. The sound has also held up well, with near-perfect fidelity on the music and just-enough-room ambience so that you never lose sight of the fact that this is a concert performance. And while there are some better live shows available, this is thoroughly entertaining and worth the time of any of their fans. \n\n\n","torrent":{"xt":"urn:btih:5aed7b78825245c21019f089fafeae6c56606e7b","amp;dn":"%28Blues%29+Sonny+Terry+And+Brownie+McGhee+-+At+Sugar+Hill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aed7b78825245c21019f089fafeae6c56606e7b","infoHashBuffer":{"type":"Buffer","data":[90,237,123,120,130,82,69,194,16,25,240,137,250,254,174,108,86,96,110,123]},"announce":[],"urlList":[]}}