{"title":"Shadowrun Returns (Update v1.0.3) (ENG) FLTDOX","uid":8779457,"size":293506666,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5be54d75e87385902f72e735084b4c4176bae82e&amp;dn=Shadowrun+Returns+%28Update+v1.0.3%29+%28ENG%29+FLTDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"DMeTaLx","files":3,"time":1375643181,"description":"This release requires the following updates installed before you begin - [UPDATE] Shadowrun Returns (Update v1.0.2) (ENG) FLTDOX\n\nGame: Shadowrun Returns\nVersion: v1.0.3\nLanguage: ENG\nRelease Group: FLTDOX\nProtection: Steam\n\nRelease 1.0.1\n\nBug Fixes\n- Fix for issue with final battle occasionally not advancing.\n- Fix for issue with AI occasionally not using self-buffs and IC Charge.\n\nRelease 1.0.2\n\nNew Features &amp; Improvements\n- SMG: Aimed Shot now uses 4 bullets, down from 6.\n- SMG: Spray and Pray now uses 6 bullets, down from 8.\n- SMG: the Beretta, Uzi, Colt, and HK are slightly more accurate.\n- Shotgun: Kneecap now has a HP DMG penalty of -6, up from -3. It now has a -5% accuracy penalty, and a cooldown of 3.\n- Shotgun: All shotguns have had their accuracy falloff increased slightly, lowering hit chance at long ranges.\n- Rifle: Full Auto's accuracy penalty was not being applied properly at high skill levels. It should now always be 15% lower than a single shot's percentage to hit.\n- Rifle: Smartlinked rifles were less accurate at very long ranges instead of more accurate. This has been resolved.\n- Rifle: The FN HAR and HK G12 were very similar in every aspect except price. The FN HAR is now more accurate and holds more ammunition than the HK G12.\n- Rifle: Ammo capacity of the HK G12, Colt M23, and Ares Alpha have been reduced to 32, 34, and 38 respectively.\n- Rifle: The Colt M23's damage is now 15, down from 16. The Ares Alpha's damage is now 16, down from 18.\n- Grenades: Reduced store prices of all grenades.\n- Grenades: HE Phosphorus grenades were not showing up in the store. They should now be purchasable along with the other Tier 3 weapons.\n- Cyberware purchase screen is now more user friendly.\n- Vendors will now sell more things in various places throughout DMS campaign (such as more med-kits).\n- Visual improvements to the summoning grid.\n- General UI Improvements.\n- Added additional debugging for finding walkable tiles in debug mode.\n- Added messaging to alert user when last auto-save occurred.\n- Black IC is now less lethal.\n- Added an explanation of how Leylines work in the world of SR:R.\n- Added a definition of SIN in glossary.\n\nBug Fixes\n- Player can no longer sell a currently equipped outfit.\n- Swapping outfits will now correctly give the correct enhancements.\n- Player can now equip an outfit if they do not currently have one equipped.\n- Drones will now retain their Rigging bonus between levels.\n- Wired reflexes no longer dodge friendly effects.\n- Spirit death from overwatch no longer causes occasional hardlock\n- Reduced load times when loading new assets after version update.\n- First time OSX play will start in windowed mode to work around a crash issue for some users.\n- Move marker will now be visible over walls.\n- Fixed a crash that could occur when transitioning characters one-by-one out of the scene and into the next.\n- Fixed issue with equip screen item filtering.\n- Fixed issue with installing upgraded cyberware on individual locations of a pair.\n- Fixed issue with hiring screen adding incorrect selected runner.\n- Fixed a slew of typos.\n- Fixed cases in conversation where attribute or skill checks were applied incorrectly.\n- Fixed character preview not showing 3D Character in some cases.\n- Fixed bug where user could enter missions that require a decker without having any runners with a Cyberdeck.\n- Fixed various issues with hiring Coyote.\n- Work around some Steam Workshop upload timeout issues\n- Editor: Changes to scene or story variables will refresh that variable in the scratchpad.\n\nRelease 1.0.3\n\nBug Fixes\n- Fixed an issue with asset caching and optimization that was causing some users significant stalls and occasional crashes while playing.\n- This update also includes a one-time verification of assets on startup to repair any potential cache issues introduced by prior patch.","torrent":{"xt":"urn:btih:5be54d75e87385902f72e735084b4c4176bae82e","amp;dn":"Shadowrun+Returns+%28Update+v1.0.3%29+%28ENG%29+FLTDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be54d75e87385902f72e735084b4c4176bae82e","infoHashBuffer":{"type":"Buffer","data":[91,229,77,117,232,115,133,144,47,114,231,53,8,75,76,65,118,186,232,46]},"announce":[],"urlList":[]}}