{"title":"Vermist S02 DVDRip Nl gesproken DutchReleaseTeam","uid":6920137,"size":4194830254,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c0083684c90fe87f10b27f08f668013a7c4c007&amp;dn=Vermist+S02+DVDRip+Nl+gesproken+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Koedje","files":-1,"time":1325182151,"description":" &lt;a href=&quot;http://img827.imageshack.us/img827/5861/vermist.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img827.imageshack.us/img827/5861/vermist.jpg&lt;/a&gt;\n\n\nPlot:\n\nVermist is een Vlaamse fictieserie dat vanaf 2008 werd gerealiseerd door VT4 en Eyeworks. Het project bestaat uit een bioscoopfilm en een televisieserie. De verhaallijnen draaien om het vijfkoppige team van de Cel Vermiste Personen van de Federale Politie, dat zich focust op het terugvinden van vermiste personen. Door onder meer de zaak-Dutroux en de moord op Nathalie Mahy en Stacy Lemmens heeft Vermist een hoog actualiteitsgehalte. De film, geregisseerd door Jan Verheyen, diende tevens als pilot aflevering van de serie. In totaal telt de serie twintig afleveringen, verspreidt over twee seizoenen. Hoofdrollen werden vertolkt door Koen De Bouw, Joke Devynck, Kevin Janssens, Stan Van Samang, CathÃƒÂ©rine Kools en Axel Daeseleire. Oorspronkelijk werd aangekondigd dat er geen derde seizoen zou komen, maar VT4 is hierop teruggekomen. Wanneer dit seizoen zal worden opgenomen en uitgezonden, is onbekend.\n\n\nNl subs bijgevoegd\n\n\nSeizoen 2:\n\n\nAflevering 1: Lena\n\nWanneer Lena, de zestienjarige dochter van Walter Sibelius, na een nachtje stappen verdwijnt, staan de zenuwen meteen strak gespannen bij de Cel Vermiste Personen. \nWalter voelt zich schuldig omdat hij haar in de steek heeft gelaten en wil haar koste wat het kost terugvinden. \nIs Lena gewoon weggelopen of is er meer aan de hand?\n\n\n\n\nAflevering 2: Elise\n\nTwee tienermeisjes verdwijnen na een optreden van Clouseau in het Sportpaleis. Ze werden het laatst gezien tijdens een meet &amp; greet met Koen en Kris Wauters. \nDe verdwijning vertoont opvallende gelijkenissen met een zaak van een jaar geleden, toen een seriemoordenaar tijdens het festival Couleur CafÃƒÂ© een tienermeisje ontvoerde en wurgde. \nDe Cel schakelt een versnelling hoger en kan daarbij, nu Walter afwezig is, de hulp van seriemoord-specialist Marc Plasschaert maar al te goed gebruiken.\n\n\n\n\nAflevering 3: Vincent\n\nHoofdinspecteur Vincent Weemaes daagt niet op voor de reconstructie van een schietpartij waarbij hij een paar dagen eerder was betrokken. \nHij lijkt met de noorderzon verdwenen. Nick heeft vroeger samengewerkt met Vincent en is erop gebrand om zijn vriend terug te vinden. \nHij botst hierdoor met collega Steve en commissaris Bourlon van ComitÃƒÂ© P. \nVolgens Bourlon is Vincent een corrupte flik, die betrokken is bij een diamantdiefstal. \n\n\n\n\nAflevering 4: Tessa\n\nTessa, een 21-jarige studente, verdwijnt na een uit de hand gelopen studentendoop in Leuven. \nWanneer ze de dochter van procureur Vandermeersch blijkt te zijn, en de problematische relatie tussen vader en dochter aan het licht komt, staat de Cel nog meer onder druk. \nWalter heeft ondertussen zijn ontslag als hoofd van de Cel aangeboden en kersvers teamleider Tine kan zich nu geen fouten veroorloven in dit delicate onderzoek. \n\n\n\n\nAflevering 5: Arne\n\nTijdens het traditionele zomerse buurtfeest in een chique villawijk verdwijnt de achttienjarige Arne. \nMoet de oorzaak van zijn verdwijning worden gezocht bij een van de vele geheimen die de bewoners van de wijk met zich meedragen? \nNick blijkt stiekem pedofiel Karel Dooms in het oog te houden. \n\n\n\n\nAflevering 6: Julie\n\nDe achtjarige Julie Herpoel, de dochter van een steenrijke zakenman, wordt ontvoerd. \nVoor Erik Coppens is dit zijn eerste case als nieuwe chef van de Cel Vermiste Personen. \nNick heeft het niet voor Coppens en het komt tot een aanvaring wanneer Nick Karel Dooms als verdachte binnenhaalt. \nTine ligt in de knoop met zichzelf want niet zij, maar haar ex-minnaar is nu teamleider. \nZe gaat alleen op onderzoek en dat loopt slecht af. \n\n\n\n\nAflevering 7: Valentina\n\nEen jonge vrouw met geheugenverlies wordt toevertrouwd aan de Cel. Wie is zij? \nWanneer Nick en Mily haar opzoeken in het ziekenhuis proberen enkele zware jongens haar te ontvoeren. \nBlijkbaar heeft de mysterieuze vrouw een niet alledaags verleden, want ook de Russische geheime dienst moeit zich met de zaak. Binnen het team zijn er nog altijd spanningen. \nNick aanvaardt Coppens niet als chef en Tine weet niet hoe ze aan haar man moet uitleggen dat ze nu met Erik samenwerkt. \nMily is dan weer bezorgd over het feit dat Steve een relatie begint met Jolien Geeraerts, wiens man 6 jaar geleden spoorloos verdwenen is.\n\n\n\n\nAflevering 8: Mike\n\nEx-gedetineerde Mike verdwijnt een maand na zijn vrijlating. Heeft zijn verleden hem ingehaald? Is hij terug op het slecht pad? \nDe samenwerking tussen Nick en Coppens verloopt stilaan beter. \n\n\n\n\nAflevering 9: Meisje X (Deel 1)\n\nTwee pedofielen beramen het plan om een meisje te ontvoeren en te misbruiken. Welke meisje? \nDe Cel probeert er alles aan te doen om de verdwijning te voorkomen en de identiteit van de pedofielen te achterhalen. \nNick is zichzelf niet meer en gaat in de clinch met Dooms. Hij wordt geschorst en besluit zich uit te geven als pedofiel in een poging de ontvoering te verhinderen. \nErik en Tine zijn op elkaar aangewezen om de cel recht te houden. Steve is van slag. Hij denkt dat hij Bart Geeraerts gezien heeft, de man van zijn vriendin. \nJolien weet dat dat niet kan: Bart is zes jaar geleden spoorloos verdwenen. \n\n\n\n\nAflevering 10: Meisje X (Deel 2)\n\nNick is alleen op pad met de pedofielen, maar verliest controle op de situatie. \nHij kan de ontvoering niet verhinderen en belandt samen met het ontvoerde meisje in een lastig parket. \nIntussen zet de Cel alles op alles om Nicks fout ongedaan te maken en daarbij ontdekt de Cel pijnlijke informatie over zijn jeugd.\nKunnen zijn collega's hem en het meisje nog op tijd terugvinden? \n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:5c0083684c90fe87f10b27f08f668013a7c4c007","amp;dn":"Vermist+S02+DVDRip+Nl+gesproken+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c0083684c90fe87f10b27f08f668013a7c4c007","infoHashBuffer":{"type":"Buffer","data":[92,0,131,104,76,144,254,135,241,11,39,240,143,102,128,19,167,196,192,7]},"announce":[],"urlList":[]}}