{"title":"POtHS - Classic Bible Movies - 06 - Jacob and Joseph","uid":8636875,"size":5966025467,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5c281ece7065b5b2542cd2919bd761f263ddcca0&amp;dn=POtHS+-+Classic+Bible+Movies+-+06+-+Jacob+and+Joseph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"POtHS11","files":-1,"time":1372777984,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\n\nClassic Bible Movies\nJacob and Joseph\n\n\nPOtHS - Classic Bible Movies - 06- Jacob and Joseph\n\n\nPOtHS says: I love The Story of Joseph.\n\n\nDescription:\n\nFor seven long years, Jacob has labored to earn the right to marry beautiful Rachel. Now the seven years are up - but Rachel's devious father substitutes his elder daughter on the wedding night.\n\nMatthew Modine and Lara Flynn Boyle play Jacob and Rachel in one of the greatest love stories from the Bible. Highlights of Jacob's life - how he usurped his brother Esau's birthright and blessing, the pillow of stone, the ladder to heaven, wrestling with God - are set against the heartache and hope of his relationship with the woman he seems destined never to possess. Sustained by his faith in God and his love for Rachel, Jacob perseveres... and becomes the father of the 12 tribes of Israel. Also starring Sean Bean, Irene Papas and Giancarlo Giannini. Color/93 minutes. Closed captioned. Not rated.\nBy\nJerry Parks &quot;USAToday All-American Teacher; N... (Lexington, KY USA) - See all my reviews\n\nCast into a pit by his jealous brothers, young Joseph pleads for mercy. Instead, the brothers sell the terrified boy into slavery in Egypt. But Joseph turns this agonizing betrayal into triumph.\n\nAcademy Award Â® winners Ben Kingsley and Martin Landau highlight an outstanding cast in this beloved Biblical tale of treachery and redemption. Joseph uses his gift for divining dreams to rise from slave to Pharaoh's most trusted aide, saving Egypt from seven years of famine. Then his brothers travel to Egypt in search of food... and right into Joseph's power. &quot;Forgiveness is greater than vengeance,&quot; Joseph declares. &quot;Compassion more powerful than anger.&quot; But can he forgive so grievous a wrong? Also starring Paul Mercurio and Lesley Ann Warren. Color/187 minutes. Closed captioned. Not rated.  \n\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n\n\n","torrent":{"xt":"urn:btih:5c281ece7065b5b2542cd2919bd761f263ddcca0","amp;dn":"POtHS+-+Classic+Bible+Movies+-+06+-+Jacob+and+Joseph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c281ece7065b5b2542cd2919bd761f263ddcca0","infoHashBuffer":{"type":"Buffer","data":[92,40,30,206,112,101,181,178,84,44,210,145,155,215,97,242,99,221,204,160]},"announce":[],"urlList":[]}}