{"title":"GRID.Autosport.Black.Edition.DLC.Updates-EUPC","uid":10427849,"size":4969638998,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5c2979585264f74f616a6628e55e2754d6816f24&amp;dn=GRID.Autosport.Black.Edition.DLC.Updates-EUPC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1403727094,"description":"\t\t\t\t\t\t\n\t\t\t\t\t\t\tGRID AUTOSPORT (c) CODEMASTERS\n\nRELEASE DATE: 24.06.2014\nPROTECTION: STEAM+Custom\nDISC(S): #1\nGAME TYPE: Racing\n\nRacing alongside a teammate, you must overcome key rivals and satisfy team sponsors in ferocious races where every pass and position counts. In a huge career, specialise in your favourite racing discipline or conquer them all feel the aggression of the pack in Touring Cars, manage tyre wear and race into the night in Endurance events, race Open-Wheel cars with precision, show car control in Tuner events and react on the fly in Street races. Each unique category features series dedicated to different classes, including Touring Cars, Hypercars, Endurance GT Cars, Prototypes, Single-Seaters, Super Modified vehicles, Drift cars and many more. Bursting with content, GRID Autosport features over 100 routes across 22 incredible locations and the world s most exciting contemporary and classic high-performance racing cars to collect, tune and upgrade. Development has been driven by Community feedback to include the return of in-car view, authentic handling and multiplayer racing powered by RaceNet to deliver new challenges every week, plus all-new Racing Clubs for online team competition. Party modes, Demolition Derby and competitive split-screen modes complement the game s extensive career mode and expansive core online game\n\nFEATURES\n\nFEEDBACK DRIVEN DEVELOPMENT\nCODEMASTERS HAS CONSULTED EXTENSIVELY WITH THE COMMUNITY, RACING DRIVERS AND EXPERTS FROM AUTOSPORT MAGAZINE IN DESIGNING AND PRODUCING GRID AUTOSPORT\n\nREALISTIC AI FOR INTENSE RACING\nRACE WHEEL-TO-WHEEL AGAINST ADVANCED, REALISTIC AI WHO WILL DEFEND THEIR LINE, TAKE CHANCES OR SPIN OUT UNDER PRESSURE IN RACES WHERE EVERY PASS COUNTS AND EVERY POSITION MATTERS\n\nAUTHENTIC HANDLING\nGRID AUTOSPORT S NEW HANDLING MODEL RECREATES THE FEEL OF MOTORSPORT S MOST EXCITING CARS, HITTING AN AUTHENTIC SWEET-SPOT BETWEEN ARCADE AND SIMULATION HANDLING\n\nRACENET CLUBS\nJOIN WITH FRIENDS TO FORM A RACING CLUB, RECEIVE NEW CHALLENGES EVERY WEEK, TRACK STATS AND CREATE LIVERIES WITH CODEMASTERS FREE ONLINE MILLION MEMBER COMMUNITY PORTAL RACENET\n\nMinimum:\nOS: Windows Vista, Windows 7 or Windows 8\nProcessor: Intel Core 2 Duo @ 2.4Ghz or AMD Athlon X2 5400\nMemory: 2 GB RAM\nGraphics: Intel HD3000 or AMD HD2000 Series or NVIDIA Geforce 8000 Series Series\nNetwork: Broadband Internet connection\nHard Drive: 15 GB available space\nSound Card: Direct X compatible soundcard\n\nRecommended:\n\nOS: Windows Vista 64 bit, Windows 7 64 bit or Windows 8 64 bit\nProcessor: Intel Core i7 or AMD FX Series\nMemory: 4 GB RAM\nGraphics: Intel HD5200 or AMD HD7000 Series or NVIDIA GTX600 Series minimum 1GB RAM\nNetwork: Broadband Internet connection\nHard Drive: 20 GB available space\nSound Card: Direct X compatible soundcard\n\nNote:\n\nThe dvd containes the black edition dlcs and high resolution textures updates.\n\n1. You must have our previous release installed\n\n2. Install the dlc update by using &quot;GRID Autosport.exe&quot;\n\n3. Play the game\n\n4. Support the software developers. If you like this game, BUY IT!\n\t\t\t\t\t\t","torrent":{"xt":"urn:btih:5c2979585264f74f616a6628e55e2754d6816f24","amp;dn":"GRID.Autosport.Black.Edition.DLC.Updates-EUPC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c2979585264f74f616a6628e55e2754d6816f24","infoHashBuffer":{"type":"Buffer","data":[92,41,121,88,82,100,247,79,97,106,102,40,229,94,39,84,214,129,111,36]},"announce":[],"urlList":[]}}