{"title":"XOM-B By Jeremy Robinson","uid":10160848,"size":1857908,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c5c2f3bcf4a0b55fbd069543f4875b6ebe150c1&amp;dn=XOM-B+By+Jeremy+Robinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"maxdesolate","files":4,"time":1400199061,"description":"A rising talent, Robinson is well-known in the community of action/adventure fans and has received amazing quotes in the past from big name authors like James Rollins, Steve Berry, and Scott Sigler. XOM-B is a riveting zombie novel with a great hook that is also an amazing plot twist, and is poised to bring him to the next level.\n\nFreeman is a genius with an uncommon mixture of memory, intelligence and creativity. He lives in a worldwide utopia, but it was not always so. There was a time known as the Grind-when Freeman's people lived as slaves to another race referred to simply as &quot;Master.&quot; They were property. But a civil rights movement emerged. Change seemed near, but the Masters refused to bend. Instead, they declared war. And lost. Now, the freed world is threatened by a virus, spread through bites, sweeping through the population. Those infected change--they are propelled to violence, driven to disperse the virus. Uniquely suited to respond to this new threat, Freeman searches for a cure, but instead finds the source--the Masters, intent on reclaiming the world. Freeman must fight for his life, for his friends and for the truth, which is far more complex and dangerous than he ever imagined.\n\nepub and mobi. enjoy and seed. dont let the torrent die! ","torrent":{"xt":"urn:btih:5c5c2f3bcf4a0b55fbd069543f4875b6ebe150c1","amp;dn":"XOM-B+By+Jeremy+Robinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c5c2f3bcf4a0b55fbd069543f4875b6ebe150c1","infoHashBuffer":{"type":"Buffer","data":[92,92,47,59,207,74,11,85,251,208,105,84,63,72,117,182,235,225,80,193]},"announce":[],"urlList":[]}}