{"title":"UNCANNY AVENGERS (Marvel NOW) 001-009 (Up-to-date June 19) FIXED","uid":8609457,"size":399959959,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5ce19609fb9f2bea8ecc645f7b3050a5f1ab35a0&amp;dn=UNCANNY+AVENGERS+%28Marvel+NOW%29+001-009+%28Up-to-date+June+19%29+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1372096227,"description":"The Marvel Universe's greatest era starts NOW!, as the all-new, all-different Avengers assemble!\n\nCaptain America creates a sanctioned Avengers unit comprised of Avengers and X-Men, humans and mutants working together... so why is the late Professor Xavier's dream more at risk than ever?\n\nThe Red Skull has returned - straight out of the 1940's and full of hatred - and his rebirth will alter the Marvel Universe forever! What are the Skull's new powers? Can Havok and Thor defeat the spreading influence of Honest John, The Living Propaganda? As Rogue and Scarlet Witch find themselves trapped on the Isle of the Red Skull's S-Men, Wolverine and Captain America investigate the worldwide mutant assassination epidemic! Uncanny Avengers Assemble! Plus: from the ashes of AvX, the funeral of one of Marvel's greatest heroes!\n\n------\n\nThis was intended to be the flagship title of NOW!, but unfortunately suffered (just like Planetary &amp; Astonishing X-Men did) from John Cassaday's snail-like pace. It's still one of the best books out there, particularly now that you can go back and read #1-5 in one sitting. Daniel Acuna's not quite on that Cassaday level of brilliance IMHO, but he's an excellent artist nonetheless. Give it a try!  --STF\n\n------\n\nNOTE: This torrent replaces my previous upload because RedDragon's version of issue #3 was missing a story page (the page where Wolverine cuts off the Red Skull's hand, to be exact). The version here, from Archangel+Zone, has the missing page. Sorry 'bout this inconvenience.  --STF","torrent":{"xt":"urn:btih:5ce19609fb9f2bea8ecc645f7b3050a5f1ab35a0","amp;dn":"UNCANNY+AVENGERS+%28Marvel+NOW%29+001-009+%28Up-to-date+June+19%29+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce19609fb9f2bea8ecc645f7b3050a5f1ab35a0","infoHashBuffer":{"type":"Buffer","data":[92,225,150,9,251,159,43,234,142,204,100,95,123,48,80,165,241,171,53,160]},"announce":[],"urlList":[]}}