{"title":"Jane Lovering - Please Don't Stop the Music - Barbie1710","uid":7816627,"size":1211229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d59903e99f764cdb198a7364a677dd95dd5af06&amp;dn=Jane+Lovering+-+Please+Don%27t+Stop+the+Music+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Barbie1710","files":6,"time":1352677608,"description":"Jane Lovering - Please Don't Stop the Music (Choc-Lit) - Kindle + ePub - Barbie1710\n\nHow much can you hide?\nJemima Hutton is determined to build a successful new life and keep her past a dark secret. Trouble is, her jewellery business looks set to fail - until enigmatic Ben Davies offers to stock her handmade belt buckles in his guitar shop and things start looking up, on all fronts.\nBut Ben has secrets too. When Jemima finds out he used to be the front man of hugely successful Indie rock band Willow Down, she wants to know more. Why did he desert the band on their US tour? Why is he now a semi-recluse? \nAnd the curiosity is mutual - which means that her own secret is no longer safe ...\n\nAbout the Author\nJANE LOVERING was born in Devon, England but, following extradition procedures, now lives in Yorkshire.  She has five children, four cats, two dogs and doesn't believe in housework so the bacteria and dust are approaching sentience and now rank among the pets. Incidentally, she doesn't believe in ironing either, and the children all learned self-defensive cookery at early ages. She works in a local school and also teaches creative writing, which are extreme ways of avoiding the washing up. Jane is a member of the Romantic Novelists' Association and has a first class honours degree in creative writing. Jane writes romantic comedies which are often described as 'quirky'. One day she's going to find out what that means.\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:5d59903e99f764cdb198a7364a677dd95dd5af06","amp;dn":"Jane+Lovering+-+Please+Don%27t+Stop+the+Music+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d59903e99f764cdb198a7364a677dd95dd5af06","infoHashBuffer":{"type":"Buffer","data":[93,89,144,62,153,247,100,205,177,152,167,54,74,103,125,217,93,213,175,6]},"announce":[],"urlList":[]}}