{"title":"Embedded C prabhu_","uid":9412304,"size":2386137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d9c2a95fab5d1f7781d0bac280394510f008fe6&amp;dn=Embedded+C+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":2,"time":1388334831,"description":"Embedded C \n\nby Michael J Pont\n &lt;a href=&quot;\nhttp://www.8051projects.net/files/public/1206612827_1201_FT0_clipboard02bf1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.8051projects.net/files/public/1206612827_1201_FT0_clipboard02bf1.jpg&lt;/a&gt;\n\nabout book :-\n\nFor people who are about to write their first embedded program - or have been struggling to learn about this important area - this book will save weeks of effort.\n\nIt's been suggested that there are now as many embedded systems in everyday use as there are people on planet Earth. Domestic appliances from washing machines to TVs, video recorders and mobile phones, now include at least one embedded processor. They are also vital components in a huge variety of automotive, medical, aerospace and military systems. As a result, there is strong demand for programmers with 'embedded' skills, and many desktop developers are moving into this area.\n\nEmbedded C is designed for programmers with desktop experience in C, C++ or Java who want to learn the skills required for the unique challenges of embedded systems.\n\nThe book and CD-ROM include the following key features:\n\nThe Keil hardware simulator for the popular 8051 microcontroller is on the CD-ROM so that readers can try out examples from the book - and create new ones - without requiring additional hardware.\nAll code is written in C, so no assembly language is required. industry-standard C compiler from Keil software is included on the CD-ROM, along with copies of code examples from the book to get you up and running very quickly.\nKey techniques required in all embedded systems are covered in detail, including the control of port pins and the reading of switches.\nA complete embedded operating system is presented, with full source code on the CD-ROM.\n\n &lt;a href=&quot;\nhttp://www.8051projects.net/files/public/1206612827_1201_FT0_clipboard02bf1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.8051projects.net/files/public/1206612827_1201_FT0_clipboard02bf1.jpg&lt;/a&gt;\n\nAbout the Author :-\n\nMichael Pont is an experienced software engineer, and began his first embedded project in 1986. Since then he has lectured and carried out research at the University of Sheffield and the University of Leicester, and has provided consultancy and training services to a range of international companies. He is the author of two previous books &quot;Patterns for Time-Triggered Embedded Systems&quot; and &quot;Software Engineering with C++ and CASE tools&quot;.\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:5d9c2a95fab5d1f7781d0bac280394510f008fe6","amp;dn":"Embedded+C+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9c2a95fab5d1f7781d0bac280394510f008fe6","infoHashBuffer":{"type":"Buffer","data":[93,156,42,149,250,181,209,247,120,29,11,172,40,3,148,81,15,0,143,230]},"announce":[],"urlList":[]}}