{"title":"Satyajit Ray on Cinema","uid":8575920,"size":14306713,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5da313e852bb63dfe75dd7e61d72db9d1df72abb&amp;dn=Satyajit+Ray+on+Cinema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371273307,"description":" Satyajit Ray, Sandip Ray, &quot;Satyajit Ray on Cinema&quot;\nEnglish | ISBN: 0231164947, 0231164955 | 2013 | PDF | 184 pages | 13,6 MB\n\nSatyajit Ray, one of the greatest auteurs of twentieth century cinema, was a Bengali motion-picture director, writer, and illustrator who set a new standard for Indian cinema with his Apu Trilogy: Pather Panchali (Song of the Little Road) (1955), Aparajito (The Unvanquished) (1956), and Apur Sansar (The World of Apu) (1959). His work was admired for its humanism, versatility, attention to detail, and skilled use of music. He was also widely praised for his critical and intellectual writings, which mirror his filmmaking in their precision and wide-ranging grasp of history, culture, and aesthetics.\n\nSpanning forty years of Ray's career, these essays, for the first time collected in one volume, present the filmmaker's reflections on the art and craft of the cinematic medium and include his thoughts on sentimentalism, mass culture, silent films, the influence of the French New Wave, and the experience of being a successful director. Ray speaks on the difficulty of adapting literary works to screen, the nature of the modern film festival, and the phenomenal contributions of Jean-Luc Godard and the Indian actor, director, producer, and singer Uttam Kumar. The collection also features an excerpt from Ray's diaries and reproduces his sketches of famous film personalities, such as Sergei Eisenstein, Charlie Chaplin, and Akira Kurosawa, in addition to film posters, photographs by and of the artist, film stills, and a filmography. Altogether, the volume relays the full extent of Ray's engagement with film and offers extensive access to the thought of one of the twentieth-century's leading Indian intellectuals.","torrent":{"xt":"urn:btih:5da313e852bb63dfe75dd7e61d72db9d1df72abb","amp;dn":"Satyajit+Ray+on+Cinema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5da313e852bb63dfe75dd7e61d72db9d1df72abb","infoHashBuffer":{"type":"Buffer","data":[93,163,19,232,82,187,99,223,231,93,215,230,29,114,219,157,29,247,42,187]},"announce":[],"urlList":[]}}