{"title":"Meltdown - Thomas Woods.epub","uid":11707582,"size":350390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5dc3ef5e0406813647ccb9c7cd0ad89b514fc199&amp;dn=Meltdown+-+Thomas+Woods.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"starxteel","files":1,"time":1424188547,"description":"\nIf you are fed up with Washington boondoggles, and you like the small-government, politically-incorrect thinking of Ron Paul, then you'll love Tom Woods's Meltdown. In clear, no-nonsense terms, Woods explains what led up to this economic crisis, who's really to blame, and why government bailouts won't work. Woods will reveal:\n* Which brave few economists predicted the economic fallout--and why nobody listened\n* What really caused the collapse\n* Why the Fed--not taxpayers--should have to answer for the current economic crisis\n* Why bailouts are band-aids that will only provide temporary relief and ultimately make things worse\n* What we should do instead, to put our economy on a healthy path to recovery\n\nWith a foreword from Ron Paul, Meltdown is the free-market answer to the Fed-created economic crisis. As the new Obama administration inevitably calls for more regulations, Woods argues that the only way to rebuild our economy is by returning to the fundamentals of capitalism and letting the free market work\n\n\nAbout the Author:\nThomas E. Woods jr. is the New York Times bestselling author of The Politically Incorrect Guide to American History and How the Catholic Church Built Western Civilization. He holds a B.A. in history from Harvard and an M.A., an M.Phil., and a Ph.D. from Columbia University. A contributing editor of The American Conservative magazine, Woods has received the Templeton Enterprise Award, the O. P. Alford III Prize for Libertarian Scholarship, and an Olive W. Garvey Fellowship from the Independent Institute. He and his family live in Alabama, where he is a fellow at the Ludwig von Mises Institute","torrent":{"xt":"urn:btih:5dc3ef5e0406813647ccb9c7cd0ad89b514fc199","amp;dn":"Meltdown+-+Thomas+Woods.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dc3ef5e0406813647ccb9c7cd0ad89b514fc199","infoHashBuffer":{"type":"Buffer","data":[93,195,239,94,4,6,129,54,71,204,185,199,205,10,216,155,81,79,193,153]},"announce":[],"urlList":[]}}