{"title":"Midnight.Sun.2006.DVDRip.XviD-BiEN (reupload)","uid":3989451,"size":1471227353,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:604e1ab5a89b34bbf5a6fc516b6882fcf5d9bd78&amp;dn=Midnight.Sun.2006.DVDRip.XviD-BiEN+%28reupload%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"egban","files":6,"time":1200971608,"description":"This is an endearing movie starring sensational JPOP singer YUI.  A real tear-jerker.  It is YUI\\&amp;#039;s first and only movie, so far, and was entered in the Cannes film festival in 2006.\n\nPLOT SUMMARY:\n\\&quot;Kaoru dreamily gazes from her bedroom window each morning just before dawn. She can see a stretch of the beach in front of her parent\\&amp;#039;s house on a hill in Kamakura, but focuses upon the activity at the bus stop where Koji and his two best friends meet before going surfing. The appearance of the sun causes her to lowers the blinds and go to sleep for she suffers from Xeroderma Pigmentosum (XP) and exposure to the sun\\&amp;#039;s rays has had the potential to kill her. At night she walks to the train station, plays her guitar and sings songs she has written, commonly returning home just a few minutes before it starts getting light. One morning she is at the bus stop singing when Koji arrives. Liking the song she was singing, he promises to go and listen to her perform as a street musician the first day of summer vacation but finds a loud and off-key man has occupied her spot. Koji improvises and takes her to Yokahama on his motor bike where her singing immediately draws a crowd. Koji marvels at her extraordinary future, whereas he muses at his ordinary nature as he asks to be her boyfriend. But she breaks up almost immediately as the rising sun reminds her that she cannot live a normal life. Koji tries and make amends after being sought out by her father, and starts to earn the 200,000 yen needed to pay for a studio session and production of a CD of Kaoru\\&amp;#039;s songs. As she practices on her guitar, she finds her fingers becoming immobilized, the first sign that neurological damage from the disease is progressing.  Written by Brian Greenhalgh\\&quot; for IMDB.\n\nIF YOU ENJOYED THIS AND YUI\\&amp;#039;S OTHER ENDEAVORS, PLEASE SUPPORT HER BY LEGALLY BUYING HER WORKS.  ENJOY! GAMBARE NEE, YUI!!!","torrent":{"xt":"urn:btih:604e1ab5a89b34bbf5a6fc516b6882fcf5d9bd78","amp;dn":"Midnight.Sun.2006.DVDRip.XviD-BiEN+%28reupload%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604e1ab5a89b34bbf5a6fc516b6882fcf5d9bd78","infoHashBuffer":{"type":"Buffer","data":[96,78,26,181,168,155,52,187,245,166,252,81,107,104,130,252,245,217,189,120]},"announce":[],"urlList":[]}}