{"title":"TITANIC (1953)","uid":4267189,"size":982731590,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:607d052b3956d143323dad0123be4120f03090b8&amp;dn=TITANIC+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"yogirajj","files":4,"time":1214752329,"description":"Although it was never known for strict authenticity, the elegant 1953 production of Titanic holds just as much fascination as A Night to Remember and James Cameron?s 1997 blockbuster. Its original screenplay deservedly won an OscarÂ® for its brilliant, dramatically involving creation of fictional characters?primarily a strained couple on the verge of divorce (Clifton Webb, Barbara Stanwyck)?whose lives are forever altered on that fateful morning of April 15, 1912. Director Jean Negulesco focuses on this human drama, lending a personal touch to the luxury liner?s fatal collision with an iceberg; if the scale-model disaster (complete with motorized miniature lifeboat rowers) looks quaint by modern special-effects standards, it still captures the emotional impact of Titanic?s ultimate fate. While Titanic?s sinking is inaccurately depicted (here the ship is damaged on the port side, and sinks in one piece), the Webb/Stanwyck relationship is handled with sophistication, style, and well-earned redemption. As would happen with Cameron?s Titanic 44 years later, fiction proved a perfect vehicle for tragic factual history","torrent":{"xt":"urn:btih:607d052b3956d143323dad0123be4120f03090b8","amp;dn":"TITANIC+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"607d052b3956d143323dad0123be4120f03090b8","infoHashBuffer":{"type":"Buffer","data":[96,125,5,43,57,86,209,67,50,61,173,1,35,190,65,32,240,48,144,184]},"announce":[],"urlList":[]}}