{"title":"Johnny Ace - The Complete Duke Recordings [2004]","uid":8388301,"size":265025042,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:60e5b445e13f213b07150d5d6599e6df2c93c455&amp;dn=Johnny+Ace+-+The+Complete+Duke+Recordings+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Gloria","files":-1,"time":1366345105,"description":"eac secure cue log scans\n\nJohnny Ace - The Complete Duke Recordings [2004]\n\nOriginal Release / Hip-O Select / B0002744-02 / CD\n\nIt took half-a-century, but finally Johnny Ace's Complete Duke Recordings (2004) have been gathered on to a single volume. Kudos to the archivists at the internet-exclusive audio boutique Hip-O Select, as they present a primary cannon of Ace's brief, yet interminably influential contributions to R&amp;B and rock &amp; roll alike. Sadly, a majority of folks tend to correlate the name Johnny Ace with the staggering events surrounding his death by a self-inflicted gunshot wound backstage at a sold-out Christmas Eve gig at the Houston, Texas City Auditorium in 1954. He left behind the musical legacy found here, which has not only withstood the test of time, but in hindsight is a definite touchstone in the progression and influence that Memphis-based blues had on the primordial era of rock. During the late '40s Ace united with B.B. King as a pianist, prior to absconding with key members Earl Forest (drums) and Adolph &quot;Billy&quot; Duncan (sax) to form the Beal Streeters. All three did, however, stay with King long enough to turn up on his platter Three O'clock Blues. Ace and company's earliest session on their own was held at local radio station WDIA, most significantly yielding an overhaul of Ruth Brown's &quot;So Long,&quot; which the combo effectively re-tooled into the chart-topping &quot;My Song.&quot; The B-side of the 78 rpm has a very different feel, as &quot;Follow the Rule&quot; is an unadulterated hot-steppin' shouter. Ace can be heard quite literally pounding the keys with a rollicking combination stride/boogie-woogie style. The next batch proved to be equally impressive with the moody &quot;Cross My Heart.&quot; The tune features Ace on an ethereal electric organ, giving the performance a distinct flavor, completely unlike any of its contemporaries. Concurrent audiences obviously felt the same way, as it climbed all the way to number three. That summer of '52 cache also boasted the instrumentals &quot;Aces Wild&quot; and &quot;Burley Cutie.&quot; A further number one ensued with the ominously languid &quot;The Clock,&quot; followed up by &quot;Saving My Love for You,&quot; marking Ace's first West Coast collection supported by the Johnny Otis Band. As before, the title was an unqualified smash, placing at a lofty number two. The August '53 date similarly netted the raucous &quot;Yes Baby,&quot; with Ace joined by Big Mama Thornton on vocals. &quot;Please Forgive Me,&quot; and the crossover triumph &quot;Pledging My Love&quot; -- a Top 20 (number 17) pop entry -- trailed closely behind, as did &quot;Anymore,&quot; Ace's ultimate trip to the R&amp;B survey during his tenure with Otis. The concluding lot would be the last that Ace would document. He is joined by the leader of Ace's touring band Johnny Board (sax) and among other things, they recorded the jazzier, chiming &quot;Never Let Me Go,&quot; in addition to the brass-fuelled rant &quot;How Can You Be So Mean,&quot; and the Windy City vibe on &quot;Don't You Know,&quot; recalling Ace's former employer B.B. King, or possibly Muddy Waters. The sound on Complete Duke Recordings is unequaled, as is the care given to the 16-page liner notes and tri-fold digipack -- both sporting plenty of rare memorabilia and other assorted eye candy. Interested parties should make haste, however, as the volume is strictly limited to an edition of 5,000 copies.\n\n01 - My Song\n02 - Follow the Rule\n03 - Angel\n04 - Aces Wild\n05 - Cross My Heart\n06 - Burley Cutie\n07 - The Clock\n08 - Saving My Love for You\n09 - Yes Baby\n10 - Please Forgive Me\n11 - Still Love You So\n12 - Pledging My Love\n13 - So Lonely\n14 - You've Been Gone So Long\n15 - Anymore\n16 - No Money\n17 - I'm Crazy Baby\n18 - Don't You Know\n19 - Never Let Me Go\n20 - How Can You Be So Mean","torrent":{"xt":"urn:btih:60e5b445e13f213b07150d5d6599e6df2c93c455","amp;dn":"Johnny+Ace+-+The+Complete+Duke+Recordings+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60e5b445e13f213b07150d5d6599e6df2c93c455","infoHashBuffer":{"type":"Buffer","data":[96,229,180,69,225,63,33,59,7,21,13,93,101,153,230,223,44,147,196,85]},"announce":[],"urlList":[]}}