{"title":"The Joy of Pain: Schadenfreude and the Dark Side of Human Nature","uid":10983111,"size":3725044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60f3975e3d66ee1706e8d735f856acfd3c172f2c&amp;dn=The+Joy+of+Pain%3A+Schadenfreude+and+the+Dark+Side+of+Human+Nature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1409883757,"description":"Book Description:\n\nFew people will easily admit to taking pleasure in the misfortunes of others. But who doesn't enjoy it when an arrogant but untalented contestant is humiliated on American Idol, or when the embarrassing vice of a self-righteous politician is exposed, or even when an envied friend suffers a small setback? The truth is that joy in someone else's pain--known by the German word schadenfreude--permeates our society.\n\nIn The Joy of Pain, psychologist Richard Smith, one of the world's foremost authorities on envy and shame, sheds much light on a feeling we dare not admit. Smith argues that schadenfreude is a natural human emotion, one worth taking a closer look at, as it reveals much about who we are as human beings. We have a passion for justice. Sometimes, schadenfreude can feel like getting one's revenge, when the suffering person has previously harmed us. But most of us are also motivated to feel good about ourselves, Smith notes, and look for ways to maintain a positive sense of self. One common way to do this is to compare ourselves to others and find areas where we are better. Similarly, the downfall of others--especially when they have seemed superior to us--can lead to a boost in our self-esteem, a lessening of feelings of inferiority. This is often at the root of schadenfreude. As the author points out, most instances of schadenfreude are harmless, on par with the pleasures of light gossip. Yet we must also be mindful that envy can motivate, without full awareness, the engineering of the misfortune we delight in. And envy-induced aggression can take us into dark territory indeed, as Smith shows as he examines the role of envy and schadenfreude in the Nazi persecution of the Jews.\n\nFilled with engaging examples of schadenfreude, from popular reality shows to the Duke-Kentucky basketball rivalry, The Joy of Pain provides an intriguing glimpse into a hidden corner of the human psyche.\n\nProduct Details:\n\nePub: 257 pages\nPublisher: Oxford University Press\nLanguage: English\nISBN-10: 0199393710\nISBN-13: 978-0199393718\nAmazon Link:\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:60f3975e3d66ee1706e8d735f856acfd3c172f2c","amp;dn":"The+Joy+of+Pain%3A+Schadenfreude+and+the+Dark+Side+of+Human+Nature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f3975e3d66ee1706e8d735f856acfd3c172f2c","infoHashBuffer":{"type":"Buffer","data":[96,243,151,94,61,102,238,23,6,232,215,53,248,86,172,253,60,23,47,44]},"announce":[],"urlList":[]}}