{"title":"If I Had A Son: The Railroading of George Zimmerman (2013)","uid":10337745,"size":2371707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6106f967950cd3c8643ff3311c977bbaef7ca518&amp;dn=If+I+Had+A+Son%3A+The+Railroading+of+George+Zimmerman+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kraut58","files":-1,"time":1402503282,"description":"If I Had A Son - Race, Guns, and the Railroading of George Zimmerman (2013) by Jack Cashill.epub\n\nHis friends called George Zimmerman &quot;Tugboat,&quot; the one who always came to the rescue. An Hispanic-American civil rights activist, he helped a black homeless man find justice. He helped guide two black teens through life. He helped a terrified mother secure her house. He helped his wary neighbors secure their community.  'In If I Had A Son', Jack Cashill tells the inside story of how, as the result of a tragic encounter with troubled seventeen-year-old Trayvon Martin, the media turned Tugboat into a white racist vigilante, &quot;the most hated man in America.&quot;  'If I Had A Son' tells how for the first time in the history of American jurisprudence, a state government, the US Department of Justice, the White House, the major media, the entertainment industry and the vestiges of the civil rights movement conspired to put an innocent man in prison for the rest of his life.  All that stood between Zimmerman and lifetime internment were two folksy local lawyers, their aides, and some very dedicated citizen journalists, most notably an unpaid handful of truth seekers at the blogging collective known as the Conservative Treehouse.'If I Had A Son' takes an inside look at this unprecedented battle formation.  'If I Had A Son' tells the story too of the six stalwart female jurors who ignored the enormous pressure mounting around them and preserved America's belief in its judicial system.  In the wake of the verdict, skeptics in the Martin camp claimed that the State of Florida did not play to win. In the course of his research, Cashill came across some startling evidence which suggests that those skeptics may indeed be right.  'If I Had A Son' is the one and only comprehensive look at the most politically significant trial in decades. What George Zimmerman learned in the course of his ordeal is that although he supported Obama, and lobbied for Obama, and voted for Obama at least once, in the final analysis he did not look enough like Obama to be his son, and that made all the difference.\n\n336 pages\nPublisher: WND Books; 1 edition (October 29, 2013)\nLanguage: English\nISBN-10: 1938067215\nISBN-13: 978-1938067211","torrent":{"xt":"urn:btih:6106f967950cd3c8643ff3311c977bbaef7ca518","amp;dn":"If+I+Had+A+Son%3A+The+Railroading+of+George+Zimmerman+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6106f967950cd3c8643ff3311c977bbaef7ca518","infoHashBuffer":{"type":"Buffer","data":[97,6,249,103,149,12,211,200,100,63,243,49,28,151,123,186,239,124,165,24]},"announce":[],"urlList":[]}}