{"title":"Programming in Python 3 - 2nd edition {AlgErioN}","uid":8598731,"size":2469224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61d8d501af2cdc2ff83779999f9c89003f9acacf&amp;dn=Programming+in+Python+3+-+2nd+edition+%7BAlgErioN%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ALG3RiON","files":1,"time":1371828146,"description":"A Fully Revised Edition Featuring New Material on Coroutines, Debugging, Testing, Parsing, String Formatting, and More\n\nPython 3 is the best version of the language yet: It is more powerful, convenient, consistent, and expressive than ever before. Now, leading Python programmer Mark Summerfield demonstrates how to write code that takes full advantage of Python 3's features and idioms. Programming in Python 3, Second Edition, brings together all the knowledge you need to write any program, use any standard or third-party Python 3 library, and create new library modules of your own.\nï¿½\nSummerfield draws on his many years of Python experience to share deep insights into Python 3 development you won't find anywhere else. He begins by illuminating Python's &quot;beautiful heart&quot;: the eight key elements of Python you need to write robust, high-performance programs. Building on these core elements, he introduces new topics designed to strengthen your practical expertise-one concept and hands-on example at a time. Coverage includes\nDeveloping in Python using procedural, objectoriented, and functional programming paradigms\nCreating custom packages and modules\nWriting and reading binary, text, and XML files, including optional compression, random access, and text and XML parsing\nLeveraging advanced data types, collections, control structures, and functions\nSpreading program workloads across multiple processes and threads\nProgramming SQL databases and key--value DBM files\nDebugging techniques-and using Test Driven Development to avoid bugs in the first place\nUtilizing Python's regular expression mini-language and module\nParsing techniques, including how to use the third-party PyParsing and PLY modules\nBuilding usable, efficient, GUI-based applications\nAdvanced programming techniques, including generators, function and class decorators, context managers, descriptors, abstract base classes, metaclasses, coroutines, and more\nï¿½\nProgramming in Python 3, Second Edition, serves as both tutorial and language reference. It assumes some prior programming experience, and is accompanied by extensive downloadable example code-all of it tested with Python 3 on Windows, Linux, and Mac OS X. This edition covers Python 3.0 and 3.1, and due to the Python language moratorium it is also valid for Python 3.2 which has the same language as Python 3.1. ","torrent":{"xt":"urn:btih:61d8d501af2cdc2ff83779999f9c89003f9acacf","amp;dn":"Programming+in+Python+3+-+2nd+edition+%7BAlgErioN%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d8d501af2cdc2ff83779999f9c89003f9acacf","infoHashBuffer":{"type":"Buffer","data":[97,216,213,1,175,44,220,47,248,55,121,153,159,156,137,0,63,154,202,207]},"announce":[],"urlList":[]}}