{"title":"Stupid Sex: The Most Idiotic and Embarrassing Intimate Encounter","uid":8471225,"size":2882125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6211b9abe98f86a6fd749c1f6fa319a92554e6f6&amp;dn=Stupid+Sex%3A+The+Most+Idiotic+and+Embarrassing+Intimate+Encounter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":2,"time":1368488742,"description":"\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61ToLB76nbL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61ToLB76nbL.jpg&lt;/a&gt;\n\n\nStupid Sex: The Most Idiotic and Embarrassing Intimate Encounters of All Time\n\nPublisher: Main Street Books\nRoss Petras , Kathryn Petras\n1998\nISBN: 0385488513 \nEPUB , PDF \n208 pages \n2.74 MB\n\nA mother, answering her phone, hears her daughter shrieking and screaming. Terrified, she calls the police who arrive at the daughter's house, batter down the door--and find the daughter, nude, in her bedroom having sex with her boyfriend. Apparently her toe hit the automatic dial button for her mother's number on the bedroom phone.A man, swimming in a Florida pool, sees the pool intake pipe and gets a unique idea. \n Hours later, after police, firemen, and EMT personnel are called, the man is taken to an area hospital--along with ten feet of pipe attached to a very swollen part of his anatomy.A newly married couple in Turin set up a video camera in their bedroom to tape all of their honeymoon activities. But somehow certain crucial wires got crossed. While they were enjoying their honeymoon sex, so was everyone else in their apartment building: the couple had accidentally connected their camera to the building's cable television system.In the national bestseller The 776 Stupidest Things Ever Said Ross and Kathryn Petras immortalized idiotic utterances by public figures and average citizens alike. The 176 Stupidest Things Ever Done chronicled fiascoes, senseless stunts, and utterly asinine activities from around the globe. Now, Stupid Sex takes on the subject that no one can resist. It's about people who get caught in the act . . . and about people who get caught in the trash disposal. Stupid Sex tells two hundred true stories of extremely dumb (and very funny) sex acts arranged under headings ranging from Airplane Sex to Zoo Bathroom Sex.\n\n","torrent":{"xt":"urn:btih:6211b9abe98f86a6fd749c1f6fa319a92554e6f6","amp;dn":"Stupid+Sex%3A+The+Most+Idiotic+and+Embarrassing+Intimate+Encounter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6211b9abe98f86a6fd749c1f6fa319a92554e6f6","infoHashBuffer":{"type":"Buffer","data":[98,17,185,171,233,143,134,166,253,116,156,31,111,163,25,169,37,84,230,246]},"announce":[],"urlList":[]}}