{"title":"Home Before the Leaves Fall","uid":9392058,"size":5951338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:625106027c829d7c5bb1638104dcb8033aeb432a&amp;dn=Home+Before+the+Leaves+Fall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"prabhu_","files":2,"time":1387902728,"description":"Home Before the Leaves Fall: A New History of the German Invasion of 1914\n\nby Ian Senior\n &lt;a href=&quot;\nhttp://cdn2.lybrary.com/1780968663.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cdn2.lybrary.com/1780968663.jpg&lt;/a&gt;\n\nabout book :-\n\nThe German invasion of France and Belgium in August 1914 came within an ace of defeating the French armies, capturing Paris, and ending the First World War before the autumn leaves had fallen. But the German armies failed to score the knock-out blow they had planned. The war would drag on for four years of unprecedented slaughter.\n\nThere are many accounts of 1914 from the British point of view. The achievements of the British Expeditionary Force were the stuff of legend, but in reality there were only four divisions in the field; the French and Germans had more than 60 each. The real story of the battle can only be told by an author with the skill to mine the extensive German and French archives. Ian Senior does this with consummate skill, weaving together strategic analysis with diary entries and interview transcripts from the soldiers on the ground to create a remarkable new history. In addition, all previous classic histories on the subject either focus virtually exclusively on the British experiences or are now very out-of-date such as Barbara Tuchman's Guns of August (1962) or Sewell Tyng's Campaign of the Marne (1935).\n\nSupported by up numerous sketch maps, extensive archival research and poignant first-hand accounts, Home before the leaves fall is an accessible, narrative account of the German invasion that came within an ace of victory, that long hot summer.\n\n\nAbout the Author :-\n\nIan Senior read Natural Sciences at Cambridge and has taught at Dulwich College for many years. He is also Associate Lecturer in the History of Art for the Open University and a Principal Examiner for the University of Cambridge International Examination Board. A fluent German and French speaker, he first became interested in the battlefields of 1914 when visiting his wife's family in her native Belgium. This is his first book.\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:625106027c829d7c5bb1638104dcb8033aeb432a","amp;dn":"Home+Before+the+Leaves+Fall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"625106027c829d7c5bb1638104dcb8033aeb432a","infoHashBuffer":{"type":"Buffer","data":[98,81,6,2,124,130,157,124,91,177,99,129,4,220,184,3,58,235,67,42]},"announce":[],"urlList":[]}}