{"title":"Local Hero (1983)","uid":5382353,"size":1327677727,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:632e51595444aba94cf3142c4db61a84a707d0ae&amp;dn=Local+Hero+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GungaDan","files":1,"time":1266782221,"description":"I have not been able to find a definitive connection, but I feel that this movie must have been the inspiration for the television show Northern Exposure. The themes and style are so very similar. Any fan of Northern Exposure who has not seen this film, should.\n\n\nAccording to the Wikipedia:\n&quot;Local Hero is a 1983 Scottish film starring Peter Riegert, Denis Lawson, Peter Capaldi and Burt Lancaster. It was directed by Bill Forsyth and produced by David Puttnam.[1]\n\nThe film is set in the fictional fishing village of Ferness on the west coast of Scotland. A young representative of an American oil company is sent to the village on a mission. The film features a notable ensemble of character parts.&quot;\n\nalso\n\n&quot;Forsyth slipped some sly references into the characters' names. The recurring theme of sea and sky is echoed in the names of the two principal women, Marina and Stella. Also, Ben shares his last name with Happer's oil company and the radio station MacIntyre listens to in his car at the opening of the film (KNOX).\n[edit] Casting\n\nAccording to The Sun newspaper, Warner Bros. wanted Henry Winkler to play the part of Mac, but Bill Forsyth rejected the idea.[2]\n[edit] Locations\n\nLocal Hero was filmed at several places around Scotland. Most of the village scenes were filmed in Pennan on the Aberdeenshire coast, most of the beach scenes at Morar and Arisaig on the west coast.[3]&quot;\n\nand finally\n&quot;Music\n\nThe film's soundtrack, which outsold the film itself, was written by Mark Knopfler of Dire Straits, and is considered amongst his best work. This has led to the popularity of the film with fans of the band; Knopfler has since performed an arrangement of the main theme music (&quot;Going Home&quot;) as an encore at many of his concerts.This tune borrows some riffs from traditional songs. 'Local Hero' from the soundtrack is played as Newcastle United take to the field in their home games played at St James' Park. It is also played at the end of Tranmere Rovers' home games.&quot;","torrent":{"xt":"urn:btih:632e51595444aba94cf3142c4db61a84a707d0ae","amp;dn":"Local+Hero+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"632e51595444aba94cf3142c4db61a84a707d0ae","infoHashBuffer":{"type":"Buffer","data":[99,46,81,89,84,68,171,169,76,243,20,44,77,182,26,132,167,7,208,174]},"announce":[],"urlList":[]}}