{"title":"mewithoutYou - Discography (2002-2012) [FLAC]","uid":8870611,"size":1632727789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:639a6482c5faa6263312d2937790e3b9e8c345cf&amp;dn=mewithoutYou+-+Discography+%282002-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1378052749,"description":"\n  mewithoutYou - Discography (2002-2012) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2002 [A--B] Life\n  2004 Catch for Us the Foxes\n  2006 Brother, Sister\n  2009 It's All Crazy! It's All False! It's All a Dream! It's Alright\n  2012 Ten Stories\n\n  A blend of experimental rock structures, punky energy, spoken-word melodies, and Judeo-Christian content characterizes the output of mewithoutYou, a Philadelphia-based band that formed in 2001. Having grown up listening to Jawbox and Burning Airlines, brothers Aaron and Michael Weiss initially cut their hard rock teeth as frontmen of the Operation. After releasing an album with the help of Takehold Records, the Operation's members decided to launch a side project in order to experiment with new sounds. The Weiss brothers subsequently formed mewithoutYou with help from bassist Ray Tadeo, guitarist Christopher Kleinberg, and drummer Richard Mazzotta. Tooth &amp; Nail was taken by the fiery five-piece's raw appeal and inked them a deal, with bassist Daniel Pishock replacing the departing Tadeo. the Operation disbanded shortly thereafter, allowing the musicians to focus their efforts on the new band.\n\n  mewithoutYou issued their full-length debut, [A -- &gt; B] Life, during the summer of 2002. The band's well-received sophomore effort, Catch for Us the Foxes, followed in late 2004, after which Pishock exited the lineup to pursue other interests. Greg Jehanian eventually took his position on bass. Tours with the likes of Dredg and Coheed &amp; Cambria took mewithoutYou through the end of 2005, and the guys joined Thursday for a string of shows during the following year. Brother, Sister then appeared in September 2006, featuring cameos from the likes of Sunny Day Real Estate's Jeremy Enigk and the members of Anathallo. Another lineup adjustment arrived in the form of Christopher Kleinberg's departure, although he briefly returned during the band's 2008 summer tour.\n\n  As the bandmembers looked forward to 2009, they began working on material that replaced their traditional post-hardcore flourishes with an emphasis on acoustic instrumentation and Neutral Milk Hotel-styled folk. The result was 2009's It's All Crazy! It's All False! It's All a Dream! It's Alright, whose long-winded title modeled itself after the teachings of Sufi leader Bawa Muhaiyaddeen.","torrent":{"xt":"urn:btih:639a6482c5faa6263312d2937790e3b9e8c345cf","amp;dn":"mewithoutYou+-+Discography+%282002-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639a6482c5faa6263312d2937790e3b9e8c345cf","infoHashBuffer":{"type":"Buffer","data":[99,154,100,130,197,250,166,38,51,18,210,147,119,144,227,185,232,195,69,207]},"announce":[],"urlList":[]}}