{"title":"Omnibus Video Jukebox BBC1 9th May 1986 - A History Of The Pop M","uid":10695861,"size":4810995926,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:63ba967d67097a6ce463aa56583b7a9a287a26a4&amp;dn=Omnibus+Video+Jukebox+BBC1+9th+May+1986+-+A+History+Of+The+Pop+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"oldtvshow","files":4,"time":1407168143,"description":"Omnibus - Video Jukebox\n\nThe History Of The Pop Video\n\nShown on BBC1 9th May 1986\n\n\nThe development of the rock video from the musicals and promotional shorts of the 1930s, the jazz sound films of the 40s, the rock 'n' roll films and scorpitones of the 50s and the television pop programmes of the 60s to the first true videos in the 1970s and the 1980s.\n\nFormat: AVI\nCodec: xvid\nResolution: 700 x 572\nFrame Rate: 25fps\nLanguage: ENGLISH\n\nA history of the pop music video, presented by John Peel and John Walters. Most of the featured videos, pop promos and other types of pop music on film are shown complete. The timings sometimes include short comments from interviewees or the presenters' links. Tape one: Introduction and extracts from interviews to be featured in the programme (5.17). Oskar Fischinger's abstract animation KOMPOSITION IN BLAU (1934) (9.01). Extracts from two jazz soundies: Meade Lux Lewis and Joe Turner 'Low Down Dog' (10.15) and Nat King Cole 'Frim Fram Sauce' (11.53). Video: The Police 'Every Breath You Take', filmed in black and white (15.26). Extracts from French Scopitones: Johnny Hallyday singing unidentified number, teenagers dancing in school room to 'La Chunga', and white female singer singing 'The Locomotion' with dancing bowler-hatted Englishmen and men in cardigans (19.58). Feature film extracts of Julie London singing 'Cry Me A River' from THE GIRL CAN'T HELP IT (1956), Cliff Richard playing the bongos in EXPRESSO BONGO (1959), Billy Fury singing the title song from PLAY IT COOL (1962), and Bob Dylan holding up some of the words to 'Subterranean Homesick Blues' from DON'T LOOK BACK (1967) (24.54). Newsreel on the filming of A HARD DAY'S NIGHT (1964) followed by interview with Richard Lester on the making of the film (27.02). Beatles fooling to 'Can't Buy Me Love' from the film (27.56). Lester on making HELP! (1965) followed by sequence showing the Beatles skiing to 'Ticket to Ride' (30.43). Title sequence to THE MONKEES television show followed by interview with Micky Dolenz (32.28). The Monkees 'Tomorrow' from the TV series followed by more comments from Dolenz (33.56). Brief sequence of The Kinks 'I'm a Lover not a Fighter' from TV show SHINDIG (35.31). Video: Diana Ross 'Chain Reaction', parodying 1960s TV pop shows (37.12). Pop promo: The Supremes play table tennis to 'You Just Keep Me Hanging On' (37.50). Pop promo: The Beatles 'Penny Lane', filmed in black and white in Penny Lane, Liverpool and London, mostly showing John Lennon (41.45). Pop promo: The Beatles 'Strawberry Fields Forever', surreal imagery with the band, a decorated piano and a tree (45.21). Pop promo: The Beatles 'Hello Goodbye', filmed statically in a theatre (48.43). Pop promo: The Beatles 'Come Together', using film of the 'Sgt. Pepper' recording sessions (52.37). Interview with Mick Jagger on Stones' promos (54.03). Pop promo: Rolling Stones 'Satisfaction', showing the band at an airport with fans (55.03). Interview with director of many of the Stones' promos, Peter Whitehead, with extracts from the unreleased CHARLIE IS MY DARLING (1965) (57.39). Pop promo: Rolling Stones 'Have You Seen Your Mother, Baby (Standing in the Shadows)?' with the band in drag (1.00.09). Pop promo: Rolling Stones 'We Love You', using imagery of the Oscar Wilde trial (1.06.06). Pop promo: Rolling Stones 'Lady Jane', slow motion film of the band in concert at the Royal Albert Hall (1.10.05). Extracts from films made to accompany pop songs for TOP OF THE POPS: Smokey Robinson and the Miracles 'Tears of a Clown' (a clown in a circus tent), Clifford T. Ward 'Home Thoughts from Abroad' (featuring Ward with children), Bobby 'Boris' Pickett and the Crypt-Kickers 'Monster Mash' (with the Pan's People dance troupe), and Rod Stewart 'Sailing' (with Stewart on a quayside) (1.13.50). Extracts from films made to accompany album tracks on THE OLD GREY WHISTLE TEST: two unidentified, and clips from werewolf films to Warren Zevon 'Werewolves of London' (1.17.45). Interview with Ken Russell plus clips from TOMMY (1975), including Paul Nicholas 'Cousin Kevin' (1.19.40). Video: Queen 'Bohemian Rhapsody', often considered to be the first true pop video (1.26.06). Video: Mike Nesmith 'Rio', with basic special effects [tape ends mid-song] (1.29.35). Tape two: Video: Mike Nesmith 'Rio' [overlapping from tape one] (3.45). David Bowie singing 'Ziggy Stardust' from ZIGGY STARDUST AND THE SPIDERS FROM MARS (1982) followed by interview with Bowie on his music video work and thoughts about the medium intercut with the videos (not all shown complete) for 'Space Oddity' (5.50-7.30), 'The Jean Genie' (8.33-9.49), 'Blue Jean' (10.50-11.50), 'Ashes to Ashes', a symbolic fantasy with Bowie dresed as a clown (13.03-16.31 complete), 'Let's Dance' (17.58-19.35), 'China Girl', banned for its scenes of nudity (21.20-25.27 complete), 'Dancing in the Street' with Mick Jagger (26.59-28.45), 'Loving the Alien' (30.56-33.16). Video: Sex Pistols 'Pretty Vacant', a straightforward performance video directed by Mike Mansfield (35.00). Video: The Boomtown Rats 'I Don't Like Mondays' (38.37). Russell Mulcahy on filming videos for Ultravox and Duran Duran (38.57). Video: Ultravox 'Vienna' (43.48), filmed in black and white in Covent Garden. Midge Ure (of Ultravox), Mulcahy and critic Paul Morley on the superficial qualities of videos (47.24). Video: Duran Duran 'Union of the Snake' (50.09). Malcolm McLaren on how dull pop musicians are; Morley says Duran Duran should be shot (52.35). Video: Duran Duran 'Rio', filmed on a yacht (54.16). Midge Ure followed by video for Ultravox 'Love's Great Adventure' with a spoof adventure theme (58.08). Video: Adam and the Ants 'Stand and Deliver' with highwayman setting (1.00.38). Video: Duran Duran 'Wild Boys', with lavish set including windmill blades passing through water, the singer Simon Le Bon tied to one of the blades (1.03.19). Video: Jesse Rae 'Over the Sea' (minor record with eccentric Scottish imagery for the video) (1.05.50). Section on the MTV channel for pop videos including interviews with John Landis, Thomas Dolby (very brief), Dire Straits' computer-animated video 'Money for Nothing' (1.08.53-1.10.54), MTV chief executive Bob Pittman, rock critic Dave Marsh, video jock Martha Quinn, Midge Ure, and a group of teenage American MTV viewers, plus studio shots (1.17.09). Video: The Buggles 'Video Killed the Radio Star', intercut with comment from McLaren (1.20.04). Extracts from Madness videos, directed by Dave Robinson: 'House of Fun' (1.21.00), 'Grey Day' (1.21.48), 'Our House' (1.22.28). Comments by members of Madness on their use of comedy in videos, intercut with extracts from 'Tomorrow's (Just Another Day)' (1.23.39-1.24.28), 'The Sweetest Girl' (1.24.47-1.25.22), 'Driving in My Car' (1.26.52-1.28.05) and 'Uncle Sam' (1.28.05-1.29.29). More comments from Madness and brief further clip from 'Uncle Sam' (1.30.02). Tape three: Overlap with 'Uncle Sam' from previous tape (1.49). Continuation of comments from Madness intercut with extracts from 'The Prince', performed on TOP OF THE POPS (2.47-3.13), 'Yesterday's Men' (4.32-4.56), 'It Must Be Love' (5.16-5.35 and 8.03-9.04), 'House of Fun' (5.58-7.12 and 7.47-8.03), 'Bed and Breakfast Man' (7.21-7.41), 'Our House' (9.22-10.28) and 'Baggy Trousers' with the flying saxophonist (11.35-12.57). Section on animation in pop videos: interviews with Annabel Jankel and Rocky Morton (14.30). Video: Elvis Costello and the Attractions 'Accidents Will Happen', utilising semi-abstract animation (16.52). Further comments from Jankel and Morton on animation techniques and the primacy of ideas over technique, intercut with videos for Chaz Jankel 'Questionnaire', with electrical effects (17.25-18.23), Tom Tom Club 'Genius of Love', animating style of a particular artist (20.46-24.06), Donald Fagen 'New Frontier' (25.07-29.27) and Miles Davis 'Decoy' (30.57-32.59), both mixing live action and animation. Steve Barron on the production of A-ha's first video, a mixture of live action and animated drawings (34.33). Video: A-Ha 'Take On Me' (38.18). Video: Art of Noise 'Close to the Edit', abstract, cut-up animation by Zbigniew Rybczynski (41.18). Video: Jackie Wilson 'Reet Petite', clay animation by Giblets Animation (43.07). Video: Eurythmics 'It's Alright (Baby's Coming Back)', animation effects by Willie Smax (45.21). Video: The Cars 'You Might Think', special effects by Charles and Jeff Stein (48.24). Video: Talking Heads 'And She Was', cut-out animation directed by David Byrne and Jim Blashfield (51.55). David Byrne interviewed on his band Talking Heads and their considered but humorous use of video to complement the themes of their songs, intercut with videos for 'Lady Don't Mind' (52.22- 53.03), 'Burning Down the House' (54.53-58.03), from the film STOP MAKING SENSE 'Girlfriend is Better' (59.54-1.01.48) and 'Psycho Killer' (1.02.14- 1.06-31), 'Once in a Lifetime' (1.07.29-1.09.32) and 'Road to Nowhere' (1.10.39-1.14.41). Section on choreography; interview with Toni Basil (1.16.11). Video: Toni Basil 'Mickey' (1.19.38). Video: Toni Basil 'Over My Head' (1.23.22). Basil on the differences between video and live choreography (1.24.34). Examples of videos with dance: Elton John 'I'm Still Standing' (1.26.32). Lionel Richie 'All Night Long (All Night)' (1.29.45). Madonna 'Like a Virgin' (1.31.11). Very brief section from video for Prince 'Little Red Corvette' (1.31.17). Tape four: Overlap of Madonna 'Like a Virgin' (1.19). Video: Prince 'Little Red Corvette' (2.29). Toni Basil praises Michael Jackson's use of choreography (2.44). Director Steve Barron on his ideas behind 'Billie Jean' (3.00). Video: Michael Jackson 'Billie Jean', with Jackson as a mysterious visitor to a grey world whose touch creates light (6.23). Director Bob Giraldi on 'Beat It' (6.46). Video: Michael Jackson 'Beat It', with street gangs dancing alongside Jackson (11.14). John Landis describes the ideas behind the extended 'vanity video' of 'Thriller' (12.02). Video: Michael Jackson 'Thriller', an exercise in the horror film genre: an opening statement from Jackson that the video &quot;in no way endorses a belief in the occult&quot;; on a date at night in the woods, Jackson turns into a werewolf; the action is a film being watched by Jackson and girlfriend in a cinema; they leave and are surrounded by the dead which rise from a graveyard; Jackson becomes one of them and a dance routine follows; the girl is chased by Jackson and the dead into a house, then is woken from her dream by Jackson; he turns to the camera and his eyes go green (23.28). Video: Godley and Creme 'Cry', in which faces filmed in black and white dissolve into one another, intercut with comments by performers/directors Kevin Godley and Lol Creme (27.17). Video: Frankie Goes to Hollywood 'The Power of Love', which shows the traditional Nativity, intercut with Godley and Creme's comments on making the video and how they were forced to include film of the band and did so by adding them as a decorative frame (the version show here does not include the band) (32.13). They discuss creating an image for Go West (34.05). Video: Go West: We Close Our Eyes (35.27). They discuss editing and sampling visuals (37.22). Video: Godley and Creme 'Golden Boy', with images portrayed on a Steenbeck (38.07). Video: Herbie Hancock 'Rockit' with bizarre mannequins in a domestic setting (40.43). Godley and Creme describe its production and how MTV asked them to lessen the appearances of black performer Hancock. They discuss pure video art, shooting with sound and a shot for every note, and constructing a video from this material (42.49). Video: Godley and Creme 'Mondo Video' (43.59). Videos that are controversial or make political statements: Julien Temple on making videos for an audience other than &quot;five year olds&quot; (45.17). Video: The Rolling Stones 'Undercover', featuring a kidnapping drama with a man shot dead and a shootout in a church (50.08). Ken Rusell on videos and the compression of time (51.26). Godley and Creme on filming 'Two Tribes' (52.29). Video: Frankie Goes to Hollywood 'Two Tribes', featuring a violent fight between 'Reagan' and 'Chernenko' (58.28). Video: Sting 'Russians' (1.00.08). Video: Artists United Against Apartheid 'Sun City' (1.02.19). Video: The Pogues 'A Pair of Brown Eyes', using anti-Thatcher imagery (1.05.04). The banned video for Frankie Goes to Hollywood 'Relax', with orgiastic scenes (1.08.57). The relation of videos to advertising: Grace Jones 'Slave to the Rhythm', with product placement for Kodak and Citreon CX cars (1.11.30). Part of video for ZZ Top 'Sharp Dressed Man', with prominent ZZ Top key-ring (1.12.11). Comments from Malcolm McLaren and Paul Morley (1.12.17). TV commercial for Levi's 501 jeans using recording of Sam Cooke 'Wonderful World' (1.12.15). Japanese TV commercial for the Honda 'City' car featuring Madness, who comment on how this attempt to break them into the Japanese market backfired (1.15.33). Video: Robert Palmer 'Addicted to Love', with glamorous models as Palmer's 'band', directed by Terence Donovan, and Malcolm McLaren's enthusiastic comments (1.17.38). Low budgets and directorial ingenuity: Tim Pope discusses his approach to making videos, illustrated by Soft Cell 'Bed Sitter' (1.18.15-1.19.44); The Cure 'Close to Me', with the whole action taking place in a wardrobe (1.19.54-1.23.33); The Cure 'Love Cats' (1.24.00-1.26.02); comments from Siouxsie Sioux (1.26.31-1.26.45); Siouxsie and the Banshees 'Dear Prudence', filmed in Venice (1.26.45-1.28.09); The Cure 'In Between Days', with swooping camera (1.28.47-1.31.26). Pope says meaningful looks in videos impose too much on a song (1.31.55). Tape five: Overlap of The Cure 'In Between Days' and Tim Pope (2.06). Video: The Cure 'Boys Don't Cry', with children taking the place of band members (3.41). The crossover between video and cinema: Steve Barron describes the influence of Truffaut's LA NUIT AMERICAINE on 'Don't You Want Me?' (4.38). Video: The Human League 'Don't You Want Me?', dramatised around the filming of a pop video (8.01). Julien Temple says video is repeatable where film tends not to be, and says video can be like a riddle (9.25). Barron and then Temple on the increase in the pace of films for the MTV generation (10.21). Patsy Kensit 'singing' 'Having it All' from ABSOLUTE BEGINNERS (1986) (10.43). Malcolm McLaren on how video directors fail to present character when they make films (11.24). Barron on how video directors tend not to learn about actors and dialogue (11.49). Ken Russell says audiences remember visuals not dialogue (12.03). Video/film clip of 'It's a Lovely Life' from CRIMES OF PASSION (1985), sung by Maggie Bell (14.32). John Landis on hit songs in movies (14.55). Video: Jim Steinman 'Tonight is What it Means to be Young', with Landis voiceover querying why the film from which the song came, STREETS OF FIRE (1984), was a flop when the video was a hit (18.39). Video: Madonna 'Into the Groove', using scenes from the film DESPERATELY SEEKING SUSAN (1985) (21.03). Video parodying itself: 'Weird Al' Yankovic 'Eat It', a parody of the Michael Jackson song and video 'Beat It' (24.09). Pamela Stephenson parodying Kate Bush with 'England, My Leotard' from the TV series NOT THE NINE O'CLOCK NEWS (1980) (25.37). Video: David Lee Roth 'Just a Gigolo', set in a pop video TV studio (29.31). Parody of various pop video pretensions and production techniques with 'Nice Video (Shame About the Song)' from NOT THE NINE O'CLOCK NEWS (1982) (31.41). Peel and Walters sign off and rewind the programme (32.16). End title sequence and credits (33.28). Note: The programme ran for two hours longer than advertised in the 'Radio Times'. The NFTVA tape recording lasts 397mins, which includes approximately 7mins overlap between tapes. The 'Radio Times' lists some videos due to be shown, but which do not feature in the broadcast programme: The Stranglers 'Golden Brown', ABC 'Poison Arrow', Madonna 'Gambler', Thomas Dolby 'Hyper Active'. Similarly, Mel Brooks and Paul Weller are listed as interviewees, but do not feature in the broadcast programme. Reference: Radio Times, 3-9 May 1986, pp. 10-11, 62.","torrent":{"xt":"urn:btih:63ba967d67097a6ce463aa56583b7a9a287a26a4","amp;dn":"Omnibus+Video+Jukebox+BBC1+9th+May+1986+-+A+History+Of+The+Pop+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ba967d67097a6ce463aa56583b7a9a287a26a4","infoHashBuffer":{"type":"Buffer","data":[99,186,150,125,103,9,122,108,228,99,170,86,88,59,122,154,40,122,38,164]},"announce":[],"urlList":[]}}