{"title":"Indian Castles 1206-1526: The Rise and Fall of the Delhi Sultana","uid":11836110,"size":49694507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63c49ed0d41744e5073993b56509e5173358ccaa&amp;dn=Indian+Castles+1206-1526%3A+The+Rise+and+Fall+of+the+Delhi+Sultana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429741880,"description":"From the beginning of the 11th century onwards, the constant sate of war amongst the various Indian kingdoms left them open to outside attack, and Muslim Turkic tribesmen began to pour over the north-west border from modern-day Afghanistan. These raiders consolidated their successes and by 1206 a Muslim state, the Sultanate of Delhi, had been founded, which then extended its direct rule or influence over most of the subcontinent.\n\nA turbulent period followed. The Sultanate was in constant flux as five dynasties rose and fell: Mamluk or Slave (1206-90), Khalji (1290-1320), Tughluq (1320-1413), Sayyid (1414-51), and Lodi (1451-1526). 19 out of the 35 Sultans died at the hands of assassins and the Sultanate was torn by factional rivalries and court intrigues. As a consequence of this, the territory under its direct control expanded and shrank depending on the personality, fortunes and military success of each individual Sultan.\n\nThis era is considered to be the defining age of Indian castle and fortification design. The instability and feudal division of the country throughout the greater part of the period led to the intense fortification of many of the provinces, as each small lord sought to bolster his position by constructing castles. It was also the period during which Indian castles started to show their defining features, elements of which would be modified in later years as the technology of siege warfare evolved. The combined influence of the Islamic and Hindu architectural tradition lends these fortifications a unique and exotic style.\n\nThis book covers all the major sites of the period, including the fabled seven medieval cities on the site of present-day Delhi, as well as the most prominent sieges","torrent":{"xt":"urn:btih:63c49ed0d41744e5073993b56509e5173358ccaa","amp;dn":"Indian+Castles+1206-1526%3A+The+Rise+and+Fall+of+the+Delhi+Sultana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c49ed0d41744e5073993b56509e5173358ccaa","infoHashBuffer":{"type":"Buffer","data":[99,196,158,208,212,23,68,229,7,57,147,181,101,9,229,23,51,88,204,170]},"announce":[],"urlList":[]}}