{"title":"Norman Finkelstein: Gaza: One Year Later","uid":5394886,"size":587566974,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:6401411399accac75bf8f4c020f3950458555dbb&amp;dn=Norman+Finkelstein%3A+Gaza%3A+One+Year+Later&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"theArchit3kt","files":1,"time":1267196321,"description":"Gaza: One Year Later\nNorman Finkelstein \non the significance of the Goldstone Report\n\nFilmed live at Brecht Forum in New York City on December 2, 2009:\n\nOn the morning of 27 December 2008, Israeli occupying forces launched 'Operation Cast Lead,' a wide-ranging military offensive against the Gaza Strip. 80 warplanes carried out a devastating surprise airstrike campaign whose scale and intensity signaled Israel's intention to inflict widespread destruction throughout the Gaza Strip.\n\nAfter 22 days of unrelenting aerial attacks coupled with an intensive ground invasion that began on 3 January 2009, the death toll exceeded 1,400 Palestinians, the majority of them civilians including women and children. Over 5,000 more were wounded. Excessive civilian casualties were compounded by the unprecedented destruction of civilian infrastructure across the Gaza Strip including hospitals, schools, mosques, civilian homes, police stations and United Nations compounds.\n\nThe Goldstone report, which was released in September, details the extensive war crimes of the Israeli army. While the report was dismissed by the United States, it remains the most authoritative document for any further discussion on the question of Palestine. Join Norman Finkelstein as he presents a detailed analysis of the report.\n\nNorman G. Finkelstein received his doctorate in 1988 from the Department of Politics at Princeton University. For many years he taught political theory and the Israel-Palestine conflict. Finkelstein is the author of five books which have been translated into more than 40 foreign editions: Beyond Chutzpah: On the Misuse of Anti-Semitism and the Abuse of History; The Holocaust Industry: Reflections on the Exploitation of Jewish Suffering; Image and Reality of the Israel-Palestine Conflict; The Rise and Fall of Palestine: A Personal Account of the Intifada Years; and, with Bettina Birn, A Nation on Trial: The Goldhagen Thesis and Historical Truth. He has just completed a new book entitled A Farewell to Israel: The Coming Break-up of American Zionism, to be published in 2009.\n\n------------------------------------------------------------------------\n &lt;a href=&quot;\nhttp://www.archive.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.c-spanarchives.org/person/1336&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.c-spanarchives.org/person/1336&lt;/a&gt;\n\n\n------------------------------------------------------------------------\n\n...check out my &quot;Best of Noam Chomsky&quot; Video if u want:\nhttp://vimeo.com/7344978\n\n------------------------------------------------------------------------\n\n..i wish u aLL the best and i hope thats you will seed this torrent a little bit..\n\n..theArchit3kt..\n\nvisit my site on Vimeo if u want:\nhttp:/vimeo.com/nobrand\n\n\nAlso you can take a look at all my torrents on the &quot;SuperBayForum&quot;\nhttp://forum.suprbay.org/showthread.php?tid=62897\n\n\n!! keep torrents alive !!","torrent":{"xt":"urn:btih:6401411399accac75bf8f4c020f3950458555dbb","amp;dn":"Norman+Finkelstein%3A+Gaza%3A+One+Year+Later","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6401411399accac75bf8f4c020f3950458555dbb","infoHashBuffer":{"type":"Buffer","data":[100,1,65,19,153,172,202,199,91,248,244,192,32,243,149,4,88,85,93,187]},"announce":[],"urlList":[]}}