{"title":"Coleman-Conspirators' Hierarchy-Committee of 300(1997)","uid":4537780,"size":1552216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64e83bcf3565abaecb46da2772a2136e879504a5&amp;dn=Coleman-Conspirators%5C%27+Hierarchy-Committee+of+300%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227807960,"description":"John Coleman, a former MI 6 Intelligence agent, wrote an amazing book The Conspirators&amp;#039; Hierarchy - The Committee of 300 4th edn (1997) which rips off the lid of the conspiratorial group that knows no national boundaries, is ABOVE the laws of every aspect of politics, religion, commerce,industry, banking,insurance mining and even the drug trade. Learn how this small ELITE GROUP, which is answerable to no one except its members, has pulled the strings and manipulates the affairs of the entire world. 250 pages. A must read for everyone.\n\nFrom the Back Cover:\nCan you imagine an all powerful group, that knows no national boundaries, above the laws of all countries, one that controls every aspect of politics, religion, commerce and industry, banking, insurance, mining, the drug trade, the petroleum industry, a group answerable to no one but its members? To the vast majority of us, such a group would appear to be beyond the realms of possibilities and capabilities of any given organization. If that is what you believe, then you are in the majority. The conception of a secret, elite group exercising control of every aspect of our lives is beyond our comprehension. Americans are prone to say, &quot;It can&amp;#039;t happen here, our Constitution forbids it.&quot; That there is such a body, called &quot;The committee of 300,&quot; is graphically told in this book. When most people attempt to address our problems, they speak or write about &quot;they&quot;; this book tells precisely who &quot;they&quot; are, and what &quot;THEY&quot; have planned for our future, how &quot;they&quot; have been at war with the American nation for 50 years, a war which we are on the brink of losing, what methods &quot;They&quot; use and exactly how &quot;they&quot; have brainwashed us. If you are Puzzled and perplexed as to why things are occurring that we as a nation don&amp;#039;t like yet seem powerless to prevent, why it is that the United States always seems to back the wrong horse, Why the UNITED states is in a depression from which it will not emerge, why our former social and moral values have been turned aside and seemingly buried; if you are confused by the many conspiracy theories, the CONSPIRATORS&amp;#039;&amp;#039; hierarchy: the committee of 300 will clearly establish that these conditions have been deliberately created to bring us to our knees. Once you have read the applying truths contained in this book, understanding past and present political, economic, social and religious events will no longer be a problem. This powerful account of the forces ranged against the United States, and indeed the entire free world, cannot be ignored.\n","torrent":{"xt":"urn:btih:64e83bcf3565abaecb46da2772a2136e879504a5","amp;dn":"Coleman-Conspirators%5C%27+Hierarchy-Committee+of+300%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64e83bcf3565abaecb46da2772a2136e879504a5","infoHashBuffer":{"type":"Buffer","data":[100,232,59,207,53,101,171,174,203,70,218,39,114,162,19,110,135,149,4,165]},"announce":[],"urlList":[]}}