{"title":"Neil Young - 1974-05-16 - Bottom Line NYC - Citizen Kane Junior","uid":8745167,"size":452433161,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6575bd73391892203229b8d8b6dd07dce36ea3c6&amp;dn=Neil+Young+-+1974-05-16+-+Bottom+Line+NYC+-+Citizen+Kane+Junior+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PEPEVISION","files":15,"time":1374903070,"description":"Some history, for anyone who cares: this was a short set performed by Neil completely spontaneously, as an &quot;add-on&quot; after a Ry Cooder set. Neil did not tour as a solo act during 1974 (he did a brief tour with CSNY), and therefore his excellent &quot;On The Beach&quot; stuff doesn't show up on many bootlegs. This torrent features an all-acoustic show featuring Neil performing solo during his supposedly &quot;depressed&quot; period (after the OD deaths of his guitarist and roadie) between &quot;On The Beach&quot; and &quot;Tonight's The Night.&quot; Can't tell he's depressed here--he's friendly and talkative and doesn't even get upset when a few members of the small crowd yell for &quot;Southern Man&quot;--instead he tells a funny story about the same thing happening in LA.\n\nWhat really makes this one stand out, besides the happy/chatty Neil is the setlist, which includes some rare appearances of a few songs from the aforementioned NY album &quot;On The Beach,&quot; (my personal favorite) including &quot;Motion Pictures&quot; (I don't have any other boots with this one), &quot;Revolution Blues&quot; (hilarious), &quot;On The Beach,&quot; and the quintessential Neil tune &quot;Ambulance Blues.&quot; With the exception of &quot;Helpless,&quot; all of the songs were unreleased at the time of this performance, making for some interesting first impressions by the crowd. Indeed, two songs (&quot;Greensleeves&quot; and &quot;Dance, Dance, Dance,&quot; which isn't listed on the label) remain unreleased today; a third, &quot;Pushed It Over the End,&quot; was put out as a CSNY 12-inch single in Italy. On The Beach is the backdrop for this recording, with four of its songs performed live and a fifth (&quot;For The Turnstiles&quot;) appearing as a low quality recording of what I believe to be the actual studio version (the label doesn't say). Renditions of &quot;Pardon My Heart,&quot; &quot;Long May You Run,&quot; &quot;Roll Another Number&quot; and &quot;Flying on the Ground Is Wrong&quot; (recorded in a 1970 Carnegie Hall performance) round out the songs. \n\nSQ is very good--this has been called a SBD, but it is clearly not--some distance between the mic and Neil is apparent; however, it is a quality audience tape, with Neil's guitar/harmonica and voice all clear.\n-------------------------------------------------------------------------------\n\nNeil Young -The Bottom Line NYC 1974-05-16\n\nCD (&quot;Citizen Kane Junior Blues&quot;) &gt; EAC &gt; WAV &gt; FLAC &gt; SHNTOOLS (SBE check--okay)\n\n01. Pushed It Over The Edge (Neil calls it &quot;Citizen Kane Junior Blues&quot;)\n02. Long May You Run\n03. Greensleeves\n04. Ambulance Blues\n05. Helpless\n06. Revolution Blues\n07. On The Beach\n08. Roll Another Number For The Road\n09. Motion Pictures\n10. Pardon My Heart\n11. Dance, Dance, Dance\n\nFILLER\n12. For The Turnstiles (1973)\n13. Flying On The Ground Is Wrong (Carnegie Hall 1974-12-05)","torrent":{"xt":"urn:btih:6575bd73391892203229b8d8b6dd07dce36ea3c6","amp;dn":"Neil+Young+-+1974-05-16+-+Bottom+Line+NYC+-+Citizen+Kane+Junior+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6575bd73391892203229b8d8b6dd07dce36ea3c6","infoHashBuffer":{"type":"Buffer","data":[101,117,189,115,57,24,146,32,50,41,184,216,182,221,7,220,227,110,163,198]},"announce":[],"urlList":[]}}