{"title":"Patty Griffin - Children Running Through [2007][FLAC]","uid":11708336,"size":351374852,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65b3d25e7021ceaf77bfca0db4c271b62f7fc9a3&amp;dn=Patty+Griffin+-+Children+Running+Through+%5B2007%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":21,"time":1424227124,"description":"Â» FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: ATO Records / 88088-21576-2 / Barnes &amp; Noble Bonus Disc Version\nCountry: USA\nYear: February 6, 2007\nGenre: americana\nFormat: CD\n\n01. Patty Griffin - You'll Remember (02:07)\n02. Patty Griffin - Stay on the Ride (05:17)\n03. Patty Griffin - Trapeze (04:23)\n04. Patty Griffin - Getting Ready (03:15)\n05. Patty Griffin - Burgundy Shoes (03:26)\n06. Patty Griffin - Heavenly Day (03:45)\n07. Patty Griffin - No Bad News (04:02)\n08. Patty Griffin - Railroad Wings (03:59)\n09. Patty Griffin - Up to the Mountain (MLK Song) (04:08)\n10. Patty Griffin - I Don't Ever Give Up (04:00)\n11. Patty Griffin - Someone Else's Tomorrow (04:06)\n12. Patty Griffin - Crying Over (04:37)\n\nBarnes &amp; Noble Bonus Disc:\n1. Patty Griffin - Free (03:52)\n2. Patty Griffin - Only Up or Down (04:01)\n\nPatty Griffin's raucous second album Flaming Red was a shocking departure from the critically noticed Living with Ghosts. It placed solid, searing rock &amp; roll and big bad drumbeats up against the authority of her voice. On Impossible Dream, she married country and her own brand of gospel in an intimate and musically seductive mix. The reason for stating the obvious is that the Mike McCarthy-produced Children Running Through is the moment Griffin's recordings have been building toward; an album that cements the emotional and musical adventure of earlier offerings with clarity of vision and seamless execution. Smoky and jazz-tinged, with Glenn Worf's double bass strolling through the first verse, &quot;You'll Remember&quot; that gets kissed by Michael Longoria's brushed drums is her evocative song of hoped-for memory and resilience, and is breathtaking in its poetic sparseness. This is underscored and shifted by the tough, acoustic guitar and horn laced acoustic R&amp;B in &quot;Stay on the Road.&quot; The prominence of her voice in the mix is startling. She stands right out in front of her band and lets the raw soul just pour out of her mouth. She changes up again on the gorgeous country of the tragically haunting &quot;Trapeze&quot; with backing vocals by Emmylou Harris. Griffin's song is lyrically her own, but there is a trace of Bruce Springsteen's country-ish phrasing in her delivery. As Harris' duet vocal joins on the second verse, the tale strips itself of time and place and becomes a folk song, a tale told too often but never in this way as the refrain lays out a proverb for the ages: &quot;Some people don't care if they live or they die/Some people want to know what it feels like to fly/They gather their courage and they give it a try/And fall under the wheels of time going by.&quot; The song builds to a stirring climax and the final word, &quot;Hallelujah,&quot; resonates long after the track concludes. Griffin hardly lets these three songs, filled with their wisdom and loss, dominate her recording. &quot;Getting Ready&quot; is a burning, snaky rockabilly tune for the 21st century. In it, one can hear the energy of Johnny Burnette and the punk rock determinism of the early Pretenders. This is a song of self-determination and the acknowledgement of emotional and sexual power. There's yet another twist in the utterly gorgeous &quot;Burgundy Shoes,&quot; a ballad that swirls into a celebration of a mother, or grandmother, that rings to the skies with gratitude and remembrance. Once more, as she does for the rest of the set, Griffin shifts gears toward her own brand of secular gospel in &quot;Heavenly Day&quot; with a stirring string section that underscores the soaring conviction and joy in her vocal, and Ian McLagan's piano is straight from the gut, caressing her voice until it's time to push it into the stratosphere, which he does. (You all guessed right: this is the same song she loaned to Solomon Burke for his Nashville album.) &quot;Up to the Mountain (The MLK Song)&quot; is another gospel number based on the &quot;I Have a Dream&quot; speech delivered on the day before Rev. Dr. Martin Luther King was assassinated. Griffin's reverence here is so profound it feels like she deliberately gives up some of the authority she expresses on the rest of the album out of respect. And that's fine. She lets the low strings and McLagan's grand piano guide her to the peak of the mountain she sings about. She never goes over it but points to the dignity of the man, the integrity of his spirituality, and the depth of his courage, and carries his inspiration in the grain of her voice. This is followed by her own testament in &quot;I Don't Ever Give Up,&quot; a song -- ushered in quietly by percussion and an acoustic guitar -- about determination in the face of discouragement, error and downright oppression. As the swelling strings buoy her voice she looks outside the song and then back in for what she needs to carry it through and reveal her truth.\nGriffin is a fully in control artist here; she knows what she wants and she knows how to get it. Her songwriting is leaner yet more evocative, her singing stronger and more confident, and her manner of illustration is spot-on; the song is true simply because she delivers it that way","torrent":{"xt":"urn:btih:65b3d25e7021ceaf77bfca0db4c271b62f7fc9a3","amp;dn":"Patty+Griffin+-+Children+Running+Through+%5B2007%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65b3d25e7021ceaf77bfca0db4c271b62f7fc9a3","infoHashBuffer":{"type":"Buffer","data":[101,179,210,94,112,33,206,175,119,191,202,13,180,194,113,182,47,127,201,163]},"announce":[],"urlList":[]}}