{"title":"The Miracle of Theism Arguments For and Against the Existence of","uid":8890291,"size":1367400,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66800b49036ec1472d5815e058e9e4b6642cbe74&amp;dn=The+Miracle+of+Theism+Arguments+For+and+Against+the+Existence+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"georgestrawson33","files":1,"time":1378565001,"description":"This book is a professional philosopher's view of theism. Although Mackie was an atheist, he takes the subject seriously here, something which he thinks it deserves.\n\nThe book has two main parts. In the first we get a discussion of the traditional arguments for the existence of God together with modern attempts to update them. Since Kant, however, &quot;proofs&quot; of God's existence have mostly fallen out of favour and other ways of justifying belief have been sought; these are considered in the second part of the book.\n\nMackie starts by reviewing Hume's treatment of miracles. Hume held that it was unreasonable to believe in Christianity without the support of miracles, but he also thought that the evidence in favour of miracles could never be strong enough to make it more probable than not that they had occurred. It is unclear whether Hume himself was a deist or a frank atheist.\n\nAfter a fairly brief consideration of Descartes' views, Mackie goes on to treat the ontological argument at some length. So far as I can make out, this seems to consist in defining God as a supreme being and then saying that such a being must necessarily exist. I have to admit that I have never seen the force of this argument myself (it seems too much like trying to lift yourself up by your bootstraps), but some modern philosophers have taken it up and put it into modern dress, though Mackie does not find their views to be persuasive.\n\nOther chapters in this part of the book look at Berkeley's immaterialist position, cosmological arguments, moral arguments, arguments from consciousness, and arguments for design, before taking up what is surely the most difficult question for any theist, the problem of evil. Attempts to show that the presence of evil in the world is compatible with the existence of an omnipotent and benevolent god are called theodicies. Not surprisingly, Mackie has little difficulty in demonstrating that no theodicy worth the name will stand up to logical criticism.\n\nWe hear a lot of talk these days about the need for a Designer of the universe, as evidenced by the existence of &quot;fine tuning&quot; in the laws of nature. Even such a well-known atheist as Antony Flew apparently found it persuasive enough to make him change his mind. Mackie advances several objections to such arguments and echoes Kant's view that the most they could do would be to support the existence of an architect god but not a transcendental creator. Even this, however, is an unnecessary extrapolation.\n\nIn the second part of the book Mackie looks at claims based on religious experience and natural histories of religion. Here he draws a good deal on William James's classic &quot;The Varieties of Religious Experience&quot;. No kind of psychological experience, Mackie concludes (in contradiction to James), can justify postulating a supernatural source for such experience.\n\nAn argument for religion that is quite often advanced today is that its being so widespread in all societies means that there must be a natural psychological need for it. But Mackie makes the telling objection that this is, if anything, evidence against the truth of religious claims, since it would explain &quot;why religious beliefs would arise and persist, and why they would be propagated and enforced and defended as vigorously as they are, even if there were no good reason to suppose them to be true.&quot;\n\nSome philosophers, such as Tertullian and (the to me impenetrable) Kierkegaard, have made a positive virtue out of the lack of any proof or evidence of the existence of God. (Tertullian: &quot;I believe because it is absurd.&quot;) Mackie does not think that Kierkegaard has made this position intellectually respectable, a view I have to agree with. An alternative approach is to try to keep religion going without any factual belief system at all. Don Cupiitt (not mentioned here) would, I suppose, be one of the leading advocates of this radical solution. But the distinction from frank atheism is hard to discern.\n\nThis is probably one of the most comprehensive modern philosophical treatments of theism from an atheistic standpoint. Though largely jargon-free it is not light reading. It is somewhat technical in places and close attention is required throughout if the arguments are to be understood. The lack of a bibliography is unfortunate, although quotations are referenced in footnotes; these features give it a slightly old-fashioned character. Anyone who is seriously interested in the philosophy of atheism would be glad to have it on their shelves, but for a more accessible, although still thorough, discussion of the atheistic position it might be better to look at The Ghost in the Universe, by Taner Edis.","torrent":{"xt":"urn:btih:66800b49036ec1472d5815e058e9e4b6642cbe74","amp;dn":"The+Miracle+of+Theism+Arguments+For+and+Against+the+Existence+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66800b49036ec1472d5815e058e9e4b6642cbe74","infoHashBuffer":{"type":"Buffer","data":[102,128,11,73,3,110,193,71,45,88,21,224,88,233,228,182,100,44,190,116]},"announce":[],"urlList":[]}}