{"title":"Dire Straits - Dire Straits (1978) 2010 SHM-SACD-DFF","uid":11009486,"size":1770507606,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6724d1cf927f9db77793322ef1cb8fae43fc5c95&amp;dn=Dire+Straits+-+Dire+Straits+%281978%29+2010+SHM-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"hal4000","files":-1,"time":1410324098,"description":"Dire Straits were a British rock band, formed in 1977 by Mark Knopfler (lead vocals and lead guitar), his younger brother David Knopfler (rhythm guitar and backing vocals), John Illsley (bass guitar and backing vocals), and Pick Withers (drums and percussion). Dire Straits' sound drew from a variety of musical influences, including jazz, folk, and blues, and came closest to beat music within the context of rock and roll. Despite the prominence of punk rock during the band's early years, the band's stripped-down sound contrasted with punk, demonstrating a more &quot;rootsy&quot; influence that emerged from pub rock. Many of Dire Straits' compositions were melancholic. Dire Straits' biggest selling album, Brothers in Arms, has sold over 30 million copies, and was the first album to sell a million copies on Compact Disc.\n\nDire Straits' minimalist interpretation of pub rock had already crystallized by the time they released their eponymous debut. Driven by Mark Knopfler's spare, tasteful guitar lines and his husky warbling, the album is a set of bluesy rockers. And while the bar band mentality of pub-rock is at the core of Dire Straits, even the group's breakthrough single, &quot;Sultans of Swing,&quot; offered a lament for a neglected pub rock band, their music is already beyond the simple boogies and shuffles of their forefathers, occasionally dipping into jazz and country. Knopfler also shows an inclination toward Dylanesque imagery, which enhances the smoky, low-key atmosphere of the album. While a few of the songs fall flat, the album is remarkably accomplished for a debut, and Dire Straits had difficulty surpassing it throughout their career. \n\nDFF tracks extracted with Scarletbook\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2010 SHM-SACD.\n\nSHM-SACD-ISO-DFF-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:6724d1cf927f9db77793322ef1cb8fae43fc5c95","amp;dn":"Dire+Straits+-+Dire+Straits+%281978%29+2010+SHM-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6724d1cf927f9db77793322ef1cb8fae43fc5c95","infoHashBuffer":{"type":"Buffer","data":[103,36,209,207,146,127,157,183,119,147,50,46,241,203,143,174,67,252,92,149]},"announce":[],"urlList":[]}}