{"title":"Jimmie Dale Gilmore - One Endless Night (2000) MP3@320","uid":10107091,"size":128791096,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:67af9a884d3552d6ecf7a9b0477b03c11cc27862&amp;dn=Jimmie+Dale+Gilmore+-+One+Endless+Night+%282000%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":null,"files":14,"time":1399467736,"description":"Jimmie Dale Gilmore (born May 6, 1945) is an American country singer, songwriter, actor, recording artist and producer, currently living in Austin, Texas.\n\nGilmore is a native of the Texas Panhandle, having been born in Amarillo, Texas, and raised in Lubbock, Texas. His earliest musical influence was Hank Williams and the honky tonk brand of country music that his father played. In the 1950s, he was exposed to the emerging rock and roll of other Texans such as Roy Orbison and Lubbock native Buddy Holly, as well as to Johnny Cash. He was profoundly influenced in the 1960s by the likes of The Beatles and Bob Dylan and the folk music and blues revival in that decade.\n\nWith Joe Ely and Butch Hancock, Gilmore founded The Flatlanders. The group has been performing on and off since 1972. The band's first recording project, from the early 1970s, was barely distributed. It has since been acknowledged, through Rounder's 1991 reissue (More a Legend Than a Band), as a milestone of progressive, alternative country. The three friends continued to reunite for occasional Flatlanders performances, and in May 2002 released a long-awaited follow-up album, Now Again, on New West Records.\n\nAfter briefly attending Texas Tech University, Gilmore spent much of the 1970s in an ashram in Denver, Colorado, studying metaphysics with teenaged Indian guru Prem Rawat, also known as Maharaji. In the 1980s, he moved to Austin, where his first solo album, Fair and Square, was finally released in 1988.\n\n","torrent":{"xt":"urn:btih:67af9a884d3552d6ecf7a9b0477b03c11cc27862","amp;dn":"Jimmie+Dale+Gilmore+-+One+Endless+Night+%282000%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67af9a884d3552d6ecf7a9b0477b03c11cc27862","infoHashBuffer":{"type":"Buffer","data":[103,175,154,136,77,53,82,214,236,247,169,176,71,123,3,193,28,194,120,98]},"announce":[],"urlList":[]}}