{"title":"Fruit Ninja Puss in Boots v1.0 Android","uid":6917054,"size":22352099,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:67b012794a31fc91a3c5218cb7b52316d60ef2f6&amp;dn=Fruit+Ninja+Puss+in+Boots+v1.0+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":".BONE.","files":1,"time":1325068809,"description":"Fruit Ninja: Puss in Boots v1.0 \nRequirements: Android 2.1+\nOverview: Fruit meets fairytales in Fruit Ninja: Puss in Boots.\n\n\n[break]\nThe suave, fruit-slashing swashbuckler, Puss in Boots, faces a challenge that would make Sensei proud. Prepare for a journey of familiar fruit-slicing action as Puss encounters a wealth of new and exciting challenges in his search for the Magic Beans.\n\n\nGet classic fruit-slicing action in Desperado Mode\nPuss in Fruits\nSlice through a series of increasingly exciting challenges in the all-new Bandito Mode, and become the greatest Fruit Ninja warrior of all time. Each stage thrusts you into never-before-seen fruit frenzy adventure. Face massive fruit from the Giant's castle, precision and timing challenges, and all-out fruit onslaughts with new obstacles. Plus, for the first time ever, throw down against the much-requested tomato!\n\n\nFace all-out fruit onslaughts and live to tell the tale\nReal Banditos must put their best blade forward, because scoring is based on the number of fruits sliced, ninja reflexes, and slicing efficiency. A true produce warrior can upload their massive high scores to global leaderboards, and rank among the best players online.\n\nIf Kitty-Looks Could Kill\nBring your blade to Desperado Mode--an enhanced and re-mastered version of the Classic Fruit Ninja game. But this time, you will face even more fruit, unique waves, and Puss in Boots' elusive Magic Beans from the DreamWorks Animation feature film.\n\nFinally, bask in the fruit-stained glory of Puss in Boots' own exclusive Ninja Stash, featuring a whole range of unique customizable content, including new backgrounds and blades.\n\nStay juicy, amigos!","torrent":{"xt":"urn:btih:67b012794a31fc91a3c5218cb7b52316d60ef2f6","amp;dn":"Fruit+Ninja+Puss+in+Boots+v1.0+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67b012794a31fc91a3c5218cb7b52316d60ef2f6","infoHashBuffer":{"type":"Buffer","data":[103,176,18,121,74,49,252,145,163,197,33,140,183,181,35,22,214,14,242,246]},"announce":[],"urlList":[]}}