{"title":"EXPLOITED COLLEGE GIRLS - Rachel - Squirting Creampie 720p *NEW*","uid":11230157,"size":1846345453,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:67bdc99c228ea85255215b8e7da74d65fdb80159&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Rachel+-+Squirting+Creampie+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"beta2008x","files":1,"time":1413510301,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=qqws1_rlc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=qqws1_rlc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=dv3ap_ecg_14_10_16_rachel_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=dv3ap_ecg_14_10_16_rachel_.jpg&lt;/a&gt;\n\n\nWe get the best of Rachel from both ends this week. From her pussy we get a nice wet squirting orgasm, from her mouth we get a load on absurd attention whoring that is almost Kardashian in its epic absurdity. In between she's got the body of a sex doll and the ass and tan lines of a swim instructor.\n\nAs Rachel strips, she confesses that she used to be fat as a teenager and has gotten fit. Rachel, darling. We knew you were fat when you said you'd fucked 400 guys to boost your self esteem. What's the next bomb you are going to drop, daddy issues? No, really, you're a unique snowflake. How about you spread your thighs and make room for Jay and his favorite vibrator.\n\nJay's nearly got a PhD. in g-spot locating and in no time flat has Rachel quivering and squirting in her first orgasm. Feel free to rewind and watch a few times, she absolutely gushes as she cums. After getting off, she gets on?her knees to suck Jay's cock. Good news! It worked! Jay's as hard as a rock and proceeds to apply his cock to Rachel's pussy in several positions. He gets her from behind, he drills her hard in sideshow and then pounds her on her back until he blows inside her, leaving a huge huge load to drip out of her.\n\nRachel is the kind of girl who will email us in a few years when she's finally done making mistakes and found some CPA to put a ring on it (and a low end Lexus under it!) and beg us to take down her scene. Because god forbid her new beau finds out he's paying full retail for the village bicycle. But today she's still neck deep in bad decisions and letting Jay fuck her brains out and blow a huge load inside her is one you get to watch. Enjoy!","torrent":{"xt":"urn:btih:67bdc99c228ea85255215b8e7da74d65fdb80159","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Rachel+-+Squirting+Creampie+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67bdc99c228ea85255215b8e7da74d65fdb80159","infoHashBuffer":{"type":"Buffer","data":[103,189,201,156,34,142,168,82,85,33,91,142,125,167,77,101,253,184,1,89]},"announce":[],"urlList":[]}}