{"title":"Tango : Sex and Rhythm of the City (pdf){Zzzzz}","uid":11644604,"size":4044238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68da5c8f78293a0738a7be9b8e497e5cae09c580&amp;dn=Tango+%3A+Sex+and+Rhythm+of+the+City+%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1417807473,"description":"Born on the unlit streets of Buenos Aires, tango was inspired by the music of European immigrants who crossed the ocean to Argentina, lured by the promise of a better life. In the capital's marginal districts, it was embraced and shaped by young men who told tales of prostitutes, petty thieves and disappointed lovers through its music and movements. Chronicling the stories told through tango's lyrics, this book shows how the dance went from slumming it in the brothels and cabarets of lower-class Buenos Aires to the ballrooms of Paris, London, Berlin and beyond. Tracing the evolution of tango, Mike Gonzalez and Marianella Yanes set its music, key figures and the dance itself in their place and time, and explore its subsequent global impact. It was not until Paris went crazy for tango just before World War I that it became acceptable for middle-class Argentineans to perform the seductive dance, and each new generation has embraced it with renewed enthusiasm, from Tokyo to Helsinki. Telling the sexy, enthralling history of this stylish and dramatic dance, Tango is a book for music fans, ballroom aficionados and everyone fascinated by the cultural history of Latin America.\n\nProduct Description\n\nAbout the Author\nMike Gonzalez is Emeritus Professor of Latin American Studies at Glasgow University and has written and lectured widely on Latin American culture and politics. Marianella Yanes is a Venezuelan writer, journalist and playwright who has written soap operas for a number of Latin American television channels and worked in theatre for many years","torrent":{"xt":"urn:btih:68da5c8f78293a0738a7be9b8e497e5cae09c580","amp;dn":"Tango+%3A+Sex+and+Rhythm+of+the+City+%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68da5c8f78293a0738a7be9b8e497e5cae09c580","infoHashBuffer":{"type":"Buffer","data":[104,218,92,143,120,41,58,7,56,167,190,155,142,73,126,92,174,9,197,128]},"announce":[],"urlList":[]}}