{"title":"The Road From Gap Creek_ A Nove - Robert Morgan.epub","uid":8854727,"size":988506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:691ed68dd8b4547517a1e6e265c925ae0698e6fc&amp;dn=The+Road+From+Gap+Creek_+A+Nove+-+Robert+Morgan.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1377624131,"description":"When Robert Morgan s novel &quot;Gap Creek &quot;was published in 1999, it became an Oprah Book Club Selection and an instant national bestseller, attracting hundreds of thousands of readers to its story of a marriage begun with love and hope at the turn of the twentieth century. Set in the Appalachian South, it followed Julie and Hank Richards as they struggled through the first year and a half of their union. But what, readers asked, of the years that followed? What did the future hold for these memorable characters? &quot;The Road from Gap Creek &quot;holds the answers to these questions, as Robert Morgan takes us back into their lives, telling their story and the stories of their children through the eyes of their youngest daughter, Annie. Through Annie, we watch as the four Richards children create their own histories, lives that include both triumphs and hardship in the face of the Great Depression and then World War II. Much more than a sequel, &quot;The Road from Gap Creek &quot;is a moving and indelible portrait of people and their world in a time of unprecedented change, an American story told by one of our country s most acclaimed writers.","torrent":{"xt":"urn:btih:691ed68dd8b4547517a1e6e265c925ae0698e6fc","amp;dn":"The+Road+From+Gap+Creek_+A+Nove+-+Robert+Morgan.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"691ed68dd8b4547517a1e6e265c925ae0698e6fc","infoHashBuffer":{"type":"Buffer","data":[105,30,214,141,216,180,84,117,23,161,230,226,101,201,37,174,6,152,230,252]},"announce":[],"urlList":[]}}