{"title":"The Biblical Offense of Racism [blackatk]","uid":8796107,"size":5525732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69526ff6515dd161537128ba7e9306a496688eff&amp;dn=The+Biblical+Offense+of+Racism+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1376083094,"description":"|With A special thanks to &quot;wetworx12&quot; - The bitter, racist troll who has inspired this upload. | filetype: pdf |\n\n\nThe Biblical Offense of Racism\n\nFrom a non-Christian perspective, the ethical issues of racism are much more radically desperate than most are willing to admit. The non-Christian has no legitimate, nonarbitarary ethical standard by which to condemn racist practices. Therefore, he has no basis to determine the right thing, the wrong thing, the problem, or the solution. The non-Christian worldview must logically (and horribly) embrace racism.\n\nWhile unhinging tired secular arguments, Jones presents a deft, biblical apologetic against racism.\n\n\nPamphlet: 32 pages\nPublisher: Canon Press; 2nd edition (May 31, 2007)\nLanguage: English\nISBN-10: 1885767072\nISBN-13: 978-1885767073\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Biblical-Offense-Racism-Douglas-Jones/dp/1885767072/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Biblical-Offense-Racism-Douglas-Jones/dp/1885767072/&lt;/a&gt;\n\n\nTags: god, yhwh, allah, Jesus, Christ, Christianity, Islam, Judaism, old, new, testament, holy, bible, religion, theology, race, racism, discrimination, oppression, slave, slavery, hebrew, israel, egypt, africa, african, african american, american, usa, united, states, chattel, bondage, indentured, servitude, church, ethics, sociology, psychology, jim crow, civil, rights, sunday, lord, justification, mass, Catholic, catholicism, pope, Rome, Vatican, Europe, \nlinguistics, race, racism, white, NLP, psychology, sociology, frame, framing, race, racism, oppression, cyber, digital, white supremacy, white power, 88, narrative, media, pr, viewpoint, 88, ss, nsdp, aryan, nation, white narrative, contested, space, superiority, inferiority, subtle, racism, thought, logic, sociology, psychology, ethics, african, african american studies, AA, obama, militia, right, wing, mccain, bush, romney, tea, party, white anxiety, white rage, white guilt, inaction, complicity, slave, slavery, jim crow, segregation, knight, ku klux, inequality, Jim, Crow, race, racism, right, wing, republican, race coding, racially coded, subtle, doublespeak, George W Bush, George H.W Bush, Nixon, John Locke, William F Buckley, barack, obama, barry, black, biracial, IR, multiracial, preseident, bush, war, afghanistan, 2008, change, yes, we, can, hope, biden, china, afghanistan, tea, party, republican, democrat, politics, nobel, prize, war, peace, diplomacy, command, military, race, relations, racism, chicago, senator, white guilt, white anxiety, african, american, african american, black, racism, sociology, social mobiility, social climbing, mentor, race relations, race, militia, hate, nazi, white anxiety, oppression, tea party, fundamentalist, fundementalism, political science, hate group, ghettoization, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, unconscious, subconscious,","torrent":{"xt":"urn:btih:69526ff6515dd161537128ba7e9306a496688eff","amp;dn":"The+Biblical+Offense+of+Racism+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69526ff6515dd161537128ba7e9306a496688eff","infoHashBuffer":{"type":"Buffer","data":[105,82,111,246,81,93,209,97,83,113,40,186,126,147,6,164,150,104,142,255]},"announce":[],"urlList":[]}}