{"title":"Plenty of Room for Biology at the Bottom","uid":15400630,"size":4158387,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:699690159ec0a6439db8634204cce360dbc45c75&amp;dn=Plenty+of+Room+for+Biology+at+the+Bottom&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469451452,"description":"Plenty of Room for Biology at the Bottom - An Introduction to Bionanotechnology - Ehud Gazit, Anna Mitraki (ICP, 2013).pdf\r\n\r\nThis expanded and updated edition of the 2007 version introduces readers from various backgrounds to the rapidly growing interface between biology and nanotechnology. It intellectually integrates concepts, applications, and outlooks from these major scientific fields and presents them to readers from diverse backgrounds in a comprehensive and didactic manner.\r\n\r\nWritten by two leading nanobiologists actively involved at the forefront of the field both as researchers and educators, this book takes the reader from the fundamentals of nanobiology to the most advanced applications.\r\n\r\nThe book fulfils a unique niche: to address not only students, but also scientists who are eager (and nowadays obliged) to learn about other state-of-the-art disciplines. The book is written in such a way as to be accessible to biologists, chemists, and physicists with no background in nanotechnology (for example biologists who are interested in inorganic nanostructures or physicists who would like to learn about biological assemblies and applications thereof). It is reader-friendly and will appeal to a wide audience not only in academia but also in the industry and anyone interested in learning more about nanobiotechnology","torrent":{"xt":"urn:btih:699690159ec0a6439db8634204cce360dbc45c75","amp;dn":"Plenty+of+Room+for+Biology+at+the+Bottom","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"699690159ec0a6439db8634204cce360dbc45c75","infoHashBuffer":{"type":"Buffer","data":[105,150,144,21,158,192,166,67,157,184,99,66,4,204,227,96,219,196,92,117]},"announce":[],"urlList":[]}}