{"title":"Kenoma (1998)","uid":6172870,"size":766083072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69d71290793816114ec19dd92d8cf6f9fd2a7632&amp;dn=Kenoma+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"aluizbsilva","files":1,"time":1297651930,"description":"A trama do filme comeÃƒÂ§a no momento em que Jonas, um andarilho, chega ao pequeno povoado de Kenoma e ali permanece, atraÃƒÂ­do por uma jovem de nome Tali. Habitada por camponeses, garimpeiros e pequenos comerciantes, Kenoma ÃƒÂ© um desses muitos vilarejos que ainda hoje transpiram um modo de vida primitivo, quase medieval.\n\nEntre os habitantes, destaca-se Lineu, um artesÃƒÂ£o que se dedica hÃƒÂ¡ vinte anos a um ÃƒÂºnico propÃƒÂ³sito: a reforma de um velho moinho abandonado. NÃƒÂ£o haveria nada de surpreendente nisso, nÃƒÂ£o fosse a idÃƒÂ©ia vertiginosa de transformar a engrenagem do moinho em uma mÃƒÂ¡quina capaz de produzir constantemente, sem necessidade de combustÃƒÂ­vel: o moto-perpÃƒÂ©tuo.\n\nObcecado pelo sonho de instalar em Kenoma a primeira mÃƒÂ¡quina auto-suficiente, Lineu converte sua existÃƒÂªncia numa infinita sucessÃƒÂ£o de tentativas e fracassos. Em sua luta quixotesca, Lineu nÃƒÂ£o investe apenas contra as leis da fÃƒÂ­sica- que frustam cada uma de suas tentativas -, mas tambÃƒÂ©m contra os anseios e artimanhas de GerÃƒÂ´nimo, dono do moinho e, consequentemente, principal opositor de sua invenÃƒÂ§ÃƒÂ£o.\nProprietÃƒÂ¡rio de terras, GerÃƒÂ´nino ÃƒÂ© a maior autoridade de Kenoma e uma espÃƒÂ©cie de benfeitor do povoado. PragmÃƒÂ¡tico, ele tambÃƒÂ©m vive em funÃƒÂ§ÃƒÂ£o de um ÃƒÂºnico ideal: fazer de Kenoma uma cidade prÃƒÂ³spera e moderna. Para GerÃƒÂ´nimo, a mÃƒÂ¡quina de Lineu representa a &quot;vergonha&quot; e o &quot;desperdÃƒÂ­cio&quot;; um empreendimento que apenas consome tempo e energia, sem nunca funcionar.\n\nNesse embate entre o divino e o terreno, o andarilho Jonas acaba aliando-se a Lineu, mais fascinado por sua forte determinaÃƒÂ§ÃƒÂ£o do que por sua obra. Enquanto cresce a cumplicidade entre lineu e Jonas, cresce tambÃƒÂ©m a dificuldade de Jonas em concretizar o seu amor por Tari.","torrent":{"xt":"urn:btih:69d71290793816114ec19dd92d8cf6f9fd2a7632","amp;dn":"Kenoma+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69d71290793816114ec19dd92d8cf6f9fd2a7632","infoHashBuffer":{"type":"Buffer","data":[105,215,18,144,121,56,22,17,78,193,157,217,45,140,246,249,253,42,118,50]},"announce":[],"urlList":[]}}