{"title":"Arizona Dream [1993] Emir Kusturica","uid":6198728,"size":977726747,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a59370ccf898a411012641efdfdb21b5e0d85d0&amp;dn=Arizona+Dream+%5B1993%5D+Emir+Kusturica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1298529426,"description":" &lt;a href=&quot;http://bayimg.com/NAEEOAADa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/NAEEOAADa&lt;/a&gt;\n\nArizona Dream (1993) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0106307/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0106307/&lt;/a&gt;\n\nRuntime 2hours 15 minutes\n\nArizona Dream is a 1993 film directed by Emir Kusturica and starring Johnny Depp, Jerry Lewis and Faye Dunaway.\n\n  Johnny Depp  ...  Axel Blackmar  \n  Jerry Lewis  ...  Leo Sweetie  \n  Faye Dunaway  ...  Elaine Stalker  \n  Lili Taylor  ...  Grace Stalker  \n  Vincent Gallo  ...  Paul Leger  \n  Paulina Porizkova  ...  Millie  \n  Michael J. Pollard  ...  Fabian  \n\n \nImagination is a gift. It bestows power, insight and the ability to dream. It takes courage to dream on a big scale, which is what Emir Kusturica does in Arizona Dream, a wonderfully absurdist comedy that opens today at the Castro. \n\nStarring Johnny Depp as a rootless orphan who wants to live in Alaska, Faye Dunaway as a horny widow who wishes she could fly like a bird and Jerry Lewis as a car dealer who wants to stack Cadillacs up to the moon, Arizona Dream is an inspired, erratic goulash that ignores standard movie- making formulas. \n\nShafted by Warner Bros., its original American distributor, and cut from 142 minutes to a flat two hours, ``Dream'' was test-marketed to poor results, and tossed into the huge dumping ground of home video. It had moderate success in Europe, but until recently, never played on U.S. screens. \n\nDirected by the Bosnian-born Kusturica, who made When Father Was Away on Business and won the top prize at Cannes for Underground, Arizona Dream fits perfectly with the body of work that Depp has created for himself. Like Benny and Joon, Edward Scissorhands, What's Eating Gilbert Grape and Don Juan DeMarco, it is the story of a bright, sensitive soul who doesn't see himself fitting into society, and isn't sure he wants to make the effort to try. \n\nIt's impossible to adequately describe the spirit of merry anarchy that Kusturica creates in Arizona Dream. It's as if the director and his co-writer, David Atkins, had chosen the perfect actors to bring their cracked vision to life, and then given them complete license to fly. \n\nLike several European directors before him, Kusturica is also enchanted with his vision of America as the last frontier for impossible dreams: a bizarre fantasia of big cars, tacky strip malls and crass commercialism -- a place unfiltered by the constraints of European tradition. \n\nThere's bound to be those who feel that Kusturica's film is a wild, exasperating, uncontainable mess. That's largely true, but it's a mess with enormous heart and tenderness. \n\n\n","torrent":{"xt":"urn:btih:6a59370ccf898a411012641efdfdb21b5e0d85d0","amp;dn":"Arizona+Dream+%5B1993%5D+Emir+Kusturica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a59370ccf898a411012641efdfdb21b5e0d85d0","infoHashBuffer":{"type":"Buffer","data":[106,89,55,12,207,137,138,65,16,18,100,30,253,253,178,27,94,13,133,208]},"announce":[],"urlList":[]}}