{"title":"[FSX] Simcheck A300B4 V2 [SP2]","uid":6195923,"size":215181456,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6a8368bbbb29a442417d8a149e3ff5d58aed1c95&amp;dn=%5BFSX%5D+Simcheck+A300B4+V2+%5BSP2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NvidiaPhysX","files":-1,"time":1298455258,"description":"following are the features of this updated bird (complete new bird and installation):\n\n\nSwitched from FSUIPC to SimConnect,  this will hopefully resolve some small issues\nWe added an extra lighting intensity to the VC, so now we will have dark - normal - storm. What used to be &quot;normal&quot; is now considered &quot;storm&quot;\nAdded a more elaborate algorythm for the brake cooling and reduced the warming sensitivity of the brakes. They will only warm up of the brake pressure is more than 50% of maximum pressure\nSmall fix to the INS code so it can read minimalistic flightplans in FSX format\nUpdated the &quot;aircraft.cfg&quot; with the correct fuel tank size, also update the Configurator so it also includes these numbers. Note that fuel tank size in FSX is based on gallons not lbs and in FSX fuel weight is relatively high so although the volume is correct the weight will be a bit too high.\nDisabled F1-F4 when the autothrottle is armed and in SPD or N1 mode\nDisabled mixture axis from joysticks\nChanged the whoop whoop sound logic for the trims, they will only sound when flaps are 8Ã‚Â° or more\nTrims will work faster when the flaps are down, this closer reflects the real situation\nWe have created a small add-on program that allows users to assign keyboard shortcuts to each of the buttons and settings in the autopilot and autothrottle. This will allow to connect external hardware to the SimCheck A300 to control the autopilot\nWe have changed the way the autopilot heading mode interacts with the FSX engine. This new way of working allows external programs like vasFMC or the SimuFly INS to control the heading of the aircraft\nWe have completely rewritten the engine indications during engine start-up so that the indicators show the correct values based on real life start-up sequence and no longer the incorrect sequence that FSX uses in reality. The start-up sequence now takes approximately 1 minute per engine instead of the default 32 seconds in FSX. Note that the start-up itself is what it is so we have no control over that unfortunately\nThe settings panel now contains an option to select lbs versus kg on the displays in the aircraft (weight indicator and fuel gauges)\nThere where some issues with the livery installer, these have been resolved\nWe have added an MSU for each of the INS units, alignment of the INS will be necessary although we will have the option to get automatic alignment. The INS will drift slighly, but as we wil not have VOR updating the drift will be limited\n&quot;Airline options&quot; where added to the Settings dialog, with 2 options available: \n-&gt; The VSPD selector will follow the current vertical speed except when VSPD mode is active\n-&gt; The autothrottle SPD mode will automatically engage when ALT ACQ turns green and when the autothrottle is armed\nA repetitive warning sound was added when cabin altitude is too high or cabin pressure is too high\nLow and all speed ailerons have been switched in the external model\nEngine reverser animation is all or nothing instead of percentage reverser set\nLeft/Right mouse clicks are enabled in the VC for multi-position switches and rotary knobs\nAvionics ventilation sound updated with newly recorded sound\nAdd right runway turnoff light to external model\nMake the F/E panel completely 3D in the VC. Based on our test results we'll see if we implement this, if the effect on framerates is too big we will not include this\nAPU standby light goes on when APU is spooling down, flap light goes on while APU inlet flap is in transit\nLLZ tracking is enhanced, even in heavy crosswind situations.\n","torrent":{"xt":"urn:btih:6a8368bbbb29a442417d8a149e3ff5d58aed1c95","amp;dn":"%5BFSX%5D+Simcheck+A300B4+V2+%5BSP2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a8368bbbb29a442417d8a149e3ff5d58aed1c95","infoHashBuffer":{"type":"Buffer","data":[106,131,104,187,187,41,164,66,65,125,138,20,158,63,245,213,138,237,28,149]},"announce":[],"urlList":[]}}