{"title":"Kid Rock - Rebel Soul (2012) [FLAC] vtwin88cube","uid":7938764,"size":443723688,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ba70288a14a7ced1aa176886634e6bd2b7ec197&amp;dn=+Kid+Rock+-+Rebel+Soul+%282012%29+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1355929573,"description":"\n\n\nKid Rock\nRebel Soul (2012)\n\n\n\n\n\nOne of the unlikeliest success stories in rock at the turn of the millennium, Detroit rap-rocker Kid Rock shot to superstardom with his fourth full-length album, 1998's Devil Without a Cause. What made it so shocking was that Rock had recorded his first demo a full decade before, been booted off major label Jive following his Beastie Boys-ish 1990 debut, Grits Sandwiches for Breakfast, and toiled for most of the decade in obscurity, releasing albums to a small, devoted, mostly local fan base while earning his fair share of ridicule around his home state. Nevertheless, Rock persevered, and by the time rap-metal had begun to attract a substantial audience, he had perfected the outlandish, over the top white-trash persona that gave Devil Without a Cause such a distinctive personality and made it such an infectious party record. Bob &quot;Kid Rock&quot; Ritchie (born Robert James Ritchie, January 17, 1971) grew up in Romeo, Michigan, a small rural town north of the Detroit metro area. Finding small-town life stiflingly dull, Ritchie immersed himself in rap music, learned to breakdance, and began making the talent-show rounds in Detroit. Inspired by the Beastie Boys' Licensed to Ill -- white performers fusing rap and hard guitar rock -- Kid Rock recorded his first demos in 1988, and eventually scored an opening slot at a Boogie Down Productions gig. That performance, in turn, led to a contract with Jive Records, which issued Kid Rock's debut album, Grits Sandwiches for Breakfast, in 1990. Produced by Kid Rock, Too Short, and D-Nice, the album was heavily derivative of Licensed to Ill. Rock briefly became notorious when a New York college radio station aired the album's profanity-laced ode to oral sex, &quot;Yodelin' in the Valley,&quot; and was fined over $20,000 (a judgment later rescinded). However, despite a tour with Too Short and Ice Cube, Jive didn't see much of a future for Kid Rock and dropped him from their roster. \n\n\n\nFormat:\t\t\tFLAC Lossless\nLabel:\t\t\tAtlantic\nCatalog:\t\t7567-87622-5\nAudiochecker:\t\t99.79% CDDA\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\n01.Chickens In The Pen\n02.Let's Ride\n03.Catt Boogie\n04.Detroit, Michigan\n05.Rebel Soul\n06.God Save Rock 'N' Roll\n07.Happy New Year\n08.Celebrate\n09.The Mirror\n10.Mr. Rock 'N' Roll\n11.Cucci Galore\n12.Redneck Paradise\n13.Cocaine And Gin\n14.Midnight Ferry\n\n\n\n\n\n\n\n\n\n                            ****Thanks For Seeding!****\n                                     \n                                   ***Enjoy!***\n\n\n","torrent":{"xt":"urn:btih:6ba70288a14a7ced1aa176886634e6bd2b7ec197","amp;dn":"+Kid+Rock+-+Rebel+Soul+%282012%29+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba70288a14a7ced1aa176886634e6bd2b7ec197","infoHashBuffer":{"type":"Buffer","data":[107,167,2,136,161,74,124,237,26,161,118,136,102,52,230,189,43,126,193,151]},"announce":[],"urlList":[]}}