{"title":"Earope Advanced Ear Training v1.65","uid":3605193,"size":1846685,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6c3e4f1f9311ef48d137303222a6b4098cee95ad&amp;dn=Earope+Advanced+Ear+Training+v1.65&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Phatbone","files":1,"time":1169977740,"description":"Earope 1.65 Advanced Ear Training Software\n\nEar Training Software Earope is a complete and advanced ear training software system for beginners and professionals alike. Unique features like the EarTutor? and the &quot;few-click&quot; interface makes it easy to get started right away.\n\nEarope will give you a lot of extra confidence and make it easy to communicate music to others, play by ear, transcribe a tune when you hear it, compose music, improvise and read music and much more.\n\nEarope was developed for musicians, by musicians. It is a full-featured profesionally developed ear training software package aimed at anyone spending time with learning, practicing or teaching music.\n\nEarope lets you use the free-form practice or you can let EarTutor? improve your ear for you!\n\nThis ear training software Available in several languages including English, Spanish, Russian, Dutch, Swedish, Danish and more to come.\n\nEarope was designed with the requirements at different advanced musical studies as focal point. It can be tailored to almost any need.\n\nIntervals, Scales, Chords, Inversions, Melody, Rhythm, Chord Progressions and more!\nThe beginner at music school level will enjoy the ease of the user interface and even the most advanced ear training &quot;freaks&quot; are guaranteed a challenge thru the program&amp;#039;s flexibility. Use it for fun or on your quest for a perfect pitch!\n\nIn the design of Earope, the relevance and musicality of the problems has been emphasized, both in the selection of problems and in the construction and playback of the problems. It actually sounds good!\n\nAnother feature invented for Earope Ear Training is the option to activate the build-in EarTutor?, which acts as your personal tutor, and gradually increases the level of skill based on previous results and errors.\n\n\nSystem Requirements:\nEarope Ear Training is available for Win 98, Me, NT, 2000 XP/SP2\nIntel Pentium CPU 300MHz or higher\n64 MB RAM\n100 MB free hard disk space. VGA with 800x600, 256 colors minimum\n","torrent":{"xt":"urn:btih:6c3e4f1f9311ef48d137303222a6b4098cee95ad","amp;dn":"Earope+Advanced+Ear+Training+v1.65","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c3e4f1f9311ef48d137303222a6b4098cee95ad","infoHashBuffer":{"type":"Buffer","data":[108,62,79,31,147,17,239,72,209,55,48,50,34,166,180,9,140,238,149,173]},"announce":[],"urlList":[]}}