{"title":"Asset Manager 2012 Enterprise Edition V1.0.1141.0 with Key [iahq","uid":7732665,"size":14204504,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6cca6a51df4db6eab82434249e4a855b60db4d58&amp;dn=Asset+Manager+2012+Enterprise+Edition+V1.0.1141.0+with+Key+%5Biahq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"TorDigger","files":3,"time":1350382451,"description":"Asset Manager\n\n\nYou can't afford the wasted time, effort, and cost of searching for and replacing lost or missing assets. With Asset Manager, you can track the assets you have, where they are, how much they cost, and more. You can use existing barcodes or create your own to check in and check out tools and equipment to employees. Asset Manager takes only a few minutes to download and install.\n\nCheck in and check out assets\nWith Asset Manager, you can check out computers and equipment to employees and always know who to call when you need an item returned. Set a due date during the check out process, and then run reports to find the overdue assets.\n\nTrack the fixed assets in your business\nWhether you need help keeping track of where your assets are, or if you simply need a better accounting of what you have and how much it's worth, Asset Manager can track it all. Attach owner's manuals, pictures, notes and more to your service records, then look them up again in one place whenever you need.\n\nTrack service, vendors, and contacts\nWhen servicing an item, track the service instructions, tips and tricks, vendors, and contacts in your database. If the item needs to be serviced again, you'll have all the information you need right at your fingertips. Find the items quickly using a barcode scanner or a quick search.\n\nAsset Manager Features\n\nTrack an unlimited number of assets.\nAttach pictures, owner's manuals, and other files easily.\nPrint barcodes for your assets, or use existing barcodes to identify your assets.\nCheck items out to employees, and maintain a full history of ownership.\nPrint and save asset reports in a variety of formats.\nPerform a fixed asset stocktake.\nTrack related vendors and contacts.\n\nSupported OS:\n\ncompatible with Windows 98, ME, NT, 2000, XP, 2003, Vista, and 7\n\nHomepage: http://www.kzsoftware.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given key to register application.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:6cca6a51df4db6eab82434249e4a855b60db4d58","amp;dn":"Asset+Manager+2012+Enterprise+Edition+V1.0.1141.0+with+Key+%5Biahq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cca6a51df4db6eab82434249e4a855b60db4d58","infoHashBuffer":{"type":"Buffer","data":[108,202,106,81,223,77,182,234,184,36,52,36,158,74,133,91,96,219,77,88]},"announce":[],"urlList":[]}}