{"title":"Pat Boone - The Fifties Collection CD 2 of 6 [1997/192kbps]","uid":3349711,"size":113543999,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d3b3e6f43683be74905ad8e954bc68e2376284f&amp;dn=Pat+Boone+-+The+Fifties+Collection+CD+2+of+6+%5B1997%2F192kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"metro20","files":31,"time":1119982415,"description":"A short while later Pat was signed to the Dot label, one that he would stay with throughout his run on the charts from 1955 to 1962. His first top forty song was Two Hearts, a cover of an R&amp;B hit for the Charms which went to number sixteen for Pat in 1955. It was common at the time for white artists to cover R&amp;B hits, and more often than not the disc jockeys would play the cover version. Pat Boone had a smooth style, a clean-cut image, and of course, his white bucks. His next offering was a cover of Fats Domino's Ain't That A Shame, a song that propelled both Fats and Pat to stardom. Both versions entered the charts in July, 1955 with the former's going to number ten, and Pat Boone's version going all the way to number one. He followed with another cover of a song from a black artist, this time the El Dorados' At My Front Door [Crazy Little Mama], which quickly became his second record to reach the top ten. \nPat Boone was doing good R&amp;B songs, and doing them in his own smooth style, which was quite different from the way they had been done originally. Some found it laughable, but the formula worked and the records sold well. He took on Little Richard, recording Tutti Frutti and Long Tall Sally, both of which he made into big hits. He was successful with the Five Keys' Gee Whittakers! and Ivory Joe Hunter's I Almost Lost My Mind, the latter of which in 1956 became Boone's second number one hit. He covered Joe Turner's Chains Of Love, and had another number one with Don't Forbid Me.","torrent":{"xt":"urn:btih:6d3b3e6f43683be74905ad8e954bc68e2376284f","amp;dn":"Pat+Boone+-+The+Fifties+Collection+CD+2+of+6+%5B1997%2F192kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d3b3e6f43683be74905ad8e954bc68e2376284f","infoHashBuffer":{"type":"Buffer","data":[109,59,62,111,67,104,59,231,73,5,173,142,149,75,198,142,35,118,40,79]},"announce":[],"urlList":[]}}