{"title":"Manic Street Preachers - Rewind the Film (2013) [FLAC]","uid":8980414,"size":311777377,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6db7946b79dd614c1bca1b215138e8c2621c6b78&amp;dn=Manic+Street+Preachers+-+Rewind+the+Film+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1380551857,"description":"\n  Manic Street Preachers - Rewind the Film (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Brit-Pop, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 This Sullen Welsh Heart\n  02 Show Me the Wonder\n  03 Rewind the Film\n  04 Builder of Routines\n  05 4 Lonely Roads\n  06 (I Miss the) Tokyo Skyline\n  07 Anthem for a Lost Cause\n  08 As Holy as the Soil (that Buries Your Skin)\n  09 3 Ways to See Despair\n  10 Running Out of Fantasy\n  11 Manorbier\n  12 30-Year War\n\n  It's hard not to view the title of Rewind the Film as a conscious allusion to how the Manic Street Preachers are pursuing their career in the second decade of the new millennium. Journal for Plague Lovers, the Steve Albini-recorded collection of new songs set to abandoned Richey Edwards lyrics, functioned as ground zero, the new Holy Bible from which they moved forward, first with Postcards from a Young Man, the companion piece to Everything Must Go, and now to Rewind the Film, a corollary to the melodramatic MOR of This Is My Truth, Tell Me Yours. As with Postcards, the comparisons between Rewind the Film and its predecessor don't scan cleanly. Now in their third decade as a band, the Manics certainly are comfortable with mellow theatrics, perhaps even more than they were when they were channeling Queen on This Is My Truth, but they're also keen to pursue gentlemanly adventures, threading a strong British folk undercurrent into their 11th album and sometimes taking the time to punctuate proceedings with a bracing bit of brass. Despite these subdued flourishes, contemplation is the order of the day here, Rewind the Film achieving an appealingly woozy, early-hours-of-the morning vibe, thanks in part to canny cameos from Richard Hawley, Lucy Rose, and Cate Le Bon, kindred spirits who can find the comfort in misery. Occasionally, Nicky Wire's lyrics drift back toward free-floating angst -- &quot;my ecosystem is based on hatred&quot; is a line that feels perpetually adolescent -- but the combined effect of the sometimes tortured words and the gentle, never-conflicting currents of folk, anthemic rock, cinematic instrumentals, and mannered pop create a welcome impression of a group that acknowledges that they've entered a comfortable middle age but are happy to fight against complacency however they can.","torrent":{"xt":"urn:btih:6db7946b79dd614c1bca1b215138e8c2621c6b78","amp;dn":"Manic+Street+Preachers+-+Rewind+the+Film+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6db7946b79dd614c1bca1b215138e8c2621c6b78","infoHashBuffer":{"type":"Buffer","data":[109,183,148,107,121,221,97,76,27,202,27,33,81,56,232,194,98,28,107,120]},"announce":[],"urlList":[]}}