{"title":"Herbert Read - To Hell with Culture.pdf","uid":6813130,"size":6141314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6dd71a6f6591b6a3435a5f9abd564b33f423c2a4&amp;dn=Herbert+Read+-+To+Hell+with+Culture.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dogbearmonkey","files":1,"time":1321059383,"description":"Herbert Read was a maverick character in the cultural life of the twentieth century. A radical leader of the avant garde in the 1930s, and an anarchist revolutionary during the war years, by the time of his death in 1968 he had become a key figure at the heart of the British cultural establishment. To Hell with Culture offers readers an ideal overview of the ideas that marked out this seminal and hugely influential thinker. It is a controversial work that engages the reader in a wide range of topics, from revolutionary art to pornography.\n\n\nAdept at challenging assumptions and penetrating to the heart of any issue, Read's deft prose encourages the reader to think critically, to question and to subvert the voice of authority, of whatever political or cultural creed. Only through such a critical evaluation of culture, Read believes, can one appreciate the art that arises from the 'unpolitical manifestation of the human spirit'. At a time when authority and value are questionable terms, and when culture itself is a contested concept, Read's is both a challenging and an enlightening voice. ","torrent":{"xt":"urn:btih:6dd71a6f6591b6a3435a5f9abd564b33f423c2a4","amp;dn":"Herbert+Read+-+To+Hell+with+Culture.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd71a6f6591b6a3435a5f9abd564b33f423c2a4","infoHashBuffer":{"type":"Buffer","data":[109,215,26,111,101,145,182,163,67,90,95,154,189,86,75,51,244,35,194,164]},"announce":[],"urlList":[]}}