{"title":"Creative Photoshop CS4- Digital Illustration and Art Techniques ","uid":5491661,"size":69329352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6eda37a4eddcfe2bf0da08d0963a88ba5b0c76bf&amp;dn=Creative+Photoshop+CS4-+Digital+Illustration+and+Art+Techniques+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1271061479,"description":"Creative Photoshop CS4: Digital Illustration and Art Techniques\n\n\nFocal Press | April 7, 2009 | English | ISBN: 024052134X | PDF | 436 Pages | 66,1 Mb\n\n\n\n\nA truly unique guide to the creative side of Photoshop showcasing phenomenal artwork by one of the world`s best.\n\n\n\nIf you are a digital artist, illustrator, cartoonist, graphic artist, designer, or serious hobbyist looking for new and interesting ways to use Photoshop, this is the book for you! You already know how to use Photoshop as an image editing tool; now, challenge yourself and discover the more artistic aspects of the program with one of the world's best teachers by your side.\n\n\n\nIn addition to four brand new chapters on real world projects, this new edition of award-winning digital artist Derek Lea's bestselling Creative Photoshop contains several brand new features such as &quot;What you'll learn in this chapter&quot; summaries, so you can quickly find projects using the specific tools you'd like to focus on, and supplementary information at the end of each chapter, containing useful resources and additional gallery images to provide further study and inspiration. \n\n\n\nAs you work through Derek's fantastic artistic methods, be sure to visit www.creativephotoshopthebook.com for more information, including the project files for each chapter, available for download for you to work with, a reader forum, and more.\n\n\n\n*Stunning images from award winning digital artist Derek Lea inspire you to push your own creativity further than you even thought possible\n\n\n*Compatible with previous versions of Photoshop\n\n\n*Explore Photoshop from an entirely unique perspective as you learn how to create graffiti, antique effects, stencil art, and so much more\n\n\n*Fully updated throughout for CS4, plus four brand new chapters on real world projects that combine traditional art methods with Photoshop to create tactile images \n\n\n\n","torrent":{"xt":"urn:btih:6eda37a4eddcfe2bf0da08d0963a88ba5b0c76bf","amp;dn":"Creative+Photoshop+CS4-+Digital+Illustration+and+Art+Techniques+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eda37a4eddcfe2bf0da08d0963a88ba5b0c76bf","infoHashBuffer":{"type":"Buffer","data":[110,218,55,164,237,220,254,43,240,218,8,208,150,58,136,186,91,12,118,191]},"announce":[],"urlList":[]}}