{"title":"Black &amp; Decker The Complete Guide to Finishing Basements","uid":10408122,"size":69155507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f6c0664d0deb96b3fa66f9f9ec2be3b9d76aadf&amp;dn=Black+%26amp%3B+Decker+The+Complete+Guide+to+Finishing+Basements&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":1,"time":1403489905,"description":"\nBlack &amp; Decker The Complete Guide to Finishing Basements: Projects and Practical Solutions for Converting Basements into Livable Space by Black &amp; Decker\n\n\nA fact-filled, 240-page manual that covers every aspect of designing and planning a basement conversion/remodeling project. With more than 600 color photographs, this book goes into thorough detail on crucial subjects like moisture and climate control, egress, ventilation, lighting, and many other issues. \n\nIt deals comprehensively with adapting home mechanical systems to basement conditions. The many featured projects include finishing a bathroom stub-out, installing an all-new basement bathroom, insulating, repairing foundation walls, installing sump pumps, dehumidification strategies, as well as many other projects designed for livability. \n\nA special focus new to this edition presents information and projects for aging in place, including home elevators and chair lifts, monitoring and communication systems, and creating an accessible basement apartment. You will also find projects that show how to upgrade with luxury amenities, including a fireplace, sauna, home spa, exercise room, basement club/lounge and more.\n\nGenre: Non-Fiction / General | DIY","torrent":{"xt":"urn:btih:6f6c0664d0deb96b3fa66f9f9ec2be3b9d76aadf","amp;dn":"Black+%26amp%3B+Decker+The+Complete+Guide+to+Finishing+Basements","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6c0664d0deb96b3fa66f9f9ec2be3b9d76aadf","infoHashBuffer":{"type":"Buffer","data":[111,108,6,100,208,222,185,107,63,166,111,159,158,194,190,59,157,118,170,223]},"announce":[],"urlList":[]}}