{"title":"ADOBE PHOTOSHOP PLUGINS [thethingy] ","uid":6079939,"size":406543195,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6fef0466939e9464e380eb445c3f63eb8116db06&amp;dn=ADOBE+PHOTOSHOP+PLUGINS+%5Bthethingy%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"thethingy","files":-1,"time":1294072348,"description":"AKVIS Plugins Collection Multilingual for Photoshop\n\nSoftware for processing graphics and digital images - retouching, painting, restoration. Retoucher-program for photo restoration and photo retouching. The program will help remove scratches, spots, dust, stains and other defects to remove unnecessary details, the text, to reconstruct missing parts of pictures, delay holey space and increase the ragged edge.\n\nAKVIS Chameleon-program to create collages, realistic and fantastic.\nChameleon saves time and effort, so it does not require precise selection of objects automatically smooths the boundary and matches the color scheme &quot;insert&quot; to the background color.\nAKVIS MultiBrish-brush set for image editing.\nThe program allows you to fix her chosen field of photography without much effort: to change the color saturation and sharpness, smudge object, tinted area, restore and conceal, remove unwanted objects and create an artistic collage.\n\nAKVIS Enhancer-program for processing photos with increased image detail.\nEnhancer improves the texture, emphasizes the details, pulling them out of the illuminated and shaded areas. The program supports HDR.\n\nAKVIS Refocuspomogaet sharpen fuzzy, blurry, blurred images. With this program you can fix the whole image, or to edit only a specific area to focus on some details, like eyes, using the technique selective focus.\n\nProgram for coloring black and white photos and replacing colours on colour images.\nColoriageprost and understood as a child's colouring book, he turns the work into the game. A few dashes indicate sites for repainting. The program recognizes the borders, impose a specified colour, given the lighting, the play of shadows, folds in clothing.\n\nNoise Buster - a program to suppress the digital noise.\nThe program removes digital camera noise matrix and the noise that appear when you scan a photograph and reduces graininess and eliminates non-uniform colour stain on the image, while maintaining detail and sharpness of the boundaries.\n\nAKVIS Sketch-a tool for turning photos into the picture.\nSketch turns a photo into a work of art, converts the images into sketches in pencil, charcoal, watercolour, simulating manual work of this artist. With this program you can get not just black and white sketch, but a colour picture.\n\nAKVIS Decoratorpozvolyaet to modify the surface of the object.\nWhen applying the texture stored volume, shape, bends, folds, shadows of the original image. Using the Decorator can not just impose the texture, change it, but to load their textures, and simply change the colour of an object.\n\nAKVIS LightShop adds light effects to the image.\nWith this program you can create any type and form of light, add a photo beams, halos, flashes, lightning, reflections on the objects, sunset or fireworks. LightShop decorate picture enliven landscape, change the time of day and weather.\n\nAKVIS ArtSuite - a program for processing photos.\n18 kinds of effects and frames, and more than 500 samples! ArtSuite can make an image, create an original greeting card, a holiday album, a poster or calendar, to turn a colour photo into a modern stylized black and white portrait, and even make color correction.\n\nAKVIS SmartMask - Plugin for quick selection (cut) of the image.\nSmartMaskpozvolyaet quickly and accurately allocate part of the picture or cut the figure of a man from a photo using relatively simple manipulation. The plugin is used to remove the background, creating collages.\n\nMagnifierpozvolyaet resize images without losing quality.\nYou can not only reduce the image to put it on the Web or send to friends. The program allows you to receive the highest quality images from a small picture. Magnifier provides a manifold increase in the image without the artifacts and ghosting.\n\nAKVIS ArtWork allows you to create a digital photo realistic painting, as if written by the artist. The program simulates an oil painting, imposes strokes so that the image looks like a work of art! It is possible to choose the type of canvas, add text to the design on the finished canvas.\n\nAKVIS NatureArt - a collection of unique effects that simulate natural phenomena. The program allows you to add a photo rain, snow, lightning, sun and clouds change the weather, prevnesti a dramatic image, change the mood of the scene, a seascape or a picture of night sky.\n\nVirus Total report for patch;\n &lt;a href=&quot;\nhttp://www.virustotal.com/file-scan/report.html?id=c242edabbfe84cdbd2d0249e03f11f8771d91b70dcb3ffebca71746149113cea-1294067910&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/file-scan/report.html?id=c242edabbfe84cdbd2d0249e03f11f8771d91b70dcb3ffebca71746149113cea-1294067910&lt;/a&gt;\n\nPhotoshop CS5 Extended;                    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5628169&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5628169&lt;/a&gt;\n\nPhotoshop CS5 Extended in eLearning Suite;                    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5702621&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5702621&lt;/a&gt;\n\nPhotoshop CS5 Extended in Technical Communication Suite;                    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5699267&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5699267&lt;/a&gt;\n\nPhotoshop CS5 Extended in CS5 Production Premium;                    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5649900&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5649900&lt;/a&gt;\n\nPhotoshop CS5 Extended in CS5 Design Premium;                    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5529111&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5529111&lt;/a&gt;\n\nPhotoshop CS5 in Acrobat X Suite;               &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5993999&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5993999&lt;/a&gt;\n\nAdobe Photoshop CS5 Extended in Adobe Creative Suite 5 Web Premium;              &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6013660&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6013660&lt;/a&gt;\n\nPhotoshop Lightroom;                  &lt;a href=&quot;\nhttp://thepiratebay.se/search/adobe%20photoshop%20lightroom%20%5Bthethingy%5D/0/99/300&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/search/adobe%20photoshop%20lightroom%20%5Bthethingy%5D/0/99/300&lt;/a&gt;\n\nPhotoshop Elements;                    &lt;a href=&quot;\nhttp://thepiratebay.se/search/adobe%20photoshop%20elements%20%5Bthethingy%5D%5D/0/99/300&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/search/adobe%20photoshop%20elements%20%5Bthethingy%5D%5D/0/99/300&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:6fef0466939e9464e380eb445c3f63eb8116db06","amp;dn":"ADOBE+PHOTOSHOP+PLUGINS+%5Bthethingy%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fef0466939e9464e380eb445c3f63eb8116db06","infoHashBuffer":{"type":"Buffer","data":[111,239,4,102,147,158,148,100,227,128,235,68,92,63,99,235,129,22,219,6]},"announce":[],"urlList":[]}}