{"title":"Inside.The.Factory.s02e03.Baked.Beans.EN.SUB.x264.WEBRIP.MPup","uid":15529163,"size":1056398423,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:702a99846adae101d09e1b3e03885f375bae2a7d&amp;dn=Inside.The.Factory.s02e03.Baked.Beans.EN.SUB.x264.WEBRIP.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"makinapufterpup","files":2,"time":1470809489,"description":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e03.Baked.Beans.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nGregg Wallace helps to unload 27 tonnes of dried haricot beans from North America and follows them on a one and a half mile journey through the largest baked bean factory in the world, which makes more than three million cans of beans every 24 hours. Gregg discovers how a laser scrutinizes every single bean, how the spice recipe for the sauce is a classified secret known only by two people, and, most surprisingly, how the beans are cooked in the can in a room of giant pressure cookers - not baked at all!\r\n\r\nMeanwhile, Cherry Healey follows the journey of her discarded baked bean can through a recycling centre and on to the largest steelworks in the UK, where she watches a dramatic, fiery process that produces 320 tonnes of molten steel - enough to make eight million cans. She also takes a can that is 14 months after its best before date to a lab at the University of Coventry and is amazed when tests reveal it has the same Vitamin C levels compared to fresh tomatoes. The lab also prove that a 45-year-old tin of Skippers is still fit to eat.\r\n\r\nAnd historian Ruth Goodman reveals that in the early 19th century, malnutrition killed more than half of all British seamen, and how tinned food was invented to improve their nutrition and prevent them developing scurvy on their long voyages at sea. Ruth also relates how Henry Heinz first marketed baked beans in the UK in the early 1900s and made them a family favourite. Today, we get through more than two million cans of them every day","torrent":{"xt":"urn:btih:702a99846adae101d09e1b3e03885f375bae2a7d","amp;dn":"Inside.The.Factory.s02e03.Baked.Beans.EN.SUB.x264.WEBRIP.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702a99846adae101d09e1b3e03885f375bae2a7d","infoHashBuffer":{"type":"Buffer","data":[112,42,153,132,106,218,225,1,208,158,27,62,3,136,95,55,91,174,42,125]},"announce":[],"urlList":[]}}