{"title":"A - Hi-Fi Serious","uid":4207056,"size":65977787,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:702fecc8777c736ef6be89ca793773de64022c90&amp;dn=A+-+Hi-Fi+Serious&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"billy_stretcher","files":16,"time":1211853500,"description":"A\nHi-Fi Serious\nAlternative/Britrock\n2002\n192Kbps\n\n1.Nothing \n2.Something&amp;#039;s Going On \n3.Six O&amp;#039;clock On A Tube Stop \n4.Going Down \n5.Took It Away \n6.Starbucks \n7.Springs \n8.Shut Yer Face \n9.Pacific Ocean Blue \n10.Distance \n11.WDYCAI \n12.Hi Fi Serious\n\nFront, Back And CD Covers Included. \n\nUndoubtably the best kept secret in the world of pop-punk, nu-metal, rock, call-it-what-you-will, A - Jason Perry (vocals), Mark Chapman (guitar), Dan Carter (bass) Adam Perry (drums) Giles Perry (keyboards) - look set to finally break into the consciousness of the mainstream with the release of their finest work yet. A mixture of punk attitude and Britpop-influenced guitar rock, &amp;#039;Hi-Fi Serious&amp;#039; is a feast of crunching riffs, electronic dynamics and super infectious melodies that plants the band firmly between the liquid songcraft of Feeder and the ballsy dynamics of Pitchshifter. Produced by Al Clay (Feeder, Pixies, Therapy?), if this doesn&amp;#039;t make you want to smash up your parents&amp;#039; house, then you are either stupid, dead or both! Play it until your ears bleed - and then some...Includes the singles &amp;#039;Nothing&amp;#039;, &amp;#039;Starbucks&amp;#039; and &amp;#039;Something&amp;#039;s Going On&amp;#039;.\n\nAs Hi-Fi Serious so ably demonstrates, sometimes it&amp;#039;s just a matter of waiting for the rest of the world to catch up with you. Round about the time of their second album Monkey Kong, A were pegged as perfunctory Brit-rock chancers, a poor substitute for their angst-heavy Stateside peers. Come their third album, though, A sound every bit the globe-straddling international rock band. Marking out the crucial mid-point between the impassioned emo-pop of Jimmy Eat World and the dumb-assed gross-out punk splatter of Blink 182, Hi-Fi Serious is a cackling, cartoonish descent into fearlessly tuneful power-pop larkery. It&amp;#039;s saturated in an obvious love for beach-bum Americana: &quot;It&amp;#039;s an endless summer/It&amp;#039;s the summer forever&quot; breezes the bronzed power-punk of &quot;Pacific Ocean Blue&quot;. And while the five are frighteningly eager to dally like playful puppies through all rock&amp;#039;s cheesiest cliches--just check out guitarist Mark Chapman&amp;#039;s Eddie Van Halen-style fretwork on &quot;The Distance&quot;--it&amp;#039;s always performed with enough charm to win the day. Think the Brits can&amp;#039;t do rock? Crank up Hi-Fi Serious and let A put a smile back on your face.\n\n&amp;#039;This is f**king ace&amp;#039; - Kerrang! \n\nEnjoy! :)","torrent":{"xt":"urn:btih:702fecc8777c736ef6be89ca793773de64022c90","amp;dn":"A+-+Hi-Fi+Serious","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"702fecc8777c736ef6be89ca793773de64022c90","infoHashBuffer":{"type":"Buffer","data":[112,47,236,200,119,124,115,110,246,190,137,202,121,55,115,222,100,2,44,144]},"announce":[],"urlList":[]}}