{"title":"Van Morrison - Astral Weeks (1968) 2013 HDtracks  24-192-FLAC","uid":11058126,"size":1822220267,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7031798a593750e7090e09b5eb2ab281abf66b8d&amp;dn=Van+Morrison+-+Astral+Weeks+%281968%29+2013+HDtracks++24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hal4000","files":-1,"time":1411139515,"description":"Van Morrison, (born George Ivan Morrison; 31 August 1945) is a Northern Irish singer-songwriter and musician. His live performances at their best are described as mystical and transcendental, while some of his recordings, such as the studio albums Astral Weeks and Moondance and the live album It's Too Late to Stop Now, are critically acclaimed and appear at the top of many greatest album lists.\n\nKnown as &quot;Van the Man&quot; to his fans, Morrison started his professional career when, as a teenager in the late 1950s, he played a variety of instruments including guitar, harmonica, keyboards and saxophone for various Irish showbands covering the popular hits of the day. He rose to prominence in the mid-1960s as the lead singer of the Northern Irish R&amp;B band Them, with whom he recorded the garage band classic &quot;Gloria&quot;. His solo career began under the pop-hit oriented guidance of Bert Berns with the release of the hit single &quot;Brown Eyed Girl&quot; in 1967. After Berns' death, Warner Bros. Records bought out his contract and allowed him three sessions to record Astral Weeks in 1968. Even though this album would gradually garner high praise, it was initially poorly received; however, the next one, Moondance, established Morrison as a major artist, and throughout the 1970s he built on his reputation with a series of critically acclaimed albums and live performances. Morrison continues to record and tour, producing albums and live performances that sell well and are generally warmly received, sometimes collaborating with other artists, such as Georgie Fame and The Chieftains. In 2008 he performed Astral Weeks live for the first time since 1968.\n\nAstral Weeks is generally considered one of the best albums in pop music history. For all that renown, Astral Weeks is anything but an archetypal rock &amp; roll album: in fact, it isn't a rock &amp; roll album at all. Employing a mixture of folk, blues, jazz, and classical music, Van Morrison spins out a series of extended ruminations on his Belfast upbringing, including the remarkable character &quot;Madame George&quot; and the climactic epiphany experienced on &quot;Cyprus Avenue.&quot; Accompanying himself on acoustic guitar, Morrison sings in his elastic, bluesy voice, accompanied by a jazz rhythm section (Jay Berliner, guitar, Richard Davis, bass, Connie Kay, drums), plus reeds (John Payne) and vibes (Warren Smith, Jr.), with a string quartet overdubbed. An emotional outpouring cast in delicate musical structures, Astral Weeks has a unique musical power. Unlike any record before or since, it nevertheless encompasses the passion and tenderness that have always mixed in the best postwar popular music, easily justifying the critics' raves.\n\nHDTracks PCM-24Bit-192Khz.","torrent":{"xt":"urn:btih:7031798a593750e7090e09b5eb2ab281abf66b8d","amp;dn":"Van+Morrison+-+Astral+Weeks+%281968%29+2013+HDtracks++24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7031798a593750e7090e09b5eb2ab281abf66b8d","infoHashBuffer":{"type":"Buffer","data":[112,49,121,138,89,55,80,231,9,14,9,181,235,42,178,129,171,246,107,141]},"announce":[],"urlList":[]}}