{"title":"Merle Haggard - Down Every Road Box Set (1996) [FLAC]","uid":10807740,"size":1712814012,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:706eeccc2d9efe59d8308959906c602631821e0a&amp;dn=Merle+Haggard+-+Down+Every+Road+Box+Set+%281996%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Bil6969","files":142,"time":1408394796,"description":" Review by Stephen Thomas Erlewine  [-]\n\nIt may be hard to believe, but it's true: Legacy's four-disc 2006 box Nashville Rebel is the first comprehensive, multi-label Waylon Jennings retrospective ever assembled. During the peak of the CD box set reissue boom of the late '80s/early '90s, Waylon did receive a quasi-box in the form of 1993's Only Daddy That'll Walk the Line: The RCA Years, an excellent double-disc set that was housed in a box yet fell short of being a true box set. Starting in the late '90s, his catalog began to be overhauled -- Buddha reissued classic individual albums like Honky Tonk Heroes, Bear Family put out two huge box sets that chronicled all of his RCA work up until 1973, then the rest of his '70s work came out as two-fers overseas, while Hip-O assembled a collection of both his earliest recordings and his '80s work for MCA -- but he still lacked a set that covered his whole career, from 1958 through 1995. That's exactly what Nashville Rebel does, and it does so in superb fashion. Any career with as much great work as Waylon's is inevitably hard to condense, even at the length of a four-disc set with 92 tracks, but Nashville Rebel does the job right, providing an accurate, compelling narrative of Jennings' career, while offering all of his biggest hits along with sharply chosen lesser-known songs and rarities that help complete the picture. Any hardcore fan might find favorite songs missing, but nobody can complain about what's here -- and that applies not only to the first three discs, which trace the prime of Waylon's career, but even the fourth, which is the rare final CD on a multi-disc set that is solid, perhaps not as gripping or timeless as the music that precedes it, but it does present a convincing case that Waylon continued to make strong music right up until the later stages of his career. And this is how Nashville Rebel is like those classic box sets of the late '80s and early '90s: there is no fluff, no needlessly chosen rarities; it simply and cleanly gives the listener the essential items from a truly great artist. There is plenty of other great music within Waylon's catalog, but if this is all somebody heard from him, they would know exactly who he was and what he meant musically. That's the goal of all lavish box sets such as this, and this is one of the few that truly achieves that goal. It's an essential item, not just for country fans, but for anybody who cares about American music of the 20th century.\n","torrent":{"xt":"urn:btih:706eeccc2d9efe59d8308959906c602631821e0a","amp;dn":"Merle+Haggard+-+Down+Every+Road+Box+Set+%281996%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"706eeccc2d9efe59d8308959906c602631821e0a","infoHashBuffer":{"type":"Buffer","data":[112,110,236,204,45,158,254,89,216,48,137,89,144,108,96,38,49,130,30,10]},"announce":[],"urlList":[]}}