{"title":"Disgaea 2 Dark Hero Days [English][PSP][USA][gamerguuy]","uid":5083597,"size":516126849,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:70b8a05db49aa46aa967579d06cc3ee8504ebc8d&amp;dn=Disgaea+2+Dark+Hero+Days+%5BEnglish%5D%5BPSP%5D%5BUSA%5D%5Bgamerguuy%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gamerguuy","files":-1,"time":1252535708,"description":"Category: PSP\nLanguage: English\nRegion: USA\nType:RPG\nQuality: UMD\nFormat: ISO\nSize: 492.22 MB\nDate: 05-09-2009\n\nTHE AWARD WINNING SRPG HITS THE PSP WITH LOADS OF NEW CONTENT! As the sequel to the most over-the-top strategy RPG ever, the critically-acclaimed Disgaea 2: Dark Hero Days heads to PlayStation Portable with a ton of new content! With massive character &amp; weapon customization, 9999 levels to climb through, an infinite number of battle maps, and brand-new story chapters, Disgaea 2 is ready to please the most dedicated hardcore gamers. Play as a human hero devoted to saving the world from a demented overlord, or try your luck as a dumb-as-bricks demon villain determined to become the NetherworldÃ‚Â¿s new superstar! KEYFEATURES - Loads upon loads of new and enhanced content - Try your hand at over 55 new battle stages, 4 new story chapters, and a new playable character... all spanning over 150 hours of gameplay! - Extreme Battle System - The Magichange and Throw/Receive system from Disgaea 3 on the PLAYSTATION 3 have been added, allowing battle units to transform into weapons and units to be caught and thrown to strategically attack the enemy. - Anime Style Comedy - Like the battle system, the story and characters are all over-the-top and good laugh from all the back-stabbing, good-for-nothing characters.\n\nOriginal credit goes to the original uploader and remember to seed.","torrent":{"xt":"urn:btih:70b8a05db49aa46aa967579d06cc3ee8504ebc8d","amp;dn":"Disgaea+2+Dark+Hero+Days+%5BEnglish%5D%5BPSP%5D%5BUSA%5D%5Bgamerguuy%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70b8a05db49aa46aa967579d06cc3ee8504ebc8d","infoHashBuffer":{"type":"Buffer","data":[112,184,160,93,180,154,164,106,169,103,87,157,6,204,62,232,80,78,188,141]},"announce":[],"urlList":[]}}