{"title":"Rickson Gracie &quot;Choke&quot;","uid":4635075,"size":769153024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71c6bb62c24143b4a58b17b8d7ec1ab4b4599450&amp;dn=Rickson+Gracie+%5C%22Choke%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Midnighter_Tribe","files":1,"time":1231525112,"description":"Rickson Gracie Choke\n\nThis exquisite piece of work is far more professional than any of the American pro wrestling mega-event videos produced recently. The often-gory fights are well handled and only play a small role; this video is not solely about fighting. Done in documentary style, Choke takes an introspective look at the men--their goals, their dreams, and their families--who become the ultimate fighting machines in the ring at the 1995 Vale Tudo World Fighting Championship in Tokyo.\n\nDelving into the life of the undefeated and undisputed world freestyle fighting champion, Rickson Gracie, a 30-year-old jujitsu expert from Rio de Janeiro, Brazil, this video displays a side that you rarely see in sports: the articulate, intelligent family man who turns his training into the art of movement and athleticism--not violence. It also explores the world of two men expected to offer a serious challenge to Gracie: American heavyweight kickboxer Todd &quot;Hollywood&quot; Hays and Japanese shootfighting heavyweight champion Koichiro Kimura. These two men provide some of the more uplifting moments in the documentary. Hays, who is also a member of the U.S. Olympic bobsled team, explains how he will use his performance money to fund his dream of buying a bobsled that will allow him to be a driver in the 1998 Winter Games. Kimura completes his training but then has to ask the permission of his elderly parents to compete. The big man bluffs his way through with a warm smile and a respectful manner.\n\nChoke is an insightful look at a full-contact, controversial sport. The only warning it should carry is that some of the scenes are graphically violent and some of the language is X-rated. --Gordie Sholtys","torrent":{"xt":"urn:btih:71c6bb62c24143b4a58b17b8d7ec1ab4b4599450","amp;dn":"Rickson+Gracie+%5C%22Choke%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c6bb62c24143b4a58b17b8d7ec1ab4b4599450","infoHashBuffer":{"type":"Buffer","data":[113,198,187,98,194,65,67,180,165,139,23,184,215,236,26,180,180,89,148,80]},"announce":[],"urlList":[]}}