{"title":"[eBook ITA] Paolo Cornaglia Ferraris - La Casta bianca (Mondador","uid":4716743,"size":1177731,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:732b7794866ea241d9637cebbaeb463fa316e98a&amp;dn=%5BeBook+ITA%5D+Paolo+Cornaglia+Ferraris+-+La+Casta+bianca+%28Mondador&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"voxel","files":1,"time":1234306706,"description":"Questo libro racconta la malasanitÃƒÂ , la denuncia, ma soprattutto la spiega. PerchÃƒÂ© c'ÃƒÂ¨ un filo che tiene uniti la clinica degli orrori Santa Rita, lo scandalo della sanitÃƒÂ  abruzzese, i tragici errori da cronaca nera e i piccoli grandi disservizi nei quali spesso ci imbattiamo. C'ÃƒÂ¨ un sistema, volutamente distorto, che guida molte delle logiche della gestione della nostra salute. E conoscerlo puÃƒÂ² essere utile per capire che cosa stanno combinando sub la nostra pelle.\nPaolo Cornaglia Ferraris, medico in prima linea che giÃƒÂ  col libro Camici e pigiami, aveva scosso il mondo della sanitÃƒÂ , passa in spietata rassegna tutti i meccanismi di questa macchina: liste di attesa gonfiate e facilmente scavalcabili (basta pagare); esami (e interventi) inutili prescritti per far soldi; ricoveri e dimissioni decisi con criteri prettamente economici; politici che si spartiscono le torte e i primari con tessera di partito; figli di professori che magicamente vincono concorsi universitari; industrie farmaceutiche che corrompono medici e controllori.\nQuesto libro ÃƒÂ¨ un'inchiesta coraggiosa, sconvolgente, bellissima da leggere Per imparare a stare un po' piÃƒÂ¹ in guardia ogni volta che disgraziatamente ci capita di avere a che fare con la &quot;casta bianca&quot;.\n","torrent":{"xt":"urn:btih:732b7794866ea241d9637cebbaeb463fa316e98a","amp;dn":"%5BeBook+ITA%5D+Paolo+Cornaglia+Ferraris+-+La+Casta+bianca+%28Mondador","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"732b7794866ea241d9637cebbaeb463fa316e98a","infoHashBuffer":{"type":"Buffer","data":[115,43,119,148,134,110,162,65,217,99,124,235,186,235,70,63,163,22,233,138]},"announce":[],"urlList":[]}}