{"title":"Ujala Asianet Film Awards 2014 Malayalam.x264.WEB-DL-Full-Part1-","uid":9629137,"size":1785474020,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:733646962d877162eeeb7f81d2093631a200ef79&amp;dn=Ujala+Asianet+Film+Awards+2014+Malayalam.x264.WEB-DL-Full-Part1-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":null,"files":-1,"time":1392644612,"description":"            Ujala Asianet Film Awards 2014 Malayalam\n\n16th Ujala Asianet Film Awards was held with glory like in previous years. This time Dubai Meydan Hotel was adorned as the venue for the most fabulous award night in Malayalam. The function was maginnificant with rich celebrity presence, vibrant programs and remarkable ambience.\n\nApart from the superstars of Malayalam film industry the presence of the bollywood king Shahrukh Khan made the show stand out. The heartthrob of Indian film lovers swept the audience with his killer smile and dynamicity. The pride of Indian Cinema, Kamal Hassan also added to the grandeur of the function.\nThe elements of surprises are yet to be reveled. Each moment was filled with fun, zest and vivacity. The show will be telecasted soon. Start your countdown now for the one and only Ujala Asianet Film Awards.\n\nThe biggest attraction of the ceremony was the presence of Bollywood superstar Shah Rukh Khan, who was honored with the International Icon of Indian Cinema award. The laurel came to King Khan from a million viewers of Asianet, who had selected the actor for his impeccable onscreen aura and the special connect that he shares with countless international fans around the world.[3]\n\nThe superstar was accompanied with a host of other big names from Malayalam movie industry. The show saw the attendance of legendary stars namely, Kamal Hassan, Mohanlal, Mammootty, Dilip, Jayaram, Innocent, Priyamani, Kavya Madhavan and also other generation next actors such as Dulquer Salmaan, Fahadh Faasil, Kunchacko Boban, Amala Paul, Nazriya Nazim and many more.\n\nBesides the shimmering galaxy of movie stars, who made the ceremony sparkle with their glamor and charisma, leading Bollywood composer and singer Shankar Mahadevan, grabbed the spotlight as he bedazzled his fans with a live performance, featuring his chartbuster tracks. The Tamil singing sensation Andrea Jeremiah also trilled her fans with a live performance of her hit Tamil and Telegu songs. The winners of India's Dancing Superstar, the famous dancing five, MJ5 also gave a performance.\n\nMalayalam actors Kavya Madhavan, Isha Talwar, Vineeth, Asha Sarath, Ramya Nambeesan and gen-next sensation Nazriya Nazim also put up their acts and entertained the audience. Famous Malayalam singer Rimi Tomy paid a tribute to A.R.Rahman by singing his hit songs.[4]\n\n\n\n\n\nVisit Our Site: http://www.asianetglobal.com/\n\n\n\nSubscribe to Asianet Official YouTube Channel for more videos:\n\nFor Asianet News and Updates LIKE our Facebook Page:\n\nand follow us on Twitter:\n\n\t\t","torrent":{"xt":"urn:btih:733646962d877162eeeb7f81d2093631a200ef79","amp;dn":"Ujala+Asianet+Film+Awards+2014+Malayalam.x264.WEB-DL-Full-Part1-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733646962d877162eeeb7f81d2093631a200ef79","infoHashBuffer":{"type":"Buffer","data":[115,54,70,150,45,135,113,98,238,235,127,129,210,9,54,49,162,0,239,121]},"announce":[],"urlList":[]}}