{"title":"The Message (Story Of Islam) 1976 in Urdu---By115","uid":6032850,"size":735019302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73a58467e4323fa463483032d079f2fd6a3db193&amp;dn=The+Message+%28Story+Of+Islam%29+1976+in+Urdu---By115&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Muzaffar_Shah","files":1,"time":1292138587,"description":"The Message (Story Of Islam) 1976 in Urdu---By 115\n\nHandsomely-mounted historical epic concerns the birth of the Islamic faith and the story of the prophet Mohammed -- who, in accordance with the tenants of Islam, is never seen or heard (as this is offensive to certain islamic schools of thought). In Mecca in the 7th century, Mohammed is visited by a vision of the Angel Gabriel, who urges him to lead the people of Mecca to cast aside the 300 idols of Kaaba and instead worship the one true God. Speaking out against the corrupt political and military leaders who rule Mecca. With the help of his uncle, a brave warrior named Hamza (Anthony Quinn), Mohammed and his followers return to Mecca to liberate the city in the name of God. The Message (originally screened in the U.S. as Mohammed, Messenger of God) proved to be highly controversial during its production and initial release. Unfounded rumors had it that Mohammed would not only be depicted in the film, but that he was to be played by Charlton Heston or Peter O'Toole. This resulted in angry protests by Muslim extremists, until director Moustapha Akkad hired a staff of respected Islamic clerics as technical advisors. \n\n\nThe Message was shot in two versions, one in English and one in Arabic (entitled Al-Ris-Alah), with different actors taking over some of the roles due to language r equirements.\n\nThis is the english version with Anthony Quinn as Hamza But Dubbed In Urdu Language.\n\nPLEASE SEED\nPlEASE SEED","torrent":{"xt":"urn:btih:73a58467e4323fa463483032d079f2fd6a3db193","amp;dn":"The+Message+%28Story+Of+Islam%29+1976+in+Urdu---By115","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73a58467e4323fa463483032d079f2fd6a3db193","infoHashBuffer":{"type":"Buffer","data":[115,165,132,103,228,50,63,164,99,72,48,50,208,121,242,253,106,61,177,147]},"announce":[],"urlList":[]}}