{"title":"The Cambridge Double Star Atlas 2009 - (Malestrom)","uid":4977595,"size":16332292,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73eb0bd81984b688a976b400796d6ad79df5ef19&amp;dn=The+Cambridge+Double+Star+Atlas+2009+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1246086834,"description":" &lt;a href=&quot; http://bayimg.com/PABPCAACk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PABPCAACk&lt;/a&gt;\n\nJames Mullaney, Wil Tirion , &quot;The Cambridge Double Star Atlas&quot;\nCambridge University Press | 2009 | ISBN: 0521493439 | 154 pages | PDF \n\nReview\n&quot;Thanks to the genius of James Mullaney, and the artistic sensibility of Wil Tirion, backyard stargazers can now enjoy endless hours of double- and multiple-star observing. Mullaney's vivid descriptions of the finest showpieces truly inspire; Tirion's design is both handsome and practical. The work is destined to become an instant classic. Bravo!&quot; Stephen James O'Meara - Author of the Deep-Sky Companions observing guides and columnist for Astronomy magazine.\n\n&quot;...the definitive treasure map to the night sky's most alluring deep-sky gems. ...an essential addition to any stargazer's observing kit. This new work from James Mullaney, one of the world's most experienced double-star observers, and Wil Tirion, the dean of modern celestial cartographers, gives even the most experienced stargazer a lifetime supply of deep-sky wonders to explore and enjoy.&quot; - Rick Fienberg, Editor Emeritus, Sky &amp; Telescope\n\nDescription\nThis magnificent atlas contains the most attractive and interesting double and multiple stars for viewing with binoculars and telescopes. It is a must-have for stargazers who want to explore these fascinating objects. The first modern star atlas devoted to double and multiple stars, it plots over 2,000 selected pairs of stars, each labeled with discoverer, catalog, and/or observatory designations. A superb introduction to this important class of celestial objects, it is spiral bound and printed in red-light friendly colors, making it ideal for use in the field. Written by experienced observer James Mullaney, and beautifully illustrated by renowned celestial cartographer Wil Tirion, it provides an easy-to-use 'celestial roadmap' to locate and identify double and multiple stars. Other deep-sky objects such as star clusters, nebulae, and galaxies are also included, and are color-coded for easy recognition and identification, making this an all-purpose observing reference.","torrent":{"xt":"urn:btih:73eb0bd81984b688a976b400796d6ad79df5ef19","amp;dn":"The+Cambridge+Double+Star+Atlas+2009+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73eb0bd81984b688a976b400796d6ad79df5ef19","infoHashBuffer":{"type":"Buffer","data":[115,235,11,216,25,132,182,136,169,118,180,0,121,109,106,215,157,245,239,25]},"announce":[],"urlList":[]}}