{"title":"EXPLOITED COLLEGE GIRLS - Kenzie - She Cums 7 Times!","uid":8708562,"size":562869286,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:73fee10578a17a32747c1e26f96617e2a7a09d7e&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Kenzie+-+She+Cums+7+Times%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"beta2008x","files":1,"time":1374187369,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=s6dks_ecg_kenzie_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=s6dks_ecg_kenzie_s.jpg&lt;/a&gt;\n\n\nSo I have a fetish for 'real' looking girls in porn - you know - the ones who don't have fat gaping nasty pussies and haven't done 50 scenes on cam. I also hate downloading huge 1GB+ 20 minute files so I promise to never do that to you. I've been collecting these scenes for quite awhile from various sites and have dled only to promptly delete probably 9 out of 10 videos that just don't make the cut for whatever reason. But I've never gotten around to uploading the ones I've saved for everyone else to enjoy. This is another of many that I will be sharing over the coming days/weeks depending on the response I get from you pervs.\n\n\nThis scene features Kenzie who is a one and only timer I do believe at ECG. Pure amateur 18 year old girl fucked once on camera and never again. This video has been in my archives as a favorite since I originally grabbed it back in Jan of 2012. Kenzie is a spoiled little bitch from the Tucson area of Arizona (520 area code tattoo on her right inner arm) who wants to look all hard with her tats and piercings but really has never been properly fucked in her life before today. One of her tats says trouble but its high color red and blue and just looks like a joke. This is one of the VERY FEW ecg scenes where they get a slut before she's been fucked loose while she's still got a prime pussy. She's got great B cups and an oh so tight pussy that she cums fairly quickly with just 2 fingers on the bed during some foreplay. Not a great ass and no anal but you don't need it when you got her tight pussy and sweet natural moaning. Yeah shes got some trashy tats and the piercings don't help much but before he gets done they've gone back and forth in a bunch of different positions and she's cummed at least 7 times (yes thats SEVEN ORGASMS). Good fucking relatively speaking for ECG - medium-large dick (that she thinks honestly looks huge) stays hard for the full scene to get her to cum so many times. Enjoy!","torrent":{"xt":"urn:btih:73fee10578a17a32747c1e26f96617e2a7a09d7e","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Kenzie+-+She+Cums+7+Times%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73fee10578a17a32747c1e26f96617e2a7a09d7e","infoHashBuffer":{"type":"Buffer","data":[115,254,225,5,120,161,122,50,116,124,30,38,249,102,23,226,167,160,157,126]},"announce":[],"urlList":[]}}