{"title":"Land of Talk - Applause Cheer Boo Hiss","uid":4866229,"size":39984143,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7490b3e9965c42300c4270efd39d599f11983b55&amp;dn=Land+of+Talk+-+Applause+Cheer+Boo+Hiss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"davmuss","files":7,"time":1240525322,"description":"Land Of Talk - Applause, Cheer, Boo, Hiss\n\n\nTrack listing:\nSpeak To Me Bones\nSea Foam\nSummer Special\nBreaxxbaxx\nMagnetic Hill\nAll My Friends\nStreet Wheels\nYoung Bridge\n2 Ships\nDark Nature Places\n\n\n\n\nBorn and partially raised in a one-room schoolhouse in Moonstone, Ontario,\nElizabeth Powell and her family later moved to Guelph, where she tapped into the\nlocal music scene and moved beyond Suzuki violin to an acoustic Yamaha that\nshe &quot;acquired&quot; from an aunt.\n\nBetween gigging around Ontario and Quebec, she recorded the EP belle ÃƒÂ©poque, which she released the summer before heading off to Concordia University in Montreal. It is at Concordia where she met current bass player Chris McCarron. The Music program was too constricting for both the young singer-songwriter and bassist Chris, so they both left school to practice music on her own terms.\n\nHaving gone through various permutations of band lineups, the perfect chemical trio was finally formed in early 2007 with the addition of jazz/rock savant Eric Thibodeau, affectionately known as eROCK.\n\n\nAfter spending a grueling three days recording and an agonizing three hours\nmixing in the studio with local music man extraordinaire, Jace Lasek (Wolf Parade, Sunset Rubdown, Malajube, Besnard Lakes), the band unleashed the feral 7 song masterpiece Applause Cheer Boo Hiss, originally self released in Canada in April 2006 via Dependent Music.\n\nNot long after, word of mouth spread as the band was embraced by music\nbloggers. After several shows in NYC, the buzz had reached a fevered pitch. Land of Talk found early supporters and fans in such blogs and periodicals as Brooklyn Vegan,\nChromewaves, Stereogum, and Paste Magazine, as well as such taste making\nradio stations as Seattle's KEXP and LA's KCRW. These accolades led to a grueling tour schedule with such venerable bands as Wintersleep, Holy Fuck, The Dears, The Stills, Menomena, Fiery Furnaces, The Besnard Lakes, and The Rosebuds which never seems to end.\n\nPutting the ROCK back in indie rock, Land of Talk's sound is fueled by Liz's stunning, unforgettable vocal melodies, haunting lyrics and a unique guitar style that mixes lush\nchord voicings with the dissonant urgency of Thurston Moore. In other circles you may hear them described as a place yielding destructive Stevie Nicks Blonde Redhead mutants, Will Oldham meets Sonic Youth, or PJ Harvey meets Crazy Horse creatures.\n\nEither way, Land of Talk will consume you with their warm, yet fierce,\nembrace.\n\nThe opposite is also true.\n &lt;a href=&quot;\nhttp://www.onelittleshop.com/product_info.php?products_id=689&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.onelittleshop.com/product_info.php?products_id=689&lt;/a&gt;","torrent":{"xt":"urn:btih:7490b3e9965c42300c4270efd39d599f11983b55","amp;dn":"Land+of+Talk+-+Applause+Cheer+Boo+Hiss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7490b3e9965c42300c4270efd39d599f11983b55","infoHashBuffer":{"type":"Buffer","data":[116,144,179,233,150,92,66,48,12,66,112,239,211,157,89,159,17,152,59,85]},"announce":[],"urlList":[]}}