{"title":"Tron-2.0-For Windows-Standard-Iso Format","uid":4616143,"size":974020423,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:74d899b5bc700a21b9752f88af091c3a6f5bf4b9&amp;dn=Tron-2.0-For+Windows-Standard-Iso+Format&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"seraphim911","files":12,"time":1230845178,"description":"Tron 2.0 is a computer game developed by Monolith Productions. It is a sequel to the 1982 motion picture Tron. The PC version of the game was released by Buena Vista Games on August 26, 2003. The Mac version was released by MacPlay on April 21, 2004.\n\nThe game is a first person shooter set &quot;inside&quot; a computer in the same sense as the original movie. It cheerfully uses and abuses computing conventions; players will find themselves in the flaming red environment of a firewall and the minimalistic white one of a PDA, battle viruses while fleeing a format, and wield a sniper rifle known as the LOL. A light cycle mini-game is included as part of the plot as well as available in multiplayer mode across a network. In the game, Bruce Boxleitner reprises his role from the original movie as Alan Bradley. Cindy Morgan, who also starred in the original movie, voices the new character Ma3a. Rebecca Romijn (credited as Rebecca Romijn-Stamos) provides the voice of Mercury. A new Light Cycle design was contributed to the game by Syd Mead. The story is centered around Alan's son Jet, who is digitized at the start of the game, like Kevin Flynn was in the movie. As the plot progresses, Jet must rid the computer system of a virus, protect his father and Ma3a, and thwart the efforts of the evil fCon company and their human Data-Wraiths, all while constantly dodging the efforts of the computer protection forces to eliminate him.\n\nIn addition to the Mac, the game was also ported to the Xbox with significant changes to the single and, especially, the multiplayer modes. The Xbox version is entitled Tron 2.0 Killer App. Changes to the single player mode include optional jumping sequences, and overall console-tailored controls. The real changes were made to the multiplayer modes. Added is up to sixteen player multiplayer disc arena, light cycles, or overRide modes for system link or Xbox Live. The new overRide mode allows for first person mayhem with the ability to ride light cycles at any time. There is also a version of Tron 2.0 Killer App for the Game Boy Advance that has different story and gameplay from its Xbox counterpart. A version of the game was planned for the Gizmondo, but was canceled during development.\n\nThe idea of Tron 2.0 was originally explored as a movie concept, but it was eventually decided to focus first on making it as a game. The film TR2N has recently been announced, and production is expected to begin soon.\n\n","torrent":{"xt":"urn:btih:74d899b5bc700a21b9752f88af091c3a6f5bf4b9","amp;dn":"Tron-2.0-For+Windows-Standard-Iso+Format","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d899b5bc700a21b9752f88af091c3a6f5bf4b9","infoHashBuffer":{"type":"Buffer","data":[116,216,153,181,188,112,10,33,185,117,47,136,175,9,28,58,111,91,244,185]},"announce":[],"urlList":[]}}