{"title":"Paranormal State Season 1","uid":4303032,"size":3678561238,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:74e3dd361430f013a5a3188552e33e78f8cd7ee7&amp;dn=Paranormal+State+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Chrille_1977","files":20,"time":1216407327,"description":"Ryan Buell is just an ordinary college kid. He attends classes at Penn State University, deals with schedules, school-work, parties, girls, etc. But he is also a member of one of the first university sanctioned paranormal research groups in the country, The Paranormal Research Society (PRS). Each week, outside parties ranging from The Catholic Church to ordinary families contact the PRS to request help in dealing with a terrifying real-life mystery often involving poltergeists, hauntings and the darkest areas of the unknown.\n\n===================================================================================\nTOO BIG TO DOWNLOAD OR DO YOU ONLY WANT PART OF THE DOWNLOAD?\n\nIn most torrent programs you can check/uncheck the files to download in the torrent. If your program supports this you can usually do this when asked where to save the files.\nYou can let some files (or just the onces you want) be checked and download that. If the torrent is too big you can burn to DVDs or watch on computor, then delete the files from your harddrive. Open your torrentprogram again and mark the torrent. Go to torrent settings, uncheck the already downloaded files and check others for download. And so on until you have all the files you want.\n","torrent":{"xt":"urn:btih:74e3dd361430f013a5a3188552e33e78f8cd7ee7","amp;dn":"Paranormal+State+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74e3dd361430f013a5a3188552e33e78f8cd7ee7","infoHashBuffer":{"type":"Buffer","data":[116,227,221,54,20,48,240,19,165,163,24,133,82,227,62,120,248,205,126,231]},"announce":[],"urlList":[]}}