{"title":"Dedh Ishqiya - DVDScreen - XviD - 2014 {{STARM273}}","uid":9544894,"size":1759317686,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:74f5a679a8b00dfcf6ee13ef75390e0134f47c88&amp;dn=Dedh+Ishqiya+-+DVDScreen+-+XviD+-+2014+%7B%7BSTARM273%7D%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starmm273","files":3,"time":1391111246,"description":" {{STARM273 PROUDLY PRESENTS}}\n\n\n{{DEDH ISHQIYA}}\n\n{{Movie Info}}\n\nMadhuri Dixit - Begum Para\nArshad Warsi - Razzaakh Hussain alias Babban\nNaseeruddin Shah - Ifthekhar alias Khalujan\nHuma Qureshi - Muniya\nVijay Raaz - Jaan MohammadManoj\nPahwa - Nawab ItalwaRavi\nGossain - Liyaakat ali\n\nKhalujan (Naseeruddin Shah) and his nephew Babban (Arshad Warsi), a thief duo, pose as a Nawab and his attendant, and manage to run away with a prized necklace from a jewellery shop. In the police chase they get separated, while Khalujaan is hurt. Months later Babban traces Khalujan again, this time posing a nawab, at a poetry contest. It is a mushaira organized by Begum Para (Madhuri Dixit), the widowed Begum of Mahmudabad as per the wishes of her deceased husband. The winner would win the Begum as bride and in turn become the Nawab of Mahudabad. However, by the opening night, Babban traces Khalujaan. Soon he falls in love with Begum Para's assistant, Muniya (Huma Qureshi), while Khalujaan has his heart set on Begum herself. Gradually the story progress a plot to kidnap the Begum is revealed. To complicate the matters there is another suitor in the fray, a local MLA-gangster Jaan Mohammed (Vijay Raaz), who posing as a poet, making a poet Nawab Italwi (Manoj Pahwa) write poetry for him in captivity. Khalujaan tries to impress the Begum by giving her the prized necklace they stole earlier but on the final day Begum declares Jaan Mohammed as her to be husband and new nawab of Mahmudabad. Disappointed Khalujaan approaches begum with a gun just before a masked man kidnaps her at gun point. Khalujaan chases them and blocks their way only to discover that the masked man was Babban and Begum has plotted her own kidnapping to extort money from the new to be nawab (now Jaan Mohammad) as the Begum was left bankrupt by her late husband. Babban calls Jaan Mohammed to bring 10 crore ransom money to a railway station who now is aware of Begum's plan. All four reach the railway station to collect money but find the bag empty and surrounded by Jaan Mohammad's goons. Much to their good fortune Nawab Italwi arrives with police force and cross-firing starts. Begum and Muniya escape from the situation leaving behind Babban and Khalujaan only to be arrested. One and half month later both get bail and a message from Begum and Muniya who are now settled in an unknown city by selling off the prized necklace. Movie ends with the duo once again surrounded by Mushtaq (Salman Shahid) and his gang.\n\n\n{{Movie Screen Shots}}\n\n\n\nPLEASE CLICK THE LINKS FOR SCREEN SHOTS ","torrent":{"xt":"urn:btih:74f5a679a8b00dfcf6ee13ef75390e0134f47c88","amp;dn":"Dedh+Ishqiya+-+DVDScreen+-+XviD+-+2014+%7B%7BSTARM273%7D%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74f5a679a8b00dfcf6ee13ef75390e0134f47c88","infoHashBuffer":{"type":"Buffer","data":[116,245,166,121,168,176,13,252,246,238,19,239,117,57,14,1,52,244,124,136]},"announce":[],"urlList":[]}}