{"title":"Open.Tee.Bioscope.(2015)-DVD.Rip-HEVC-x265.AAC.Esubs-1BD-[DDR]","uid":12597716,"size":731381530,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:75248423410ed10a3ee4c9b912177a5cdda8224f&amp;dn=Open.Tee.Bioscope.%282015%29-DVD.Rip-HEVC-x265.AAC.Esubs-1BD-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"SaM","files":1,"time":1445284044,"description":"\nDDR Presents\r\n\r\n\r\nOpen Tee Bioscope(2015)\r\n(A film by Anindya Chatterjee)\r\n\r\nBengali - DVD rip - 720x304p (2.35:1)- 697 MB - x.265.AAC (5.1 Ch) - 2 Hrs:15 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/M0m \nhttp://extraimago.com/image/M0R \nhttp://extraimago.com/image/M0Q \nhttp://extraimago.com/image/M0L \nhttp://extraimago.com/image/M0y \nhttp://extraimago.com/image/M0q \nhttp://extraimago.com/image/M0S \nhttp://extraimago.com/image/M0O \nhttp://extraimago.com/image/M0E \nhttp://extraimago.com/image/M01 \nhttp://extraimago.com/image/M0c \nhttp://extraimago.com/image/M07 \nhttp://extraimago.com/image/M0n\r\n\r\nTech Specifications: \r\n \nhttp://extraimago.com/image/M0s\r\n\r\nSynopsis:\r\nFoara (Riddhi Sen) comes home after being rusticated for beating up a teacher in his residential school , much to the disappointment of his mother Baisakhi (Sudipta). But he quickly makes friends with Kochua (Ritobroto), Charan (Dhee) and Gopa (Rajarshi). Together these street urchins raise cain, have fun and Foara even falls in love with Titir (Surangana). Life progresses in its aimless wayin the neighbourhood, until Gopeshwar (Rajatava) a failed football coach, takes them under his wing. In the end, Foara finds meaning in his life..\r\n\r\nComments:\r\nThis is a story of North Calcutta of the 90's. The neighbourhood or 'para' is a close knit community in which everyone, young and old, participate. As Foara and his friends poke fun at the 'Bhadralok' and scamper across the neighbourhood, we come across the life in the 'Para', some bitter, some sweet. It is a tapestry of a number of tales of different characters in the 'Para', creating an ambience that brings to life the 'Para'of the 90's. The common thread that binds all of them is football and the local tournament.\r\n\r\nUltimately, it a film about childhood, and growing up and adolesence - the indefinable period before a person transforms from a child to an adult.\r\nIt is a tale humourously told. Anindya Chatterjee, who also wrote the story and the screenplay, peppers it with liitle gems of repartee, that is so typically Bengali, that the subtitles simply cannot bring it across. How does one, for example, explain the humour in, whats your name?, Foara, Jal Pore. Foara means fountain and Jal pore means does the water flow. But the humour goes much beyond. But if you follow the language, it is delightful. The other strength is the music. From Bangla Band (Pagol Khabi Ki) to the closing strains of Bondhu Chal, music is part and parcel of the film. The Director, after all is the leading song-writer of the Bangla Band Chandrabindoo.\r\nBut, if this tale hangs together it is because of the superb acting by the four protagonists, Riddhi Sen, Dhee Majumdar, Ritobroto Mukherjee and Rajarshi Nag. I liked Surangana Banerjee in her role of Titir as well. Among the adults, Sudipta Chakraborty is outstanding. the veterans Rajatava Dutta and Paran Bandyopadhyay are good, but look familiar in their mannerisms. In general the actors do a good job.\r\nThe music, as I mentioned above flows through the film. Some good editing keeps our interest from flagging and most of the outdoor cinematography is very good. Indoors, its on expected lines, with few surprises.\r\nOverall, its a film that is pure nostalgia. If you grew up in the 90's in North Calcutta, you will recognise every nuance. Even if you didn't, the tale of four young boys growing up and finding their feet will keep you engrossed.\r\n\r\nUploader's Notes:\r\nAs is usual with DDR rips, the rip is an improvement overthe original DVD. we have corrected the colors to remove an ugly yellow veneer that permeated the DVD. The natural colors that lay below are much nicer and we havent payaed with them much. The big logo has been removed so that it is hardly visible except in a few frames. The entire 2 Hr. 17 minutes film has been compressed into just 700 MB. But in the process, the discerning will find just a hint of flicker and a little bit of grain. But you will need a very good eye to see that!\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4365506/","torrent":{"xt":"urn:btih:75248423410ed10a3ee4c9b912177a5cdda8224f","amp;dn":"Open.Tee.Bioscope.%282015%29-DVD.Rip-HEVC-x265.AAC.Esubs-1BD-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75248423410ed10a3ee4c9b912177a5cdda8224f","infoHashBuffer":{"type":"Buffer","data":[117,36,132,35,65,14,209,10,62,228,201,185,18,23,122,92,221,168,34,79]},"announce":[],"urlList":[]}}