{"title":"Margaret Atwood - Negotiating With the Dead (pdf)","uid":8721853,"size":2182334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:761de17e86260dbfa0db1a187a654a2e6443104f&amp;dn=Margaret+Atwood+-+Negotiating+With+the+Dead+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1374434380,"description":"Margaret Atwood - Negotiating With the Dead: A Writer on Writing (Cambridge Univ. Press, 2002). 219 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nLectures on writing by the great Canadian writer.\n\ndescription:\n\nWhat is the role of the Writer? Prophet? High Priest of Art? Court Jester? Or witness to the real world? Looking back on her own childhood and writing career, Margaret Atwood examines the metaphors which writers of fiction and poetry have used to explain--or excuse!--their activities, looking at what costumes they have assumed, what roles they have chosen to play. In her final chapter she takes up the challenge of the title: if a writer is to be seen as &quot;gifted&quot;, who is doing the giving and what are the terms of the gift? Atwood's wide reference to other writers, living and dead, is balanced by anecdotes from her own experiences, both in Canada and elsewhere. The lightness of her touch is offset by a seriousness about the purpose and the pleasures of writing, and by a deep familiarity with the myths and traditions of western literature. \n\nMargaret Atwood was born in 1939 in Ottawa and grew up in northern Quebec, Ontario, and Toronto. She received her undergraduate degree from Victoria College at the University of Toronto and her master's degree from Radcliffe College. Throughout her thirty years of writing, Atwood has received numerous awards and honorary degrees. Hew newest novel, The Blind Assassin, won the 2000 Booker Prize for Fiction. She is the author of more than twenty-five volumes of poetry, fiction, and non-fiction and is perhaps best known for her novels, which include Alias Grace (1996), The Robber Bride (1994), Cat's Eye (1988), The Handmaid's Tale (1983), Surfacing (1972) and The Edible Woman (1970). Acclaimed for her talent for portraying both personal lives and worldly problems of universal concern, Atwood's work has been published in more than thirty-five languages, including Japanese, Turkish, Finnish, Korean, Icelandic, and Estonian.\n\nReview\n\nAfter having been through the &quot;wash-and-spin cycle&quot; a few times, Margaret Atwood realized that her &quot;own experience in the suds may be relevant to others.&quot; Thus was born Negotiating with the Dead, six essays about what it means to be a writer, particularly a female writer. Each essay explores one aspect of writerly contemplation: art vs. commerce; the ideal reader; the separation between the part of a person that writes and the part that lives; and, as the title suggests, the constant presence of those who came before (both writers and other ancestors). Atwood relates her own experiences as a female poet (to be taken seriously, it would have helped to commit suicide) and as a bestselling novelist (whether your books are good or bad, sell well or don't, people will look down at you for it). These are intriguing meditations, with references to works by Virgil, Isak Dinesen, Robertson Davies, and countless others (Atwood's own dead, no doubt).\n","torrent":{"xt":"urn:btih:761de17e86260dbfa0db1a187a654a2e6443104f","amp;dn":"Margaret+Atwood+-+Negotiating+With+the+Dead+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761de17e86260dbfa0db1a187a654a2e6443104f","infoHashBuffer":{"type":"Buffer","data":[118,29,225,126,134,38,13,191,160,219,26,24,122,101,74,46,100,67,16,79]},"announce":[],"urlList":[]}}