{"title":"Magnetism - Molecules to Materials IV - Nanosized Magnetic Mater","uid":15533756,"size":11811408,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:767af9b312f00050efc1dba7d6fb439e7d51f4f5&amp;dn=Magnetism+-+Molecules+to+Materials+IV+-+Nanosized+Magnetic+Mater&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1470859239,"description":"Magnetism - Molecules to Materials IV - Nanosized Magnetic Materials - Joel S. Miller, Marc Drillon (Wiley-VCH, 2002).pdf\r\n\r\nMagnetic phenomena and materials are everywhere. Our understanding of magnetic behavior, once thought to be mature, has enjoyed new impetus from contributions ranging from molecular chemistry, materials chemistry and sciences to solid state physics. New phenomena are explored that open promising perspectives for commercial applications in future - carrying out chemical reactions in magnetic fields is just one of those. The spectrum spans molecule-based - organic, (bio)inorganic, and hybrid - compounds, metallic materials as well as their oxides forming thin films, nanoparticles, wires etc. Reflecting contemporary knowledge, this open series of volumes provides a much-needed comprehensive overview of this growing interdisciplinary field. Topical reviews written by foremost scientists explain the trends and latest advances in a clear and detailed way. By maintaining the balance between theory and experiment, the book provides a guide for both advanced students and specialists to this research area. It will help evaluate their own experimental observations and serve as a basis for the design of new magnetic materials. A unique reference work, indispensable for everyone concerned with the phenomena of magnetism!","torrent":{"xt":"urn:btih:767af9b312f00050efc1dba7d6fb439e7d51f4f5","amp;dn":"Magnetism+-+Molecules+to+Materials+IV+-+Nanosized+Magnetic+Mater","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"767af9b312f00050efc1dba7d6fb439e7d51f4f5","infoHashBuffer":{"type":"Buffer","data":[118,122,249,179,18,240,0,80,239,193,219,167,214,251,67,158,125,81,244,245]},"announce":[],"urlList":[]}}