{"title":"Nanotechnology and Ethical Governance in the European Union and","uid":15446476,"size":1901167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7729f729ecf10a032e14386e60a576480bf276f9&amp;dn=Nanotechnology+and+Ethical+Governance+in+the+European+Union+and+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469891132,"description":"Nanotechnology and Ethical Governance in the European Union and China - Sally Dalton-Brown (Springer, 2015).pdf\r\n\r\nThis book addresses questions surrounding the feasibility of a global approach to ethical governance of science and technology. The emergence and rapid spread of nanotechnology offers a test case for how the world might act when confronted with a technology that could transform the global economy and provide solutions to issues such as pollution, while potentially creating new environmental and health risks. The author compares ethical issues identified by stakeholders in China and the EU about the rapid introduction of this potentially transformative technology – a fitting framework for an exploration of global agency.\r\n\r\nThe study explores the discourse ethics and participatory Technology Assessment (pTA) inspired by the work of Jürgen Habermas to argue that different views can be universally recognized and agreed upon, perhaps within an ideal global community of communication. The book offers a developed discourse model, utilizing virtue ethics as well as the work of Taylor, Beck, Korsgaard and others on identity formation, as a way forward in the context of global ethics. The author seeks to develop new vocabularies of comparison, to discover shared aspects of identity and to achieve, hopefully, an ‘intercultural personhood’ that may lead to a global ethics.\r\n\r\nThe book offers a useful guide for researchers on methods for advancing societal understanding of science and technology. The author addresses a broad audience, from philosophers, ethicists and scientists, to the interested general reader. For the layperson, one chapter surveys nanoissues as depicted in fiction and another offers a view of how an ordinary citizen can act as a global agent of change in ethics","torrent":{"xt":"urn:btih:7729f729ecf10a032e14386e60a576480bf276f9","amp;dn":"Nanotechnology+and+Ethical+Governance+in+the+European+Union+and+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7729f729ecf10a032e14386e60a576480bf276f9","infoHashBuffer":{"type":"Buffer","data":[119,41,247,41,236,241,10,3,46,20,56,110,96,165,118,72,11,242,118,249]},"announce":[],"urlList":[]}}