{"title":"Shutter Island - Dennis Lehane-viny","uid":6408130,"size":661474,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:778cb1377a368d8672f91dfe5ba65b8883a64e27&amp;dn=Shutter+Island+-+Dennis+Lehane-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1305882473,"description":"Shutter Island - Dennis Lehane-viny\n\nn a masterful departure from the Boston-based hard-boiled mysteries he's known for, New York Times bestselling author Dennis Lehane (Mystic River) offers an atmospheric psychological thriller set in a 1950s asylum for the criminally insane. It's 1954, and up-and-coming U.S. marshal Teddy Daniels is assigned to investigate the disappearance of a patient from Shutter Island's Ashecliffe Hospital. He'd been gunning for an assignment on the island for reasons of his own -- but before long he wonders whether he hasn't been brought there as part of a twisted plot by hospital doctors whose radical treatments range from unethical to illegal to downright sinister. Teddy's code-breaking skills soon provide a promising lead, but the hospital refuses him access to records he suspects would break the case wide open. As a hurricane cuts off communication with the mainland, more dangerous criminals &quot;escape&quot; in the confusion, and the puzzling, improbable clues proliferate, Teddy begins to doubt everything -- his memory, his partner, even his own sanity. Sue Stone","torrent":{"xt":"urn:btih:778cb1377a368d8672f91dfe5ba65b8883a64e27","amp;dn":"Shutter+Island+-+Dennis+Lehane-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"778cb1377a368d8672f91dfe5ba65b8883a64e27","infoHashBuffer":{"type":"Buffer","data":[119,140,177,55,122,54,141,134,114,249,29,254,91,166,91,136,131,166,78,39]},"announce":[],"urlList":[]}}