{"title":"The Butterfly Defect: How Globalization Creates Systemic Risks","uid":10421172,"size":8216814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77da675ff0c55fb9c45c868ce94bc56fa009febf&amp;dn=The+Butterfly+Defect%3A+How+Globalization+Creates+Systemic+Risks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bookzilla","files":1,"time":1403650134,"description":"The Butterfly Defect: How Globalization Creates Systemic Risks, and What to Do about It\n\nGoldin and Mariathasan assert that the current complexities of globalization will not be sustainable as surprises become more frequent and have widespread impacts. The recent financial crisis exemplifies the new form of systemic risk that will characterize the coming decades, and the authors provide the first framework for understanding how such risk will function in the twenty-first century. Goldin and Mariathasan demonstrate that systemic risk issues are now endemic everywhere--in supply chains, pandemics, infrastructure, ecology and climate change, economics, and politics. Unless we are better able to address these concerns, they will lead to greater protectionism, xenophobia, nationalism, and, inevitably, deglobalization, rising conflict, and slower growth.\n\n The Butterfly Defect shows that mitigating uncertainty and systemic risk in an interconnected world is an essential task for our future. \n\nepub 2014","torrent":{"xt":"urn:btih:77da675ff0c55fb9c45c868ce94bc56fa009febf","amp;dn":"The+Butterfly+Defect%3A+How+Globalization+Creates+Systemic+Risks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77da675ff0c55fb9c45c868ce94bc56fa009febf","infoHashBuffer":{"type":"Buffer","data":[119,218,103,95,240,197,95,185,196,92,134,140,233,75,197,111,160,9,254,191]},"announce":[],"urlList":[]}}