{"title":"American_Top_40_1982_August_7th","uid":10761673,"size":292415571,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:781eed5810d89f655b955589bde60b87f8b4e22d&amp;dn=American_Top_40_1982_August_7th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1407982366,"description":"&quot;This is AT40, I'm Casey Kasem, and we're counting down the most popular songs in the land.'\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nHerb Alpert is at number 38 with an instrumental, &quot;Route 101.&quot; Casey calls him the only one recording artist in the history of the Billboard charts ever to hit number one with both a vocal and an instrumental. Casey tells how Billy Preston was only one notch away from making Alpert having to share that title (I'll bet that makes feel so good . . .)\n\nCasey tells how Ronnie Van Zant (original leader of Lynyrd Skynyrd) gifted a special belt to his younger brother Donnie, which was the stolen but later returned. Donnie's band, 38 Special has their song &quot;Caught Up In You&quot; at number 35.\n\nA listener asks, &quot;What soul act has had the most number one hits on the pop chart?&quot; This soul act is the rock 'n' roll era's most successful of all American groups. Casey says they put 12 number one songs on the pop chart in their first five years, and had more number one pop hits than any other American group of any type!\n\nThe highest debuting song of the week is the first American hit by an Australian group calling themselves 'Men At Work.' Their song, &quot;Who Can It Be Now&quot; comes from down-under to land in position number 27.\n\nThe Pointer Sisters (at number 25) with their latest hit, &quot;American Music&quot; Casey tells how, as children, their church frowned on them for singing traditional hymns with too much spirit. The last time I went to church, I brought my pet skunk with me and they made us sit in our own pew.\n\nDonna Summer is at number 16 (headed for number 2) with &quot;Love to Love You Baby.&quot; Giorgio Moroder helped out with keyboards, percussion, and arrangement. He also worked with her on &quot;I Feel Love&quot; which went to number six. Both songs went to number one on the dance charts.\n\nFleetwood Mac is at number 4 with their latest, &quot;Hold Me.&quot; Casey says their earlier self-titled album &quot;Fleetwood Mac&quot; was the first album in the history of Billboard's album chart to hit number one after being on that chart for over the year. \n\nLW#3: Hurts So Good - John Cougar\nLW#2: Rosanna - Toto\nLW#1: Eye Of The Tiger - Survivor\n40: Early In The Morning - The Gap Band\n39: Still They Ride - Journey\n38: Route 101 - Herb Alpert\n37: Love Plus One - Haircut One Hundred\n36: Hot In The City - Billy Idol\n35: Caught Up In You - .38 Special\n34: Your Imagination - Hall &amp; Oates\n33: Jack And Diane - John Cougar\n32: Paperlate - Genesis\n31: I Found Somebody - Glenn Frey\n30: If The Love Fits, Wear It - Leslie Pearl\n29: And I'm Telling You I'm Not Going - Jennifer Holiday\n28: Eye In The Sky - Alan Parsons Project\n27: Who Can It Be Now - Men At Work\n26: Kids In American - Kim Wilde\n25: American Music - Pointer Sisters\n24: Think I'm In Love - Eddie Money\nLDD: Making Love - Roberta Flack\n23: Out Of Work - Gary U.S. Bonds\n22: Love Will Turn You Around - Kenny Rogers\n21: What Kind Of Fool Am I - Rick Springfield\n20: Do I Do - Stevie Wonder\n19: Personally - Karla Bonoff\nEXTRA: I'd Really Love To See You Tonight - England Dan &amp; John Ford Coley\n18: Love's Been A Little Bit Hard On Me - Juice Newton\n17: Tainted Love - Soft Cell\n16: Love Is In Control - Donna Summer\n15: You Should Hear How She Talks About You - Melissa Manchester\n14: Take It Away - Paul McCartney\n13: Let It Whip - The Dazz Band\n12: Vacation - Go-Go's\n11: Wasted On The Way - Crosby, Stills And Nash\n10: Don't You Want Me - Human League\n9: Only The Lonely - The Motels\n8: Keep The Fire Burnin' - REO Speedwagon\n7: Even The Nights Are Better - Air Supply\n6: Rosanna - Toto\n5: Hard To Say I'm Sorry - Chicago\n4: Hold Me - Fleetwood Mac\n3: Abracadabra - The Steve Miller Band\n2: Hurts So Good - John Cougar\n1: Eye Of The Tiger - Survivor","torrent":{"xt":"urn:btih:781eed5810d89f655b955589bde60b87f8b4e22d","amp;dn":"American_Top_40_1982_August_7th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"781eed5810d89f655b955589bde60b87f8b4e22d","infoHashBuffer":{"type":"Buffer","data":[120,30,237,88,16,216,159,101,91,149,85,137,189,230,11,135,248,180,226,45]},"announce":[],"urlList":[]}}