{"title":"Project Nemesis (A Kaiju Thriller)","uid":8893876,"size":1307639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7825b97ff740d9af3e6474a48b0a1a924cb70dae&amp;dn=Project+Nemesis+%28A+Kaiju+Thriller%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheRose88","files":1,"time":1378652532,"description":"\nProject Nemesis (A Kaiju Thriller)  (epub)\n\n\nJon Hudson, lead investigator for the Department of Homeland Security's Fusion Center-P, thinks his job is a joke. While other Fusion Centers focus on thwarting terrorist activity, Hudson's division is tasked with handling paranormal threats to national security, of which there have been zero during his years at the DHS. When yet another Sasquatch sighting leads to a research facility disguised as an abandoned Nike missile site in the back woods of Maine, Hudson's job becomes deadly serious.\n\nHudson and the local Sheriff, Ashley Collins, suddenly find themselves on the run from a ruthless ex-Special Forces security team, but the human threat is short-lived as something very much not-human destroys the facility and heads for civilization, leaving only a single clue behind--a name scrawled in blood: Nemesis. Working with his team at Fusion Center-P, Sheriff Collins and a surly helicopter pilot named Woodstock, Hudson pursues the creature known as Nemesis, attempts to uncover the corporate secrets behind its creation and accidental release and tries to comprehend why several clues lead to a murdered little girl named Maigo.\n\nBut as the body-count explodes, along with the monster's size, it quickly becomes clear that nothing short of a full military response can slow Nemesis's progress. Coordinating with every branch of the U.S. military, Hudson simultaneously searches for clues about Nemesis's origins and motivations, and leads the counterattack that will hopefully stop the monster before it reaches Boston and its one million residents.\n\nWitness the birth of a legend as Jeremy Robinson, bestselling author of SecondWorld and Ragnarok, combines the pacing of Matthew Reilly with the mystery of James Rollins and creates the first iconic American Kaiju* story since King Kong. Includes original creature designs by legendary Godzilla artist, Matt Frank.\n\n*Kaiju is Japanese for &quot;strange beast.&quot; The genre includes classic monsters such as Godzilla, Gamera, Mothra, Rodan and King Ghidorah.\n","torrent":{"xt":"urn:btih:7825b97ff740d9af3e6474a48b0a1a924cb70dae","amp;dn":"Project+Nemesis+%28A+Kaiju+Thriller%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7825b97ff740d9af3e6474a48b0a1a924cb70dae","infoHashBuffer":{"type":"Buffer","data":[120,37,185,127,247,64,217,175,62,100,116,164,139,10,26,146,76,183,13,174]},"announce":[],"urlList":[]}}