{"title":"The Steve Jobs Way - Jay Elliot.epub","uid":9024696,"size":330803,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7842047e80e71a80b45001e323383a18b2431787&amp;dn=The+Steve+Jobs+Way+-+Jay+Elliot.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1381344890,"description":"The former Senior Vice President of Apple Computer and close colleague of Steve Jobs's throughout his tenure, Jay Elliot takes listeners on a remarkable tour through Jobs's astonishing career. From the inception of game-changing products like the Apple II and the Macintosh, to his stunning fall from grace, and on to his rebirth at the helm of Apple, his involvement with Pixar, and the development of the iPod, iPhone, iPad, and much more, The Steve Jobs Way presents real-life examples of Jobs's leadership challenges and triumphs, showing readers how to apply these principles to their own lives and careers. Packed with exclusive interviews from key figures in Apple Computer's history, this revealing account provides a rarely seen, intimate glimpse into the Steve Jobs you won't see on stage, thoroughly exploring his management and leadership principles. From product development meetings to design labs, through executive boardroom showdowns to the world outside of Silicon Valley, you will see the real Steve Jobs, the ?Boy Genius? who forever transformed technology and the way we work, play, consume, and communicate ? all through the eyes of someone who worked side by side with Jobs. Fascinating work that both validates the Jobs/Apple mystique while demystifying it at the same time! Great [book] for all of us working to keep our visions married to the details.? ?David Allen, author of the international bestseller Getting Things Done","torrent":{"xt":"urn:btih:7842047e80e71a80b45001e323383a18b2431787","amp;dn":"The+Steve+Jobs+Way+-+Jay+Elliot.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7842047e80e71a80b45001e323383a18b2431787","infoHashBuffer":{"type":"Buffer","data":[120,66,4,126,128,231,26,128,180,80,1,227,35,56,58,24,178,67,23,135]},"announce":[],"urlList":[]}}