{"title":"Sunny Day Real Estate - Diary (1994) [24 bit FLAC] vinyl","uid":8145613,"size":902186330,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:784bbf5cb93aa546d6be5d4276962ec3652be93a&amp;dn=Sunny+Day+Real+Estate+-+Diary+%281994%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"politux","files":-1,"time":1360915318,"description":"  Sunny Day Real Estate - Diary (1994) [24 bit FLAC] vinyl\n\n  Released: 1994\n  Genre: Pop/Rock\n  Style: Emo\n  Codec: FLAC\n  Bit Rate: ~ 3,200 kbps\n  Bits Per Sample: 24\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  Side A\n  \n  01 Seven\n  02 In Circles\n  03 Song About an Angel\n  04 47\n   \n  Side B\n  \n  01 Blankes Were the Stairs\n  02 Pheurton Skeurto\n  03 Shadows\n  04 Sometimes\n\n  Sunny Day Real Estate's debut album, Diary, virtually defined emo in the '90s, laying much of the groundwork (along with Weezer) for the genre's end-of-decade indie prominence. Although emo existed (both as a term and as a style) prior to Diary, it hadn't yet risen out of the deepest hardcore punk underground, save for a few bands on the Dischord label. For all intents and purposes, Diary was the album that made emo accessible, fusing its gnarled guitars and nakedly emotional vocals with more than a hint of melodic Seattle grunge. SDRE's song structures are far more oblique than, for example, the similarly anthemic Pearl Jam, but it's still easy to miss the group's main inspirations if you're not looking for them. Perhaps that's because, at bottom, SDRE don't sound much like their emo predecessors. \n\n  For one, there are plenty of quiet, arpeggiated passages and contrasting dynamics; for another, vocalist Jeremy Enigk is more of a crooner than a screamer at heart, and the underlying tenderness in his voice breathes majesty into the group's slow, languid melodies. Yet, while Diary's true heart lies in its soaring, introspective anthems (like the band's signature song, &quot;In Circles&quot;), the more tortured, visceral moments balance things out, preventing the album from wallowing in melodramatic self-obsession. In retrospect, Diary doesn't quite fulfill all of its ambitions -- there are a few underfocused moments that don't achieve the epic sweep of the album's best compositions. \n\n  That occasional inconsistency makes it feel somewhat less realized than their proggier post-reunion work, especially since Enigk would develop into a far more distinctive vocalist. But even if it isn't quite the top-to-bottom masterpiece its legions of imitators suggest, Diary still ranks as arguably the definitive '90s emo album, and an indispensable introduction to the genre.","torrent":{"xt":"urn:btih:784bbf5cb93aa546d6be5d4276962ec3652be93a","amp;dn":"Sunny+Day+Real+Estate+-+Diary+%281994%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784bbf5cb93aa546d6be5d4276962ec3652be93a","infoHashBuffer":{"type":"Buffer","data":[120,75,191,92,185,58,165,70,214,190,93,66,118,150,46,195,101,43,233,58]},"announce":[],"urlList":[]}}