{"title":"House of Eternity - The Tomb of Nefertari (History Art Ebook).pd","uid":8605136,"size":33624811,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:789b87c8ba7479e6d38389272daa2cbfc59e0652&amp;dn=House+of+Eternity+-+The+Tomb+of+Nefertari+%28History+Art+Ebook%29.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1371998450,"description":"House of Eternity: The Tomb of Nefertari \nPublisher: Getty Publications | ISBN: 0892364157 | edition 1996 | PDF | 120 pages | 32 mb\n\nIf you can't get to Egypt anytime soon, take John McDonald's informative tour of beloved Queen Nefertari's tomb, which has only been open to the public since 1995. The beautifully structured House of Eternity is replete with full-color photographs of the contrasting desert landscape, the elaborate tomb, and the paintings. Included are explanations of the hieroglyphs and artwork, plus interesting snippets from Nefertari's culture. For example, the queen's own status wasn't enough to make her powerful in the afterlife. The magical chapter 17 from the Egyptian Book of the Dead contains a spell that is painted on Nefertari's tomb walls to assure her transformation from playing senet, to becoming a &quot;ba&quot; bird, then finally worshipping a lion-headed god. To ensure success, the spell ends right at the doorway that marks the burial chamber.\nMost souls were believed to experience the judgment of Osiris--not so with Nefertari, whose tomb contains no mention of this trial. In fact, most of the gods seem to be greeting Nefertari and urging her through the many passages to Necropolis, the city of the dead. Although the annexes are not open to the public, McDonald has included a photograph and discussion of the only evidence of Nefertari in mummified form.","torrent":{"xt":"urn:btih:789b87c8ba7479e6d38389272daa2cbfc59e0652","amp;dn":"House+of+Eternity+-+The+Tomb+of+Nefertari+%28History+Art+Ebook%29.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"789b87c8ba7479e6d38389272daa2cbfc59e0652","infoHashBuffer":{"type":"Buffer","data":[120,155,135,200,186,116,121,230,211,131,137,39,45,170,44,191,197,158,6,82]},"announce":[],"urlList":[]}}