{"title":"Thermodynamics and Heat Power, 8th Edition [2014] [PDF]","uid":13295801,"size":10182338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78a3bd855435b13329f989ccf8ca91c163d1f7b4&amp;dn=Thermodynamics+and+Heat+Power%2C+8th+Edition+%5B2014%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"NoctDeath","files":2,"time":1453627874,"description":"Title: Thermodynamics and Heat Power \r\nAuthor: Irving Granet, Maurice Bluestein \r\nFormat: PDF \r\nHardcover: 856 pages \r\nPublisher: CRC Press; 8 edition (November 10, 2014) \r\nLanguage: English \r\nISBN: 9781482238556 \r\n\r\n\r\nBuilding on the last edition, (dedicated to exploring alternatives to coal- and oil-based energy conversion methods and published more than ten years ago), Thermodynamics and Heat Power, Eighth Edition updates the status of existing direct energy conversion methods as described in the previous work. Offering a systems approach to the analysis of energy conversion methods, this text focuses on the fundamentals involved in thermodynamics, and further explores concepts in the areas of ideal gas flow, engine analysis, air conditioning, and heat transfer. It examines energy, heat, and work in relation to thermodynamics, and also explores the properties of temperature and pressures. The book emphasizes practical mechanical systems, and incorporates problems at the end of the chapters to advance the application of the material.\r\n\r\nWhat’s New in the Eighth Edition:\r\n\r\n- An emphasis on a systems approach to problems\r\n- More discussion of the types of heat and of entropy\r\n- Added explanations for understanding pound mass and the mole\r\n- Analysis of steady flow gas processes, replacing the compressible flow section\r\n- The concept of paddle work to illustrate how frictional effects can be analyzed\r\n- A clearer discussion of the psychrometric chart and its usage in analyzing air conditioning systems\r\n- Updates of the status of direct energy conversion systems\r\n- A description of how the cooling tower is utilized in high-rise buildings\r\n- Practical automotive engine analysis\r\n- Expanded Brayton cycle analysis including intercooling, reheat, and regeneration - and their effect on gas turbine efficiency\r\n- A description of fins and how they improve heat transfer rates\r\n- Added illustrative problems and new homework problems\r\n- Availability of a publisher’s website for fluid properties and other reference materials\r\n- Properties of the latest in commercial refrigerants\r\n\r\nThis text presents an understanding of basic concepts on the subject of thermodynamics and is a definitive resource for undergraduate students in engineering programs, most specifically, students studying engineering technology","torrent":{"xt":"urn:btih:78a3bd855435b13329f989ccf8ca91c163d1f7b4","amp;dn":"Thermodynamics+and+Heat+Power%2C+8th+Edition+%5B2014%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78a3bd855435b13329f989ccf8ca91c163d1f7b4","infoHashBuffer":{"type":"Buffer","data":[120,163,189,133,84,53,177,51,41,249,137,204,248,202,145,193,99,209,247,180]},"announce":[],"urlList":[]}}