{"title":"Vandaveer - Divide &amp; Conquer [2009][EAC/FLAC]","uid":10670544,"size":245892487,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:78d94482bd42b2c3f4610be2772db19fc7e890ce&amp;dn=Vandaveer+-+Divide+%26amp%3B+Conquer+%5B2009%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":-1,"time":1406864484,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: Supply and Demand #5\nCountry: USA\nYear: August 25, 2009\nGenre: folk\nFormat:CD,Album\n\n\n\n\n\n01. Divide &amp; Conquer (04:38)\n02. Fistful Of Swoon (04:28)\n03. Resurrection Mary (04:14)\n04. A Mighty Leviathan Of Old (04:44)\n05. Woolgathering (02:39)\n06. Turpentine (04:32)\n07. Before The Great War (03:51)\n08. Long Lost Cause (02:49)\n09. The Sound &amp; The Fury (05:07)\n10. Beverly Cleary's 115th Dream (05:18)\n\n\n\nMark Charles Heidinger, the fellow who records as Vandaveer, is big in France, and it's easy to understand why. His despondent, earthy ditties share a lot with the tradition of French chanson -- luscious melodies, complex poetic lyrics, and a world-weary outlook. The music on Divide &amp; Conquer is mostly acoustic, and even when an electric guitar or Mellotron does float out of the mix, it's played with a subtle hand. There may be elements of rock here, more in the occasional chord progression, but Heidinger's not a rocker, he's a philosopher, and the songs all unfold in their own languid time. It's closer to chamber pop than rock or folk, with Heidinger's lyrical prowess and the lush arrangements creating a heady, melancholy brew. Heidinger's also an exceptional singer, with a unique phrasing that adds another element of mysterious beauty to his songs. Internal rhymes abound and his vocal lines pause in unexpected places, or flow over the music in long, unbroken phrases that weave a hypnotic spell. The songs overflow with images of decay, dissolution, and bewilderment. The rhythm of &quot;Fistful of Swoon&quot; creeps along like a drunken thief, a perfect accompaniment to its tale of a lover falling from grace into oblivion. &quot;Before the Great War&quot; uses a beautiful piano-dominated melody to investigate three generations of a dysfunctional family in three short, perfectly constructed, verses. The title of &quot;Beverly Cleary's 115th Dream&quot; is an obvious reference to &quot;Bob Dylan's 115th Dream,&quot; but it has little relation to the earlier song. The progression is a familiar 1-4-5 turnaround with acoustic piano triplets that echo an early R&amp;B song. The lyrics are sprinkled with borrowed lines from dozens of rock hits, but Heidinger makes them his own with one last song that tries to win the heart of a disinterested lover. &quot;Woolgathering&quot; could be the album's centerpiece; it certainly sums up the overall dreamy, or perhaps nightmarish, aura of the music. The almost archaic term refers to those moments when you're lost in a dream and having trouble coping with reality. A sprightly acoustic guitar and sparse acoustic piano accent this somnambulant meditation on life's uncertainties. Heidinger's language here is subtly dazzling, full of insight, sadness, and dark, disillusioned humor. When this album was originally released in France in early 2009, it drew rave reviews that hailed Heidinger as an amazing new talent haunted by the same downhearted muse that has inspired so many French songwriters. He lives up to his notices on this brilliant collection.","torrent":{"xt":"urn:btih:78d94482bd42b2c3f4610be2772db19fc7e890ce","amp;dn":"Vandaveer+-+Divide+%26amp%3B+Conquer+%5B2009%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78d94482bd42b2c3f4610be2772db19fc7e890ce","infoHashBuffer":{"type":"Buffer","data":[120,217,68,130,189,66,178,195,244,97,11,226,119,45,177,159,199,232,144,206]},"announce":[],"urlList":[]}}