{"title":"Prophet","uid":4597972,"size":531066536,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:792ab4bd86028e32b1a7ce2b32587685cfc1e4f2&amp;dn=Prophet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gilgamesh07","files":31,"time":1230080507,"description":"This torrent contains a fairly comprehensive collection of Rob Liefeld's Prophet.\n\nWithin this torrent are Vol 1,  Vol 2, Vol 3, Prophet and Cable, Prophet and Avengelyne, Prophet and Chapel and the Babewatch issue. This appears to be all of the Prophet titled books that have been scanned as of the November 2008 LIST.\n\nJohn Prophet was also involved in the Extreme Sacrifice storyline as well as a number of other Image based titles. Glory v1 #5 is not included in this torrent, but held the continuation of the story that began in Prophet v2 Annual #1. Because of the intertwining of Image comics coming from Liefeld's various projects and shenanigans for which he is infamous, I elected not to attempt to track all of the appearances of John Prophet, but rather to collect the core books and leave the adventure of tracking down the remaining threads to thos of you who want more of this character.\n\nThis is a Rob Liefeld creation and was subject to all of the benefits and weaknesses that condition tended to bring. Of note are the issues 5-10 of vol 1 and the majority of vol 2 for the Stephen Platt artwork.\n\nThanks go to the scanners and the original sources who shall remain nameless.\n\nPlease seed. Please enjoy.\n","torrent":{"xt":"urn:btih:792ab4bd86028e32b1a7ce2b32587685cfc1e4f2","amp;dn":"Prophet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792ab4bd86028e32b1a7ce2b32587685cfc1e4f2","infoHashBuffer":{"type":"Buffer","data":[121,42,180,189,134,2,142,50,177,167,206,43,50,88,118,133,207,193,228,242]},"announce":[],"urlList":[]}}