{"title":"ZDSimulator-SKIDROW","uid":8554434,"size":756824388,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:79491d4cae5546b741065151cf99dee969162466&amp;dn=ZDSimulator-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1370726781,"description":"\nS  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nZDSimulator (c) Frozenbyte\n\n08-06-2013......Release Date - Protection............Activation\nTrain Simulator....Game Type - Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nHave you ever dreamt about handling a real train? Do you like to travel\nand discover new interesting places and picturesque sceneries from the\nlocomotive's cabin? If so, this simulator is your best bet Here you\nwill have a perfect chance to try yourself as an engine driver of a\nheavy freight train as well as high speed passenger train, go through\nexact copies of Ukrainian and Russian railway routes in the game\nversion of the program that is nowadays used for train operator\ntraining by universities and railroad depots. High level of\nrealisticness and real life contingencies makes ZDSimulator by far the\nmost realistic train simulator. See it for yourself\n\nFeatures:\n\nIf you are new to the train driver duties, beginner difficulty mode\nwill help you start off with on-screen tips and hints. The game doesn't\nrequire any special skills in this mode.\n\nIf you are interested in locomotive's inside mechanism and want to\nunderstand how it works, you will find gear units working and see\nelectric circuit visualization.\n\nIf you have previous experience of starting, driving and handling a\ntrain, &quot;professional&quot; difficulty mode will let you experience different\nand interesting scenarios: you may encounter various malfunctions and\nwill have to troubleshoot them by arranging jumpers and wedging\ncontacts etc. The simulator is highly educational. With its help you\nwill have a perfect chance to widen your knowledge in physics and train\nmechanisms.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy the cracked content from the SKIDROW folder and into the main\ninstall folder and overwrite\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups\n\nascii art by the\ngodlike &amp; terrific duo\nmalodix  irokos\ntitan artdivision\n\n","torrent":{"xt":"urn:btih:79491d4cae5546b741065151cf99dee969162466","amp;dn":"ZDSimulator-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79491d4cae5546b741065151cf99dee969162466","infoHashBuffer":{"type":"Buffer","data":[121,73,29,76,174,85,70,183,65,6,81,81,207,153,222,233,105,22,36,102]},"announce":[],"urlList":[]}}