{"title":"Frank Zappa - Them Or Us TQMP","uid":5145800,"size":530423020,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7a750c503a7f5eb9bceedf66152108818fbdba53&amp;dn=Frank+Zappa+-+Them+Or+Us+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zootallure","files":28,"time":1257254995,"description":"Released in October 1984, Them or Us is Frank Zappa's last studio rock album (unless one counts Thing-Fish). It contains a little of everything for everyone, but most of all it has that cold and dry early-'80s feel that made this and other albums like The Man From Utopia and Frank Zappa Meets the Mothers of Prevention sound dated pretty quickly. The record begins and ends with covers. &quot;The Closer You Are&quot; is one of those '50s R&amp;B tunes the man loved so much. As for the Allman Brothers' &quot;Whippin' Post,&quot; it answered a request from an audience member in Helsinki back in 1974 (go figure). In between one finds the usual offensive lyrics -- the clichÃƒÂ©-ridden &quot;In France,&quot; the sexually explicit &quot;Baby, Take Your Teeth Out.&quot; Crunchy guitars are found in &quot;Ya Hozna&quot; and &quot;Stevie's Spanking&quot; (named after Steve Vai, playing guitar in it, too), arguably one of Zappa's best straightforward rock songs from that period. &quot;Sinister Footwear II&quot; and &quot;Marqueson's Chicken&quot; represent an '80s update of complex instrumental pieces the likes of &quot;RDNZL.&quot; &quot;Planet of My Dreams&quot; salvages a bit from the never-produced stage play Hunchentoot (the scenario of which was incidentally published in a book titled Them or Us released at the same time). Finally, &quot;Be in My Video&quot; mocks David Bowie's hit &quot;Let's Dance&quot; and the MTV generation, still in its infancy stage at the time. It's a high-average mixed bag, especially interesting since the reissue packs two LPs on one CD.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:                      &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\n\t\t\t\t","torrent":{"xt":"urn:btih:7a750c503a7f5eb9bceedf66152108818fbdba53","amp;dn":"Frank+Zappa+-+Them+Or+Us+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a750c503a7f5eb9bceedf66152108818fbdba53","infoHashBuffer":{"type":"Buffer","data":[122,117,12,80,58,127,94,185,188,238,223,102,21,33,8,129,143,189,186,83]},"announce":[],"urlList":[]}}