{"title":"Amplitude USA PS2DVD","uid":4523203,"size":1765736448,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7aa9f6c8a68dc079b6cbe2b64a421d9967f94597&amp;dn=Amplitude+USA+PS2DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"circlensess","files":1,"time":1227248381,"description":"Description \n\nAmplitude allows players to take part in the music and gaming revolution by keeping beat with top named recording artists and gamers around the world in an all-new auditory and visual gaming experience. Building on the critically acclaimed PlayStation 2 title Frequency, Amplitude presents a redesigned interface allowing gamers and music lovers alike the chance to mix and remix songs from a new line-up of bands encompassing many genres including Alternative Rock, Hip-Hop, Heavy Metal and more. \n\nAmplitude will feature songs and video content from David Bowie, Weezer, Garbage, Quarashi, Logan 7 as well as other major recording artists. Surrounded by interactive environments customized to each artist, players will be able to recreate their favorite songs from the ground up by triggering instruments such as drums, bass, vocals and guitars. If played successfully within the four skill levels, players will have the opportunity to then jam along in freestyle mode and create custom remixes of the songs. Focusing on not only the thrill of creating and mixing music, Amplitude also provides a fast-paced competitive dynamic environment encouraging players of all skill levels to challenge each other both locally and on-line. \n\nAs the first online music franchise for PlayStation 2 via the Network Adaptor (Ethernet/Modem) (for PlayStation 2) Amplitude allows players to challenge their friends in multi-player and remix mode. Utilizing full chat capabilities and other unique online features such as a ladder-ranking system and remix repository, players will be able to collaborate together to form an online music community. If a player creates a remix in the online mode, they have the opportunity to be selected as a top remix posted in the online lobby for other players to listen to, enjoy and play. During online gameplay, Amplitude supports both broadband and dial-up users. \n\nThere are more than 20 diverse songs and video content in Amplitude. Starting with one instrument, such as drums, players must hit the appropriate buttons at the right time in order to match the rhythm of the song. Once this instrument is successfully mixed, players can move on to another instrument, such as guitar and continue through all the instruments, performing all instrumental tracks and re-creating the song.","torrent":{"xt":"urn:btih:7aa9f6c8a68dc079b6cbe2b64a421d9967f94597","amp;dn":"Amplitude+USA+PS2DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aa9f6c8a68dc079b6cbe2b64a421d9967f94597","infoHashBuffer":{"type":"Buffer","data":[122,169,246,200,166,141,192,121,182,203,226,182,74,66,29,153,103,249,69,151]},"announce":[],"urlList":[]}}