{"title":"The Defenders Guide For Life's Toughest Questions - Ray Comfort","uid":10386644,"size":12876581,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ada028a36b780c7a822bc75da34dbebe7f0aedd&amp;dn=The+Defenders+Guide+For+Life%27s+Toughest+Questions+-+Ray+Comfort&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1403139644,"description":"The Defenders Guide For Life's Toughest Questions - Ray Comfort\n\nRay Comfort has collected some of the toughest questions people will face in defending their faith, and offers sound biblical responses. Each issue is one that has been raised by genuine atheists. When faced with a world trying to twist and confuse your understanding of biblical truth, could you answer these candid challenges?\n\n-If God exists, why didn't He hill Hitler before he killed six million Jews?\n-The Bible not only condones slavery, it encourages it!\n-Evolution scientifically disproves the Bible.\n-The God of the Old Testament ordered Israel to commit genocide.\n-The Old Testament doesn't even mention Hell. It's mythology, invented by Christianity to rule by fear.\n-How come God never heals amputees?\n\nWith the influx of &quot;new&quot; atheism, multitudes of professing Christian youth are going to college and leaving their faith. This is because they are not equipped to give an answer to every man that asks the reason for believing in a &quot;bronze age book of fables,&quot; especially in the light of what is said to be the &quot;scientific&quot; nature of Darwinian evolution.\n\nThe Internet has given the average skeptic the ability to cut and paste the cream of anti-Christian atheistic arguments, and become an instant Richard Dawkins clone, who can eloquently stump the average believer with seemingly tough questions. However, even the toughest of questions has an answer. This book will place that answer in your hands and confirm to you that the foundation of the Christian faith is as solid as a rock.\n\nAbout the author:\nRay Comfort is the best-selling author of more than 70 books, including, &quot;Hitler, God and the Bible&quot; (the book that sparked the award-winning movie &quot;180&quot;), &quot;You Can Lead an Atheist to Evidence But You Can't Make Him Think&quot;, &quot;Nothing Created Everything&quot; and, &quot;The Evidence Bible.&quot; He also co-hosts a TV program with actor Kirk Cameron, which airs in 123 countries.","torrent":{"xt":"urn:btih:7ada028a36b780c7a822bc75da34dbebe7f0aedd","amp;dn":"The+Defenders+Guide+For+Life%27s+Toughest+Questions+-+Ray+Comfort","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ada028a36b780c7a822bc75da34dbebe7f0aedd","infoHashBuffer":{"type":"Buffer","data":[122,218,2,138,54,183,128,199,168,34,188,117,218,52,219,235,231,240,174,221]},"announce":[],"urlList":[]}}