{"title":"[Coursera] C++ For C Programmers","uid":9382857,"size":3387582150,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7aea05421ba77b00714e9863edd749c2e1c716eb&amp;dn=%5BCoursera%5D+C%2B%2B+For+C+Programmers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clutton","files":-1,"time":1387739079,"description":"About the Course\nThe course provides an overview of C++ for the experienced C programmer. You will learn how C++ is more powerful than C. The C++ STL library will be featured. This library allows C++ programmers to code generically, efficiently and at a high level. You will learn how to write basic graph algorithms such as the shortest path algorithm. You'll then put this skill to use in a programming assignment aimed at producing an intelligent hex player.\n\nRecommended Background\nOne year of experience in programming with C or a similar programming language is required. You should have a basic familiarity with implementing standard CS algorithms, especially graph algorithms, such as the shortest path algorithm. Some object-oriented software development is also desirable. These topics are typically taught in a first year computer science curriculum.\nSuggested Readings\n\nAlthough the lectures are designed to be self-contained, a serious C++ programmer will need access to reference materials. The Wikipedia C++ article is a good place to start. The course is based on the instructor's text: C++ for C Programmers: 3rd Edition.\n\nCourse Format\nThe course consists of lecture videos ranging from 5 and 18 minutes in length. Each of these videos includes one or two integrated quiz questions. There will be programming assignments and a final exam.","torrent":{"xt":"urn:btih:7aea05421ba77b00714e9863edd749c2e1c716eb","amp;dn":"%5BCoursera%5D+C%2B%2B+For+C+Programmers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7aea05421ba77b00714e9863edd749c2e1c716eb","infoHashBuffer":{"type":"Buffer","data":[122,234,5,66,27,167,123,0,113,78,152,99,237,215,73,194,225,199,22,235]},"announce":[],"urlList":[]}}