{"title":"Irene Huss (NLsubs)(DVD 3 v 3  ) TBS B-SAM","uid":6955441,"size":4636336143,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7b0d21589a7a43ee787c353adff310c1255ccf70&amp;dn=Irene+Huss+%28NLsubs%29%28DVD+3+v+3++%29+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"Mad_Parrot","files":-1,"time":1326560056,"description":"Irene Huss dvd 3 (3 van 3)  \n\nIrene Huss - GlasdjÃƒÂ¤vulen  en  Irene Huss - GlasdjÃƒÂ¤vulen\n\n\n\n\n\nNederlands:\n\nNieuwe uiterst spannende Zweedse crimeserie, gebaseerd op de boeken van Helene Tursten. \nIrene Huss wordt de vrouwelijke tegenhanger van Kurt Wallander genoemd, de hoofdpersoon in de misdaadromans van Henning Mankell. \nHuss is een veertigjarige inspecteur, ze is gelukkig getrouwd, heeft een zwarte band in jiu-jitsu en werkt al heel wat jaren bij de politie. \nToch komt ze nog altijd collega\\'s tegen die niet zo blij zijn met vrouwen bij het corps. \n\n\nIrene Huss - GlasdjÃƒÂ¤vulen:\n\nIn een klein dorp in de buurt van Gotheborg, worden drie leden van de familie Schytelius in hun woningen vermoord. \nHet bloed van de slachtoffers wordt gebruikt om daarmee omgekeerde pentagrammen op muren aan te brengen. \nHet rechercheteam ontdekt al snel dat een omgekeerd pentagram het gezicht van Satan symboliseerd.\nIrene Huss ontdekt dat Sten Schytelius, een dominee, samen met zijn familie geprobeerd heeft onderzoek te doen naar een breed vertakte satanistische beweging. \nIrene volgt het spoor maar ligt de oplossing ook echt bij een culte ? \nEn gaan alleen de gelovigen naar de kerk ?\n\n\n\n\nIrene Huss - Guldkalven:\n\nEr wordt een man dood gevonden in de kofferbak van een auto. \nAan de ene hand zijn vier vingers afgesneden. \nDe man was een partner in een online poker bedrijf dat zich zeer snel ontwikkeld had tot een multi-miljoenen bedrijf dat vervolgens failliet ging. \nKort na de ontdekking wordt een andere partner vermoord. \nDe derde en laatste aandeelhouder, Sanna, is nog in leven, maar leeft nu onder constante bedreiging.\nDe politie vindt drie van het eerste slachtoffer afgesneden vingers, maar waar is de vierde vinger en wie zal deze verstuurd krijgen? Waarom worden er zowieso vingers afgesneden? \nHet onderzoek leidt Irene Huss tot een voor haar onbekende wereld van dure luxe auto\\\\\\'s en prachtige villa\\\\\\'s in exclusieve locaties waar de Russische kaviaar gemeengoed is en de champagne voortdurend stroomt. \nAlsof het allemaal nog niet genoeg is raakt Irene er tijdens een vlucht in een prive-vliegtuig van overtuigd dat haar man Krister een affaire heeft.\n\n\n\n\n\nEngels:\n\nIrene Huss - GlasdjÃƒÂ¤vulen:\n\nOne morning in May: In Goteborg is wrapped in plastic found a corpse washed up, a horribly maimed body.\nWho is the victim of a sick crime.\nThe only trace is a special and exotic tattoo on the shoulder.\nThis clue leads Inspector Irene Huss to Copenhagen two years ago under similar circumstances a prostitute was brought to life.\nIf there are more murders occur following one event to another and the young Huss stands for riddles. The bloody trail of the serial killer Huss brings a world of lies and false promises.\nStuck in the research she believes the killer, like a shadow, has lifted his heels and remain forever out of reach.\n\n\nIrene Huss - Guldkalven:\n\nAn online poker company promises fame and fortune. When the bubble bursts, it is not only the dream of big money that bites the dust: \nthree separate men are all brutally executed in one of Gothenburg\\'s most fashionable areas. At first, they appear to have nothing in common. \nThe complex investigation of the three dead men immerses Irene Huss and her colleagues into a world of expensive cars, fancy homes, lies and deceit. \nMeanwhile, the otherwise peaceful atmosphere of the Huss family is disturbed by marital tension as Irene suspects her husband Krister of \na having an affair with a younger woman. \n\n\n   \n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Zweeds\nExtra\\'s       : Ja , trailers\nOndertitels   : Nederlands (instelbaar)\nCover &amp; label : Beperkt\nGenre         : Action Crime\n\n &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/irene-huss/1002004006495489/index.html&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1251732/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1251732/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1251733/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1251733/&lt;/a&gt;\n\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\n\nhttp:black-sam.org","torrent":{"xt":"urn:btih:7b0d21589a7a43ee787c353adff310c1255ccf70","amp;dn":"Irene+Huss+%28NLsubs%29%28DVD+3+v+3++%29+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b0d21589a7a43ee787c353adff310c1255ccf70","infoHashBuffer":{"type":"Buffer","data":[123,13,33,88,154,122,67,238,120,124,53,58,223,243,16,193,37,92,207,112]},"announce":[],"urlList":[]}}