{"title":"We Live in Public","uid":5426868,"size":1150836402,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bd2a5620b420f09a82733fbb0eedd72ec55166d&amp;dn=We+Live+in+Public&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SummerJam","files":-1,"time":1268285527,"description":"On the 40th anniversary of the Internet, WE LIVE IN PUBLIC tells the story of the effect the web is having on our society as seen through the eyes of &quot;the greatest Internet pioneer you've never heard of&quot;, visionary Josh Harris. Award-winning director, Ondi Timoner (&quot;DIG!&quot;), documented his tumultuous life for more than a decade, to create a riveting, cautionary tale of what to expect as the virtual world inevitably takes control of our lives. Josh Harris, often called the &quot;Warhol of the Web&quot; through the infamous dot.com boom of the 1990's, founded Pseudo.com, the first Internet television network and created his vision of the future, an underground bunker in NYC where 100 people lived together on camera for 30 days over the millennium. He proved how in the not-so-distant future of life online, we will willingly trade our privacy for the connection and recognition we all deeply desire. Through his experiments, including a six-month stint living under 24-hour live surveillance online which led him to mental collapse, he demonstrated the price we will all pay for living in public.\n\n\n\n\nEDIT: If anyone noticed, I accidentally spelled the title &quot;We Live in Pubic&quot;. Fixd","torrent":{"xt":"urn:btih:7bd2a5620b420f09a82733fbb0eedd72ec55166d","amp;dn":"We+Live+in+Public","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bd2a5620b420f09a82733fbb0eedd72ec55166d","infoHashBuffer":{"type":"Buffer","data":[123,210,165,98,11,66,15,9,168,39,51,251,176,238,221,114,236,85,22,109]},"announce":[],"urlList":[]}}