{"title":"Frank Wess - 1956 - North, South, East... Wess &amp; No Count (2","uid":9222346,"size":346684157,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7beaf9a53593f07c79d3a9e23329af62b7b9f897&amp;dn=Frank+Wess+-+1956+-+North%2C+South%2C+East...+Wess+%26amp%3B+No+Count+%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1384959230,"description":"Frank Wess - 1956 - North, South, East... Wess &amp; No Count (2012)\n\nThis easygoing swing date is essentially a small group drawn from the Count Basie band of the day. The two tenors, Wess and Frank Foster, and two trombones, Bennie Powell and Henry Coker, all from the Count's band, keep the sound comfortably cruising near the middle register.\nKenny Burrell is on the date as the only chordal instrument, contributing flowing chord selections when comping and clean, tasty choruses for his solos. Savoy house drummer Kenny Clarke and Basie bassist Eddie Jones complete rhythm section. On tenor, Wess and Foster are eminently capable, but, on these performances, there isn't a lot to differentiate one from the other. The same can be said for the trombonists. The best moments come when Wess switches to flute, the instrument on which he does have a distinctive and appealing musical personality.\nThe other high points are Burrell's, both as accompanist and in his brief solo spots. Both he and the leader, however, can be heard together to better effect on other Savoy dates, notably Wess' bright and airy chamber jazz date Opus in Swing, and the Frank Foster-led No Count, which features the same group as on North, South, East...Wess. (AllMusic - North, South, East...Wess)\n\nNo Freddie Green either, but that's okay; the four horns carved out from the Count Basie band for this Frank Foster-led date get along just fine with drummer Kenny Clarke, bassist Eddie Jones, and guitarist Kenny Burrell. The set is a companion to Frank Wess' North, South, East...Wess, recorded by the same players at the same sessions. No Count, however, stays closer to Kansas City swing than the Wess release, which attempted, not altogether successfully, to update the sound with some nods to hard bop. Foster's charts provide for lots of interplay and counterpoint between the two trombones and two tenors. This gets around the potential for the similar ranges of the horns to bog down in tonal homogeneity. The natural, yet sophisticated, blues-based swing players spin out long, masterful lines. Trombonists Henry Coker and Bennie Powell are most effective in supporting roles. The rhythm section is what makes this date, though. The poised Clarke balances the blues feeling of the arrangements with a cool bopping, cymbal-driven pulse. Jones, too, is effective, even if he is a bit far down in the mix. Then there's Burrell, who pretty much steals the show, covering for the absent Count and Basie guitarist Freddie Green with some of the finest rhythm work to be heard anywhere. Ã€ la the Count, he also takes the occasional brief but impressive solo. (AllMusic - No Count)\n\nTrack list:\nNorth, South, East...Wess\n01 - What'd Ya Say\n02 - Dill Pickles\n03 - Dancing on the Celling\n04 - Hard Sock Dance\n05 - Salvation\n06 - Lazy Sal\nNo Count\n07 - Stop Gap\n08 - Excursion\n09 - Casa de Marcel\n10 - Apron Strings\n11 - Alternative\n12 - Serenata\n\nPersonnel:\nBenny Powell, Henry Coker (tb)\nFrank Wess (ts, fl)\nFrank Foster (ts)\nKenny Burrell (g)\nEddie Jones (b)\nKenny Clarke (d)\n\nEmjoy and share!","torrent":{"xt":"urn:btih:7beaf9a53593f07c79d3a9e23329af62b7b9f897","amp;dn":"Frank+Wess+-+1956+-+North%2C+South%2C+East...+Wess+%26amp%3B+No+Count+%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7beaf9a53593f07c79d3a9e23329af62b7b9f897","infoHashBuffer":{"type":"Buffer","data":[123,234,249,165,53,147,240,124,121,211,169,226,51,41,175,98,183,185,248,151]},"announce":[],"urlList":[]}}