{"title":"Family Guy S010E21 HDTV Nl subs DutchReleaseTeam","uid":7340751,"size":223421801,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7c637db2b23f4e2942e7c903a50c689c58548567&amp;dn=Family+Guy+S010E21+HDTV+Nl+subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Koedje","files":-1,"time":1339235557,"description":" &lt;a href=&quot;http://img163.imageshack.us/img163/1131/familyguyr.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img163.imageshack.us/img163/1131/familyguyr.gif&lt;/a&gt;\n\n\nPlot:\n\nDe animatieserie over een gestoorde familie met een vader die het wel probeert maar er niet in slaagt om enige stuctuur en regelmaat in zijn eigen leven en dat van zijn familie te scheppen. Niets is te gek. Er gebeurt altijd van alles in de familie van vader Peter Griffin. Maar het is voornamelijk chaos en wanorde die heersen. De jongste van de drie kinderen in de familie, Stewie, is een duivels mannetje die een moordaanslag niet uit de weg gaat als ie zijn zin niet krijgt. De hond Brian mengt zich in de conversaties want hij kan praten, rookt sigaretjes en drinkt een martini op zijn tijd. En moeder is de enige stabiele factor in het gezin en daarom vaak het middelpunt van spot en grappen. Eigenlijk heeft Family Guy geen vaste verhaallijn behalve dat er altijd bizarre en enorm lachwekkende situaties zijn. Die doorgaans beginnen met een mooi plan van vader Peter wat bijna altijd desastreus uitpakt voor hem en zijn familie. Family Guy is inmiddels een klassieke comedy serie die elke keer weer verrast met bizarre wendingen en de meest originele grappen.\n\n\nVertaald door het DRT Vertaalteam;\nJules71\n\n\n\nSeizoen 10 Aflevering 21: Tea Peter\n\nPeter joins the Tea Party and campaigns to shut down Quahog's municipal government after his illegal business is shut down. His campaign succeeds, but it's his tycoon father-in-law, Carter Pewterschmidt, who reaps the benefits.\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be/\n\n\nFollow me on #Twitter @Koedje\n\n\nDutchReleaseteam = Hardcoded Dutch Subs\n","torrent":{"xt":"urn:btih:7c637db2b23f4e2942e7c903a50c689c58548567","amp;dn":"Family+Guy+S010E21+HDTV+Nl+subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c637db2b23f4e2942e7c903a50c689c58548567","infoHashBuffer":{"type":"Buffer","data":[124,99,125,178,178,63,78,41,66,231,201,3,165,12,104,156,88,84,133,103]},"announce":[],"urlList":[]}}