{"title":"X-MEN X-Cutioner's Song and CABLE Fathers and Sons COMPLETE","uid":7883194,"size":367198231,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7d4edbbb64cdc221e6aac343660e103b0ad29447&amp;dn=X-MEN+X-Cutioner%27s+Song+and+CABLE+Fathers+and+Sons+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1354547412,"description":"X-CUTIONER'S SONG was the Fall 1992 crossover between Marvel's top-selling titles UNCANNY X-MEN, X-FACTOR, X-FORCE and X-MEN. Conceived in the wake of the Image Comics founders leaving Marvel, this crossover was make-it or break-it for X-editor Bob Harras. Harras had forced writers Chris Claremont and Louise Simonson off the books to keep artists Jim Lee and Rob Liefeld happy, only to have them ditch Bob's ass in '92. LOL.\n\nPersonally I think X-Cutioner's Song isn't half-bad, although some people will tell you it sucks. Bob's new X-writers Fabian Nicieza and Scott Lobdell (alongside Peter David) put a lot of effort into it, and it features some good art from Jae Lee, Greg Capullo and others. It sold like crazy, but back then you could put a turd in a polybag with a trading card and collectors would buy two.\n\nThis torrent features the original trade paperback with the 12-part X-Cutioner's Song story. I've also included the official epilogue Uncanny X-Men #297, the unofficial epilogue X-Force #19 (with the infamous Cannonball-Xavier &quot;open hand, closed fist&quot; confrontation), and the follow-up storyline FATHERS &amp; SONS from the CABLE ongoing series -- about a year later, it revealed the truth about Cyclops and Madelyne's son Nathan Christopher Summers. Finally this torrent has the STRYFE'S STRIKE FILE one-shot, even though the scanner for some damn reason chose not to scan the cover. (I've searched high and low but it's the only version online.)\n\n------\n\nA story preview from Wikipedia:\n\nMutant pop-star Lila Cheney organizes a free concert in Central Park to promote diversity in society and invites Professor Charles Xavier to speak at the concert. His speech is interrupted by Stryfe who, disguised as his doppelganger and arch-nemesis Cable, shoots Xavier with a bullet that infects the professor with a lethal strain of the Techno-organic virus.\n\nMeanwhile, War and Famine, the Horsemen of Apocalypse, attack Iceman and Colossus, distracting them from Caliban, who kidnaps Cyclops and Jean Grey. The Horsemen are working for Mr. Sinister, who is impersonating the Horsemen's former master Apocalypse. Mr. Sinister organized the kidnapping as part of his newly formed alliance with Stryfe. Stryfe trades Mr. Sinister a canister containing the past and future Summers family DNA history, and receives Jean Grey and Cyclops in the exchange.\n\nWhile Xavier is rushed to the hospital, X-Factor and the Blue X-Men Strike Force go after X-Force, Cable's team of mutants formerly known as the New Mutants. X-Force, however, is in the dark about Cable's current location (having been separated from him during a S.H.I.E.L.D.-organized raid of their headquarters). But tension caused by their association with Cable causes the two groups to attack and ultimately capture X-Force ...","torrent":{"xt":"urn:btih:7d4edbbb64cdc221e6aac343660e103b0ad29447","amp;dn":"X-MEN+X-Cutioner%27s+Song+and+CABLE+Fathers+and+Sons+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d4edbbb64cdc221e6aac343660e103b0ad29447","infoHashBuffer":{"type":"Buffer","data":[125,78,219,187,100,205,194,33,230,170,195,67,102,14,16,59,10,210,148,71]},"announce":[],"urlList":[]}}