{"title":"From.Darkness--BBC--468p","uid":12635062,"size":2624894181,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7dcef60279ad4c2d78bae66dcb1e5a0119fc5c4a&amp;dn=From.Darkness--BBC--468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"uggauga","files":8,"time":1445913328,"description":"From Darkness\r\n\r\nPsychological crime drama. An ex-constable hiding from the guilt of her past is slowly drawn back to confront her darkness.\r\n\r\n4 Episodes\r\n_____________________________\r\n\r\nMore info: http://www.bbc.co.uk/programmes/b06h7yy4\r\n\r\n832x468 resolution, with subtitles - enjoy !\r\n\r\n_____________________________\r\n\r\nEpisode descriptions below contain some spoilers...\r\n\r\nFrom Darkness\r\nEpisode 1\r\n\r\nEx-constable Claire Church has fled her dark past by escaping to the remote Western Isles with her partner, Norrie. But no matter how far she runs, she can't escape the shadows cast by her history, and as decades-old bodies are unearthed on a Manchester building site, the darkness threatens to fracture her life once more.\r\nDCI John Hind immediately suspects the bodies are connected to a case that dates back to 1998: women who were reported missing, but who few cared about... apart from his former protege, Claire. Harassed by his own impending misconduct investigation, Hind realises there's only one option available - he must reconnect with Claire.\r\nJohn's reappearance in her life rocks Claire, immediately threatening the seemingly idyllic, but fragile, life she's built with her devoted family. Desperate, John appeals to Claire's conscience and sense of guilt to help him catch the killer. But is John there to win justice, or Claire?\r\nTorn between her desire to help those women she believed she failed all those years ago, and a fear of the darkness that once engulfed her, Claire must choose a path. All she really wants is peace, but with the past bleeding irreversibly into the present, Claire can't hide any longer - especially when a new body is discovered carrying a message for her future.\r\n\r\n\r\nFrom Darkness\r\nEpisode 2\r\n\r\nThe discovery of a new victim carries a haunting message for Claire - her old shoulder number left on the body. It can't be dismissed as coincidence - someone wants Claire's attention, and she can't run any longer. When she returns to Manchester to work alongside John, he is invigorated by Claire's presence, desperate to use the investigation to reignite old flames - but not everyone is so happy. Norrie, already feeling Claire slipping away from him, tries to persuade her to return home, but Claire insists that she can't, and as they argue more secrets from Claire's past emerge.\r\nAs Claire is drawn into the task of identifying the bodies, her desire for justice supersedes her fear of violence. She strives to persuade the Fenton family to help identify their daughter Mimi, one of the possible victims. But when John wants her to accompany him to see the bodies, Claire refuses: she's not ready. Eventually, as tensions rise between them, the personal and professional collide for John and Claire. New clues about a women's clinic are unveiled, and John is left derailed by Claire's confession that she may once have been pregnant with his baby. John is fraught, wanting to know more, but Claire stonewalls him, instead finally agreeing to see the latest victim's body and confront the violence.\r\nAt the morgue, Claire has a revelation: there are differences between the new victim and the bodies from the 90s. She deduces that there are two killers - one from then, and one now. John, however, dismisses Claire's theory as overemotional and unfounded, and Claire finds herself ignored once again. Determined to fight for the women she let down, Claire plunges more recklessly into the case, only realising too late that her own life is directly threatened too.\r\n\r\nFrom Darkness\r\nEpisode 3\r\nA direct threat on Claire's life pushes her uncomfortably close to John, sending her fleeing to the Western Isles. Convinced she's being watched, Claire finds she can't outrun the darkness this time as Norrie, frightened for his daughter's safety, banishes Claire back to Manchester. To win her family back, Claire must solve the murders and trap her tormentor.\r\nJohn also faces mounting pressure to crack the case, as ambitious DSI Lola Keir dangles his pending misconduct investigation over him. She needs a clean arrest based on hard evidence; with Claire's reliability in question, John must dismiss her theory of a new killer and play by Lola's rules.\r\nSidelined from the investigation, Claire attempts to get inside her stalker's mind. Her frenzied investigations lead her straight to into her target's path, igniting a dangerous line of communication that severely tests Claire's loyalties and professionalism. When a high-profile prime suspect re-emerges, Claire repeats a fatal mistake when she makes a promise she can't keep.\r\nDetermined to end the violence, Claire entices John into a reckless mission that could cost them much more than his career. She believes it's a risk worth taking. But the explosive consequences of their rebellion threaten to launch a fresh wave of terror, and to drive the pair apart forever.\r\n\r\n\r\nFrom Darkness\r\nEpisode 4\r\nClaire's confession about their lost child sends John reeling, and both crumble in the aftermath of a disastrous attempt to nail the prime suspect. When John is suspended from duty, Claire with her direct connection to one of the killers must put aside her guilt and fight to prevent another murder.\r\nUnder intense media pressure, DSI Lola Keir takes the reins of the investigation and orders the team to take her back to square one, with a full list of potential suspects, now including Claire's tormentor, Lucy Maxley, a former student who survived an attack by the original culprit, and whose cries for help went unheard at the time. Now, Claire must exploit Lucy's obsession with her in order to try to stop the killing, but at what personal cost?\r\nClaire's betrayal enrages Lucy, forcing Claire to lead a desperate operation to rescue her own fractured family. She emerges tougher, newly determined to end the violence by finally snaring the 1998 killer. But as Claire makes a daring breakthrough, Lucy closes in on a new and unexpected target.\r\nJohn risks professional annihilation to get to Lucy before she kills again, his feelings for Claire intensifying even as events keep them apart. As each races to catch a killer, they uncover the dark secrets at the heart of the murderers' brutality. But they may be too late to prevent another tragedy.\r\nFor Claire, the final confrontation will test her emotions beyond anything she's endured so far. As she finally confronts her own role in the crimes, will she finally put an end to the darkness or has the true horror only just begun?","torrent":{"xt":"urn:btih:7dcef60279ad4c2d78bae66dcb1e5a0119fc5c4a","amp;dn":"From.Darkness--BBC--468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dcef60279ad4c2d78bae66dcb1e5a0119fc5c4a","infoHashBuffer":{"type":"Buffer","data":[125,206,246,2,121,173,76,45,120,186,230,109,203,30,90,1,25,252,92,74]},"announce":[],"urlList":[]}}