{"title":"Madonna - Angel","uid":8788691,"size":52425079,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7ec139763d8460e64007a4f3de735efb30b8960e&amp;dn=Madonna+-+Angel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"fiveofseven","files":1,"time":1375887651,"description":"(Quality is what it is. This rare video is a Web Rip)\n\n&quot;Angel&quot; is a song by American singer-songwriter Madonna from her second studio album Like a Virgin. It was released on April 10, 1985 by Sire Records as the third single from the album. Written by Steve Bray and Madonna, it was one of the first songs developed for the project and, according to Madonna, was inspired by a girl who is saved by an angel, and she falls in love with Him. &quot;Angel&quot; was released as a 12&quot; single with &quot;Into the Groove&quot; in some countries and charted likewise. A music video was initially planned for the release, but was later cancelled. Instead a promotional video comprising clips from her previous videos was released in the United Kingdom.\n\nMusically &quot;Angel&quot; consists of three chord ascending hook, which serves for the verse and chorus. It has vocal harmonies beneath the main chorus and the lyrics repeat the angel-like image of Madonna's saviour. Critics gave mixed review of the song, with one group denoting it as a classic while the others felt it was sub-par compared to the other Madonna singles. &quot;Angel&quot; became Madonna's fifth consecutive top-five single on the Billboard Hot 100 and reached the top of its dance charts. It was also able to reach number-one in Australia and the top-five of the charts in Canada, Ireland, Japan, New Zealand, Spain and the United Kingdom. Madonna has performed the song only once, on her Virgin Tour in 1985.\n\n\n\nFile Name:\nMadonna Angel\n\nFile Format:\nmp4\n\nDuration:\n00:02:30\n\nBit Rate:\n2785k\n\nFile Size:\n50.00 MB\n\nVideo Codec:\nh264\n\nVideo Bitrate:\n2656k\n\nVideo Size:\n720x528\n\nAspect Ratio:\n1.36:1\n\nFrame Rate:\n23.98fps\n\nAudio Codec:\nmp3\n\nAudio Bitrate:\n128k\n\nChannels:\n2\n\nSample Rate:\n48000","torrent":{"xt":"urn:btih:7ec139763d8460e64007a4f3de735efb30b8960e","amp;dn":"Madonna+-+Angel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ec139763d8460e64007a4f3de735efb30b8960e","infoHashBuffer":{"type":"Buffer","data":[126,193,57,118,61,132,96,230,64,7,164,243,222,115,94,251,48,184,150,14]},"announce":[],"urlList":[]}}