{"title":"port25.PowerMTA-Management.Console-1.5r3","uid":13959603,"size":615067937,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:7ede950dd019fc1eb8fcb910422dbb3041e0fc04&amp;dn=port25.PowerMTA-Management.Console-1.5r3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TETBOM","files":14,"time":1458572765,"description":"Quality Release by : ricochet:powermta45tetbom\r\n\r\nFor contact, download ricochet.im and click +\r\n\r\nThe PowerMTA Management Console (PMC), a web-based smtp, is a major feature in the extensive release of PowerMTA v4.5. The PMC is a feature-rich option for PowerMTA which integrates with PowerMTA v4.0 and later. The PowerMTA Management Console acts as a sophisticated command center for reporting, monitoring and configuring multiple PowerMTA nodes. The interface features four main navigation tabs:\r\n\r\nBy distributing the workload across multiple instances of PowerMTA Server, and applying configuration settings from a single interface, you simplify the operation of the entire node group. Centralized control of performance parameters permits you to efficiently identify threats, dynamic blocks, and enhance platform reliability. This type of improved management enables PowerMTA to drastically improve deliverability, preserve IP reputation and mitigate real-time performance problems.\r\n\r\nWhile extensive modifications have been made within PowerMTA to interact with the PMC, the PMC is not part of the PowerMTA server software, nor is it included within the PowerMTA builds. As distinct software with its own architectural considerations, the PMC software must be downloaded and installed separately, requiring a separate license activation key (LAK). Installing PowerMTA v4.5 by itself will not allow access to the PowerMTA Management Console.\r\n\r\nThe PowerMTA Management Console has specialized accounting files from PowerMTA? servers, and pulls them into the database for pre-processing. During this time many of the reports are pre-calculated to allow faster access from the web interface. The communication to and from PowerMTA is done over SSL using the configured PowerMTA web monitor port. Approximately 10 nodes processing 1M messages per hour can be concurrently registered to a PowerMTA Management Console if deployed on hardware meeting the recommended performance specifications","torrent":{"xt":"urn:btih:7ede950dd019fc1eb8fcb910422dbb3041e0fc04","amp;dn":"port25.PowerMTA-Management.Console-1.5r3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ede950dd019fc1eb8fcb910422dbb3041e0fc04","infoHashBuffer":{"type":"Buffer","data":[126,222,149,13,208,25,252,30,184,252,185,16,66,45,187,48,65,224,252,4]},"announce":[],"urlList":[]}}