{"title":"Tinsley Ellis - 14 albums FLAC","uid":10988234,"size":5118989213,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7f9442d3fd520cf76e8c6ad7be6d0afb0e923da0&amp;dn=Tinsley+Ellis+-+14+albums+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1409952680,"description":"Tinsley Ellis - 14 albums FLAC\n\nA hard-rocking, high-voltage blues guitarist most often compared to Stevie Ray Vaughan, Tinsley Ellis is hardly one of the legions of imitators that comparison might imply. Schooled in a variety of Southern musical styles, Ellis draws not only from fiery Vaughan-style blues-rock, but also Texas bluesmen like Freddie King and Clarence &quot;Gatemouth&quot; Brown, the soulful blues of B.B. King, the funky grit of Memphis soul, and numerous other electric bluesmen. Ellis has been praised in many quarters for the relentless, storming intensity of his sound, and criticized in others for his relative lack of pacing and dynamic contrast (he's also been dubbed a much stronger guitarist than vocalist). Yet no matter which side of the fence one falls on, it's generally acknowledged that Ellis remains a formidable instrumentalist and a genuine student of the blues.\nEllis was born in Atlanta in 1957, and spent most of his childhood in southern Florida. He began playing guitar in elementary school, first discovering the blues through the flagship bands of the British blues boom: John Mayall &amp; the Bluesbreakers, the Peter Green-led Fleetwood Mac, the Yardbirds, the Rolling Stones, and so on. He soon moved on to a wide variety of original sources, becoming especially fond of B.B. King and Freddie King. After high school, Ellis moved back to Atlanta in 1975 to attend Emory University, and soon found work on the local music scene, joining a bar band called the Alley Cats (which also featured future Fabulous Thunderbird Preston Hubbard). In 1981, Ellis co-founded The Heartfixers with singer/harmonica player Chicago Bob Nelson, and they recorded an eponymous debut album for the tiny Southland imprint. They soon signed with the slightly larger Landslide and issued Live at the Moon Shadow in 1983, by which point they were one of the most popular live blues acts in the South. However, Nelson left the group shortly after the album's release, and Ellis took over lead vocal chores.\nThe Heartfixers' first project in their new incarnation was backing up blues shouter Nappy Brown on his well-received 1984 comeback album Tore Up. Ellis debuted his vocals on record on The Heartfixers' 1986 LP Cool on It, which brought him to the attention of Alligator Records. Ellis left The Heartfixers to sign with Alligator as a solo artist in 1988, and they picked up his solo debut Georgia Blue for distribution. The album helped make Ellis a fixture on the blues circuit, and he toured heavily behind it, establishing a hard-working pattern he would follow for most of his career. The follow-up, Fanning the Flames, appeared in 1989 and explored similar territory. Released in 1992, Trouble Time helped land Ellis on album rock radio thanks to the track &quot;Highwayman,&quot; but it was 1994's Storm Warning that really broke Ellis to a wider blues-rock audience, earning more media attention than any of his previous recordings; additionally, guitar prodigy Jonny Lang later covered Ellis' &quot;A Quitter Never Wins&quot; on Lie to Me.\nFor 1997's Fire It Up, Ellis worked with legendary blues-rock producer Tom Dowd (the Allman Brothers, Derek &amp; the Dominos), as well as Booker T. &amp; the MG's bassist Donald &quot;Duck&quot; Dunn. Ellis subsequently left Alligator and signed with Capricorn; unfortunately, shortly after the release of 2000's Kingpin, Capricorn went bankrupt, leaving the album high and dry. Still, Ellis soon caught on with Telarc, releasing his initial disc Hell or High Water on the label in 2002, followed by The Hard Way in 2004. One year later, Ellis was back with Alligator, putting out the live set Live! Highwayman and 2007's Moment of Truth, the first studio album to contain original material since Hell or High Water. Ellis toured relentlessly behind the album, and reentered the studio in early 2009. Speak No Evil was released that October, but it would be another three and a half years before he issued another studio album, with Ellis choosing to focus on live performance for the intervening period.\nWhen the all-instrumental Get It! did arrive in March 2013, it contained tributes to a number of his blues guitar heroes such as Freddie King, Bo Diddley, and Albert Collins. Before the end of the year he had also prepared another album with the same lineup as the Get It! sessions: Kevin McKendree on keyboards, Lynn Williams on drums, and Ted Pecchio on bass. Midnight Blue was released in January of 2014. (AllMusic)\n\nAlbum list:\n1986 - Cool On It (1991)\n1988 - Georgia Blue\n1989 - Fanning The Flames\n1992 - Trouble Time\n1994 - Storm Warning\n1997 - Fire It Up\n2000 - Kingpin\n2002 - Hell Or High Water\n2004 - The Hard Way\n2005 - Live! Highwayman\n2007 - Moment Of Truth\n2009 - Speak No Evil\n2013 - Get It!\n2014 - Midnight Blue\n\nEnjoy and share!","torrent":{"xt":"urn:btih:7f9442d3fd520cf76e8c6ad7be6d0afb0e923da0","amp;dn":"Tinsley+Ellis+-+14+albums+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9442d3fd520cf76e8c6ad7be6d0afb0e923da0","infoHashBuffer":{"type":"Buffer","data":[127,148,66,211,253,82,12,247,110,140,106,215,190,109,10,251,14,146,61,160]},"announce":[],"urlList":[]}}