{"title":"The Finite Element Method with Heat Transfer and Fluid Mechanics","uid":13831362,"size":14790120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fd98f60c9c103e5622a5c6a9d689fd392adc490&amp;dn=The+Finite+Element+Method+with+Heat+Transfer+and+Fluid+Mechanics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1457738598,"description":"The Finite Element Method with Heat Transfer and Fluid Mechanics Applications - Erian A. Baskharone (Cambridge, 2014).pdf\r\n\r\nISBN: 9781107039810\r\n\r\nThis book is intended for advanced undergraduate and graduate students. The first four chapters are devoted to the introduction of the finite element concept. The focus of the book then covers two essential areas - heat transfer and fluid mechanics: topics with different finite element formulations. The heat transfer applications begin with the classical one-dimensional thin-rod problem, followed by a discussion of the two-dimensional heat transfer problem including a variety of boundary conditions. Finally, a complicated-geometry three-dimensional problem, involving a cooled radial turbine rotor, is presented, with the cooling passages treated as &quot;heat sinks&quot; in the finite element analysis. For fluid mechanics, the concept of &quot;nodeless&quot; degrees of freedom is introduced, with real-life fluid-flow applications. The time-dependent finite-element analysis topic is addressed through the problem of unsteady stator/rotor flow interaction within a turbomachinery stage. Finally, the concept of &quot;virtually-deformable finite elements,&quot; as it relates to the problem of fluid-induced vibration, is explained in detail with many practical applications","torrent":{"xt":"urn:btih:7fd98f60c9c103e5622a5c6a9d689fd392adc490","amp;dn":"The+Finite+Element+Method+with+Heat+Transfer+and+Fluid+Mechanics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fd98f60c9c103e5622a5c6a9d689fd392adc490","infoHashBuffer":{"type":"Buffer","data":[127,217,143,96,201,193,3,229,98,42,92,106,157,104,159,211,146,173,196,144]},"announce":[],"urlList":[]}}