{"title":"My Life in Middlemarch by Rebecca Mead","uid":9615809,"size":3360832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8083d26b511412d3227af46aeb460cb0c3f0291d&amp;dn=My+Life+in+Middlemarch+by+Rebecca+Mead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1392416808,"description":"\nA New Yorker writer revisits the seminal book of her youth--Middlemarch-- and fashions a singular, involving story of how a passionate attachment to a great work of literature can shape our lives and help us to read our own histories.\nRebecca Mead was a young woman in an English coastal town when she first read George Eliot's Middlemarch, regarded by many as the greatest English novel. After gaining admission to Oxford, and moving to the United States to become a journalist, through several love affairs, then marriage and family, Mead read and reread Middlemarch. The novel, which Virginia Woolf famously described as &quot;one of the few English novels written for grown-up people,&quot; offered Mead something that modern life and literature did not.\n\nIn this wise and revealing work of biography, reporting, and memoir, Rebecca Mead leads us into the life that the book made for her, as well as the many lives the novel has led since it was written. Employing a structure that deftly mirrors that of the novel, My Life in Middlemarch takes the themes of Eliot's masterpiece--the complexity of love, the meaning of marriage, the foundations of morality, and the drama of aspiration and failure--and brings them into our world. Offering both a fascinating reading of Eliot's biography and an exploration of the way aspects of Mead's life uncannily echo that of Eliot herself, My Life in Middlemarch is for every ardent lover of literature who cares about why we read books, and how they read us.\n\nGenre: Non Fiction , Memoir","torrent":{"xt":"urn:btih:8083d26b511412d3227af46aeb460cb0c3f0291d","amp;dn":"My+Life+in+Middlemarch+by+Rebecca+Mead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8083d26b511412d3227af46aeb460cb0c3f0291d","infoHashBuffer":{"type":"Buffer","data":[128,131,210,107,81,20,18,211,34,122,244,106,235,70,12,176,195,240,41,29]},"announce":[],"urlList":[]}}