{"title":"Curtsies &amp; Conspiracies - GAIL CARRIGER.epub","uid":9149882,"size":382991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80b1218999fc0bdfe537626b08b596cdc10c8e2a&amp;dn=Curtsies+%26amp%3B+Conspiracies+-+GAIL+CARRIGER.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1383669528,"description":" Does one need four fully grown foxgloves for decorating a dinner table for six guests? Or is it six foxgloves to kill four fully grown guests?\n\nSophronia's first year at Mademoiselle Geraldine's Finishing Academy for Young Ladies of Quality has certainly been rousing! For one thing, finishing school is training her to be a spy (won't Mumsy be surprised?). Furthermore, Sophronia got mixed up in an intrigue over a stolen device and had a cheese pie thrown at her in a most horrid display of poor manners.\n\nNow, as she sneaks around the dirigible school, eavesdropping on the teachers' quarters and making clandestine climbs to the ship's boiler room, she learns that there may be more to a school trip to London than is apparent at first. A conspiracy is afoot--one with dire implications for both supernaturals and humans. Sophronia must rely on her training to discover who is behind the dangerous plot-and survive the London Season with a full dance card.\n\nIn this sequel to bestselling author Gail Carriger's YA debut Etiquette &amp; Espionage, class is back in session with more petticoats and poison, tea trays and treason. Gail's distinctive voice, signature humor, and lush steampunk setting are sure to be the height of fashion this season.\nGenre: Fantasy\n","torrent":{"xt":"urn:btih:80b1218999fc0bdfe537626b08b596cdc10c8e2a","amp;dn":"Curtsies+%26amp%3B+Conspiracies+-+GAIL+CARRIGER.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80b1218999fc0bdfe537626b08b596cdc10c8e2a","infoHashBuffer":{"type":"Buffer","data":[128,177,33,137,153,252,11,223,229,55,98,107,8,181,150,205,193,12,142,42]},"announce":[],"urlList":[]}}