{"title":"Coast to Coast AM July 08, 2013 - Benefits of Dreams","uid":8672974,"size":56598251,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:811bdd0f76b1e47bcf959472b03495461792ab21&amp;dn=Coast+to+Coast+AM+July+08%2C+2013+-+Benefits+of+Dreams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1373532541,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n07-08-13\nHost:\nGeorge Noory\nGuests:\nRosemary Ellen  Guiley,                   Paul  Moller\nAuthor and leading expert on the paranormal, Rosemary Ellen Guiley, discussed the many benefits dreams can offer, such as helping us face the truth about our lives and relationships, solving problems, and spiritual and mental growth. There are many different types of dreams such as precognitive dreams (seeing the future), past life dreams, lucid dreams (knowing you're dreaming when you're dreaming), out-of-body dreams, shared dreams (sharing the same dream or elements of the dream with someone else). Some dreams are just fragments that have no beginning or ending, and there are hypnagogic dreams or visions which people have when they're first drifting off to sleep that often have a jumbled quality, she outlined.  \nPaying attention to dreams is important because they reflect how we're feeling about our lives, &quot;and when things get out of balance, dreams are one of our first mechanisms to come to our aid and say, this is out of whack; better do something to restore harmony,&quot; she said. Dreams help with our overall direction in life, and come to our aid when we're in crisis, and have even been associated with tremendous healing, she continued. We can also use dreams proactively, shaping our future by employing them as a visioning guide. For instance, you can set an intention before going to sleep, asking dreams to provide specific information or answers to questions, Guiley suggested, adding that dreams are very responsive, and become more so with practice. \nWhen it comes to interpretation, the symbols of dreams can be both personal and universal. One's personal associations may differ from person to person. &quot;Dreams are almost like peeling away layers. You look first for your personal connections, then for bigger connections; and dreams can have different messages on different levels,&quot; she remarked. Guiley also delved into her research on demons, noting that there are quite an array of interfering entities, and touched on other mysterious creatures such as vampires and werewolves. \nSkycar Update\nFirst hour guest, transportation entrepreneur Paul Moller talked about the latest developments in his Skycar, a vertical take off and landing capable, high-speed light aircraft that also can travel on the ground. Initially, the Skycar will probably be available as an on-demand air taxi in 1, 2, or 6 passenger versions, he reported. Moller announced a plan to produce an unmanned &quot;mini&quot; version of the Skycar, a sub-scale radio-controlled reproduction intended for model aircraft fans that will sell for around $300. \nNews segment guests: Ryan Mauro, Mitch Battros, Lee Speigel\nWebsite(s):\n visionaryliving.com\n moller.com\nBook(s):\n Rosemary Ellen Guiley's Pocket Dream Guide and Dictionary \n Dreamspeak\n The Encyclopedia of Dreams: Symbols &amp; Interpretations\n","torrent":{"xt":"urn:btih:811bdd0f76b1e47bcf959472b03495461792ab21","amp;dn":"Coast+to+Coast+AM+July+08%2C+2013+-+Benefits+of+Dreams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"811bdd0f76b1e47bcf959472b03495461792ab21","infoHashBuffer":{"type":"Buffer","data":[129,27,221,15,118,177,228,123,207,149,148,114,176,52,149,70,23,146,171,33]},"announce":[],"urlList":[]}}