{"title":"Handberg-Future of Space Industry-Private Enterprise&amp;Public Poli","uid":5168835,"size":849639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:828e30220ca4cb9bf38756a9799026f75b02f20c&amp;dn=Handberg-Future+of+Space+Industry-Private+Enterprise%26Public+Poli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1258570670,"description":"This is Roger Handberg's mindblowing book The Future of the Space Industry - Private Enterprise and Public Policy (1995) which analyzes the change and direction of space industrialization or commerce in the latter third of the twentieth century with an eye toward predicting the future of space commerce in the dawning millenium. The space industry is entering a new era of expanded freedom of opportunity to compete unencumbered by government agendas. This freedom carries a price. The political subsidy culture of the past is dying, so failure is not only possible, but likely for the unprepared and inefficient. For more casual observers, the overview of the currents in space commerce history will be invaluable in identifying space-related economic opportunities and will enable those more experienced in the field to reevaluate their future. The author informs the public of the potential that exists in space-related industries, while making it clear to practitioners that there is a new imperative coming into existence with the decline and marginality of NASA in commercial space. The future economic potential is projected in ways not always perceived by those immersed in day-to-day operations. Now that the Cold War is over, a space policy and law expert looks at the changes that are coming in space commercialization. He traces the history of space commerce from the pre-Sputnik era to the 1990s and offers an optimistic analysis of the long-range prospects for successful private enterprise in space. He views problems of the public sector - such as falling budgets and heightened scrutiny of government activity - as windows of opportunity for space-industry corporations and entrepreneurs willing to break their dependency on federal subsidies. Handberg's vision of the future is a must for anyone interested in learning more about policy. Every politician or business entrepreneur interested in space or forming space policy for a nation or company should read this book. Extensively footnoted, The Future of Space Industry is a piece of original research and twice as an important volume in the growing subdiscipline of space policy within the subfield of science and technology policy. 170 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:828e30220ca4cb9bf38756a9799026f75b02f20c","amp;dn":"Handberg-Future+of+Space+Industry-Private+Enterprise%26Public+Poli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"828e30220ca4cb9bf38756a9799026f75b02f20c","infoHashBuffer":{"type":"Buffer","data":[130,142,48,34,12,164,203,155,243,135,86,169,121,144,38,247,91,2,242,12]},"announce":[],"urlList":[]}}