{"title":"Pearl Jam","uid":9612987,"size":7253094455,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:828fb0c3f0e5f6e9dc64ad99e3d9453abebe60de&amp;dn=Pearl+Jam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jmwreck","files":323,"time":1392358611,"description":"Pearl Jam is an American rock band that formed in Seattle, Washington, in 1990. Since its inception, the band's line-up has included Stone Gossard (guitar), Jeff Ament (bass), Mike McCready (guitar), and Eddie Vedder (vocals). The band's fifth and current drummer is Matt Cameron, of Soundgarden, who has been with the band since 1998.\n\nFormed after the demise of Gossard and Ament's previous band, Mother Love Bone, Pearl Jam broke into the mainstream with its debut album, Ten, in 1991. One of the key bands of the grunge movement in the early 1990s, over the course of the band's career, its members became noted for their refusal to adhere to traditional music industry practices, including refusing to make music videos, giving interviews and engaging in a much-publicized boycott of Ticketmaster. In 2006, Rolling Stone described the band as having &quot;spent much of the past decade deliberately tearing apart their own fame.&quot;[1]\n\nTo date, the band has sold over 31.5 million records in the U.S,[2] and an estimated 60 million worldwide.[3][4] Pearl Jam has outlasted and outsold many of its contemporaries from the alternative rock breakthrough of the early 1990s, and is considered one of the most influential bands of the decade.[5] Stephen Thomas Erlewine of Allmusic referred to Pearl Jam as &quot;the most popular American rock &amp; roll band of the '90s.","torrent":{"xt":"urn:btih:828fb0c3f0e5f6e9dc64ad99e3d9453abebe60de","amp;dn":"Pearl+Jam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"828fb0c3f0e5f6e9dc64ad99e3d9453abebe60de","infoHashBuffer":{"type":"Buffer","data":[130,143,176,195,240,229,246,233,220,100,173,153,227,217,69,58,190,190,96,222]},"announce":[],"urlList":[]}}