{"title":"Be A Man! - Fr. Larry Richards","uid":10068932,"size":509204,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82aa4ebb7d1b44b32e0cff02472d5187ea4e4daa&amp;dn=Be+A+Man%21+-+Fr.+Larry+Richards&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"a.seeder","files":3,"time":1398820787,"description":"Be A Man!: Becoming the Man God Created You to Be\n\nby Fr. Larry Richards\n\nMen are rediscovering the importance of the spiritual life. And Father Larry Richards is helping them do it. While some writers apply a one-size-fits-all approach to the Christian life, Father Richards draws on his many years of ministry and his own experience as a man to inspire other men as men. In Be a Man!, he recounts his struggles to learn true manhood, as well as the inspiring stories of others he has served in his decades as a priest. He tells men how to focus on the right goal, how to live as a beloved son of God, of the need to acknowledge one's faults and to live according to the Holy Spirit, to be a man of true love and of wisdom, to appreciate properly the differences between men and women, to pursue holiness, and to make a difference in the world. Not preachy but direct, Father Richards challenges men to be strong, without putting on a mask of false strength or machismo. He calls men to admit their weaknesses and limitations, while urging them to find strength in faith and genuine love to overcome their sins and faults. Although a celibate priest, he minces no words when it comes to the place of sexuality--for the unmarried man as well as for the married man. He shows that true manliness is not opposed to love but thrives on it. Father Richards stresses that a relationship with Christ reveals the meaning of a man's life and his identity as a man. He inspires men to become the true heroes they long to be--men of authentic courage, compassion and integrity. This is a highly readable book for men by a man who knows how to talk to men about the things that matter most.","torrent":{"xt":"urn:btih:82aa4ebb7d1b44b32e0cff02472d5187ea4e4daa","amp;dn":"Be+A+Man%21+-+Fr.+Larry+Richards","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82aa4ebb7d1b44b32e0cff02472d5187ea4e4daa","infoHashBuffer":{"type":"Buffer","data":[130,170,78,187,125,27,68,179,46,12,255,2,71,45,81,135,234,78,77,170]},"announce":[],"urlList":[]}}