{"title":"Fiberglass Fabrication - Disc 1 of 2","uid":6820563,"size":1832657059,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:83466b0944763c0da888ee726fcfb1e65201783d&amp;dn=Fiberglass+Fabrication+-+Disc+1+of+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bluecar5556","files":-1,"time":1321373065,"description":"Fiberglass Fabrication I focuses exclusively on custom fiberglass projects for car audio installations (also available with Fiberglass Fabrication II at a special price). This DVD covers basic fiberglass fabrication designed for those without any fiberglass experience and is made to take the intimidation factor out of fiberglass work. If you like to create and want something more interesting than a basic installation fiberglass fabrication is definitely something you'll want to try. It's the first step towards becoming a great installer capable of world class installations.\n\nFiberglass Fabrication I will teach you the basics of fiberglass fabrication with popular but simple to create projects. The DVD begins with an in depth overview of the materials and tools needed for the projects demonstrated. A description of each item is given along with the approximate cost of purchase (so you don't get ripped off). If you've never worked with fiberglass than this information is absolutely essential. Once this important background information is complete the fun begins.\n\nThis DVD covers three of the most popular fiberglass projects. The first is the creation of custom kickpanels. By far the most popular custom project, kick panels will give you a much better sound and add a custom look to any installation. You'll be walked through the process of creating kick panel pods with less than $20 in material cost.\n\nThe second project is the addition of a fiberglass baffle to an MDF enclosure. This is what you see done in many of the top competition vehicles. The fiberglass baffle is what allows your enclosure to have the curves and shapes not possible with an all MDF enclosure. You'll learn how to create your custom shape, how to wrap it properly and how to finish the piece for its final covering.\n\nThe final project is a spare tire subwoofer enclosure. This is a very popular option for hidden or &quot;stealth&quot; installations. You'll learn how to make a mold of the spare tire well, how to increase the strength and decrease the construction time, and how to add a flat MDF baffle to the curved fiberglass mold.\n\nAll three projects are basic, relatively uncomplicated pieces that were designed to get a beginner started in fiberglass fabrication. It's recommended that you use a router and a powered sander for some of the steps but it's not required. A list is also included that will show you where you can go to purchase the fiberglass and the other materials used (both locally and online). And all of our videos were created by an MECP certified Master Installer so you'll know you're learning to do it the right way.\n\nHere are some of the other installation topics and techniques you'll learn that will help you save time, money and aggravation.\nMaterials and Tools\n\n    Fabrication materials\n        Various cloths needed\n        Resins and body filler types\n        Adhesives to use\n        Release agents to prevent sticking\n    Tools needed\n        Hand tools\n        Power tools\n\n\t\nFiberglass Kickpanels\n\n    Creating the pod base\n        Factory kickpanel\n        Molded kickpanel\n    Duplicating factory panels\n        Protective release agents\n        Itchless trimming\n    Speaker mounting rings\n        Creating perfect circles\n        Flush mounting\n    Aiming the pods for better sound\n        How to get laser precise imaging\n    Wrapping the pod\n        Cloth to use\n        Avoiding &quot;peel up&quot;\n    Shaping the pod\n        Body filler work\n        Body filler &quot;milkshakes&quot;\n        Sanding needed for various finishes\n\n\tFinished kick panel\nMDF Enclosure w/ a Fiberglass Face\n\n    Style techniques for your enclosure\n    Framing the shape with MDF\n    Wrapping the frame and enclosure\n        The importance of a secure bond\n    When to add additional fiberglass\n    Body filler substitutes\n        Paintable filler mixtures\n        Fiberglass reinforced fillers\n    How to fix a poor baffle connection\n    Final sanding\n\n\tSanding the enclosure\nSpare Tire Enclosure\n\n    Protecting the vehicle\n    Sprayable vs. sheet release agents\n    Laying and layering the fiberglass\n    Strengthening the enclosure without fiberglass or body filler\n    Trimming the &quot;tub&quot;\n    Adding a flat MDF baffle for strength and stealth\n    Bonding the MDF and fiberglass together\n    Flush mounting techniques\n","torrent":{"xt":"urn:btih:83466b0944763c0da888ee726fcfb1e65201783d","amp;dn":"Fiberglass+Fabrication+-+Disc+1+of+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83466b0944763c0da888ee726fcfb1e65201783d","infoHashBuffer":{"type":"Buffer","data":[131,70,107,9,68,118,60,13,168,136,238,114,111,207,177,230,82,1,120,61]},"announce":[],"urlList":[]}}