{"title":"Bach - Mass In B Minor - Peter Schreier","uid":4841678,"size":291413466,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:839108000043a48956050ffbade084560b7e5df6&amp;dn=Bach+-+Mass+In+B+Minor+-+Peter+Schreier&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tamroi","files":44,"time":1239533554,"description":"The Mass in B Minor is widely regarded as one of the supreme achievements of classical music. Alberto Basso summarises the work as follows: &quot;The Mass in B minor is the consecration of a whole life: started in 1733 for 'diplomatic' reasons, it was finished in the very last years of Bach's life, when he had already gone blind. This monumental work is a synthesis of every stylistic and technical contribution the Cantor of Leipzig made to music. But it is also the most astounding spiritual encounter between the worlds of Catholic glorification and the Lutheran cult of the cross.&quot;[10].\n\nScholars have suggested that the Mass in B Minor belongs in the same category as the Art of Fugue, as a summation of Bach's deep lifelong involvement with musical tradition - in this case, with choral settings and theology. Bach scholar Christoph Wolff describes the work as representing &quot;a summary of his writing for voice, not only in its variety of styles, compositional devices, and range of sonorities, but also in its high level of technical polish...Bach's mighty setting preserved the musical and artistic creed of its creator for posterity.&quot;[11]\n\nThe Mass was described in the 19th century by Hans Georg NÃƒÂ¤geli as &quot;The Greatest Artwork of All Times and All People.&quot;\n\nWikipedia","torrent":{"xt":"urn:btih:839108000043a48956050ffbade084560b7e5df6","amp;dn":"Bach+-+Mass+In+B+Minor+-+Peter+Schreier","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"839108000043a48956050ffbade084560b7e5df6","infoHashBuffer":{"type":"Buffer","data":[131,145,8,0,0,67,164,137,86,5,15,251,173,224,132,86,11,126,93,246]},"announce":[],"urlList":[]}}