{"title":"Slash Slash Deluxe(rock)(mp3@320)[rogercc]","uid":6118328,"size":281051881,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:839e8f2cad28cb89e55a3dac64114bbcde6fdfd4&amp;dn=Slash+Slash+Deluxe%28rock%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":27,"time":1295650742,"description":"SLASH  SLASH(DELUXE EDITION)[USA EDITION]\nReleased :April 2010\nLabel: EMI\nNo Discs: 2\nFormat:Mp3@320\n\n\n\n\nAnybody who is the least bit familiar with rock music will associate the name Slash with that of a legendary rock guitarist and icon. As the former lead guitarist of mega-rock group Guns `N' Roses, Slash has had a dominant presence in music for more than twenty years. Referred to by many as one of the greatest and most influential guitar players of all time, Slash's signature style and commanding guitar mastery has impacted not only millions of fans around the world, but many of his fellow artists - in all genres of music. Slash's various projects over the years have included the multi-platinum global rock band Velvet Revolver as well as guest guitarist and collaborator for a countless list of artists including Lenny Kravitz, Michael Jackson, Stevie Wonder, the Yard birds, Sammy Hagar and more. Add soundtrack albums and his most recent success via the video game best-seller Guitar Hero to truly begin to appreciate the legacy Slash has established through this point in his career. Slash has always been the artist others seek and invite to collaborate with on their material... now, for the first time, Slash will do the inviting. &quot;Slash&quot;, Slash's first solo release, is a collection of new songs written in partnership with some of the most notable and legendary artists in music. After first enlisting the services of producing partner Eric Valentine (Queens of Stone Age, The All-America n Rejects), Slash compiled a premier rhythm section in bassist Chris Chaney (Jane's Addiction) and drummer Josh Freese (Nine Inch Nai ls). The album features an all-star roster of guest musicians including Ian Astbury of The Cult, Chris Cornell, Rocco DeLuca , Fergie, Dav e Grohl, Myles Kennedy of Alterbridge, Kid Rock, Lemmy Kilmeister of Motorhead, Ada m Levine of Maroon 5, Duff McKaga n, M. Shadows of Avenged Sevenfold, Ozzy Osbourne, Iggy Pop, and Andrew Stockda le of Wolfmother. Slash handled the majority of arranging and song writing duties and handpicked each guest artist to collaborate with on rounding out each track.\n\nCD1:\n01. Ghost (feat. Ian Astbury)\n02. Crucify The Dead (feat. Ozzy Osbourne)\n03. Beautiful Dangerous (feat. Fergie)\n04. Back From Cali\n05. Promise (feat. Chris Cornell)\n06. By The Sword (feat. Andrew Stockdale)\n07. Gotten (feat. Adam Levine)\n08. Doctor Alibi (feat. Lemmy Kilmister)\n09. Watch This (feat. Dave Grohl &amp; Duff McKagan)\n10. I Hold On (feat. Kid Rock)\n11. Nothing To Say (feat. M. Shadows)\n12. Starlight (feat. Myles Kennedy)\n13. Saint Is A Sinner Too (feat. Rocco DeLuca)\n14. We're All Gonna Die (feat. Iggy Pop)\n\nCD2:\n01. Sahara (feat. Koshi Inaba)\n02. Paradise City (feat. Fergie &amp; Cypress Hill)\n03. Mother Maria (feat. Beth Hart)\n04. Baby Can't Drive (feat. Alice Cooper &amp; Nicole Scherzinger)\n05. Sahara (feat. Koshi Inaba)\n06. Beautiful Dangerous (feat. Fergie)\n07. Demo #4\n08. Demo #16\n09. Back From Cali (feat. Myles Kennedy)\n10. Fall To Pieces (feat. Myles Kennedy)\n11. Sweet Child O' Mine (feat. Myles Kennedy)\n12. Watch This (feat. Myles Kennedy)\n13. Nightrain (feat. Myles Kennedy)\n\n\n\n","torrent":{"xt":"urn:btih:839e8f2cad28cb89e55a3dac64114bbcde6fdfd4","amp;dn":"Slash+Slash+Deluxe%28rock%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"839e8f2cad28cb89e55a3dac64114bbcde6fdfd4","infoHashBuffer":{"type":"Buffer","data":[131,158,143,44,173,40,203,137,229,90,61,172,100,17,75,188,222,111,223,212]},"announce":[],"urlList":[]}}