{"title":"Lonely Planet St Petersburg - 7th Edition (2015).epub Gooner","uid":14706117,"size":97684858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8472fcdd3afcb9e0c1dd63bd652c0f88b8a10151&amp;dn=Lonely+Planet+St+Petersburg+-+7th+Edition+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1464360606,"description":"Lonely Planet St Petersburg (Travel Guide) - 7th Edition (2015).epub Gooner\r\n\r\nPublisher: Lonely Planet; 7 edition (13 Mar. 2015)\r\nLanguage: English\r\nISBN-10: 1742209947\r\nISBN-13: 978-1742209944\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet St Petersburg is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Tour the Hermitage, party through the White Nights, or enthral yourself in the Mariinsky Ballet; all with your trusted travel companion. Get to the heart of St Petersburg and begin your journey now!\r\n\r\nInside Lonely Planet's St Petersburg Travel Guide:\r\n\r\n* Full-colour maps and images throughout\r\n\r\n* Highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, going out, shopping, hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer, more rewarding travel experience - art, architecture, literature\r\n\r\n* Free, convenient pull-out St Petersburg map (included in print version), plus over 15 colour maps\r\n\r\n* Covers Sennaya, Kolomna, Smolny, Vosstaniya, Vasilyevsky Island, Petrogradsky Island, Vyborg Side and more\r\n\r\nThe Perfect Choice: Lonely Planet St Petersburg, our comprehensive guide to St Petersburg, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\n* Looking for more extensive coverage? Check out Lonely Planet's Russia guide for a comprehensive look at all the country has to offer.\r\n\r\nAuthors: Written and researched by Lonely Planet, Tom Masters, Simon Richmond.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:8472fcdd3afcb9e0c1dd63bd652c0f88b8a10151","amp;dn":"Lonely+Planet+St+Petersburg+-+7th+Edition+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8472fcdd3afcb9e0c1dd63bd652c0f88b8a10151","infoHashBuffer":{"type":"Buffer","data":[132,114,252,221,58,252,185,224,193,221,99,189,101,44,15,136,184,161,1,81]},"announce":[],"urlList":[]}}