{"title":"Around India in 80 Trains - Monisha Rajesh","uid":9271498,"size":3472625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8523a078739b45444e6c335ca4d93a58011fee90&amp;dn=Around+India+in+80+Trains+-+Monisha+Rajesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1385787164,"description":"To understand India you have to see it, hear it, breathe it and feel it. Living through the good, the bad and the ugly is the only way to know where you fit in and where India fits into you. \n\nIn 1991 Monisha uprooted from Sheffield to Madras in the hope of making India her home. But fed up with soap-eating rats, severed human heads, paying bribes, and the creepy colonel across the road, she returned to England with a bitter taste in her mouth. \n\nBut twenty years later, she turns to a map of the Indian Railways and takes a page out of Jules Verne s classic tale, embarking on an adventure around India in 80 trains, covering 40,000km the circumference of the Earth. Indian trains carry over twenty million passengers every day, ploughing through cities, crawling past villages, climbing up mountains and skimming along coasts. Monisha hopes that 80 train journeys up, down and across India will lift the veil on a country that has become a stranger to her. \n\nAs one of the largest civilian employers in the world, featuring luxury trains, toy trains, Mumbai s infamous commuter trains, and even a hospital on wheels, Indian Railways has more than a few stories to tell, not to mention a colourful cast of characters. And with a self-confessed militant devout atheist in tow, her personal journey around a country built on religion isn t quite what she bargained for...","torrent":{"xt":"urn:btih:8523a078739b45444e6c335ca4d93a58011fee90","amp;dn":"Around+India+in+80+Trains+-+Monisha+Rajesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8523a078739b45444e6c335ca4d93a58011fee90","infoHashBuffer":{"type":"Buffer","data":[133,35,160,120,115,155,69,68,78,108,51,92,164,217,58,88,1,31,238,144]},"announce":[],"urlList":[]}}