{"title":"THE GIRL WITH THE DRAGON TATOO XVID CAM GLOBE","uid":6937795,"size":1366430877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:85600597278318ffef4bf1396bfca1785bab485f&amp;dn=THE+GIRL+WITH+THE+DRAGON+TATOO+XVID+CAM+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"globeplus","files":-1,"time":1325890419,"description":"* XVID CAM    * 02H27M05S    * ~ 1100 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Intro :\n\n\nThe Girl with the Dragon Tattoo is a 2011 English-language drama/thriller film directed by David Fincher, adapted from Stieg Larsson's Swedish-language novel of the same name by Steven Zaillian.\n\nThe film stars Daniel Craig as Mikael Blomkvist and Rooney Mara as Lisbeth Salander and tells the story of a man's mission to find out what has happened to a girl who has been missing for 40 years, and who may have been murdered.\n\n\n\n* Plot :\n\n\nMikael Blomkvist (Daniel Craig), co-owner and writer of Millennium magazine, has just lost a libel case against crooked businessman Hans-Erik WennerstrÃƒÂ¶m, for which he must pay 600,000 Swedish kronor (approximately 87,000 USD) in damages. Meanwhile, Lisbeth Salander (Rooney Mara), a researcher for Milton Security and a computer hacker, has compiled a very extensive background check on Blomkvist for Henrik Vanger (Christopher Plummer), retired CEO of Vanger Industries, for a job that Henrik wants him to do. Despite the recent scandal, Salander passes Blomkvist as &quot;clean.&quot;\n\nBlomkvist receives a phone call from Henrik's lawyer, Dirch Frode (Steven Berkoff), summoning him to the Vanger estate at Hedeby Island in Hedestad. Blomkvist reluctantly meets Henrik, who offers him two jobs: to write a Vanger family history, and, using the information provided by Henrik for the memoir, to solve the murder of his niece Harriet Vanger, who disappeared almost 40 years previously; Henrik is convinced that one of the family killed her. He reveals that someone he believes to be the killer has been sending him pressed flowers, which Harriet had always given him on his birthday. He says he will pay Blomkvist handsomely for this job, but Blomkvist agrees only when he promises to give him damning information about WennerstrÃƒÂ¶m, who is Henrik's former employee.\n\nMeanwhile, Salander, who is a ward of the state, despite being in her twenties, due to diagnosed mental incompetency, goes to visit her legal guardian, Holger Palmgren, only to discover that he has suffered a stroke. Her new guardian, lawyer Nils Bjurman (Yorick van Wageningen), seizes control of Salander's finances and issues her a monthly allowance, which angers Salander, as Palmgren allowed her to manage her own finances.\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012 *\n","torrent":{"xt":"urn:btih:85600597278318ffef4bf1396bfca1785bab485f","amp;dn":"THE+GIRL+WITH+THE+DRAGON+TATOO+XVID+CAM+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85600597278318ffef4bf1396bfca1785bab485f","infoHashBuffer":{"type":"Buffer","data":[133,96,5,151,39,131,24,255,239,75,241,57,107,252,161,120,91,171,72,95]},"announce":[],"urlList":[]}}