{"title":"Time Machine VR","uid":14695110,"size":6226322703,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8604baea7988be39d6c831dbcc466d512cbf6ab8&amp;dn=Time+Machine+VR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1464223603,"description":"About This Game\r\nNOTE: Time Machine VR now runs on Oculus Rift (CV1) and HTC Vive headsets. Xbox 360 and Xbox One controllers supported.\r\nSYNOPSIS\r\nYou are a time-travelling cadet tasked with exploring the Jurassic era and the ancient creatures that once ruled the prehistoric oceans. Things take a turn when melting ice caps in the present unleash an ancient deadly virus that lays waste to humanity... and the key to the cure lies in the extraordinary creatures of prehistory. You will need your wits and cunning to survive the past and save the future.\r\nSTORY MODE\r\nSvalbard &amp; the DinoDex\r\nYou begin your journey inside your mission hub, in Svalbard, Norway. It shelters your time machine and comes equipped with the DinoDex, a depository of the information you will collect from the prehistoric creatures you encounter. Every time you return to Svalbard with new discoveries, upload them to the DinoDex to unlock crucial data and creatures.\r\nThe Jurassic Oceans\r\nPilot your time machine through the treacherous oceans of prehistory, where mosasaurus, livyatan, and megalodon, among others, roam the deep. Use your high-tech equipment to track, probe, and scan these beasts, extracting the information you need. Bait creatures to turn risky situations to your advantage. Freeze time and perform dangerous close-up echography and take unique live snapshots of creatures in action with Behavior Scan as you strive to fulfill your mission.\r\nEXPLORATION MODE\r\nRevisit completed levels and unlock crucial intelligence about the Jurassic-era creatures you have faced. Then, follow these clues to uncover the key to human kind’s survival.\r\nFEATURES\r\n\r\n    A game about time travel, prehistoric creatures, and human extinction;\r\n    Story Mode;\r\n    Exploration Mode;\r\n    Explore an immersive Jurassic underwater world;\r\n    Navigate a living and dangerous ecosystem populated by mysterious creatures: mosasaurus, livyatan, megalodon, and more;\r\n    An expansive on-land VR mission hub located in Svalbard, Norway;\r\n    The DinoDex: upload collected data, and unlock creatures;\r\n    Over 10 hours of gameplay.\r\n\r\nA FULL RANGE OF TECH-BASED MECHANICS\r\n\r\n    Time Freeze: Briefly slow down time around you, then use that moment to engage with creatures at close range;\r\n    Tracker: Visibility is limited in the treacherous Jurassic oceans. Use the Tracker to locate creatures in the dark or behind rock formations;\r\n    Probe: Shoot it at creatures to instantly collect genetic data about their species;\r\n    Scan: Approach prehistoric creatures and use Scan to gather intelligence on specific anatomical features;\r\n    Bait: The Jurassic oceans of Time Machine VR are living ecosystems, where your understanding of the dynamic food chain plays a decisive role on your ability to complete your mission. Use Bait to create situations that move the odds in your favor;\r\n    Echography (Echo): Use Echo’s ultrasound technology to understand the inner workings of the beasts of the deep;\r\n    Behavior Scan: Take unique live snapshots of creatures in action;\r\n    Exo Scan: Take precision scans of a creature's surface to uncover hidden details that may have gone unnoticed at first glance","torrent":{"xt":"urn:btih:8604baea7988be39d6c831dbcc466d512cbf6ab8","amp;dn":"Time+Machine+VR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8604baea7988be39d6c831dbcc466d512cbf6ab8","infoHashBuffer":{"type":"Buffer","data":[134,4,186,234,121,136,190,57,214,200,49,219,204,70,109,81,44,191,106,184]},"announce":[],"urlList":[]}}