{"title":"Radiohead - OK Computer (1997) WMA320","uid":6277329,"size":313144706,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86090b86ceb2de400d1df2c57d73121751eebaf4&amp;dn=Radiohead+-+OK+Computer+%281997%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301309155,"description":"I feel like someone who has just shown up to a really awesome party and I'm playing catch up. I don't know why it took me so long to realize that Radiohead have more good songs to offer besides &quot;Creep&quot;. I was reading an article on cracked.com and it mentioned Radiohead's albums In Rainbows and Ok Computer being intertwined to create one giant album. (I'm sure most Radiohead fans are already aware of this.) So I decided to download Radiohead's discography. I started with Pablo Honey because I wanted to go in order of release, and was blown away. The Bends blew me away even more. Next I listened to Ok Computer...and on first listen, I just didn't get it. Alright, I thought...I don't see what all the fuss is about. I moved on to Kid A, and immediately I was blown away. This was all in one night too, (the other night actually) I just couldn't stop listening to Radiohead. The next day I listened to Amnesiac, Hail to the Thief, In Rainbows, and The King of Limbs, and upon first listen fell in love with each album. Why hadn't Ok Computer have that effect on me? I decided to give it another listen. Nope...still nothing, I went back to their other albums. Then, yesterday...I gave it one more listen, and I can't explain it, but something just clicked...Now I'm hooked. I cannot stop listening to Ok Computer now...just today I've probably listened to it at least 5 times in a row. I just feel this connection with all the songs...and I wonder why I didn't feel it at first. I want to listen to their other albums some more but I just can't stop listening to this. Each song is just beautifully structured, and well...what can I say that most reviewers haven't already covered. This is actually the first time I've used my account to review a product because I just wanted to share with other fans the joy that listening to their music brings me. I don't know why it took me so long to discover them but oh well, now I have 8 amazing albums in my collection to enjoy over and over and over.\n\nby Richard Giordano\n\nTRACKLIST:\nDisc 1:\n01 - Airbag.wma                                             \n02 - Paranoid Android.wma                                   \n03 - Subterranean Homesick Alien.wma                        \n04 - Exit Music (For A Film).wma                            \n05 - Let Down.wma                                           \n06 - Karma Police.wma                                       \n07 - Fitter Happier.wma                                     \n08 - Electioneering.wma                                     \n09 - Climbing Up The Walls.wma                              \n10 - No Surprises.wma                                       \n11 - Lucky.wma                                              \n12 - The Tourist.wma  \n \nDisc 2:\n01 - Polyethylene (Parts 1 &amp; 2).wma                         \n02 - Pearly.wma                                             \n03 - A Reminder.wma                                         \n04 - Melatonin.wma                                          \n05 - Meeting In The Aisle.wma                               \n06 - Lull.wma                                               \n07 - Climbing Up The Walls (Zero 7 Mix).wma                 \n08 - Climbing Up The Walls (Fila Brazillia Mix).wma         \n09 - Palo Alto.wma                                          \n10 - How I Made My Millions.wma                             \n11 - Airbag (Live In Berlin).wma                            \n12 - Lucky (Live In Florence).wma                           \n13 - Climbing Up The Wall (Radio Session).wma               \n14 - Exit Music (For A Film) (Radio Session).wma            \n15 - No Surprises (Radio Session).wma            \n\nWMA 320Kbps 44100Hz STEREO\n\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB","torrent":{"xt":"urn:btih:86090b86ceb2de400d1df2c57d73121751eebaf4","amp;dn":"Radiohead+-+OK+Computer+%281997%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86090b86ceb2de400d1df2c57d73121751eebaf4","infoHashBuffer":{"type":"Buffer","data":[134,9,11,134,206,178,222,64,13,29,242,197,125,115,18,23,81,238,186,244]},"announce":[],"urlList":[]}}