{"title":"[CollegeFuckParties] Dirty-Minded Babes Enjoy Champagne And cCll","uid":11618246,"size":770805628,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:86334d7ec75aa2dade8a78100a86f735093f876a&amp;dn=%5BCollegeFuckParties%5D+Dirty-Minded+Babes+Enjoy+Champagne+And+cCll&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1417517978,"description":"---:More From My Torrent's Here:--- &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:--- &lt;a href=&quot;\nhttp://imgruby.com/view-image/48f403733b22594c6542a712b2892e21.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/view-image/48f403733b22594c6542a712b2892e21.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgruby.com/view-image/c3c7e8aaf5ce5bea846b2cfea721ba6a.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgruby.com/view-image/c3c7e8aaf5ce5bea846b2cfea721ba6a.jpeg&lt;/a&gt;\n\nCast:\nPenny, Sabrina, Eva Berder, Jenny, Rita-Moor, Dominika\n\nDon't know about you, but I always feel sad when summer gets close to its end. End of summer means going back to college, having tons of assignments and not being able to hang out with your friends as often as you like. Besides, outdoor hardcore sex parties are out of the question too. But hey, we still had a couple of summer weeks ahead, and we decided to throw the coolest college fuck party ever. There's no place like the woods for a crazy fuck fest in the fresh air! So we found a beautiful place by the lake and unpacked our bags. It was too cold to bathe, but hot enough to sunbathe naked, which was fine by me. Who needs to bathe anyway when you can fuck the hottest college sluts instead?\nWe knew it was probably our last college sex party of the summer and that we should enjoy it to the fullest. So we did everything we wanted: we danced to our favorite music, we played games like volleyball and football, we drank champagne and made barbeque. That was all very cool, but not cool enough for a college orgy, right? But wait till this party turns into the wildest fuck fest ever! Things started to go out of control when someone started pouring champagne over all of us. We grabbed the remaining bottles and opened them too to get everyone around us soaked in champagne. Then we just started licking it off each other, and this is when the real fun began.\nAll that licking and kissing and sucking gradually turned into hardcore student fucking, and it was something truly mind-blowing! There was super steamy action all around you. One of the sexy and lecherous college girls was enjoying double penetration sex while the other oen was banged in her asshole. Beside them two pretty party girls were making out and rubbing each other's pussies while one babe was masturbating. Sounds amazing, but believe me, it looks even better and wilder! The video that we made is full of totally breathtaking action including unforgettable party sex scene with group masturbation. Oh yeah, that was the best way to say goodbye to summer vacation!","torrent":{"xt":"urn:btih:86334d7ec75aa2dade8a78100a86f735093f876a","amp;dn":"%5BCollegeFuckParties%5D+Dirty-Minded+Babes+Enjoy+Champagne+And+cCll","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86334d7ec75aa2dade8a78100a86f735093f876a","infoHashBuffer":{"type":"Buffer","data":[134,51,77,126,199,90,162,218,222,138,120,16,10,134,247,53,9,63,135,106]},"announce":[],"urlList":[]}}