{"title":"Construction:Building Envelope and Interior Finishes Databook","uid":6682821,"size":39698795,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:864dd6ad20fa393b99494b27487e74ca0d9e7876&amp;dn=Construction%3ABuilding+Envelope+and+Interior+Finishes+Databook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316269166,"description":"A one-stop resource for residential or commercial construction projects, Construction Building Envelope and Interior Finishes Databook gives you instant access to hundreds of tables, specifications, charts, diagrams, and illustrations covering materials and components most frequently used on a typical job. In easy-to-understand language, construction pro Sidney M. Levy covers: *Interior metal stud specifications, design data and typical details...drywall installation...and fire and sound ratings *Structural steel, cast-in-place concrete and masonry structural systems, with details, specifications, and illustrations of component parts *Masonry shapes, patterns, installations tips and practices, with an illustrated guide to reinforcing specifications and materials *Roofing types and materials...flashing and waterproofing details *Finishes including plastic laminates...resilient flooring... painting specifications...and installation guidelines *Much more!\nFrom the Back Cover\nQCD (Quick Construction Data) Look inside to find easy-to-use help with materials and components, specifications, installation tips and practices, and more -- all in one handy, single source Construction Building Envelope and Interior Finishes Databook This detail-by-detail construction sourcebook from project management expert Sidney M. Levy can save you countless hours of frustrating hunting for the information you need, and eliminate the guesswork that leads to costly errors. Veteran of hundreds of major projects around the world, Sidney Levy knows exactly what managers, designers, and hands-on construction pros need to put a building together. With Construction Building Envelope and Interior Finishes Databook, he provides the answers you need, in a convenient format, right here between two covers. With this guide, you can: *Check scores of diagrams and illustrations on steel, concrete, and masonry structural systems, with details, illustrations, and component parts *Compare roofing types, flashing and waterproofing details, and find shingle and slate installation techniques *Find masonry facts, from shapes and patterns to installation tips and practices, and reinforcing specs and materials *Get interior metal stud specifications, drywall data and installation procedures, and fire and sound ratings on a variety of materials *Select finishes such as plastic laminates and paints, and resilient floorings *Check the many specification tables to ensure that you are ordering the proper materials for your job *Consult the metrication tables and conversion factors for jobs involving dual measuring systems Whether you work in the commercial or residential markets, this is the all-bases-covered source that helps you turn any construction project into a winner.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 752 pages\n    * Publisher: McGraw-Hill Professional; 1 edition (October 16, 2000)\n    * Language: English\n    * ISBN-10: 0071360220\n    * ISBN-13: 978-0071360227","torrent":{"xt":"urn:btih:864dd6ad20fa393b99494b27487e74ca0d9e7876","amp;dn":"Construction%3ABuilding+Envelope+and+Interior+Finishes+Databook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"864dd6ad20fa393b99494b27487e74ca0d9e7876","infoHashBuffer":{"type":"Buffer","data":[134,77,214,173,32,250,57,59,153,73,75,39,72,126,116,202,13,158,120,118]},"announce":[],"urlList":[]}}