{"title":"&quot;Race&quot; and Racism: The Development of Modern Racism in","uid":8640436,"size":1198401,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86d07e424e1304bac94cd8f76807d0cfaed96398&amp;dn=%26quot%3BRace%26quot%3B+and+Racism%3A+The+Development+of+Modern+Racism+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"blackatk","files":-1,"time":1372874963,"description":"Release date: October 16, 2007 | ISBN-10: 0230600778 | ISBN-13: 978-0230600775 | Edition: First Edition\n\n&quot;Race&quot; and Racism examines the origins and development of racism in North America.  It addresses the inception and persistence of the concept of &quot;race&quot; and discusses the biology of human variance, addressing the fossil record of human evolution, the relationship between creationism and science, population genetics, &quot;race&quot;-based medicine, and other related issues.  The book explores the diverse ways in which people in a variety of cultures have perceived, categorized, and defined one another without reference to any concept of &quot;race.&quot;  It follows the history of American racism through slavery, the perceptions and treatment of Native Americans, Jim Crow laws, attitudes toward Irish and Southern European immigrants, the internment of Japanese Americans during World War II, the civil rights era, and numerous other topics.\n\n\nReview\n&quot;Perry clearly understands that 'race' has no scientific basis, and his treatment of racism throughout is admirable. While this book is bound to ruffle some feathers, that is, in fact, a good thing. There are many innovative points made not readily available in other published works, and this is such an important subject that scholars will find this an invaluable resource.&quot;--C. L. Brace, University of Michigan\nAbout the Author\nRichard J. Perry earned a B.A. in anthropology at Harvard and his M.A. and Ph.D. in anthropology at Syracuse University. He has done field work on the San Carlos Apache Reservation in Arizona and spent a year and half in Kenya with his wife, Professor Alice Pomponio, co-directing the St. Lawrence University Kenya Semester Program. He is the author of four other books, titled Western Apache Heritage, Apache Reservation, From Time Immemorial, and Five Key Concepts in Anthropological Thinking.  He is Emeritus Professor of Anthropology at St. Lawrence University, where he taught from 1971 to 2004 and was founding Chair of the Department of Anthropology, serving as chair for sixteen years.\n\nHardcover: 280 pages\nPublisher: Palgrave Macmillan; First Edition edition (October 16, 2007)\nLanguage: English\nISBN-10: 0230600778\nISBN-13: 978-0230600775\n &lt;a href=&quot;\nhttp://www.amazon.com/Race-Racism-Development-Modern-America/dp/0230600778/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372867381&amp;sr=1-1&amp;keywords=race+and+racism+richard+j+perry&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Race-Racism-Development-Modern-America/dp/0230600778/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372867381&amp;sr=1-1&amp;keywords=race+and+racism+richard+j+perry&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:86d07e424e1304bac94cd8f76807d0cfaed96398","amp;dn":"%26quot%3BRace%26quot%3B+and+Racism%3A+The+Development+of+Modern+Racism+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86d07e424e1304bac94cd8f76807d0cfaed96398","infoHashBuffer":{"type":"Buffer","data":[134,208,126,66,78,19,4,186,201,76,216,247,104,7,208,207,174,217,99,152]},"announce":[],"urlList":[]}}