{"title":"Spookies_1986","uid":7715262,"size":734009344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:87a362c9bf547e94bad5106edd5e2ed42b8e039e&amp;dn=Spookies_1986&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mentaltown72","files":-1,"time":1349912841,"description":"Format: AVI\n\n\n\n\nA 13-year-old boy named Billy runs from home as his parents forget his birthday. Making his way through thick woods, he encounters a drifter who is violently slashed to death after Billy leaves. Billy stumbles on an old mansion where a room is decorated for birthday celebrations. Thinking it is a surprise by his parents, he opens a present to discover a severed head. Running away, he is attacked by the drifter's killer, a cat-like human with a hook on one hand, and subsequently buried alive.\n\nMeanwhile, a group of teenagers and some older adults come across the mansion intending to have a party, believing the mansion to be abandoned. However, a sorcerer named Kreon resides there, keeping watch over his bride who he has kept preserved for over 70 years using an unrevealed method, but it is known that he needs human victims in order to do it. He possesses one of teenagers in the group to use a Ouija board and summons a variety of monsters to pick off the group one by one. These include farting mud-men, small reptilian demons, giant spiders, an arachnid woman, an octopus-like creature with electric tentacles, a skeletal witch, a Grim Reaper statue, a vampiric boy in a monk's habit, and a large group of zombies.\n\nEventually, the entire group is killed by the monsters and Kreon hopes to preserve his bride for longer, but she escapes by killing him and trying to outrun the zombie horde around the mansion. The bride eventually is saved by a man who drives her away in his car. Kreon regenerates out of a coffin as it is revealed the man in the car is actually the cat-like creature with the hook hand. The camera pans on Kreon's laughing face and the credits roll.","torrent":{"xt":"urn:btih:87a362c9bf547e94bad5106edd5e2ed42b8e039e","amp;dn":"Spookies_1986","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a362c9bf547e94bad5106edd5e2ed42b8e039e","infoHashBuffer":{"type":"Buffer","data":[135,163,98,201,191,84,126,148,186,213,16,110,221,94,46,212,43,142,3,158]},"announce":[],"urlList":[]}}