{"title":"Nexus","uid":4156853,"size":1603036683,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87ba21fd1fb0a89f176d3646fce09fe3b35f815e&amp;dn=Nexus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"gilgamesh07","files":120,"time":1209186414,"description":"By request from the forum, this torrent is a very nearly complete set of every Nexus related comic ever published.\n\nNexus is an American comic book series created by writer Mike Baron and penciler Steve Rude in 1981. The series is a combination of the superhero and science fiction genres, set 500 years in the future.\n\nThe lead character, Horatio Valdemar Hellpop, received his powers as Nexus from an alien entity called the Merk. As payment, the Merk required Nexus to seek out and kill a certain quantity of human mass murderers per &quot;cycle&quot;. When the Merk selected a target, Nexus would receive strong headaches and maddeningly anguished dreams of his target&amp;#039;s victims until he did his duty. Horatio was reluctant to act as the Merk&amp;#039;s tool, but continued seeking out mass murderers to maintain his power and his sanity so that be could defend his homeworld, a lunar refuge of Ylum (a shortening of the word &quot;asylum,&quot; thus pronounced &quot;eye-lum&quot;).\n\nHoratio&amp;#039;s father, Theodore, was a communist general and ruler of the planet Vradic. A religious uprising led by his brother-in-law threatened to overthrow the Sov government, which he had been ordered to uphold &quot;at all costs.&quot; General Hellpop chose to detonate a bomb and destroy the planet, killing ten million people, then piloted an escape capsule with himself and his wife into a black hole. Surprisingly, it was a wormhole which ejected them near Ylum, where Horatio soon was born.\n\nAs Horatio grew up, the Merk influenced him through apparently imaginary friends named Alph and Beta. However, when Horatio&amp;#039;s mother died becoming lost in the tunnels of the planet, Horatio blamed them for her death and killed them in the first use of his power. Shortly afterward, Horatio began to dream about his father&amp;#039;s crimes, causing himself inescapable torment. In this agony, Alph and Beta mysteriously appeared to reveal the duties of Nexus necessary to end the ordeal: the execution of his own father. With considerable personal agony, and unaware that his father was on the verge of suicide on his own, Horatio carried out the execution.\n\nLeft alone for two years, Horatio began to dream of the murderous oppressors of the Thunes, led by the Manager, and set out to deal with them in costume as Nexus for the first time. After the execution was carried out, Nexus agreed to take the Thune prisoners to Ylum to protect them from reprisals. Ylum thus became an asylum world, with the Thune prisoner, Dave, becoming both senior manager and Horatio&amp;#039;s closest confidant.\n\nNexus would often find himself in the painful position of assassinating someone who had repented their former days of infamy, and desired only to be left alone with their guilt while several of his targets were completely ignorant that their short-sighted actions had inadvertently caused the deaths of others. Fortunately, at least one such target was allowed to commit suicide when confronted by Nexus and death by that means is sufficient to end the relevant dream. For the most part, however, his targets were unrepentant murderers, a number of whom had enslaved or otherwise taken advantage of their victims before causing their deaths, thus allowing Nexus to execute them with a clear conscience.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:87ba21fd1fb0a89f176d3646fce09fe3b35f815e","amp;dn":"Nexus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ba21fd1fb0a89f176d3646fce09fe3b35f815e","infoHashBuffer":{"type":"Buffer","data":[135,186,33,253,31,176,168,159,23,109,54,70,252,224,159,227,179,95,129,94]},"announce":[],"urlList":[]}}