{"title":"Alexis Cole - 2009 - Someday My Prince Will Come FLAC","uid":11168445,"size":350853424,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:88776d1429992eb9363affac9ea7f54d650e7999&amp;dn=Alexis+Cole+-+2009+-+Someday+My+Prince+Will+Come+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1412663160,"description":"Alexis Cole - 2009 - Someday My Prince Will Come\n\nMusic from Disney films and cartoons has often drifted into jazz thanks to its rich harmonies and evergreen quality, but it is not every day that a vocalist makes an entire CD with personal renditions of these popular tunes.\nSuch is the case of Alexis Cole's Someday My Prince Will Come, which features a collection of Disney tunes reread into a jazz format. Cole cleverly did not choose songs that might be too obvious, focusing mostly on more obscure numbers such as the opener, the beautiful &quot;For Now For Always&quot; (from The Parent Trap) and &quot;Once Upon A Dream&quot; (from Cinderella).\nSome tunes lend themselves naturally to a jazz format such as &quot;Let Me Be Good To You,&quot; a bluesy tune that is used to showcase pianist Fred Hersch and bassist Steve LaSpina, who both contribute fluent solos, while Cole sings with a '50s Ella Fitzgerald-like style. The Lady And The Tramp's &quot;La La Lu&quot; appears as a soft ballad enhanced by Don Braden's fluid flute solo.\nAnother highlight is &quot;If I Never Knew You,&quot; the most recently composed tune on the disc, which originally appeared on the end credits for Pocahontas. Cole's voice is inspired, and Gregoire Maret contributes a Toots Thielemans- like harmonic response to her singing that enhance the tune's beauty.\nMaret appears again on the title track, arguably the most memorable tune from Snow White &amp; The Seven Dwarfs. His solo is followed by yet another great contribution from Hersch. La Spina and drummer Matt Wilson, who provides great backup, responding to the pianist's accents with gusto.\nSomeday My Prince Will Come is a great reminder of the timelessness of these songs and also a testament to Cole's talent. The New York-born vocalist makes each song her own. The only sad note is the fact that the disc was recorded before the soundtrack to The Princess and The Frog had been released. But maybe that could be included in a second volume along with tunes from The Aristocats. (allaboutjazz)\n\nTrack list:\n01 - For Now For Always (The Parent Trap)\n02 - Home Is Where The Heart Is (Tale Spin)\n03 - If I Never Knew You (Pocahontas)\n04 - La La Lu (Lady and the Tramp)\n05 - Let Me Be Good To You (The Adventures of the Great Mouse Detective)\n06 - Love (Robin Hood)\n07 - Once Upon A Dream (Sleeping Beauty)\n08 - Remember When (101 Dalmatians)\n09 - So this Is Love (Cinderella)\n10 - Someday My Prince Will Come (Snow White and the Seven Dwarfs)\n11 - The Second Star To The Right (Peter Pan)\n12 - When You Wish Upon A Star (Pinocchio)\n\nPersonnel: \nFred Hersch: piano; \nSteve LaSpina: bass; \nMatt Wilson: drums; \nGregoire Maret: harmonica; \nDon Braden: tenor, soprano, flute.\n\nEnjoy and share!","torrent":{"xt":"urn:btih:88776d1429992eb9363affac9ea7f54d650e7999","amp;dn":"Alexis+Cole+-+2009+-+Someday+My+Prince+Will+Come+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88776d1429992eb9363affac9ea7f54d650e7999","infoHashBuffer":{"type":"Buffer","data":[136,119,109,20,41,153,46,185,54,58,255,172,158,167,245,77,101,14,121,153]},"announce":[],"urlList":[]}}