{"title":"Dr. Gene Scott - Backup of his website DrGeneScott.com","uid":4344518,"size":193682988,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8973d75bdf091d0c1f65c27d5678c377e97ebd93&amp;dn=Dr.+Gene+Scott+-+Backup+of+his+website+DrGeneScott.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"baboonbob","files":1,"time":1218794364,"description":"Dr. Gene Scott - Backup of his website DrGeneScott.com\n\nThis is a backup of archived copies of Dr. Gene Scott's original website.\n\nThis backup is designed to make it possible for his website to be reconstructed at some point in the future, and so it is VERY IMPORTANT that everyone who would like to see that happen download this torrent and help seed it for as long as possible.   \n\nIn its present form the backup itself is not itself &quot;ready for prime time&quot; viewing by everyone as there are broken links, images, etc which need to be fixed.   However there are numerous redundant copies of the website contained herein, from different periods of time.   These are all included in an effort to preserve as much content as possible so that if someone eventually works to reconstruct the site, they will have as much source material as possible to work from.\n\nSo again, even if you're not a tech person or able to enjoy the site right now, by downloading and helping seed this torrent you are contributing to a VALUABLE EFFORT OF PRESERVATION, which will help ensure the possibility that one day the whole of Dr. Gene Scott's work, including his online material, may be restored.","torrent":{"xt":"urn:btih:8973d75bdf091d0c1f65c27d5678c377e97ebd93","amp;dn":"Dr.+Gene+Scott+-+Backup+of+his+website+DrGeneScott.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8973d75bdf091d0c1f65c27d5678c377e97ebd93","infoHashBuffer":{"type":"Buffer","data":[137,115,215,91,223,9,29,12,31,101,194,125,86,120,195,119,233,126,189,147]},"announce":[],"urlList":[]}}