{"title":"Dredd_3D_DELUXE.mp4","uid":7698885,"size":784332577,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8993501ed4798567d1426e7ed99ee5af7106fc7a&amp;dn=Dredd_3D_DELUXE.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"globeplus","files":-1,"time":1349446215,"description":"* MP4 CAM    * 01H24M18S    * + 1000 Bitrate    \n\n* Worked with the Dub plugins followed by MP4 conversion\n\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n- DELUXE Portuguese subtitles (art subtitle in portuguese)\n\n\n\n: Plot :\n\nThe future United States is an irradiated waste land known as the Cursed Earth. On the east coast of North America lies Mega-City One, a vast, violent metropolis containing 800 million residents where 17,000 crimes are reported daily and &quot;Slo-Mo&quot;, an addictive new drug that slows the user's perception of time to 1% of normal, has been introduced. The only force of order is the Judges, who act as judge, jury, and executioner. Judge Dredd is tasked by the Chief Judge with evaluating rookie Judge Anderson, a psychic who has failed the tests to become a full Judge. Elsewhere, in the 200-story slum tower block Peach Trees, drug lord Madeline Madrigal, known as Ma-Ma, infuses three men with Slo-Mo and throws their skinned bodies from the top of the tower. Dredd and Anderson respond and learn of a drug den, which they assault. They arrest Kay, one of Ma-Ma's henchmen, after Anderson psychically detects his involvement in the murders. To prevent Kay being removed from the building and interrogated about her operation, Ma-Ma's forces seize the tower's security control room and seal the building using its blast shields under the pretense of a security test, preventing the Judges from leaving or summoning help.\n\nMa-Ma orders Dredd's and Anderson's deaths. Several groups of armed men unsuccessfully try to kill the pair as the Judges proceed through the building with Kay to find safety. After arriving at one floor, the Judges are assaulted by Ma-Ma and her men using gatling guns that cut through the building's concrete walls and residents. The gunfire damages one of the tower's outer walls, allowing the Judges onto a balcony that enables them to call for backup. Ma-Ma sends her right-hand man Caleb to confirm the Judges' deaths. Dredd and Anderson, with no other avenue of escape, reenter the building. Dredd overcomes Caleb and throws him from the tower in view of Ma-Ma.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n* GLOBE FILES 2012\t\t","torrent":{"xt":"urn:btih:8993501ed4798567d1426e7ed99ee5af7106fc7a","amp;dn":"Dredd_3D_DELUXE.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8993501ed4798567d1426e7ed99ee5af7106fc7a","infoHashBuffer":{"type":"Buffer","data":[137,147,80,30,212,121,133,103,209,66,110,126,217,158,229,175,113,6,252,122]},"announce":[],"urlList":[]}}