{"title":"Deep.Wreck.Mysteries.1of3.U-Boat.Death.Trap.DVB.Xvid.mp3","uid":4290231,"size":780478464,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:89d0e44f40b63129c569c23186cd65c1cabe7352&amp;dn=Deep.Wreck.Mysteries.1of3.U-Boat.Death.Trap.DVB.Xvid.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"circlensess","files":1,"time":1215875685,"description":"Deep Wreck Mysteries\n\nHistory, War Documentary hosted by Sweeney MacArthur and published by Others in 2006 - English narration\n\n\nInformation\n------------------------------\n\nBritain is surrounded by shipwrecks, many sunk during the past two world wars. Deep below the sea surface, they remain silent witnesses to the conflict and carnage of their sinking. Until now, they&amp;#039;ve been difficult to find, their waters too deep to dive in, too dark and dangerous to film. With the United Kingdom&amp;#039;s top technical diving camera team, we descend into the unexpectedly crystal clear waters to reveal a world of political intrigue, cover-up and atrocity.\n\n\n1) U-Boat Death Trap \nThree submarines are discovered deep off the English coast. No one knows their identity, or how they came to be there. New advanced techniques now allow divers to explore these wrecks. British and German experts join forces to discover the wrecks are German U-boats from WWII. Further investigation reveals a dark secret for the first time in 60 years, hinting that the British were systematically targeting U-boats and their crew. Will this new information give grieving relatives the closure they&amp;#039;ve been waiting more than half a century for?\n\n2) Fatal Decision \nOff the coast of Cornwall a wartime maritime convoy heads for France in 1944. Suddenly an explosion rocks American merchant freighter, the Ezra Weston. The Canadian corvette, Regina, turns back to help. Within minutes, she too is blown apart, taking thirty men to their deaths. Did rogue mines strike both ships or was there something more sinister lurking below the surface targeting them? Advances in underwater technology now allow experts to revisit their watery graves and unlock the controversial events of that night for the first time, unmasking the guilty, and the gallant.\n\n3) Red Cross Outrage \nAttacks on ships clearly marked with the Red Cross are war crimes. The sinking of such vessels in the First World War renewed Britain&amp;#039;s hatred of the enemy. The discovery of two torpedoed hospital ships in the Bristol Channel dredges up more than tragic memories. Divers scouring the remains of the Rewa unearth uncomfortable new evidence that the ship may have been carrying cargo that, under wartime convention, was considered illegal. As further dives scour the collapsed hull for more clues, researchers back on dry land discover information that throws new light on these atrocities. Germany might not have been alone in breaking the rules of warfare.\n\nScreenshots\n------------------------------\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD MPEG-4 codec\nVideo Bitrate: 1800 KB/s\nVideo Aspect Ratio: 16:9\nVideo Resolution: 688 x 384\nAudio Codec: MPEG-1 Layer 3 (MP3)\nAudio BitRate: 192 KB/s (CBR)\nAudio Channels: 2 Ch\nRunTime: 00:52\nFramerate: 25 FPS\nNumber Of Parts: 3\nPart Size: 744 MB\nEncoded by: gavin63\nSubtitles: No TV Cap\nSource: DVB\n.\n\nLinks\n------------------------------\n\n1) Related Documentaries \n* Shipwreck Ark Royal\n* Shipwreck Detectives\n* Living Graveyard\n* Expedition: Bismarck\n* Search for the Japanese Fleet\n* The Lost Fleet of Guadalcanal\n* Search for Battleship Bismarck\n* Gallipoli Submarine\n* The Hunt for HMAS Sydney\n\n\n\nSource: http://docuwiki.net/index.php?title=Deep_Wreck_Mysteries","torrent":{"xt":"urn:btih:89d0e44f40b63129c569c23186cd65c1cabe7352","amp;dn":"Deep.Wreck.Mysteries.1of3.U-Boat.Death.Trap.DVB.Xvid.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d0e44f40b63129c569c23186cd65c1cabe7352","infoHashBuffer":{"type":"Buffer","data":[137,208,228,79,64,182,49,41,197,105,194,49,134,205,101,193,202,190,115,82]},"announce":[],"urlList":[]}}