{"title":"Sexually Broken--Cocksucking champ Veruca James ultimate test Ma","uid":9017534,"size":1021398889,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8a329480ba8133449ec2c50305ca77ba697d786e&amp;dn=Sexually+Broken--Cocksucking+champ+Veruca+James+ultimate+test+Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":-1,"time":1381218063,"description":"Cocksucking champ Veruca James put to the ultimate test, epic orgasms and brutal blow jobs! | Veruca James | Matt Williams\n\nOctober 7, 2013 \n\n\nMP4 only. \n\n \nWe already know that Veruca James is one of the best cocksuckers out there, she can take anything you throw at her without batting an eye. How do we up the stakes? Simple. You make her suck dick while tied down firmly on the world's most powerful vibrator. Lets see if that changes her skill set.\n\nVeruca is oiled up, her breasts are tightly tied and she is lashed down on top of a sybian. A sybian is, quite simply, the strongest vibrator ever invented by man. It sounds like a jet plane taking off. The only thing louder then a sybian is the sounds a woman makes when she is on top of it. Even a cocksucking expert will find it hard to be on her A-game while riding one of these.\n\nOnce Veruca is completely immobilized, the cock onslaught begins. It is a two cock tag team without mercy. Once after another the dicks step up to be serviced. 10 inches of BBC slide home and drool pours forth and coats her pale bound breasts. Never letting up, never giving her a break, and all the while the sybian is working its magic down below. Veruca's white skin flushes bright red and sweat beads up as her hair starts to sport the &quot;freshly fucked&quot; look. \n\nThe effects of the repeated, continual orgasms and the utter owning of her face pussy do the job. Gone is the pretty little porn star that walked in the door this morning. In her place is a sweaty, disheveled, drool-covered vacant-eyed sex zombie whose sole purpose in life is to suck dick. It is a good look on her, honestly. Breaking down porn stars is what Sexuallybroken does best. \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_07vjames3/SexuallyBroken-Veruca-James-Matt-Williams-Cocksucking-champ-Veruca-James-put-to-the-ultimate-test-epic-orgasms-and-brutal-blow-jobs.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/10_07vjames3/SexuallyBroken-Veruca-James-Matt-Williams-Cocksucking-champ-Veruca-James-put-to-the-ultimate-test-epic-orgasms-and-brutal-blow-jobs.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:8a329480ba8133449ec2c50305ca77ba697d786e","amp;dn":"Sexually+Broken--Cocksucking+champ+Veruca+James+ultimate+test+Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a329480ba8133449ec2c50305ca77ba697d786e","infoHashBuffer":{"type":"Buffer","data":[138,50,148,128,186,129,51,68,158,194,197,3,5,202,119,186,105,125,120,110]},"announce":[],"urlList":[]}}