{"title":"LEGO Batman 3 Beyond Gotham Proper-RELOADED","uid":11557587,"size":7405098039,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a4908872f0a1654b189a437044fdbb9154ce1b4&amp;dn=LEGO+Batman+3+Beyond+Gotham+Proper-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"techboy15","files":2,"time":1416844424,"description":"\nnERv\n\nLEGO Batman 3: Beyond Gotham (c) WB Games\n\n11/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action, Adventure\n\nProper note:\nFLT release crashes.\n\nGame information:\nAbout This Game The best-selling LEGO Batman videogame franchise returns in\nan out-of-this-world, action-packed adventure! In LEGO Batman 3: Beyond\nGotham, the Caped Crusader joins forces with the super heroes of the DC\nComics universe and blasts off to outer space to stop the evil Brainiac from\ndestroying Earth. Using the power of the Lantern Rings, Brainiac shrinks\nworlds to add to his twisted collection of miniature cities from across the\nuniverse. Now the greatest super heroes and the most cunning villains must\nunite and journey to different Lantern Worlds to collect the Lantern Rings\nand stop Brainiac before it's too late.\n\nExciting space combat - For the first time ever, battle with Batman and his\nallies in outer space and the various Lantern worlds including Zamaron and\nOdym.\nRobust roster of DC Comics heroes and villains - Play and unlock more than\n150 unique characters with amazing powers and abilities, including members of\nthe Justice League, and BIG LEGO Figures such as Cyborg, Solomon Grundy and\nmore.\nUnique storyline with new plots and twists Surprising disguises, Brainiac's\nmind control ability, and the power of the Lantern rings bring a whole new\ntwist to characters you thought you knew.\nHack computer terminals - Enter a virtual world to escape mazes, battle in\narenas, and race to find the code.\nBat-tastic Gadget Wheel - With a simple press of a button, choose and\nupgrade select character's suits and abilities.\nVariety of iconic locales - Visit the Hall of Justice, the Batcave, and the\nJustice League Watchtower to access shops, trophy rooms, and the hero and\nvehicle customizers.\n\n1. Unrar.\n2. Burn or mount the image.\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory.\n5. Play the game.\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:8a4908872f0a1654b189a437044fdbb9154ce1b4","amp;dn":"LEGO+Batman+3+Beyond+Gotham+Proper-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a4908872f0a1654b189a437044fdbb9154ce1b4","infoHashBuffer":{"type":"Buffer","data":[138,73,8,135,47,10,22,84,177,137,164,55,4,79,219,185,21,76,225,180]},"announce":[],"urlList":[]}}