{"title":"Diamond Cut DC8 v8.15 with Key [TorDigger]","uid":8407990,"size":33939606,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b94ae152cd9f63e833bd1bcbedd545b5eaf8370&amp;dn=Diamond+Cut+DC8+v8.15+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":9,"time":1366845413,"description":"Diamond Cut DC8\n\nDC8 contains the latest in signal processing technology for the most demanding Audio Restoration needs.\n\nDC8 includes features like a Big Click Filter which will automatically repair the extremely large clicks created by a cracked or badly gouged record.\n\nIt has a Direct Spectral Editor which provides you with the ability to manually attenuate or interpolate very long-lived noise events found on live recordings like coughs, whistling, chair movement and other unwanted spurious signals.\n\nDC8 includes two very useful restoration effects called the Sub-Harmonic and the Overtone Synthesizer. These new effects help re-create the lost lower and upper octaves of a recording adding more life to your restorations. File support has now been extended to Broadcast Wave (BWF), FLAC, and Ogg Vorbis.\n\nThe built in CD burner now supports Disc-at-Once (gapless) CD creation along with CD text support. DC8 also supports Data Disc burning capability. The DC Tune Library has expanded capability allowing you to use the Multifilter and all of its effects and presets on files being played. The DC Tune Library also now includes shuffle play and repeat play modes.\n\nChangelog:\n\nDC8.15 Release Date 4/19/13\nNew Features\nAdded the ability to normalize left channel or right channel independently. This appeard to work before but really did not, nor was it supposed to. It would alays use the overall peak value regardless of channel.\nBug Fixes\nFixed bug with resample function saving 8 bit files as 16bits\nFixed the feature to save temp files in same directory as audio files. It was not able to be turned off.\nFixed Track Spin control on the MP3 encoder dialog\nFixed Spectrum analyzer when switching between files of different sample rates.\nFixed bug in batch editor when creating VBR mp3 files. It now uses the default settings from the preferences dialogs\nFixed bug using spectral interpolate function. Some times it could crash on complex music\nFixed Big Click filter bypass function\nFixed bug opening an MP3 or other non-wave file from the command line\nFixed bug in the click filters on mono files using solo mode. The bug would cause bad replacements in the audio\n\nSupported OS:\n\nWindows XP SP2, Windows Vista or Windows 7 (any version)\n\nHomepage: http://www.diamondcut.com\n\nInstallation Instructions:\n\n1.) Install Program.\n2.) Use Given name and serial for application registration.\n3.) When asked for a Activation put activation code and choose method phone/email.\n4.) Done,Enjoy!\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:8b94ae152cd9f63e833bd1bcbedd545b5eaf8370","amp;dn":"Diamond+Cut+DC8+v8.15+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b94ae152cd9f63e833bd1bcbedd545b5eaf8370","infoHashBuffer":{"type":"Buffer","data":[139,148,174,21,44,217,246,62,131,59,209,188,190,221,84,91,94,175,131,112]},"announce":[],"urlList":[]}}