{"title":"The Strokes - Reptilia [promo].VOB","uid":9012154,"size":206082048,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8bb9c501f7e723213c5814e8b0a0ccf659e1cd7c&amp;dn=The+Strokes+-+Reptilia+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1381120466,"description":"The Strokes - Reptilia [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Reptilia&quot; is a song by indie rock band The Strokes, and the second single from their second album  Room on Fire. The single's B-side contains &quot;Modern Girls &amp; Old Fashion Men&quot;, where lead singer Julian Casablancas duets with Regina Spektor. The official release date was delayed slightly after Casablancas objected to the song being credited as &quot;The Strokes and Regina Spektor&quot;, claiming that it should read &quot;by Regina Spektor &amp; The Strokes&quot;.\n\nThe title &quot;Reptilia&quot; refers to the &quot;Reptilian complex&quot;, the central part of one's brain that handles basic emotions such as love and hate. The cover of the single features the artwork from the cabinet of the 1980 arcade game Centipede by Atari.\n\nIn October 2011, NME placed it at number 129 on its list &quot;150 Best Tracks of the Past 15 Years&quot;.Although it is not one of the band's highest charting singles since the song peaked art #19 on the Modern Rock Tracks chart, it is still one of the band's most popular singles.\n\nThe song features in the video games Guitar Hero III and Rock Band.\n\nThe music video for the song was their first that was not directed by Roman Coppola. Instead they chose Jake Scott to shoot the video, which features close shots of the band members' faces, hands and instruments while performing the song. At the end of the video, Julian Casablancas spits into the camera lens.\n\nThe Strokes are an American rock band from New York, consisting of Julian Casablancas (lead vocals), Nick Valensi (guitar, backing vocals), Albert Hammond, Jr. (guitar, backing vocals), Nikolai Fraiture (bass guitar) and Fabrizio Moretti (drums, percussion). \n\nUpon the release of their debut album Is This It in 2001, the group met much critical acclaim. Since then, the band has maintained a large fan base all over the world, most notably in the United States, the United Kingdom, Argentina, Canada, France, Brazil and Australia. A number of members have embarked on a variety of side projects, although a fourth album, entitled Angles, was released on March 22, 2011. They are one of the most prominent indie-rock bands to hail from the US at the dawn of the 21st century and helped start the garage rock revival movement. Is This It was ranked number 199 on Rolling Stone's 500 Greatest Albums of All Time.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Reptilia_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Reptilia_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/gAAboaAFJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/gAAboaAFJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:35\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.0\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:8bb9c501f7e723213c5814e8b0a0ccf659e1cd7c","amp;dn":"The+Strokes+-+Reptilia+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bb9c501f7e723213c5814e8b0a0ccf659e1cd7c","infoHashBuffer":{"type":"Buffer","data":[139,185,197,1,247,231,35,33,60,88,20,232,176,160,204,246,89,225,205,124]},"announce":[],"urlList":[]}}