{"title":"Organic Photovoltaics: Concepts and Realization","uid":6513852,"size":12513920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bcb8c62404991236a5df38a56cfae6abba51bae&amp;dn=Organic+Photovoltaics%3A+Concepts+and+Realization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1309740926,"description":"Christoph Joseph Brabec, Vladimir Dyakonov, JÃƒÂ¼rgen Parisi, &quot;Organic Photovoltaics: Concepts and Realization&quot; \n Publisher: Springer | ISBN: 354000405X | edition 2003 | Scan PDF | 300 pages | 15.1 mb\n\n The present volume describes and explains the fundamentals of organic/plastic solar cells in a manner accessible to both researchers and students. It provides an up-to-date and comprehensive account of these materials and corresponding devices, which will play a key role in future solar energy systems.\n\n Achieving efficient solar energy conversion at both large scale and low cost is among the most important technological challenges for the near future. The present volume describes and explains the fundamentals of organic/plastic solar cells in a manner accessible to both researchers and students. It provides a comprehensive analysis of the operational principles underlying several types of solar cells that have absorber layers based on polymer materials and small molecules. It addresses competing approaches, such as polymer solar cells and dye-sensitized cells, while considering the thermodynamic principles within the context of these schemes. Organic Photovoltaics also analyzes in detail the charge-transfer processes in the bulk-heterojunction devices corresponding to the relevant mechanism of carrier generation. Emphasized throughout is the concept of interpenetrating polymer-fullerene networks, due to their high potential for improving power efficiency.","torrent":{"xt":"urn:btih:8bcb8c62404991236a5df38a56cfae6abba51bae","amp;dn":"Organic+Photovoltaics%3A+Concepts+and+Realization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bcb8c62404991236a5df38a56cfae6abba51bae","infoHashBuffer":{"type":"Buffer","data":[139,203,140,98,64,73,145,35,106,93,243,138,86,207,174,106,187,165,27,174]},"announce":[],"urlList":[]}}