{"title":"Regime unter dem Hakenkreuz","uid":15338954,"size":608763480,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8c0c922b058c02695779c4a263a925adea92baa2&amp;dn=Regime+unter+dem+Hakenkreuz&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"anon17809","files":275,"time":1468806747,"description":"Geschichte zum Hören: Regime unter dem Hakenkreuz\r\n\r\nInhalt\r\n\r\nVon Anfang an spielte der Hörfunk eine besondere Rolle in der nationalsozialistischen Propaganda. So bemerkte Joseph Goebbels im März 1933: &quot;Der Rundfunk muss der Regierung die fehlenden 48 Prozent zusammentrommeln, und haben wir sie dann, muss der Rundfunk die 100 Prozent halten, muss sie verteidigen, muss sie innerlich so durchtränken mit den geistigen Inhalten unserer Zeit, dass niemand mehr ausbrechen kann.&quot;\r\n\r\nUm die Geschichte des Hörfunks in der NS-Zeit zu durchleuchten, startete 1983 der Rundfunk im Amerikanischen Sektor (RIAS) eine 25-teilige Sendereihe, die sich mit der NS-Geschichte beschäftigte. Die Sendereihe erschloss bis dahin nie gehörte Tondokumente. Der damalige Leiter des Bildungsprogramms Manfred Rexin verwirklichte die umfangreiche Dokumentation unter dem Titel &quot;Regime unter dem Hakenkreuz&quot;.\r\n\r\nMit Hilfe von zeitgenössischen Tonquellen dokumentiert &quot;Regime unter dem Hakenkreuz&quot; die Geschichte des nationalsozialistischen Deutschlands: Politik, Staat und Gesellschaft, Aufstieg und Niedergang der NS-Diktatur. Die Dokumentation mit einer Gesamtlänge von mehr als 22 Stunden gliedert sich in 25 Kapitel. Zu jedem Kapitel enthält die CD-ROM ausführliche Begleitmaterialien, u.a. Manuskripte und Texte zur Sendung, Aufgaben für den Unterricht sowie Literaturhinweise.\r\n\r\nDie Kapitel:\r\n\r\n1. Hitler und der Aufstieg der NSDAP bis 1930\r\n\r\n2. Eine Republik zerfällt – die NSDAP 1930-32\r\n\r\n3. Machteroberung – Deutschland 1933/34\r\n\r\n4. Chefredaktion Propagandaministerium – Rundfunk u. Presse i. Dritten Reich\r\n\r\n5. Arbeitsfront – Zur Lage der Arbeiter im Dritten Reich\r\n\r\n6. Erbhof – Die Bauern im Dritten Reich\r\n\r\n7. Gläubige Gefolgschaft – Jugend im Dritten Reich\r\n\r\n8. Abrichtung zum 'Volksgenossen' – Die Schule im Dritten Reich\r\n\r\n9. Willkür als Gesetz – Die Justiz des Dritten Reiches\r\n\r\n10. Ärzte im Braunhemd – Die Medizin des Dritten Reiches\r\n\r\n11. Wehrwirtschaftsführer – Industrielle im Dritten Reich\r\n\r\n12. Wahn als Wissenschaft – Universitäten im Dritten Reich\r\n\r\n13. Vor der Pogromnacht – Die Verfolgung der Juden 1933-1938\r\n\r\n14. Deutsche Christen – Die evangelische Kirche im Dritten Reich\r\n\r\n15. Konkordat und Konflikt – Die katholische Kirche im Dritten Reich\r\n\r\n16. Blut und Boden – Zur Kulturpolitik des Dritten Reiches\r\n\r\n17. Führer befiehl! – Die Herrschaft der Partei\r\n\r\n18. Generäle des Gefreiten – Die Wehrmacht im Dritten Reich\r\n\r\n19. Weltmachtträume – Die Außenpolitik des Dritten Reiches bis 1938\r\n\r\n20. Abmarsch in den Untergang – Kriegsausbruch 1939\r\n\r\n21. Vergewaltigte Völker – Das besetzte Europa im Krieg\r\n\r\n22. 'Endlösung' – Die Verfolgung der europäischen Juden 1939-1945\r\n\r\n23. Aufstand des Gewissens – Der Widerstand gegen das Dritte Reich\r\n\r\n24. Totaler Krieg – Deutschland 1943/1944\r\n\r\n25. Ein deutsches Trümmerfeld – Das Ende des Dritten Reiches","torrent":{"xt":"urn:btih:8c0c922b058c02695779c4a263a925adea92baa2","amp;dn":"Regime+unter+dem+Hakenkreuz","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0c922b058c02695779c4a263a925adea92baa2","infoHashBuffer":{"type":"Buffer","data":[140,12,146,43,5,140,2,105,87,121,196,162,99,169,37,173,234,146,186,162]},"announce":[],"urlList":[]}}