{"title":"Roxy's Yoga Conditioning with Roxy Shahidi x264 aac [MP4]","uid":11847891,"size":1874405926,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:8c562c272e3d19528e6b4d198f91da00bef0956d&amp;dn=Roxy%27s+Yoga+Conditioning+with+Roxy+Shahidi+x264+aac+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elessedilgirl","files":2,"time":1429992957,"description":"TV and theatre actress Roxy Shahidi, better known for her role in Emmerdale, has been a keen exponent of Yoga for the past 12 years, Yoga is her passion and her joy. In this DVD Roxy has created three unique 45 minute Yoga workouts. The workouts are designed to fit around your daily routine and are long enough to provide a balanced and challenging workout with the potential to produce some amazing effects. Written in a way to enable you to choose your focus according to your specific needs, the first workout focuses on full body whilst the second helps develop and strengthen the core and the third is lower body focussed. The workouts have been designed for intermediate levels but with options for beginners making the workouts very accessible for both levels. The workouts are dynamic but if you approach them with a calm focus you will also find elements of them relaxing and de-stressing. As Roxy suggests this DVD can be challenging for some, but be patient, respect your body and just go to your edge. With steady progress you will achieve some great results. Practising Yoga regularly has the potential to change your body and enhance your life. With patience and persistence you will achieve great results.\n\nVideo; x264; 720*576 (16:9); 1818 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:8c562c272e3d19528e6b4d198f91da00bef0956d","amp;dn":"Roxy%27s+Yoga+Conditioning+with+Roxy+Shahidi+x264+aac+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c562c272e3d19528e6b4d198f91da00bef0956d","infoHashBuffer":{"type":"Buffer","data":[140,86,44,39,46,61,25,82,142,107,77,25,143,145,218,0,190,240,149,109]},"announce":[],"urlList":[]}}