{"title":"Catherine Breillat - Joe Dallasandro - Tapage nocturne (1979) ","uid":6549963,"size":4590702592,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8c5f71fb206fcab9e8bd35367bb5a62e6b87fb68&amp;dn=Catherine+Breillat+-+Joe+Dallasandro+-+Tapage+nocturne+%281979%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"oddeven","files":-1,"time":1311039397,"description":"The box calls it Night after Night, IMdB calls it Nocturnal Uproar.  In any case this is the first released film directed by Catherine Breillat, as A Real Young Girl was delayed by more than 20 years due to censorship. In fact, this film might appear prudish in comparison, not by subject matter, rather by what is actually exposed...very little.\n\nThe film follows a youngish female film director who is constantly on the hunt for a man.  Does she want a relationship - there's a lot of chatter about that - or does she just want to have fun? Is she just a young, unsatisfied, and experimental twentysomething?  Peut-ÃƒÂªtre. To paraphrase: Relationship?  I don't see any relationship.\n\nSerge Gainsbourg was responsible for the musical contributions, in a late, rock and roll Gainsbourg sort of way. Joe Dallasandro gives the opening scenes their character, though he disappears soon enough, as the dominant &quot;relationship&quot; with Bruno (Bertrand Bonvoisin) takes form.\n\nThe subtitles on this retail version are quite awkward, and sometimes just plain wrong, though you can certainly follow the story.  You might have a niggling feeling that you're missing something...\n\nApparently the same distributor, Pathfinder Pictures, is planning on releasing Breillat's &quot;Sale comme un ange&quot; later this year.  I hope they do a better job on the subtitles, as it will make all of Breillat's directorial contributions available on DVD. Plenty of those DVD releases could use some improvement, but at least they are available.\n\nThe extras include unsubtitled trailers, not really a good marketing plan.\n\nUncompressed DVD5 VIDEO_TS files","torrent":{"xt":"urn:btih:8c5f71fb206fcab9e8bd35367bb5a62e6b87fb68","amp;dn":"Catherine+Breillat+-+Joe+Dallasandro+-+Tapage+nocturne+%281979%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c5f71fb206fcab9e8bd35367bb5a62e6b87fb68","infoHashBuffer":{"type":"Buffer","data":[140,95,113,251,32,111,202,185,232,189,53,54,123,181,166,46,107,135,251,104]},"announce":[],"urlList":[]}}