{"title":"Triangle&amp;Trialogue Papers(reports to Trilateral Commission)","uid":5081272,"size":445519043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c704dbea699892d0dfc23d9f946448ee33916a6&amp;dn=Triangle%26Trialogue+Papers%28reports+to+Trilateral+Commission%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1252281756,"description":"This is the complete collection of reports (Triangle reports) and annual meeting publications (Trialogue series) of major globalist group called the Trilateral Commission which was formed in 1973 by private citizens of Europe, Japan and North America to foster closer cooperation among these three democratic industrialized regions on common problems. From time to time they publish various reports on their activity which actually lay in plain sight what the future will be like. Their Task Force Reports (Triangle reports) not only discuss current world affairs but openly talk about the globalist agenda as it unfolds everyday before our very eyes. Almost every year they also meet at their annual meetings which are described in the Annual Meeting Publications (Trialogue Series). The Trilateral Commission is one of those elitist groups (like the Bilderbergers) that the public knows little about. These reports provide priceless research material that will introduce you to the world of big money, geopolitics and various social experiments that are imposed on world population - often with disastrous effects for the common guy on the street. Included are all 59 Triangle papers (except the 3 unpublished ones) and all 56 Trialouge annual meeting publications. A must read for everyone.\n\nMissing (unpublished) Triangle papers (complete list at http://www.trilateral.org/projwork/tfrsgen.htm):\n20 - Major Payments Imbalances and International Financial Stability (1979, in draft form)\n34 - Science and Technology in Trilateral Relations: Competition and Cooperation (1988, in draft form)\n47 - Revitalizing Trilateral Democracies (1995, in draft form)\n\nTrialogue series complete list at http://www.trilateral.org/annmtgs/trialog/trlglist.htm\n","torrent":{"xt":"urn:btih:8c704dbea699892d0dfc23d9f946448ee33916a6","amp;dn":"Triangle%26Trialogue+Papers%28reports+to+Trilateral+Commission%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c704dbea699892d0dfc23d9f946448ee33916a6","infoHashBuffer":{"type":"Buffer","data":[140,112,77,190,166,153,137,45,13,252,35,217,249,70,68,142,227,57,22,166]},"announce":[],"urlList":[]}}