{"title":"Coast to Coast AM June 06, 2013 - Numerology Coral Castle","uid":8560076,"size":55379509,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8d20e5e5e78d6d78e1a41db8bf97eaf79ded1fe1&amp;dn=Coast+to+Coast+AM+June+06%2C+2013+-+Numerology+Coral+Castle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pyramid91","files":5,"time":1370860990,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-06-13\nHost:\nGeorge Noory\nGuests:\nGlynis  McCants,                   Michael  Kohler\nIn the first half, numerologist Glynis McCants offered interpretations to recent events in the news. Many issues came to light this past May, a &quot;5&quot; month, which promotes drama. A number of incidents negatively impacted Pres. Obama and his administration, such as Benghazi whistleblowers coming forward, and the AP and IRS scandals. The &quot;5&quot; energy is extremely toxic to Obama's personal numerology, she explained. Obama is in a personal year of &quot;9,&quot; which means he's in a cycle of clearing his space for new beginnings, and this could indicate he'll be making further changes in his administration, she said. She also cited July (&quot;7&quot;) and August (&quot;8&quot;) as months that will prove especially difficult for Obama. 2013, a &quot;6&quot; year, is all about accountability, she added. \nShe talked about how she learned from Louise Hay that using affirmations can be an effective way to bring about change in one's life. By repeating an affirmation for 15 minutes a day, you can transform the way your mind thinks, she contended. One such affirmation she shared: &quot;Abundance is my divine right. I'm healthy, wealthy, and loved.&quot; During the second hour, Glynis gave numerology readings to callers based on their first names and birth dates.  \n-----------------------------------------\nIn the latter half, author and researcher Michael Kohler discussed the work of Edward Leedskalnin and his Coral Castle near Miami, Florida. People have long been puzzled by how this man of slight build was able to single-handedly move huge coral rocks, in addition to moving some 200 tons from Florida City (Coral Castle's original location) to Homestead. The rocks were placed on a flatbed truck but no one ever saw how Leedskalnin got them off the vehicle, and into their ultimate positions. After the move to Homestead, he added an additional 900 tons of coral rocks to the new location, Kohler recounted. \nLeedskalnin figured out the mathematical concept of Phi (based on the Fibonacci sequence) and used it in his overall design of Coral Castle, Kohler theorized. He thinks Leedskalnin may have tapped into certain &quot;morphic fields&quot; during a near-death experience, which gave him the knowledge or ability to use frequency changes to cause the stones to get lighter-- possibly via his pineal gland. At the Homestead site, he may have been using a different method to move the stones such as through counter-rotating fields and electromagnetism, Kohler suggested. His placement of the Obelisk, a 30 ton solid piece of coral (see related video), could have been implemented to take or charge energy from the ground or groundwater. \nNews segment guests: Roger Tolces, Alan Collinge, Douglas Dietrich\nWebsite(s):\n coralcastleexplained.com\n numberslady.com\nbook(s):\n Coral Castle Explained\n Love by the Numbers\n Glynis Has Your Number\n","torrent":{"xt":"urn:btih:8d20e5e5e78d6d78e1a41db8bf97eaf79ded1fe1","amp;dn":"Coast+to+Coast+AM+June+06%2C+2013+-+Numerology+Coral+Castle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d20e5e5e78d6d78e1a41db8bf97eaf79ded1fe1","infoHashBuffer":{"type":"Buffer","data":[141,32,229,229,231,141,109,120,225,164,29,184,191,151,234,247,157,237,31,225]},"announce":[],"urlList":[]}}