{"title":"Windows Administration at the Command Line","uid":3611316,"size":15861311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8da5f27179c0e85830215759a4b8f0851f7e1f5d&amp;dn=Windows+Administration+at+the+Command+Line&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xenn00","files":1,"time":1170665292,"description":"Windows Administration at the Command Line for Windows 2003, Windows XP, and Windows 2000 - 554 PDF Pages\n\nThe only complete reference for Windows command line utilitiesInstant results for time-crunched IT professionals\n\nThe last thing you want as a busy systems administrator is to click endlessly through the Windows GUI every time you need to perform a simple task. Want a better solution? Windows Administration at the Command Line reacquaints you with the often-overlooked utilities accessible through the command line in Windows 2003, XP, and 2000.\n\nLocate files, check system status, secure and monitor systems, and best of all, save time by using scripts to automate your time-consuming management tasks. This practical book reveals all the command line utilities and puts them right at your fingertips. The only resource on the market with the complete set of Windows command line utilities, this hands-on reference gives you solutions that yield superior results compared to GUI-based utilities, increasing your productivity in the field.\n\nInside you?ll find:\n\n- The complete set of all Windows command line utilities\n- Real world scenarios that focus on practical applications\n- Information on third-party utilities and scripting techniques\n- Instructions for using the .NET Framework utilities\n- A preview of Windows Vista utilities including detailed instructions for using Monad and MSH\n- An appendix with 52 command line tricks and techniques.","torrent":{"xt":"urn:btih:8da5f27179c0e85830215759a4b8f0851f7e1f5d","amp;dn":"Windows+Administration+at+the+Command+Line","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da5f27179c0e85830215759a4b8f0851f7e1f5d","infoHashBuffer":{"type":"Buffer","data":[141,165,242,113,121,192,232,88,48,33,87,89,164,184,240,133,31,126,31,93]},"announce":[],"urlList":[]}}