{"title":"Terrorism in American Cinema An Analytical Filmography, 1960-200","uid":11524806,"size":1533671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e2e6a1e97d73ae302e3e734c40e3b2fa16a865c&amp;dn=Terrorism+in+American+Cinema+An+Analytical+Filmography%2C+1960-200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416519731,"description":"The American cinema of terrorism, although coming to prominence primarily in the 1970s amidst high-profile Palestinian terrorist activity, actually dates back to the beginnings of the Cold War. But this early terrorist cinema, centered largely around the Bomb--who had it, who would use it, and when--differs greatly from the terrorist cinema that would follow. Changing world events soon broadened the cinema of terrorism to address emerging international conflicts, including Black September, pre-9/11 Middle Eastern conflicts, and the post-9/11 &quot;War on Terror.&quot; This analytical filmography of American terrorist films establishes terrorist cinema as a unique subgenre with distinct thematic narrative and stylistic trends. It covers all major American films dealing with terrorism, from Otto Preminger's Exodus (1960) to Ridley Scott's Body of Lies (2008).\n\nPublisher: McFarland (September 28, 2009)\nLanguage: English\nISBN-10: 0786441550\nISBN-13: 978-0786441556\n\nMore About the Author\nRobert Cettl\nBiography\nFreelance author, multimedia eBook digital publisher, independent ethnographic filmmaker and TESOL tutor, Robert Cettl is a former SAR Research Fellow at Australia's National Film &amp; Sound Archive in Canberra. He has a Bachelor of Arts (with Honours) in Cinema Studies, a Graduate Diploma in Information Studies (Librarianship), a Graduate Certificate in TESOL and a Masters degree in TESOL. He taught English in China for one year in 2011-12 before returning to Australia to complete post-graduate study in TESOL.\n\nRobert's film non fiction in print is published in the USA by McFarland &amp; Co. Inc. &amp; Bloomsbury Academic. His digital feature videos are in the collection of Australia's National Film &amp; Sound Archive. In addition his papers on censorship and digital dissemination was presented at the 2011 Textual Manipulation Conference of the Australia / NZ Bibliographical Society, and his paper on digital publishing and disability arts was presented at the 2012 Arts Activated Conference in Sydney.\n\nRegistered with Thorpe-Bowker as an indie publisher and distributing through LSI and PODG worldwide, Robert also self-publishes his own film non-fiction eBooks and continues to make ethnographic feature films. An authentic &quot;film lover&quot; Robert eschews traditional and contemporary Hollywood to embrace social media discourses, yet as a confirmed post-modernist, he considers even his own films &quot;texts&quot;. He often jokes with the authors and artists he publishes and deals with that as a trained deconstructionist, he is their natural enemy.\n\nMost Helpful Customer Reviews\n\nThe Politics of Spectacle\nBy Nicholas Towasser on April 9, 2010\nWhat is terrorism? Is it the use of violence, particularly against civilians, to effectuate political change? If that's the case, why should we limit our definition to lethal aggression practiced by relatively small groups like Al Qaeda and the IRA? Governments constantly unleash deadly force upon innocents: just ask the citizens of Hiroshima and Nagasaki, or former inmates of Auschwitz and Dachau.\n\nAustralian film-reviewer Robert Cettl raises this and other vital points in the introduction to his &quot;Terrorism in American Cinema: An Analytical Filmography, 1960-2008.&quot; It never occurred to me there was a terrorism genre, but Cettl with tremendous care limns its development. It has roots in the spy genre, although the form came to maturity in the 1970s with the rise of the PLO hijackings and such films as &quot;Black Sunday.&quot;\n\nLike magicians and filmmakers, terrorists conjure spectacles that both fascinate us. More than Hitchcock or James Bond villains, they parallel movie monsters: as with Dracula, Freddy Kruger, and Jason, they impregnate our minds with inexorable nightmares. As Cettl writes of terrorism beginning the 1970s,\n\n&quot;In the targeting of these non-combatants and the deliberate courting of media exposure, the new and refined definition of terrorism soon became of paramount importance in cinema to distinguish it from previous Cold War agendas.&quot;\n\nUnlike the war movie, which by its nature allows audiences to divorce themselves from the carnage, the terrorist film depicts an assault upon civilians. The audience can't help but empathize with the victims, and as with the horror movie, experience their pain.\n\nAnd like the horror movies, terrorist films make morally curious bargains with audiences","torrent":{"xt":"urn:btih:8e2e6a1e97d73ae302e3e734c40e3b2fa16a865c","amp;dn":"Terrorism+in+American+Cinema+An+Analytical+Filmography%2C+1960-200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e2e6a1e97d73ae302e3e734c40e3b2fa16a865c","infoHashBuffer":{"type":"Buffer","data":[142,46,106,30,151,215,58,227,2,227,231,52,196,14,59,47,161,106,134,92]},"announce":[],"urlList":[]}}