{"title":"Twinkie, Deconstructed Journey by Steve Ettlinger","uid":9409723,"size":1571425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f1b4758be12472da86af4ff5a37f1ec36fd42ad&amp;dn=Twinkie%2C+Deconstructed+Journey+by+Steve+Ettlinger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"420weedman","files":-1,"time":1388254132,"description":"A pop-science journey into the surprising ingredients found in most common packaged foods. \nLike most Americans, Steve Ettlinger eats processed foods. And, like most consumers, he didn't have a clue as to what most of the ingredients on the labels mean. So when his young daughter asked, Daddy, what's polysorbate 60?, he was at a loss and determined to find out. \nFrom the phosphate mines in Idaho to the oil fields in China to the Hostess factories and their practices, Twinkie, Deconstructed demystifies some of the most common processed food ingredients, where they come from, how they are made, how they are used, and why. Beginning at the source (hint: they're often more closely linked to rock and petroleum than any of the four food groups), we follow each Twinkie ingredient through the process of being crushed, baked, fermented, refined, and/or reacted into a totally unrecognizable goo or powder, all for the sake of creating a simple snack cake. \nAn insightful exploration of the modern food industry, if you've ever wondered what you're eating when you consume foods containing mono- and diglycerides or calcium sulfate (the latter a food-grade equivalent of plaster of paris), this book is for you. Consequently, as Hostess plans to permanently close its doors in 2012, this book will provide a relevant guide into the practices of one of the biggest companies of all time. ","torrent":{"xt":"urn:btih:8f1b4758be12472da86af4ff5a37f1ec36fd42ad","amp;dn":"Twinkie%2C+Deconstructed+Journey+by+Steve+Ettlinger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f1b4758be12472da86af4ff5a37f1ec36fd42ad","infoHashBuffer":{"type":"Buffer","data":[143,27,71,88,190,18,71,45,168,106,244,255,90,55,241,236,54,253,66,173]},"announce":[],"urlList":[]}}