{"title":"Zani Diabate &amp; The Super Djata Band [FLAC] TQMP","uid":6547390,"size":225111439,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8f2f36bb813c387a52033c08a1a7e2ba39c937ff&amp;dn=Zani+Diabate+%26+The+Super+Djata+Band+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pastafari","files":-1,"time":1310927633,"description":"Zani DiabatÃƒÂ© &amp; The Super Djata Band\n(Mango, 1988)\n\nAn out-of-print, currently overpriced (as expected) album that's a gem. Zani was one of the greatest electric guitarists of West Africa. Although he's been compared to Hendix, B.B. King and T-Bone Walker, he was rather one of a kind. If you like other great West African guitar players like Djelimady Tounkara (Rail Band, AfroCubism) and SÃƒÂ©kou Bembeya DiabatÃƒÂ© (Bembeya Jazz), it's time you listen to Zani. Hope you enjoy it.\n\n* * * * * * * * * * * * * * * * * * *\n\nZani DiabatÃƒÂ©, prominent guitar player in the Super Djata Band, one of the most popular bands from Bamako during the 1980s, joined the Ballet National in 1963, where he sang, danced and played guitar, kora, balafon and percussion. In his spare time, he would play in Harmonica Jazz, where he played harmonica, and later he formed the Ganoua Band with Daouda SangarÃƒÂ© on kamalen n'goni and on vocals, and with MarÃƒÂ© Sanogo on djembÃƒÂ©. In the early 1970s, the Ganoua Band was appointed the third National Orchestra of Mali (Formation C). When they were left without work, Zani and his fellow band members decided to switch to a private band which they named (Super) Djata Band. It was in 1974 that they started recording for Radio Mali.\n\nProminent singer Daouda &quot;Flani&quot; SangarÃƒÂ© was invited to join the Ballet National in 1968, where he introduced his friend Alou FanÃƒÂ©. The two recorded more traditional influenced kamalen n'goni music together for Radio Mali in 1968, a recording that was later released by the Ivorian label Disco Club BagouÃƒÂ©.\n\nThe sound of Super Djata, based on the, compared to the mellow malinke sound of for instance the Rail Band, hard hitting Bambara rhythms and melodies, is highly coloured by the outstanding guitar playing by Zani DiabatÃƒÂ©.\n\nSince the late 1980s, band members DounankÃƒÂ© Koita and Bamba DembÃƒÂ©lÃƒÂ© left the Super Djata Band and started solo careers. Zani was appointed since a few years as the director of the National Ballet du Mali and played only occasionally. He left the Super Djata Band to his son. Sadly, Zani passed away in January 2011 after brain damage he suffered from a stroke on 9 December 2010, when entering a Paris studio in order to record with his son and Flani's son. Flani, Alou and his brother Bakary preceded him years ago.\n\nsource &lt;a href=&quot;\nhttp://www.musiques-afrique.com/frames/art_diabate_zani.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.musiques-afrique.com/frames/art_diabate_zani.html&lt;/a&gt;\n\n* * * * * * * * * * * * * * * * * * *\n\nAlong with Super Biton and the Ambassadeurs, Super Djata are one of the best bands in Mali, leader Zani DiabatÃƒÂ© is from one of the greatest griot families in the country.\n\nA multi-instrumentalist (kora, guitar, percussion, balafon), dance, singer, Zani joined the National Ballet, the country's premier folkloric ensemble, in 1963. He formed the Super Djata Band in 1969 together with six members of the National Ballet.\n\nZani adopted traditional rhythms and melodies to electric instrumentation. A widely acclaimed personality on the Malian music scene, he is above all a totally original guitarist bringing to mind: Jimi Hendrix, T-Bone Walker, B.B. King and Freddie King whilst remaining unmistakably Malian in his musical approach.\n\nZani and Super Djata were discovered by the French in May 1984 when they performed at the Jazz in France Festival at Angouleme. This their first LP which was the best selling African record in Holland in 1986.\n\nThey have toured successfully in France, Holland and Germany playing to ecstatic audiences wherever they visit.\n-- CD notes.\n\n* * * * * * * * * * * * * * * * * * * \n\nWritten-by, Guitar [Lead] - Zani DiabatÃƒÂ©\nBass - Abou Drahamane Camara\nDrums - Lamoussa Diabate\nGuitar - Ousmane Dicko\nKeyboards - Doumanke Koita\nLead Vocals - Daouda &quot;Flani&quot; Sangare\nPercussion - Bemba Dembele\nPercussion, Timbales - Bakari Diabate\nVocals - Alou Fane , Idrissa Magassa , Salia Sanogo\n\nRecorded at: Studio du Manoir, Leon\nProduced by: Milady Music\nThis record was first released in 1985 on the French Milady Music Label.\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - Super Djata\n02 - Bina\n03 - Djegnogo Djougou\n04 - Bandjila\n05 - Tindoro\n06 - Noumousso\n07 - Facia\n08 - Farima\n09 - Fadingna Kouma\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8f2f36bb813c387a52033c08a1a7e2ba39c937ff","amp;dn":"Zani+Diabate+%26+The+Super+Djata+Band+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f2f36bb813c387a52033c08a1a7e2ba39c937ff","infoHashBuffer":{"type":"Buffer","data":[143,47,54,187,129,60,56,122,82,3,60,8,161,167,226,186,57,201,55,255]},"announce":[],"urlList":[]}}