{"title":"The Wannadies - Be A Girl (1994)","uid":6871246,"size":297108449,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8fac7dc5d521eb5292c49fde33047776dd698613&amp;dn=The+Wannadies+-+Be+A+Girl+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"GenXRock","files":-1,"time":1323278720,"description":"This is the album that rocketed the Wannadies to stardom internationally. Thanks to start-stop dynamics of the romantic power-pop single &quot;You and Me Song,&quot; the band managed to find success on both sides of the Atlantic; in the U.K. the song hit the charts at the height of the Brit-pop movement and in the U.S. (where this album was never released) the song was featured in a prominent scene of the movie Romeo and Juliet. The magic of this album doesn't stop there, though. In fact, &quot;Be a Girl&quot; is a tour de force that lasts throughout the album's entire 11 tracks. Beside &quot;You and Me Song,&quot; there's &quot;Might Be Stars,&quot; another huge U.K. hit that is, without a doubt, one of the best songs ever written about being a rock star. Other highlights include the pure-pop mania of &quot;Love in June&quot; and &quot;New World Record,&quot; a punchy, loud, arena-ready stomper. The guitars are noticeably louder on this disc, and the pace barely relents before &quot;Kid,&quot; a gut-wrenching power-ballad, sends the listener away wanting another 11 tracks. This is classic Brit-pop from beginning to end -- a life-affirming album that reminds us why rock &amp; roll is so great.","torrent":{"xt":"urn:btih:8fac7dc5d521eb5292c49fde33047776dd698613","amp;dn":"The+Wannadies+-+Be+A+Girl+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fac7dc5d521eb5292c49fde33047776dd698613","infoHashBuffer":{"type":"Buffer","data":[143,172,125,197,213,33,235,82,146,196,159,222,51,4,119,118,221,105,134,19]},"announce":[],"urlList":[]}}