{"title":"Mythology: The DC Comics Art of Alex Ross","uid":5871796,"size":136900005,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:8fdcadb0f7ade13eb5151e2b2e1fe87f369d22a5&amp;dn=Mythology%3A+The+DC+Comics+Art+of+Alex+Ross&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mrspatula","files":280,"time":1286481698,"description":"With art that looks like a hybrid of Norman Rockwell and Jack Kirby, artist Ross has become the preeminent painter of superheroes of his generation. This lavish coffee- table tribute puts him into a pantheon as exalted as the superbeings he depicts. The son of a preacher and an illustrator, Ross was always captivated by superheroes, but it wasn't until he discovered the use of live models in art school that he was able to realize his visions of Superman, Batman, Wonder Woman and the rest. Like Rockwell, Ross uses photographs to set up lighting and staging-a process documented in a section at the end of the book-and like Rockwell, he favors otherworldly lighting effects that somehow serve to make his figures more realistic. Like Kirby, he has an innate belief in the iconic power of superheroes that gives them a dimension far beyond the usual four-colored adventures. Whether in Kingdom Come, a renowned tale of the twilight of the superheroes; his own oversized stories written with Paul Dini; or countless posters, covers and commissions, Ross's vision of beings so powerful they verge on arrogant will make viewers glad they don't exist in the real world. Kidd's text is laudatory but never cloying, and the book includes numerous studies, sketches and photos to show Ross's method. While collectors and fans gush over Ross's output, the sheer weight of pictures of every superteam in DC's universe does become somewhat numbing by the end. Still, the immense power of Ross's best images cuts through any clutter, and this volume deftly showcases just that. \n\n &lt;a href=&quot;\nhttp://www.amazon.com/Mythology-Comics-Art-Alex-Ross/dp/0375422404&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mythology-Comics-Art-Alex-Ross/dp/0375422404&lt;/a&gt;\n\n\nContains 280 High resolution Jpeg's","torrent":{"xt":"urn:btih:8fdcadb0f7ade13eb5151e2b2e1fe87f369d22a5","amp;dn":"Mythology%3A+The+DC+Comics+Art+of+Alex+Ross","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fdcadb0f7ade13eb5151e2b2e1fe87f369d22a5","infoHashBuffer":{"type":"Buffer","data":[143,220,173,176,247,173,225,62,181,21,30,43,46,31,232,127,54,157,34,165]},"announce":[],"urlList":[]}}