{"title":"Electric Power Substations Engineering,2nd Edition - (Malestrom)","uid":4657604,"size":31699592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9027886cdf2ae7a3e69e5d0f53330c16050a677e&amp;dn=Electric+Power+Substations+Engineering%2C2nd+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1232264067,"description":" &lt;a href=&quot;http://www.image-upload.net/images/bj2tjunf60ulu1f5k6fq.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/bj2tjunf60ulu1f5k6fq.jpeg&lt;/a&gt;\n\nElectric Power Substations Engineering, Second Edition (The Electric Power Engineering)\nCRC | ISBN: 0849373832 | 2007-05-30 | PDF | 424 pages\n\nCombining select chapters from Grigsby's standard-setting The Electric Power Engineering Handbook with several chapters not found in the original work, Electric Power Substations Engineering became widely popular for its comprehensive, tutorial-style treatment of the theory, design, analysis, operation, and protection of power substations. \n\nFor its second edition, this popular progeny rejoins the handbook as one in a set of five carefully focused volumes. In addition to substantial updates in most areas, this bestselling reference brings to the Handbook its five original contributions, covering such diverse topics as communications, physical and cyber security, and gas-insulated transmission lines (GIL). \n\nThis edition also includes two entirely new chapters on substation asset management and substation commissioning. Major updates appear in the highly active areas of integration, automation, substation grounding, high-voltage switching equipment, and air- and gas-insulated substations. With contributions by active leaders from around the world, the coverage reflects international standards, practices, and technologies, not limited to those found in North America. \n\nIn fact, many of the contributors are involved in developing the standards in their area of expertise. Updated to include the latest developments, trends, and technologies, Electric Power Substations Engineering, Second Edition provides a thorough and up-to-date guide for power engineers at all levels of expertise.","torrent":{"xt":"urn:btih:9027886cdf2ae7a3e69e5d0f53330c16050a677e","amp;dn":"Electric+Power+Substations+Engineering%2C2nd+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9027886cdf2ae7a3e69e5d0f53330c16050a677e","infoHashBuffer":{"type":"Buffer","data":[144,39,136,108,223,42,231,163,230,158,93,15,83,51,12,22,5,10,103,126]},"announce":[],"urlList":[]}}