{"title":"High Temperature Performance of Polymer Composites","uid":15272626,"size":4033830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9047da249e51fed7072547919329078eda10c6fc&amp;dn=High+Temperature+Performance+of+Polymer+Composites&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468278993,"description":"High Temperature Performance of Polymer Composites - Yu Bai, Thomas Keller (Wiley-VCH, 2014).pdf\r\n\r\nISBN 978-3-527-32793-5\r\n\r\nThe authors explain the changes in the thermophysical and thermomechanical properties of polymer composites under elevated temperatures and fire conditions. Using microscale physical and chemical concepts they allow researchers to find reliable solutions to their engineering needs on the macroscale. In a unique combination of experimental results and quantitative models, a framework is developed to realistically predict the behavior of a variety of polymer composite materials over a wide range of thermal and mechanical loads. In addition, the authors treat extreme fire scenarios up to more than 1000?C for two hours, presenting heat-protection methods to improve the fire resistance of composite materials and full-scale structural members, and discuss their performance after fire exposure.\r\n\r\nThanks to the microscopic approach, the developed models are valid for a variety of polymer composites and structural members, making this work applicable to a wide audience, including materials scientists, polymer chemists, engineering scientists in industry, civil engineers, mechanical engineers, and those working in the industry of civil infrastructure","torrent":{"xt":"urn:btih:9047da249e51fed7072547919329078eda10c6fc","amp;dn":"High+Temperature+Performance+of+Polymer+Composites","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9047da249e51fed7072547919329078eda10c6fc","infoHashBuffer":{"type":"Buffer","data":[144,71,218,36,158,81,254,215,7,37,71,145,147,41,7,142,218,16,198,252]},"announce":[],"urlList":[]}}