{"title":"Ernst Zundel - Genocide by Propaganda (1983)","uid":6299594,"size":326594966,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:90fb5f9082598b429fd2084642cb48874bc4f05e&amp;dn=Ernst+Zundel+-+Genocide+by+Propaganda+%281983%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Borzoi","files":1,"time":1302111237,"description":"As far as I know, this is the first video that was ever made by Ernst Zundel.  It consists of Ernst Zundel along with a Swedish historian and an American Military analyst.\n\nThis documentary is almost 2 hours in length, BUT.., is EXTREMLY well worth your time to watch !!\n\nI consider that anyone who will ACTUALLY take the time to watch AND listen to the entire video (regardless of the video quality).., and then still believe that the Auschwitz prison camp was &quot;the death camp of death camps&quot; is either lying to them self.., or does not have the ability to &quot;think for them self&quot; !!\n\nI also believe that the greatest disadvantage to a person learning truth (and un-learning a falsehood), is when one has an attitude that is equivalent to them as saying: &quot;I already have my mind made-up.., so PLEASE don't confuse me with the facts&quot; !!\n\nThis video was made into an &quot;avi&quot; file from a VHS cassette copy.., of another VHS cassette copy.., that was made all the way back in 1983.  I did my best with cleaning-up and sharpening this video, and believe it is more than watchable for anyone who wishes to watch AND hear &quot;the facts&quot; !!\n\nThe quality of the video only approaches &quot;good&quot; (A7 / V5) especially when one takes into account that the master (of my copy of a copy) was not only made almost 30 years ago, but also with VERY limited budget &quot;BetaMax&quot; video cameras and tapes.  I'm hoping to someday get an original archived copy of this documentary and then &quot;re-post&quot; it.., hopefully resulting in a much more &quot;watchable&quot; version.....\n\nAfter watching this incredibly well documented and articulated interview.., do your best to then PASS IT ON.., in whatever way possible...\n\n!!! &quot;Truth Does NOT Fear Investigation&quot; !!!\n","torrent":{"xt":"urn:btih:90fb5f9082598b429fd2084642cb48874bc4f05e","amp;dn":"Ernst+Zundel+-+Genocide+by+Propaganda+%281983%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90fb5f9082598b429fd2084642cb48874bc4f05e","infoHashBuffer":{"type":"Buffer","data":[144,251,95,144,130,89,139,66,159,210,8,70,66,203,72,135,75,196,240,94]},"announce":[],"urlList":[]}}