{"title":"BBC - The Roman Mysteries (2007-2008) TVrip 2 seasons","uid":4828105,"size":5583009792,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:91d191f2969d1bcca2a1663a88c2adf258a8ff34&amp;dn=BBC+-+The+Roman+Mysteries+%282007-2008%29+TVrip+2+seasons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"boysinger","files":20,"time":1239026716,"description":"BBC - The Roman Mysteries (2007-2008) TVrip 2 seasons\n\nIMDB - http://www.imdb.com/title/tt0808099/\n\nRoman Mysteries is a television series based on the series of children's historical novels by Caroline Lawrence. It is reportedly the most expensive British children's TV series to date at 1 million pounds per hour.\nThe series began filming in June 2006 and was first broadcast from 8 May 2007. The series is divided into &quot;Episodes&quot;, each based on one book, starting with The Secrets of Vesuvius. The stories are told in the same order as the book series, except for book 6, The Twelve Tasks of Flavia Gemina, which is transposed to the second season. Books 11 and 12 were not adapted, and the series ends with the adaptation of Book 13. Each Episode consists of two half-hour episodes. The first Episode guest-starred Simon Callow as Pliny the Elder.\nOn 22 May 2007, after just two episodes, Anne Foy announced on CBBC on BBC One that the show has been postponed due to recent events in the news and would return later in the year on CBBC on BBC One. Since &quot;The Pirates of Pompeii&quot; was about children being kidnapped, the postponement was most likely due to the then recent disappearance of Madeleine McCann. On 19 June the series began broadcasting again from the beginning.\nFilming for the second season began on 13 August, 2007. The episodes are based on the novels The Gladiators from Capua, The Twelve Tasks of Flavia Gemina, The Colossus of Rhodes, The Fugitive from Corinth and The Slave-girl from Jerusalem.\nThe series has been sold around the world including Australia, Finland, Germany, Spain, Sweden and the USA. The second season aired first in Australia. The first season is now out on DVD.\n\nFirst season series:\nVideo: 608x352 (1.73:1), 25 fps, XviD build 47 ~1380 kbps avg, 0.26 bit/pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~110.68 kbps avg\nEpisode One: The Secrets of Vesuvius (first broadcast 8 May 2007)\nEpisode Two: The Pirates of Pompeii (first broadcast 3 July 2007)\nEpisode Three: The Assassins of Rome (first broadcast 17 July 2007)\nEpisode Four: The Dolphins of Laurentum (first broadcast 31 July 2007)\nEpisode Five: The Enemies of Jupiter (first broadcast 14 August 2007)\n\nSecond season series:\nVideo: 640x368 (1.74:1), 25 fps, XviD build 47 ~1023 kbps avg, 0.17 bit/pixel\nAudio: 48 kHz, MPEG Layer 3, 2 ch, ~128.00 kbps avg\nEpisode One: The Gladiators of Capua (first UK broadcast 8 July 2008)\nEpisode Two: The Trials of Flavia Gemina (first UK broadcast 15 July 2008)\nEpisode Three: The Colossus of Rhodes (first UK broadcast 29 July 2008)\nEpisode Four: The Fugitive from Corinth (first UK broadcast 19 August 2008)\nEpisode Five: The Slave Girl from Jerusalem (first UK broadcast 2 September 2008)","torrent":{"xt":"urn:btih:91d191f2969d1bcca2a1663a88c2adf258a8ff34","amp;dn":"BBC+-+The+Roman+Mysteries+%282007-2008%29+TVrip+2+seasons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d191f2969d1bcca2a1663a88c2adf258a8ff34","infoHashBuffer":{"type":"Buffer","data":[145,209,145,242,150,157,27,204,162,161,102,58,136,194,173,242,88,168,255,52]},"announce":[],"urlList":[]}}