{"title":"Martin Buber - I and Thou (Kaufmann, trans.) (pdf)","uid":8167110,"size":1922235,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9386ffc6cd7feadab46780d8190f03fc5bcd265b&amp;dn=Martin+Buber+-+I+and+Thou+%28Kaufmann%2C+trans.%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361351432,"description":"Martin Buber - I and Thou (translated by Walter Kaufmann)(Scribner, 1970). 185 pages. \n\nSearchable pdf (clearscan) with contents in bookmarks, accurate pagination, metadata, etc.\n\nShort description:\n\nPhilosophical classic. I haven't seen the Kaufmann translation on the web anywhere, so here it is. This appears to be a superior translation to the widely available Ronald Gregor Smith version.\n\nDescription:\n\nMartin Buber's I and Thou has long been acclaimed as a classic. Many prominent writers have acknowledged its influence on their work; students of intellectual history consider it a landmark; and the generation born since World War II considers Buber as one of its prophets.\n\nThe need for a new English translation has been felt for many years. The old version was marred by many inaccuracies and misunderstandings, and its recurrent use of the archaic &quot;thou&quot; was seriously misleading. Now Professor Walter Kaufmann, a distinguished writer and philosopher in his own right who was close to Buber, has retranslated the work at the request of Buber's family. He has added a wealth of informative footnotes to clarify obscurities and bring the reader closer to the original, and he has written a long &quot;Prologue&quot; that opens up new perspectives on the book and on Buber's thought. This volume should provide a new basis for all future discussions of Buber.\n\nAmazon Review\n\nI and Thou, Martin Buber's classic philosophical work, is among the 20th century's foundational documents of religious ethics. &quot;The close association of the relation to God with the relation to one's fellow-men ... is my most essential concern,&quot; Buber explains in the Afterword. Before discussing that relationship, in the book's final chapter, Buber explains at length the range and ramifications of the ways people treat one another, and the ways they bear themselves in the natural world. &quot;One should beware altogether of understanding the conversation with God ... as something that occurs merely apart from or above the everyday,&quot; Buber explains. &quot;God's address to man penetrates the events in all our lives and all the events in the world around us, everything biographical and everything historical, and turns it into instruction, into demands for you and me.&quot; Throughout I and Thou, Buber argues for an ethic that does not use other people (or books, or trees, or God), and does not consider them objects of one's own personal experience. Instead, Buber writes, we must learn to consider everything around us as &quot;You&quot; speaking to &quot;me,&quot; and requiring a response. Buber's dense arguments can be rough going at times, but Walter Kaufmann's definitive 1970 translation contains hundreds of helpful footnotes providing Buber's own explanations of the book's most difficult passages.\n\n**Note: please help seed. I hope to upload more books of this kind, but I can't keep them all seeded indefinitely. If you like this kind of thing, help out! Thanks.**","torrent":{"xt":"urn:btih:9386ffc6cd7feadab46780d8190f03fc5bcd265b","amp;dn":"Martin+Buber+-+I+and+Thou+%28Kaufmann%2C+trans.%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9386ffc6cd7feadab46780d8190f03fc5bcd265b","infoHashBuffer":{"type":"Buffer","data":[147,134,255,198,205,127,234,218,180,103,128,216,25,15,3,252,91,205,38,91]},"announce":[],"urlList":[]}}