{"title":"Pharmaceutical Supply Chain - Drug Quality and Security Act","uid":14547653,"size":14480008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:941de15488e6e482de3178ed8af42f0a4b2cc27a&amp;dn=Pharmaceutical+Supply+Chain+-+Drug+Quality+and+Security+Act&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1462603695,"description":"Pharmaceutical Supply Chain - Drug Quality and Security Act - ActFred A. Kuglin (CRC, 2016).pdf\r\n\r\nISBN 978-1-4822-5894-3\r\n\r\nError-proofing in the production process of pharmaceuticals isn’t just a matter of good business, it has life-and-death implications for consumers. To that end, the 2013 Drug Quality and Security Act in large part requires new mandates on tracking and tracing chain of custody in the supply chain. Pharmaceutical Supply Chain: Drug Quality and Security Act overviews the new mandate and its implications, including implementation strategies for track-and-trace programs along with presenting a fuller understanding of the mechanics of intergovernmental policies and oversights.\r\n\r\nThe book focuses on the delicate balance between protecting the public through legislation against negligent compounding pharmacies and protecting patients by assuring a supply of needed compounded drugs by not over-regulating the industry. The author discusses lessons learned from the earlier e-pedigree initiatives, the technology advances that enable supply chain security, and how the industry will need to respond to the myriad of threats facing the pharmaceutical drug supply chain and comply with this act. He goes in depth into each segment of the pharmaceutical drug supply chain, describing the industry segment and how it will need to adapt to the new act.\r\n\r\nBy incorporating real-world examples of industry leaders, the book underlines the contributions of individuals who have made a difference through innovations and execution. It also addresses how laws are made, and specifically how the Drug Quality and Security Act was passed by Congress and signed into law. In an industry that is so big, you may feel that you cannot make a difference. This book provides you with key insights on how the forward supply chain process should work and how anyone can make a difference at all levels","torrent":{"xt":"urn:btih:941de15488e6e482de3178ed8af42f0a4b2cc27a","amp;dn":"Pharmaceutical+Supply+Chain+-+Drug+Quality+and+Security+Act","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"941de15488e6e482de3178ed8af42f0a4b2cc27a","infoHashBuffer":{"type":"Buffer","data":[148,29,225,84,136,230,228,130,222,49,120,237,138,244,47,10,75,44,194,122]},"announce":[],"urlList":[]}}