{"title":"Viveca Lärn - Halta Hönans hotell - Svensk","uid":14634449,"size":351403414,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:944479782c18f161745ad9995b4f1d3811666464&amp;dn=Viveca+L%26auml%3Brn+-+Halta+H%26ouml%3Bnans+hotell+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"totomas1","files":132,"time":1463415003,"description":"Viveca Lärn - Halta Hönans hotell\r\n\r\nGöteborgs rikaste man Roger Holkfjell lever numera ett enkelt liv på Saltön tillsammans med katten Clinton och hönorna Audrey Hepburn, Julia Roberts, Greta Garbo och tuppen Gregory Peck. Och så har han ju sin käresta, den kärva tävlingssimmerskan Judit.\r\nMen det enkla livet är inte helt lätt för en gammal entreprenör. Varje dag passerar Roger ett förfallet strandhotell med potential, och till slut slår han till.\r\nDet ska bli århundradets hotell med ett spa som knäcker konkurrenten baddräktsdesignen Philip som driver Saltöns Sköna Spa!\r\n\r\nTobakshandlare Holger från Göteborg har råkat i onåd både hos Blomgren och hos sin särbo tatueringsborttagaren Dolly. Krögaren Kabben sörjer djupt sin hustru Gertrud som gått bort i en olycka. Philip är bekymrad för sin kommande ruin och åker till Göteborg och stampar på Armanikostymerna.\r\nOch Emily tycker för hundrade gången att Blomgren är trist och spanar efter en ny kärlekskandidat. Baskermannen är inte förvånad. Blomgren har i alla fall sin klarinett och Johanna är aldrig långt bort.\r\nProstänkan Karin Hurtig försöker hitta meningen i livet efter att ha blivit sol- och vårad av en italienare. Kanske borde hon och väninnan Inez hitta på något spektakulärt när ett kryssningsfartyg fullt av dollarstinna amerikaner anlöper Lysekil? Därifrån är det bara några hästlängder över bron till Saltön som egentligen inte finns.\r\n\r\nMen det gör denna bok: Halta Hönans Hotell, som är den avslutande delen i Viveca Lärns älskade serie om de bångstyriga invånarna på Saltön och deras vänner och antagonister från Göteborg.\r\n\r\n\r\nAntal CD: 12 CD\r\nUppläsare: Viveca Lärn\r\nSpeltid: Ca 12 timmar","torrent":{"xt":"urn:btih:944479782c18f161745ad9995b4f1d3811666464","amp;dn":"Viveca+L%26auml%3Brn+-+Halta+H%26ouml%3Bnans+hotell+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"944479782c18f161745ad9995b4f1d3811666464","infoHashBuffer":{"type":"Buffer","data":[148,68,121,120,44,24,241,97,116,90,217,153,91,79,29,56,17,102,100,100]},"announce":[],"urlList":[]}}