{"title":"George Harmonica Smith No Time For Jive(blues)(mp3@320)[rogercc]","uid":6118335,"size":103256188,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94899e9983361651f11f0fe679f47a123192e6d4&amp;dn=George+Harmonica+Smith+No+Time+For+Jive%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":9,"time":1295651110,"description":"GEORGE HARMONICA SMITH NO TIME FOR JIVE\nReleased:1970\nLabel: Blue Horizon\nFormat:Mp3@320\n\n\nGeorge Smith was born on April 22, 1924 in Helena, AR, but was raised in Cairo, IL. At age four, Smith was already taking harp lessons from his mother, a guitar player and a somewhat stern taskmaster -- it was a case of get-it-right-or-else. In his early teens, he started hoboing around the towns in the South and later joined Early Woods, a country band with Early Woods on fiddle and Curtis Gould on spoons. He also worked with a gospel group in Mississippi called the Jackson Jubilee Singers.\n\nSmith moved to Rock Island, IL, in 1941 and played with a group that included Francis Clay on drums. There is evidence that he was one of the first to amplify his harp. While working at the Dixie Theater, he took an old 16mm cinema projector, extracted the amplifier/speaker, and began using this on the streets. \n\nHis influences include Larry Adler and later, Little Walter. Smith would sometimes bill himself as Little Walter Jr. or Big Walter. He played in a number of bands including one with a young guitarist named Otis Rush, and later went on the road with the Muddy Waters Band after replacing Henry Strong. \n\nIn 1954, he was offered a permanent job at the Orchid Room in Kansas City where, early in 1955, Joe Bihari of Modern Records (on a scouting trip) heard Smith, and signed him to Modern. These recording sessions were released under the name Little George Smith, and included &quot;Telephone Blues&quot; and &quot;Blues in the Dark.&quot; The records were a success. \n\nSmith traveled with Little Willie John and Champion Jack Dupree on one of the Universal Attractions tours. While on the tour, he recorded with Champion Jack Dupree in November of 1955 in Cincinnati, producing &quot;Sharp Harp&quot; and &quot;Overhead Blues.&quot; The tour ended in Los Angeles and Smith settled down -- spending the rest of his life in that city. \n\nIn the late '50s he recorded for J&amp;M, Lapel, Melker, and Caddy under the names Harmonica King or Little Walter Junior. He also worked with Big Mama Thornton on many shows. \n\nIn 1960, Smith met producer Nat McCoy who owned the Sotoplay and Carolyn labels, with whom he recorded ten singles under the name of George Allen. In 1966, while Muddy Waters was on the West Coast, he asked Smith to join him and they worked together for a while, recording for Spivey Records. \n\nSmith's first album on World Pacific, A Tribute to Little Walter, was released in 1968. In 1969 Bob Thiele produced an excellent solo album of Smith on Bluesway, and later made use of Smith as a sideman for his Blues Times label, including sets with T-Bone Walker, and Harmonica Slim. Smith met Rod Piazza, a young White harp player, and they formed the Southside Blues Band, later known as Bacon Fat. \n\nIn 1969, Smith signed with U.K. producer Mike Vernon and did the No Time for Jive album. Smith was less active in the '70s, appearing with Eddie Taylor and Big Mama Thornton. Around 1977, Smith became friends with William Clarke and they began working together. Their working relationship and friendship continued until Smith died on October 2, 1983. \n\nWilliam Clarke, Smith's protÃƒÂ©gÃƒÂ©, writes &quot;He had a technique on the chromatic harp where he would play two notes at once, but one octave apart. He would get an organ-type sound by doing this. George really knew how to make his notes count by not playing too much and taking his time by letting the music unfold easily. He could also swing like crazy and was a first-class entertainer. I have heard from a friend that they had seen George Smith in the '50s playing a club in Chicago, tap dancing around everybody's drinks on top of the bar while playing his harp.&quot;\n\n&quot;I have been with him in church and seen him play amplified harmonica by himself. This was very soulful. I have never heard George play a song the same way twice. He was very creative and played directly from his heart. He admired all great musicians but had his own sound and style. He was a true original. Mr. Smith would always give 100-percent on-stage whether or not there were 1 or 1,000 people listening. This was his performing style, always.&quot; \n\n&quot;George Smith greatly admired harmonica player Larry Adler, and although Adler used the octave technique on the harp also, George really was the one that developed this to its full potential. Before Mr. Smith, nobody in blues had used this octave technique.&quot; &quot;An extremely kind and gentle man, George always went all out to help other harmonica players. Everybody liked George Smith. He played a huge role in advancing blues harmonica and should never be forgotten. You can hear the influence of George Smith in most everyone playing blues harmonica today, whether directly or indirectly. He also was a great blues singer. He had a huge baritone voice that conveyed great emotion and soulfulness.&quot;\n\nTrackcklist\n1 - Some Day You're Gonna Learn (To Treat Me Right)\n2 - Blue Switch\n3 - Mississippi River Blues\n4 - Before You Do Your Thing (You'd Better Think)\n 5 - Don't Want To Go, Baby\n6 - Good Things\n7 - Soul Feet\n8 - No Time For Jive\n \nRecorded. November 17 &amp; 18, 1969 at Eldorado Studios, Hollywood; Produced. by Mike Vernon\n\nPersonnel:\nBuddy Reid - Guitar\nDick Innes - Drums\nGeorge &quot;Harmonica&quot; Smith - Harmonica, Vocals\nGregg Schaefer - Guitar\nJ.D. Nicholson - Piano\nJerry Smith - Bass\nMarshall Hooks - Guitar\nPee Wee Crayton - Guitar\n","torrent":{"xt":"urn:btih:94899e9983361651f11f0fe679f47a123192e6d4","amp;dn":"George+Harmonica+Smith+No+Time+For+Jive%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94899e9983361651f11f0fe679f47a123192e6d4","infoHashBuffer":{"type":"Buffer","data":[148,137,158,153,131,54,22,81,241,31,15,230,121,244,122,18,49,146,230,212]},"announce":[],"urlList":[]}}