{"title":"Tom Hess guitar lesson - Improvisation training","uid":6321610,"size":81432909,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:94dfe814b8423afe706fa1f7ef2bab82f0047c4b&amp;dn=Tom+Hess+guitar+lesson+-+Improvisation+training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"EpicPirate55","files":22,"time":1302954627,"description":"Improvisation Training Classes with Tom Hess\n &lt;a href=&quot;\nhttp://www.tomhess.net/ImprovisationTrainingClasses.aspx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tomhess.net/ImprovisationTrainingClasses.aspx&lt;/a&gt;\n\n\n\nIf You are like most guitarists, then Your biggest obstacle is inability to use Your musical knowledge and skills to make real music.  Very often the arsenal of skills (technique and musical knowledge) in guitarists is greater than their ability to actually use them.  Does this describe You? From my experience of teaching hundreds of guitar players, I have seen many students in this condition.\n\nThrough these classes (in CD format), You will learn:\n\n    * New ideas for creating and improvising solos on the guitar, as well as approaches and ideas used by the professionals that will greatly expand Your musical skills.\n    * How to apply the information and tools that You already know (and will learn in this course) to creating solos. (this is probably the most important skill that You will acquire in these classes)\n    * How to prevent and overcome common obstacles with improvisation and soloing on the guitar.\n    * How to control and take greatest advantage of consonance and dissonance in music. \n    * How the pros think when improvising great solos that &quot;fit&quot; the music.  \n\nIn addition to this, You will have the opportunity to use Your new improvising skills along to backing tracks where You will be able to apply the knowledge and skills that You will develop through these Improvisation Training Classes.\n\nThe ideas and concepts taught here can be successfully used in a variety of musical styles (Rock, Metal, Blues etc.)\n\nIf You would like to take these classes, the first step is to fill out the evaluation form below.  This will give me an idea of Your current level of musical and improvising skills and will allow me to determine which level of classes would be most appropriate for You.\n\n    * Level 1: Intermediate\n    * Level 2: Upper Intermediate\n    * Level 3: Advanced\n\nYou can always move to a different level if You feel that the group You have been placed into is too easy (or too advanced) for You.  Simply let me know by e-mail and I will move You to a more appropriate level.\n\nYou have several options for the schedule of classes.\n\nYou can choose from the following options:\n\n    * Once a week\n    * Once every 2 weeks\n    * Once every 3 weeks \n\nObviously the first option (once a week) will enable You to reach maximum results in minimum time.  The other options are for people who may have time or financial constraints.","torrent":{"xt":"urn:btih:94dfe814b8423afe706fa1f7ef2bab82f0047c4b","amp;dn":"Tom+Hess+guitar+lesson+-+Improvisation+training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94dfe814b8423afe706fa1f7ef2bab82f0047c4b","infoHashBuffer":{"type":"Buffer","data":[148,223,232,20,184,66,58,254,112,111,161,247,239,43,171,130,240,4,124,75]},"announce":[],"urlList":[]}}