{"title":"A Song of Ice and Fire - Book 2 - A Clash of Kings","uid":4287421,"size":1051750551,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:951c652e7b83ce223a9ffd7c2efe315efaa96174&amp;dn=A+Song+of+Ice+and+Fire+-+Book+2+-+A+Clash+of+Kings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"algorithm345","files":70,"time":1215734638,"description":"Book 2 of A Song of Ice and Fire - A Clash of Kings by George R. R. Martin.\n\nUnabridged, approx 37 hours.\n\nRead by Roy Dotrice\n\n\n\nIn his widely acclaimed A Game of Thrones, George R. R. Martin introduced us to an extraordinary world of wonder, intrigue, and adventure. Now, in the eagerly awaited second volume in this epic saga, he once again proves himself a master myth maker, setting a standard against which all other fantasy novels will be measured for years to come.\n\nA CLASH OF KINGS\n\nTime is out of joint. The summer of peace and plenty is drawing to a close, and the harsh, chill winter approaches like an angry beast. Two great leaders - Lord Eddard Stark and Robert Baratheon - who held sway over an age of enforced peace are dead...victims of royal treachery. Now, from the ancient citadel of Dragonstone to the forbidding shores of Winterfell, chaos reigns, as pretenders to the Iron Throne of the Seven Kingdoms prepare to stake their claims through tempest, turmoil and war.\n\nAs a prophecy of doom cuts across the sky, six factions struggle for control of a divided land. Eddard&amp;#039;s son Robb jas declared himself King in the North. In the South, Joffery, the heir apparent, rules in name only, victim of the scheming courtiers who teem over Kings Landing. Robert&amp;#039;s two brothers each seek their own dominion, while a disfavoured house turns once more to conquest. Against a backdrop of incest and fratricide, alchemy and murder, the price of glory may be measured in blood. And the spoils of victory may just go to the men and women possessed of the coldest steel ...and the coldest hearts. For when rulers clash, all of the land feels the tremors.\n\nAudacious, inventive, brilliantly imagined, A Clash of Kings is a novel of dazzling beauty and boundless enchantment - a tale of pure excitement you will never forget.\n","torrent":{"xt":"urn:btih:951c652e7b83ce223a9ffd7c2efe315efaa96174","amp;dn":"A+Song+of+Ice+and+Fire+-+Book+2+-+A+Clash+of+Kings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"951c652e7b83ce223a9ffd7c2efe315efaa96174","infoHashBuffer":{"type":"Buffer","data":[149,28,101,46,123,131,206,34,58,159,253,124,46,254,49,94,250,169,97,116]},"announce":[],"urlList":[]}}