{"title":"Don't Starve Reign of Giants Steam Early Access rev. 99241 (crac","uid":9917903,"size":191541635,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9587b6184920bc88d26ce10bd4a8778c95a87f25&amp;dn=Don%27t+Starve+Reign+of+Giants+Steam+Early+Access+rev.+99241+%28crac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ramasbmv","files":1,"time":1396967237,"description":"Revision 99195:\nWebber's beard now grows faster\nWebber can craft a spider egg sack\nWebber can upgrade spider dens with silk\nSpiders that are following Webber will now wait a moment before eating food on the ground\nSpiders that are following Webber will no longer attack Chester and Glommer\nSpiders will follow Webber properly through wormholes etc\nWebber can now sleep in a tent/siesta canopy when neutral or friendly spiders are around (and his own monster-ness is no longer keeping him from sleeper)\nRemoved Webber's sanity loss on eat monster meat\nTaking off the spider hat no longer removes Webber's monster tag, which caused spiders to hate him and pigs to like him\nReduced sanity buff from Glommer (EDIT: this might be a duplicate note from the last update)\nIncreased delay before Birchnuts transform to their monster mode after cutting down a tall tree\nCatcoons raise naughtiness now\nFix some more issues with Glommer and Glommer's Flower getting un-linked\nFix smoldering not getting removed from the world when the entity it was attached to got removed (manifested as a permanently smoldering rabbit hole when the rabbit went inside)\nFix a couple crashes that occurred when auto-saving and when save-and-quitting\nFix crash with Birchnuts changing their leaves (OverrideSymbol crash)\nChange Wendy's inspect on Mushtrees to not reference &quot;down there&quot; since they now appear outside of caves\nFix Goose Moose not triggering the epic fight music\nFix mole playing rabbit scream instead of mole death sound when it got cooked on a fire\nFix ice staff being used to extinguish erroneously starting combat music\nFix a crash with pigs that could happen when they were deciding if they should chop a tree\nFix burnt structures and trees being able to start wildfires\nMade glommer goop burnable\nFix eyeplants not spreading to deciduous biome ground\nFix burned pig houses spawning pigs on load\nFix a crash in the bee mine\nAdd &quot;friend gain&quot; sound to Catcoon\nFix character's damage multipliers (for example on Wolfgang and Wigfrid) not functioning properly\nFix rabbit holes being closed outside of Spring and open in Spring\nFashion Melon can now go in the ice box\nFix crash on remove bird from cage\nFix crash when requiring inventoryitem from a modmain\nFix crash when feeding a spider near a spider queen as Webber\nFix a crash in the buzzard with its target not being present when it was trying to hunt it\nFix crash from heat sources (i.e. fires) near frozen things\n \nRevision 99231:\nFix food not applying sanity and health benefits/penalties (bug introduced in Revision 99195)\nFix Dragonfly flying sounds not turning off when he dies\nMake Dragonfly stay in his angry build when he dies\n \nLastly, a quick note on Webber: he might be super easy now! We're aiming for him to be a fairly average difficulty character that encourages a different play-style and makes different times of day and different biomes more appealing to be active in.\n\nIt's latest Don't Starve Reign of Giants update rev.99241 (if you want to check version in game press backspace) also in this torrent I replaced with better crack.\nHow to play?\n1) Extract game\n2) Update your video drivers and DirektX\n3) Enjoy game\nIf you like game buy it!","torrent":{"xt":"urn:btih:9587b6184920bc88d26ce10bd4a8778c95a87f25","amp;dn":"Don%27t+Starve+Reign+of+Giants+Steam+Early+Access+rev.+99241+%28crac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9587b6184920bc88d26ce10bd4a8778c95a87f25","infoHashBuffer":{"type":"Buffer","data":[149,135,182,24,73,32,188,136,210,108,225,11,212,168,119,140,149,168,127,37]},"announce":[],"urlList":[]}}