{"title":"Angel.NTSC.DVDRip.DD2.0.x264.CRF-OtakuLoser","uid":6620102,"size":59304476935,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95d00c8cf97fddeec62a5418d1c8a69e01a33ca7&amp;dn=Angel.NTSC.DVDRip.DD2.0.x264.CRF-OtakuLoser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"otakuloser","files":116,"time":1313950050,"description":"The vampire Angelus, now known as Angel, has a human soul, but committed terrible crimes in the past. Seeking forgiveness and trying to redeem himself, he moves from Sunnydale (and a relationship with Buffy Summers, of &quot;Buffy the Vampire Slayer&quot;) to Los Angeles, where he helps the downtrodden by thwarting the supernatural creatures that prey on them.\n\nAll Seasons (1999-2004); 720x480, 23.976fps, x264 video; with DD2.0 English Audio; all DVD subtitles; all in Matroska containers.\n\nFrom nfo:\nI am releasing my own personal encodes of Angel. I'm doing this because I can't seem to find any well seeded high quality releases of this series anywhere, which is a shame. I ripped them from the region 1 NTSC DVDs using HandBrake and x264. I encoded them with a tune setting for preserving grain and a constant rate factor of 18. The video is left at its original resolution to preserve as much quality as possible. The audio is untouched and includes the English tracks as well as any commentary tracks. All subtitle tracks and chapter markers are intact. The file sizes are very non-standard/variable and usually large, but the quality should be top notch.\n\nIf you have downloaded the other seasons' torrents I have uploaded please switch over to this one. I am no longer seeding those other torrents and will be deleting them soon.\n\nPLEASE SEED AT LEAST AS MUCH AS YOU HAVE DOWNLOADED!!!","torrent":{"xt":"urn:btih:95d00c8cf97fddeec62a5418d1c8a69e01a33ca7","amp;dn":"Angel.NTSC.DVDRip.DD2.0.x264.CRF-OtakuLoser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95d00c8cf97fddeec62a5418d1c8a69e01a33ca7","infoHashBuffer":{"type":"Buffer","data":[149,208,12,140,249,127,221,238,198,42,84,24,209,200,166,158,1,163,60,167]},"announce":[],"urlList":[]}}