{"title":"PublicBang - Patty Michova (Fucking at the Nude beach!) NEW 14 O","uid":12568496,"size":284941112,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:96fa0ce16eb3338f93372cd76e3a4ab75db2abeb&amp;dn=PublicBang+-+Patty+Michova+%28Fucking+at+the+Nude+beach%21%29+NEW+14+O&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1444816055,"description":"Coming to you from Spain. We're back with another exciting episode of Public Bang. This time we had the sexy Patty Michova, so we decided to take her to a nude beach. Of course the place was only packed with old men, but they sure did get a free show. We started by rubbing oil all over Patty's huge tits and pretty pussy. Then Christian Clay started eating her pussy. Now from a distance, the other beach goers might not have been sure what they were doing yet, but then Christian stood up and Patty started deep throating his cock. A few people walked by to check out the action, but most just sat back to enjoy the show, including a few passing commuter trains. One train even stopped to watch for a while. Our couple never stopped fucking though. Patty rode Christian's dick like she was in a rodeo, and Christian slammed her pussy from behind while she screamed. They even 69ed in front of everybody. Only in Spain. I'm surprised the audience didn't clap when Patty swallowed a mouthful of cum. They were probably still in shock. Nothing like this ever happens when I go to the beach, but you can see it here. Enjoy.\r\nTags:Big Ass, Big Dick, Big Tits, Blowjob, Brunette, Deep Throat, Face Fucking, Handjob, Pornstar, Pussy Licking, Shaved Pussy, Swallow, Whte Girl\r\n \nhttp://imgdone.com/viewer.php?file=39808937219885411327.jpg\r\n \nhttp://imgdone.com/viewer.php?file=96507077447715403715.jpg","torrent":{"xt":"urn:btih:96fa0ce16eb3338f93372cd76e3a4ab75db2abeb","amp;dn":"PublicBang+-+Patty+Michova+%28Fucking+at+the+Nude+beach%21%29+NEW+14+O","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96fa0ce16eb3338f93372cd76e3a4ab75db2abeb","infoHashBuffer":{"type":"Buffer","data":[150,250,12,225,110,179,51,143,147,55,44,215,110,58,74,183,93,178,171,235]},"announce":[],"urlList":[]}}