{"title":"Jessi Colter...I'm Jessi Colter - Diamond In The Rough(2011)[FL","uid":6917068,"size":486220590,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9984de4783cf232ff0698ca40958dfd8d0dc411f&amp;dn=Jessi+Colter...I%5C%27m+Jessi+Colter+-+Diamond+In+The+Rough%282011%29%5BFL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"dickspic","files":28,"time":1325069371,"description":"[img]http://image.allmusic.com/00/amg/cov200/drq300/q333/q33380k72si.jpg[/img]\n[color=Brown] I'm Jessi Colter - Diamond In The Rough [2011] Raven / RVCD-341[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1\t Is There Any Way (You'd StayForever)\t-Colter\t2:46\n2\t I Hear a Song\t-Colter\t2:46\n3\t Come on In\t-Colter\t2:32\n4\t You Ain't Never Been Loved (Like I'm Gonna Love You)\t-Colter\t2:57\n5\t Love's the Only Chain\t-Colter\t3:16\n6\t I'm Not Lisa\t-Colter\t3:21\n7\t For the First Time\t-Colter\t2:39\n8\t Who Walks Thru Your Memory (Billy Jo)\t-Colter\t2:22\n9\t What's Happened to Blue Eyes\t-Colter\t2:20\n10\t Storms Never Last\t-Colter\t4:14\n11\t Diamond in the Rough\t-Fritts, Oldham\t7:14\n12\t Get Back\t-Lennon, McCartney\t3:29\n13\t Would You Leave Now\t-Colter\t3:16\n14\t Hey Jude\t-Lennon, McCartney\t6:34\n15\t Oh Will (Who Made It Rain Last Night)\t-Colter\t4:39\n16\t I Thought I Heard You Calling My Name\t-Emerson\t3:55\n17\t Ain't No Way\t-Colter, Mansfield\t2:26\n18\t You Hung the Moon (Didn't You Waylon?)\t-Colter\t3:20\n19\t A Woman's Heart (Is a Handy Place to Be)\t-Casady, Chapman\t2:38\n20\t Oh Will (Reprise)\t-Colter\t1:36\n21\t Black Haired Boy\t-Clark, Clark\t2:54\n22 That's the Way a Cowboy Rocks and Rolls -White\t3:24\n23\t Cowboy's Last Ride\t-Cash\t3:15\n\nAustralia's Raven Records has packaged Jessi Colter's Capitol Records debut and her third album for the label in a two-fer that contains bonus tracks, excellent remastered sound, and a fine liner essay. While it's confusing that 1975's I'm Jessi Colter isn't paired with its actual successor, Jessi (1976), Diamond in the Rough (also 1976) is a suitable companion since all three hit number four on the charts. I'm Jessi Colter had a number one hit with &quot;I'm Not Lisa&quot; as its single. Colter wrote the entire set, and its sound crosses proper &quot;country music&quot; boundaries, making her as much an &quot;outlaw&quot; as her husband, Waylon Jennings. (She was the only woman included on the platinum-selling The Outlaws compilation a year later.) Jennings and legendary Capitol house legend Ken Nelson co-produced the sessions in L.A. and Nashville with a host of musicians who included Jennings, Reggie Young, and Ralph Mooney, L.A. session pros, Texas fiddler Johnny Gimble, Muscle Shoals bassist Tommy Cogbill, and a horn section among them. Alongside the classic American gothic balladry of the single, the rest of the album is even better. Its first half has as much swampy, funky soul as anything by Tony Joe White (&quot;Is There Any Way [You'd Stay Forever]&quot; and &quot;Love's the Only Chain&quot;) and as much gospel swagger as anything by Leon Russell (&quot;Come on In&quot;), and the second side contains truly serious honky tonk tunes (&quot;For the First Time,&quot; &quot;Who Walks Through Your Memory [Billy Jo],&quot; and &quot;Storms Never Last&quot;). Colter's songwriting chops were on par with virtually any pop or country songwriter of her generation. Underscoring it all is Colter's brazen sensuality. Diamond in the Rough is a more stripped-down affair. It contains more covers (it was her second record in a year amid constant touring), including a country-funk take on the Beatles' &quot;Get Back,&quot; the sultry jazzy soul of the title track (written by Spooner Oldham and Donnie Fritts), and the country standard &quot;I Thought I Heard You Calling My Name.&quot; It did include some fine originals in &quot;You Hung the Moon (Didn't You Waylon?),&quot; the punchy country-soul number &quot;Ain't No Way,&quot; and two excellent ballads in &quot;Would You Leave Now&quot; and &quot;Oh Will (Who Made It Rain Last Night).&quot; Also included is a fine reading of Marshall Chapman's classic &quot;A Woman's Heart (Is a Handy Place to Be).&quot; Raven also includes three appropriate bonus cuts from the 1978 album That's the Way the Cowboy Rocks and Rolls.\n\ncd ripped by EAC\n\n[img]http://www.hotimg.com/direct/CAWuxEb.gif[/img]\n[url]http://dickthespic.org/about/[/url]","torrent":{"xt":"urn:btih:9984de4783cf232ff0698ca40958dfd8d0dc411f","amp;dn":"Jessi+Colter...I%5C%27m+Jessi+Colter+-+Diamond+In+The+Rough%282011%29%5BFL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9984de4783cf232ff0698ca40958dfd8d0dc411f","infoHashBuffer":{"type":"Buffer","data":[153,132,222,71,131,207,35,47,240,105,140,164,9,88,223,216,208,220,65,31]},"announce":[],"urlList":[]}}