{"title":"The Fly (1986) [DVD9 - NTSC] Collector's Edition 2 - Disc","uid":9893065,"size":14853442018,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9b40b24e1d2ccb729ba0ec0944df849e36e7d33a&amp;dn=The+Fly+%281986%29+%5BDVD9+-+NTSC%5D+Collector%27s+Edition+2+-+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Big_dude","files":-1,"time":1396663990,"description":"The Fly\t\t\t\t\t                   Rel. 08/15/1986\n\n\nFormat:        DVD9 Movie NTSC\nLang.:         English, Spanish, French\nSubs:          English, Spanish, French\nImage:         .DVD/ISO\nDiscs:         2\nRated:         R\nSource:        Original Collector's Edition\nGene:          Horror/Sci-Fi\nQuality:       Perfect Untouched DVD9\nRequirements:  DVD Player\n\n\n\nCompressed with 7Zip, Tested Working.\n\n\n\nRunning Time: 96 Minutes\n\n\nRelease Notes: This is the original NTSC 2 Disc Collector's Edition.\n               Untouched ripped DVD9 includes special features, deleted\n               scenes, making of movie etc.\n\n\n\n\n- Movie Info -\n        &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091064/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091064/&lt;/a&gt;\n\n\n\n\nDescription:\n\nDirector - David Cronenberg\n\nWriter - George Langelaan\n\nStars: Jeff Goldblum, Geena Davis, John Getz\n   \n\nSeth Brundle, a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote &quot;Be afraid. Be very afraid.&quot; \n\nSeth Brundle is a research scientist, employed by Bartok Sciences, who has invented &quot;Telepods&quot; two matter transmission pods that teleports any object through space from one &quot;Telepod&quot; to the other &quot;Telepod&quot;. But, it is until Seth meets journalist Veronica Quaife who inspires Seth to correct the system, that Seth achieves successful teleportation. But something goes horribly wrong, when Seth uses himself as a guinea-pig in a matter transmission experiment, as he teleports himself, unaware his genes have been fused with a house fly that was trapped in the telepod with him. Seth, now finds himself slowly transforming into a terrifying mutant creature known as &quot;Brundlefly&quot; as he finds himself in a fierce battle as his mutated genes begins to take over. \n\n\n\nBurn ISO to your DVD Dual Layer media watch in your DVD player, or Computer.\n\n(You can mount The iso to, to play on your computer).\n\n\nIf using DVD Decrypter to Burn make sure layer break is set\nto 1793120 for Disc 1 and layer break is set to 2095728 for Disc 2 \nwith your dvd dl media as DVD Decrypter doesn't recognize .dvd type files.\n\n\nYou may need to booktype dvd dl dvd+r type to dvd-rom thru\nyour burn software if your dvd player or computer as trouble \nplaying any dvd+R type.\n\n\n\nIf this is working fine for you write a comment let us know.\n\n\n\nPlease Seed This Torrent (I can't seed 24/7 do your part).\n\n\n\nEnjoy!\t\t\t\t","torrent":{"xt":"urn:btih:9b40b24e1d2ccb729ba0ec0944df849e36e7d33a","amp;dn":"The+Fly+%281986%29+%5BDVD9+-+NTSC%5D+Collector%27s+Edition+2+-+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b40b24e1d2ccb729ba0ec0944df849e36e7d33a","infoHashBuffer":{"type":"Buffer","data":[155,64,178,78,29,44,203,114,155,160,236,9,68,223,132,158,54,231,211,58]},"announce":[],"urlList":[]}}