{"title":"Dick Swaab - Wij Zijn Ons Brein (E-Book)NLT-Release","uid":6592706,"size":3148345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ba0637dd25ff9fa812a8564c9e774851cf450f0&amp;dn=Dick+Swaab+-+Wij+Zijn+Ons+Brein+%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"linday1","files":-1,"time":1312888402,"description":"\nBeschrijving\nDick Swaab werd wereldberoemd met zijn werk over sekseverschillen in de hersenen. \nToen hij ontdekt had waar in het brein homoseksualiteit gelokaliseerd kan worden, werd hij zelfs controversieel met zijn onderzoek, waarvan na afloop alle critici moesten toegeven dat ze fout hadden gezeten. \nWant die ontdekking was maar een klein onderdeel van de kern van het onderzoek: het feit dat al in de baarmoeder vrijwel alles al vast staat waarmee we &quot; wat ons brein betreft &quot; de rest van het leven mee te maken zullen krijgen.\n\nOver Dick Swaab:\nProfessor Dick Swaab heeft zich met creativiteit, gedrevenheid en idealisme ingezet voor het hersenonderzoek. Hij heeft zich daarmee buitengewoon verdienstelijk gemaakt voor de bloei van de wetenschappen. JURY AKADEMIEPENNING 2008\nMaar als ik op een gegeven moment zou accepteren dat er sekseverschillen bestaan op zulke fundamentele punten als de samenstelling van de hersenen, dan ben ik uitgepraat als feministe. JOKE T HART\nKwade homos zaten aan de verkeerde kant. GAY KRANT\n\n\n\nHet verhaal van je leven is het verhaal van je brein. Dat begint in de baarmoeder, waar de hersenen gevormd worden op een manier waar je je leven lang niet meer vanaf komt. Dick Swaab volgt in Wij zijn ons brein de mens vanaf de conceptie tot en met de dood. Na een leven lang onderzoek naar de werking van het menselijk brein is Swaab de autoriteit. Hoe zit dat nou precies met de hersenen van pubers, wat gebeurt er als je verliefd bent, en valt homoseksualiteit te verklaren, en wat gebeurt er wanneer alzheimer toeslaat? De zin en onzin van therapie, antidepressiva en alternatieve geneeswijzen, agressie, moreel gedrag en geloof, meditatie: alles wordt beschreven in Wij zijn ons brein. \nOok schrijft Swaab over wat er mis kan gaan: hersenbeschadiging, ziektes, psychische problemen en bijna-doodervaringen. \nDit is het boek over het brein: van de basisbegrippen (wat zijn gedachten, hoe maken we beslissingen, hoe kan ons gedrag worden verklaard?) tot en met het meest geavanceerde onderzoek (hoe zijn defecten in de hersenen in de toekomst te repareren en hoe zijn hersenziektes te genezen?). Na lezing van dit boek zul je beter begrijpen waarom je bent wie je bent.\n\nDick Swaab is hoogleraar neurobiologie aan de Universiteit van Amsterdam en was dertig jaar lang directeur van het Nederland Instituut voor Hersenonderzoek. Hij schrijft voor een breed scala aan kranten en tijdschriften: van Nature tot en met NRC Handelsblad. \n\n\nRecensie(s)\nNBD|Biblion recensie\nDe auteur, hersenonderzoeker, publiceert regelmatig in diverse kranten en tijdschriften. In de jaren zeventig kwam hij in het nieuws door zijn destijds hevig omstreden onderzoek naar hersenverschillen tussen de seksen, en tussen homo- en heteroseksuelen. Swaab is er nog altijd van overtuigd dat de basis voor menselijk gedrag in de eerste plaats in de hersenen gelegen is, maar inmiddels is dat, dankzij geavanceerd neurobiologisch onderzoek, geen taboe meer. Dit onderzoek vormt de basis voor het beeld dat dit boek geeft van de werking van de hersenen. Er komt een breed scala aan onderwerpen aan de orde, zoals seksuele differentiatie, puberteit, veroudering, Alzheimer en geheugen, maar ook zaken als moreel gedrag, spiritualiteit en religie. Natuurlijk is er ook aandacht voor stoornissen, ziekten en therapieen. Een veelomvattend boek waarin een serieus geinteresseerd algemeen publiek antwoord kan vinden op veelgestelde hersenvragen, terwijl het boek, dat een uitvoerig register (maar geen literatuuropgave) bevat, ook voor professioneel geinteresseerden een basis biedt om hun kennis te actualiseren en uit te breiden.\n\n(NBD|Biblion recensie, Drs. N.P. Aders) \n\n\n\n\nVoor de nieuwste films en muziek ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecencies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecencies.nl&lt;/a&gt;\n\nBy Linday","torrent":{"xt":"urn:btih:9ba0637dd25ff9fa812a8564c9e774851cf450f0","amp;dn":"Dick+Swaab+-+Wij+Zijn+Ons+Brein+%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba0637dd25ff9fa812a8564c9e774851cf450f0","infoHashBuffer":{"type":"Buffer","data":[155,160,99,125,210,95,249,250,129,42,133,100,201,231,116,133,28,244,80,240]},"announce":[],"urlList":[]}}