{"title":"An Introduction to 19th Century Art (Art Ebook).pdf","uid":9910973,"size":19102697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ccc45a3383f433e734393682236d74e72541938&amp;dn=An+Introduction+to+19th+Century+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1396896775,"description":"Michelle Facos, &quot;An Introduction to Nineteenth-Century Art&quot; \nEnglish | ISBN: 0415780721, 0415780705 | 2011 | PDF | 464 pages | 18 MB\n\nUsing the tools of the &quot;new&quot; art history (feminism, Marxism, social context, etc.) An Introduction to Nineteenth-Century Art offers a richly textured, yet clear and logical, introduction to nineteenth-century art and culture. This textbook will provide readers with a basic historical framework of the period and the critical tools for interpreting and situating new and unfamiliar works of art.\n\nMichelle Facos goes beyond existing histories of nineteenth-century art, which often focus solely on France, Britain, and the United States, to incorporate artists and artworks from Scandinavia, Germany, and Eastern Europe.\n\nThe book expertly balances its coverage of trends and individual artworks: where the salient trends are clear, trend-setting works are highlighted, and the complexity of the period is respected by situating all works in their proper social and historical context. In this way, the student reader achieves a more nuanced understanding of the way in which the story of nineteenth-century art is the story of the ways in which artists and society grappled with the problem of modernity.\n\nKey pedagogical features include:\n\nData boxes provide statistics, timelines, charts, and historical information about the period to further situate artworks.\n\nText boxes highlight extracts from original sources, citing the ideas of artists and their contemporaries, including historians, philosophers, critics, and theorists, to place artists and works in the broader context of aesthetic, cultural, intellectual, social, and political conditions in which artists were working.\n\nBeautifully illustrated with over 250 color images.\n\nMargin notes and glossary definitions.\n\nOnline resources at www.routledge.com/textbooks/facos with access to a wealth of information, including original documents pertaining to artworks discussed in the textbook, contemporary criticism, timelines and maps to enrich your understanding of the period and allow for further comparison and exploration.\n\nChapters take a thematic approach combined within an overarching chronology and more detailed discussions of individual works are always put in the context of the broader social picture, thus providing students with a sense of art history as a controversial and alive arena of study.\n\nMichelle Facos teaches art history at Indiana University, Bloomington. Her research explores the changing relationship between artists and society since the Enlightenment and issues of identity. Prior publications include Nationalism and the Nordic Imagination: Swedish Painting of the 1890s (1998), Art, Culture and National Identity in Fin-de-Siecle Europe, co-edited with Sharon Hirsh (2003), and Symbolist Art in Context (2009).","torrent":{"xt":"urn:btih:9ccc45a3383f433e734393682236d74e72541938","amp;dn":"An+Introduction+to+19th+Century+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ccc45a3383f433e734393682236d74e72541938","infoHashBuffer":{"type":"Buffer","data":[156,204,69,163,56,63,67,62,115,67,147,104,34,54,215,78,114,84,25,56]},"announce":[],"urlList":[]}}