{"title":"ThemeForest - Enfold v3.0.2 - Responsive Multi-Purpose Wordpress","uid":11549634,"size":30188610,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9d27b342b951454e8c0b25005c0a0c8d7d95e832&amp;dn=ThemeForest+-+Enfold+v3.0.2+-+Responsive+Multi-Purpose+Wordpress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mindfuq","files":959,"time":1416766342,"description":"Demo: http://themeforest.net/item/enfold-responsive-multipurpose-theme/full_screen_preview/4519990\n\nEnfold is a clean, super flexible and fully responsive WordPress Theme (try resizing your browser), suited for business websites, shop websites, and users who want to showcase their work on a neat portfolio site. The Theme is built on top of the fabulous Avia Framework and offers support for the WPML MULTI LANGUAGE plugin, just in case you need it ;)\n\nIt comes with a plethora of options so you can modify layout, styling, colors and fonts directly from within the backend. Build your own clean skin or use one of 18 predefined skins right out from your WordPress Admin Panel. Font, background and color options as well as the dynamic template builder will help you create the Website you need in no time. In addition to the global options you can set unqiue styling options for each entry as seen in the theme demo\nKey Features Overview\n\n    Clean, Modern Design can be used for any type of website\n    Unqiue Drag and Drop Template Builder, built only for this theme. Almost any layout imaginable is possible. Also comes with a ton of unqiue elements for the template Builder:\n        Columns, Slider, Buttons, Gallery, team, Tabs, Toogles, Accordions, Pricing and Data Tables, Call to Action Buttons, Testimonials and many more. (To avoid confusion: this is a Content Editor. Header and Footer are not managed this way)\n    Ajax Instant Search: user get results while typing\n    Translation ready with mo/po files\n    WooCommerce Ready: add your own Shop and sell anything from digital Goods to Coconuts ;)\n    WPML plugin ready:WPML Plugin, in case your business needs a multi language site\n    Responsive designs that addapts to smaller devices (iphone, ipad)\n    Retina Ready: Looks beautiful on smarthpones and tablets\n    Deactivate responsive features with one click in your backend\n    WordPress Multisite enabled\n    2D + 3D Layerslider Slideshow\n    2D Easy Slider for slideshow creation in seconds\n    All slideshows optimized for mobile devices (hardware accelerated CSS3 slider)\n    Post Format Support: Standard, Image, Video, Gallery, Link, Quote\n    Multiple Slideshows possible. You can add multiple to each post, page or portfolio entry\n    18 predefined skins, easy to edit and modify. Any number of skins possible\n    Video Support: Supports Videos from any major video hosting service\n    Video Slideshows with support for Youtube, Vimeo and self hosted videos\n    Visual Shortcode editor with preview function, tons of shortcodes like pricing tables, columns, buttons etc\n    Unlimited Color Options with Backend Color Picker for any kind of gorgeous color settings.\n    Unqiue unlimited sidebars for each page/category possible\n    User Manual, short videos and professional theme support by me and my team to fix any kind of problems\n    Unlimited Portfolio Pages. Also supports Ajax Portfolio\n    Free Lifetime Updates and Support\n    Growing community in our support forum:over 12000 registered users, 21000 Topics, 100000 Posts. We do care that your site works and answer every post!\n    jQuery 100% unobtrusive wich degrades gracefully if javascript is turned off\n    Contact Form Builder: Modify your contact form from your backend: add/remove/modify the available inputs, textareas, dropdowns and checkboxes\n    SEO Optimized: our Code is built with SEO best practice in mind: headings, heavy internal linking, google rich snippets and so much more\n    Advanced Typography Options\n    Wide &amp; Boxed Layout Versions\n    Advanced Header Options\n    Child theme support for easy customization, that is not affected by theme updates. You can download a very basic child theme here\n    more than 30 PSDs included with almost every page template you see in the live demo\n    RTL stylesheet for languages that are read from right to left like Arabic, Hebrew, etc\n    19 different Language Files included:\n        English\n        German\n        Czech\n        Danish\n        Spanish\n        French\n        Italian\n        Japanese\n        Dutch\n        Portugese\n        Romanian\n        Russian\n        Swedish\n        Turkish\n        Korean\n        Arabic\n        Norsk\n        Simplified Chinese\n        Traditional Chinese\n    Clean Programming: Well organized, commented &amp; clean code\n    Focus on typography, usability and user-experience\n    Tested with WPML, Gravitforms, WP Supercache and many other common plugins\n    Extensive documentation\n    Growing Video Tutorial Library- A great place to start are our narrated HD Video Tutorials\n    The option to decide what updates the theme will receive next by suggesting and voting on features: http://www.kriesi.at/support/enfold-feature-requests/\n\nSEO (Search engine optimization)\nThe theme is built with SEO best practices in mind. It uses clean, semantical and valid HTML code and CSS so search engines can index the content of your site with ease. Important content is always placed before unimportent in your source code (eg: Blog Post content before Sidebar), Headlines are wrapped in heading tags (h1, h2, h3 etc) to signalise their importance to search engines. \n\nThe site also uses heavy internal site linking, which is also of vital for search engines (related posts, primary and secondary navigation menus, footer navigation, etc) With this Wordpress Template you are well equipped to get a high google ranking and attract visitors to show them your fantastic work ;)\nResponsive\nThis is a responsive theme, able to adapt its layout to the screen size of your visitors. (try resizing the screen and see for yourself) The Slideshows for this theme are also touch enabled and hardware accelerated, which means they are working super sleek on mobile device like ipad or iphone :)","torrent":{"xt":"urn:btih:9d27b342b951454e8c0b25005c0a0c8d7d95e832","amp;dn":"ThemeForest+-+Enfold+v3.0.2+-+Responsive+Multi-Purpose+Wordpress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d27b342b951454e8c0b25005c0a0c8d7d95e832","infoHashBuffer":{"type":"Buffer","data":[157,39,179,66,185,81,69,78,140,11,37,0,92,10,12,141,125,149,232,50]},"announce":[],"urlList":[]}}