{"title":"Night of the Living Dead - The Beginning [Complete]","uid":8552392,"size":50708092,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9e0753665f522b1bb23fe83ea006b163d77698a0&amp;dn=Night+of+the+Living+Dead+-+The+Beginning+%5BComplete%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"RobbieDee","files":-1,"time":1370677919,"description":"-Contains all issues from Night of the Living Dead - The Beginning series from #1-3.\nReleased by Avatar Press in 2006\n\n**I don't own any of the content contained within this torrent, all credit goes to the creators of the comic**\n\n\nDescription:\n\nThe zombie series fans have demanded comes to comics in this fully-authorized series from the original creators - director George A. Romero and co-writer John Russo - and the story everyone was dying to see: a prequel to the original film! Written by Russo and fully-approved by Romero, this is the horror series of the decade from the men who defined the genre! We heard the eyewitness accounts and were shocked by the television news reports, but now for the first time we will experience the horrifying events which led to that first Night of the Living Dead! A strange mist brings the unburied dead back to life, hungry for the flesh of the living! There is nowhere safe to run, and no one could possibly prepare for the onslaught of the ghouls, hungering for human flesh! This incredible prequel to the blockbuster classic Night of the Living Dead gives new insight into many of the film's characters and locations, including horrific encounters at the farm house and Beekman's diner and, introducing us for the first time to The Cemetery Zombie, Sheriff McClellan, and Night's original hero, Ben!","torrent":{"xt":"urn:btih:9e0753665f522b1bb23fe83ea006b163d77698a0","amp;dn":"Night+of+the+Living+Dead+-+The+Beginning+%5BComplete%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e0753665f522b1bb23fe83ea006b163d77698a0","infoHashBuffer":{"type":"Buffer","data":[158,7,83,102,95,82,43,27,178,63,232,62,160,6,177,99,215,118,152,160]},"announce":[],"urlList":[]}}