{"title":"(Blues) Son House - The Original Delta Blues (1998)","uid":5797066,"size":135478456,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9e27a0d01ed1a31e2a722734150c91c908678165&amp;dn=%28Blues%29+Son+House+-+The+Original+Delta+Blues+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1283098959,"description":"Tracklisting:\n\n1. Death Letter\n\n2. Pearline\n\n3. Louise Mcghee\n\n4. John the Revelator\n\n5. Empire State Express\n\n6. Preachin' Blues\n\n7. Grinnin' in Your Face\n\n8. Sundown\n\n9. Levee Camp Moan\n\n10. Pony Blues\n\n11. Downhearted Blues \n\n\n\n Son House's place, not only in the history of Delta blues, but in the overall history of the music, is a very high one indeed. He was a major innovator of the Delta style, along with his playing partners Charley Patton and Willie Brown. Few listening experiences in the blues are as intense as hearing one of Son House's original 1930s recordings for the Paramount label. Entombed in a hailstorm of surface noise and scratches, one can still be awestruck by the emotional fervor House puts into his singing and slide playing. Little wonder then that the man became more than just an influence on some white English kid with a big amp; he was the main source of inspiration to both Muddy Waters and Robert Johnson, and it doesn't get much more pivotal than that. Even after his rediscovery in the mid-'60s, House was such a potent musical force that what would have been a normally genteel performance by any other bluesmen in a &quot;folk&quot; setting turned into a night in the nastiest juke joint you could imagine, scaring the daylights out of young white enthusiasts expecting something far more prosaic and comfortable. Not out of Son House, no sir. When the man hit the downbeat on his National steel-bodied guitar and you saw his eyes disappear into the back of his head, you knew you were going to hear some blues. And when he wasn't shouting the blues, he was singing spirituals, a cappella. Right up to the end, no bluesman was torn between the sacred and the profane more than Son House. \n\nmp3   320kbps\n\n\nsorry, guys...can't resist...fuckin' awesome...\n\n\n\n","torrent":{"xt":"urn:btih:9e27a0d01ed1a31e2a722734150c91c908678165","amp;dn":"%28Blues%29+Son+House+-+The+Original+Delta+Blues+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e27a0d01ed1a31e2a722734150c91c908678165","infoHashBuffer":{"type":"Buffer","data":[158,39,160,208,30,209,163,30,42,114,39,52,21,12,145,201,8,103,129,101]},"announce":[],"urlList":[]}}