{"title":"The Occult History of the Third Reich (Documentary)","uid":4769725,"size":3135455602,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e2b950fe6766e26e2a7b1c2f5a7b859d2c35bfb&amp;dn=The+Occult+History+of+the+Third+Reich+%28Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"Katkwaraye","files":4,"time":1236997311,"description":"Source: DVD\nFormat: .mkv\nTotal Running Time: 209 minutes (Approx)\nOrg Year: 2004\nTotal Size: 2.91GB\nripped by myself\n\nThe murderous deeds of Hitler's Third Reich are still widely recalled today, but what is less well-known is the strange concoction of beliefs that underpinned the Nazi regime.\n\nIn the early 20th Century, the young Adolf Hitler was just one of many German-speaking people attracted by a new Germanic mythology that combined ancient legends and esoteric cosmologies with cutting-edge theories of genetic science. In the hands of the Nazis, the result was a new ideology that saw racial purity as the key to human destiny.\n\nThis was a belief-system of arcane rituals and potent symbols, with the ancient swastika appropriated for the Nazi cause. By the time of the Third Reich, Hitler and the Nazis had evolved an entirely new faith, complete with holy book, venerated relics and a priestly elite in the form of Himmler's SS. It was a religion based on obedience, power, and the cult of the leader, with Hitler himself conceived in Messianic terms.\n\nThis powerful and disturbing series uses rare original footage to tell a story that is as bizarre as it is horrific, and which casts new light on a national movement that came to see evil as a sacred task.\n\nIf you need a seed, PM me here: http://suprbay.org/member.php?u=74576","torrent":{"xt":"urn:btih:9e2b950fe6766e26e2a7b1c2f5a7b859d2c35bfb","amp;dn":"The+Occult+History+of+the+Third+Reich+%28Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2b950fe6766e26e2a7b1c2f5a7b859d2c35bfb","infoHashBuffer":{"type":"Buffer","data":[158,43,149,15,230,118,110,38,226,167,177,194,245,167,184,89,210,195,91,251]},"announce":[],"urlList":[]}}