{"title":"NubileFilms - Piper Perri ** NEW 08 January 2016 **","uid":13172179,"size":215194256,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9ec52528a47cc1589705beca8bef3f32e1b02a0f&amp;dn=NubileFilms+-+Piper+Perri+%2A%2A+NEW+08+January+2016+%2A%2A&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SudoSu","files":1,"time":1452252244,"description":"\nhttp://youpornbook.com\r\n------------------------------------------------------------\r\n             ....... : Screenshots : .......    \r\n------------------------------------------------------------ \nhttp://imgpremium.com/album/Tk\r\n\r\n------------------------------------------------------------\r\n                ....... : Info : .......    \r\n------------------------------------------------------------\r\nThe name of the actress: Piper Perri\r\nName movie: Signs Of Attraction\r\nNPP site and the site: NubileFilms.com / NubilesNetwork.com\r\n\r\nYear: 2016\r\nGenre: Medium Boobs, Shaved Pussy, Blonde, Long hair, Bras, Panties, Braces, Hardcore, Petite, Tan Lines, Stockings, Girl-Boy, Blowjob, Pussy Licking\r\nDuration: 00:17:48\r\n\r\nPiper Perri is occupying herself with her cell phone while Ryan Driller reads on the couch beside her, but this horny hottie is not willing to be ignored for long. Finding Ryan receptive to her advances, Piper soon gets his cock out of his jeans so that she can enjoy giving a lusty blowjob that makes the most of her soft tongue and talented hands. Her efforts only grow in enthusiasm as Ryan reaches back to rub her pussy beneath her panties.\r\n\r\nBy the time she pulls away from sucking Ryan's dick, Piper is so desperate to get her bald pussy stuffed that she does not even bother removing her panties before climbing onto his stiffie and sliding down until she is fully impaled. As soon as her twat is filled, Piper starts flexing her hips to go for a ride that gets her little titties bouncing right in Ryan's face.\r\n\r\nAs much as Ryan enjoys having Piper rising above him, he does not want her to have all the fun. Pressing her onto her back, Ryan takes the time to pinch Piper's rock hard nipples while feasting on her creamy snatch until her moans of approval fill the air. The moment he brings her to climax, he rises onto his knees to slam his cock home into her moist fuck hole for another round of sex. Within moments Piper re-embarks on her journey for a body-shaking orgasm.\r\n\r\nClimbing back onto Ryan's lap with her back to him, Piper places her hands on his chest for balance and then starts working her hips in a hard fast rhythm. Nothing will get in the way of this tight spinner achieving the release she craves, and Ryan is happy to go along for the ride as she uses him to get off. When it becomes clear that she needs a doggy style pussy pounding to get there, Ryan is willing to oblige.\r\n\r\nFucking Piper from behind is just what Ryan needs to get to the brink of his own climax, too. Pulling out at the last second, he spurts cum all over her tight little ass so that the blonde coed can dip her fingers in the sticky mess and sample it before licking his cock clean.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 23.976fps 1487kbps\r\nAudio: AAC 44100Hz stereo 119kbps","torrent":{"xt":"urn:btih:9ec52528a47cc1589705beca8bef3f32e1b02a0f","amp;dn":"NubileFilms+-+Piper+Perri+%2A%2A+NEW+08+January+2016+%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ec52528a47cc1589705beca8bef3f32e1b02a0f","infoHashBuffer":{"type":"Buffer","data":[158,197,37,40,164,124,193,88,151,5,190,202,139,239,63,50,225,176,42,15]},"announce":[],"urlList":[]}}