{"title":"Bryan Talbot - Grandville","uid":8715192,"size":187612707,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9efdbcfa41beca00fd3c32825000ef890494c84b&amp;dn=Bryan+Talbot+-+Grandville&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1374316457,"description":"Written and Illustrated by Bryan Talbot\n\n'Grandville'\nDark Horse Books, 2009, 105 pages\n\nTwo hundred years ago, Britain lost the Napoleonic War and fell under the thumb of French domination. Gaining independence after decades of civil disobedience and anarchist bombings, the Socialist Republic of Britain is now a small, unimportant backwater connected by a railway bridge, steam-powered dirigible, and mutual suspicion with France. When a British diplomat is murdered to look like suicide, ferocious Detective-Inspector LeBrock of Scotland Yard stalks a ruthless murder squad through the heart of a Belle Epoque Paris, the center of the greatest empire in a world of steam-driven hansom cabs, automatons, and flying machines. LeBrock's relentless quest can lead only to death, truth... or war.\n\n\n'Grandville Mon Amour'\nDark Horse Books, 2010, 104 pages\n\nConvicted psychotic killer and extremist fanatic Edward &quot;Mad Dog&quot; Mastock violently escapes the guillotine's blade in the Tower of London to once again terrorize the Socialist Republic of Britain. But dogging Mastock's bloody footsteps is his longtime adversary and nemesis, Detective Inspector Archie LeBrock, at odds with Scotland Yard and intent on bringing Mastock's horrific murder spree to an end, once and for all. Aided by his friend and colleague Detective Roderick Ratzi, LeBrock follows the trail of carnage to Paris, otherwise known as Grandville, the largest city in a world dominated by the French Empire that is the prime target of Mastock's sadistic terrorism. Can LeBrock capture the Mad Dog before he can mete out his final vengeance, or will LeBrock's own quest for redemption be dragged to ground by the demons of his past?\n\n\n'Grandville Bete Noire'\nDark Horse Books, 2012, 105 pages\n\nThe baffling murder of a famed Parisian artist in his locked and guarded studio takes the tenacious Detective Inspector LeBrock of Scotland Yard and his faithful adjunct, Detective Ratzi, into the cutthroat Grandville art scene to track the mysterious assassin. As the body count mounts and events spiral out of control, the investigation points to Toad Hall, where a cabal of industrialists and fat cats plot the overthrow of the French State. A Victorian anthropomorphic thriller, Grandville Bete Noire signals the welcome return of master storyteller and graphic-novel pioneer Bryan Talbot to his Eisner and Hugo Award nominated steampunk detective series.","torrent":{"xt":"urn:btih:9efdbcfa41beca00fd3c32825000ef890494c84b","amp;dn":"Bryan+Talbot+-+Grandville","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9efdbcfa41beca00fd3c32825000ef890494c84b","infoHashBuffer":{"type":"Buffer","data":[158,253,188,250,65,190,202,0,253,60,50,130,80,0,239,137,4,148,200,75]},"announce":[],"urlList":[]}}