{"title":"Hakim Bey - T.A.Z. (1994) [FLAC]","uid":11346377,"size":278086180,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f15c1079f11daf8504b0c6edb5db8699535ab29&amp;dn=Hakim+Bey+-+T.A.Z.+%281994%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Eugene_Debs","files":-1,"time":1414862638,"description":"T.A.Z. means Temporary Autonomous Zone - &quot;The TAZ is like an uprising which does not engage directly with the state, a guerrilla operation which liberates an area (of land, of time, of imagination) and then dissolves itself, to re-form elsewhere / elsewhen, before the state can crush it.&quot; \n- Hakim Bey\n\nChaos (6:09)\nPoetic Terrorism (4:25)\nAmour Fou (5:03)\nImmediatism (13:38)\nThe Tong (12:53)\nBoycott Cop Culture (10:39) \n\nOn T.A.Z., writer Hakim Bey reads excerpts from his book of the same name, a work detailing his beliefs that ancient philosophical concepts (such as the Chinese secret society known as a Tong), coupled with modern elements, will return humanity to enlightenment. So it makes sense that Bey's readings are accompanied by backing tracks assembled by legendary producer Bill Laswell. Laswell, as shown by the other, wildly divergent releases on Axiom, has always grafted modern urban sounds and ideas with ancient Eastern musicians and instruments. For T.A.Z. (the title is short for &quot;Temporary Autonomous Zone,&quot; Bey's term for a Tong), Laswell constructed ambient, sparse music fusing the sounds of Chinese musician Wu Man with cult guitar hero Buckethead, as well as frequent collaborator Nicky Skopelitis. (Buckethead fans should be forewarned that he plays gentler, more melodic music in the style of his album Colma rather than his usual rapid-fire soloing) The music serves to showcase Bey's voice, which remains at a soothing cadence. His voice never wavers, even when he rabidly excoriates the veneration of police in popular culture, as he does in &quot;Boycott Cop Culture,&quot; or when he exhorts listeners to perform pranks in the name of civil disobedience in &quot;Poetic Terrorism.&quot; Though the album can be riveting, it has flaws. Sometimes Bey shows off his articulateness excessively, causing his meaning to be totally lost. It's also true that he falls into the danger of preaching to the converted; listeners who are already inclined to agree with his views on society and culture will feel confirmed, while others will simply dismiss him outright. Still, those looking for a modern equivalent to classic albums by the Last Poets and Gil-Scott Heron should seek T.A.Z. out","torrent":{"xt":"urn:btih:9f15c1079f11daf8504b0c6edb5db8699535ab29","amp;dn":"Hakim+Bey+-+T.A.Z.+%281994%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f15c1079f11daf8504b0c6edb5db8699535ab29","infoHashBuffer":{"type":"Buffer","data":[159,21,193,7,159,17,218,248,80,75,12,110,219,93,184,105,149,53,171,41]},"announce":[],"urlList":[]}}