{"title":"Eddie Campbell - Alec - The Years Have Pants","uid":8408000,"size":406856087,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9f324cb714a6c8093555a4748b04eecff573b1bf&amp;dn=Eddie+Campbell+-+Alec+-+The+Years+Have+Pants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1366845738,"description":"Ran into this one after I uploaded 'The Kind Canute Crowd', which is also included in this omnibus.\n\n=================================================================================\n\n'Alec - The Years Have Pants'\n(A Life-Size Omnibus)\n\nTop Shelf Productions, 2009, 600 pages \n\nWritten and Illustrated by Eddie Campbell\n\nCollects the previous Alec books...\n\nThe King Canute Crowd\nGraffiti Kitchen\nHow To Be An Artist\nLittle Italy\nThe Dead Muse\nThe Dance Of Lifey Death\nAfter The Snooter\nAs well as a generous helping of rare and never-before-seen material, including the all-new 35 page The Years Have Pants\n\nFor the first time ever, the groundbreaking autobiographical comics of master cartoonist Eddie Campbell (FROM HELL) are collected in a single volume!\n\nBrilliantly observed and profoundly expressed, the ALEC stories present a version of Eddie's own life, filtered through the alter ego of &quot;Alec MacGarry.&quot; Over many years, we witness Alec's (and Eddie's) progression &quot;from beer to wine&quot; -- wild nights at the pub, existential despair, the hunt for love, the quest for art, becoming a responsible breadwinner, feeling lost at his own movie premiere, and much more! Eddie's outlandish fantasies and metafictional tricks convert life into art, while staying fully grounded in his own absurdity. At every point, the author's uncanny eye for irony and wry self-awareness make even the smallest occasion into an opportunity for wit and wisdom. Quite simply, ALEC is a masterpiece of visual autobiography. \n\n&quot;ALEC is magic, and even if I knew how all of it was done I'd be doing you a disservice if I pointed out the wires and mirrors. ... It is written by someone who obviously finds being alive an endless source of novelty and conundrum.&quot; -- Alan Moore\n\n&quot;Do you need me to tell you how good Eddie Campbell is? Or that ALEC is probably the best book-length comic about art and wine and midlife crises and families and friends and wine and love and art and saying goodbye and terror there is?&quot; -- Neil Gaiman","torrent":{"xt":"urn:btih:9f324cb714a6c8093555a4748b04eecff573b1bf","amp;dn":"Eddie+Campbell+-+Alec+-+The+Years+Have+Pants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f324cb714a6c8093555a4748b04eecff573b1bf","infoHashBuffer":{"type":"Buffer","data":[159,50,76,183,20,166,200,9,53,85,164,116,139,4,238,207,245,115,177,191]},"announce":[],"urlList":[]}}