{"title":"Upstairs Downstairs (DivX) 29GB collection - moviesbyrizzo","uid":6117043,"size":31396705469,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9f3774851050acb22e9c5019bf66ab166a342330&amp;dn=Upstairs+Downstairs+%28DivX%29+29GB+collection+-+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"moviesbyrizzo","files":-1,"time":1295597207,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0066722/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0066722/episodes&lt;/a&gt;\n\nWe bring you the Complete 68 episode collection of all included in\nthe 5 Seasons of this program (see the above link) in addition to a 25th\nanniversary special program found on the DVD extras). The Thomas and Sarah\nseries are to be found separately in due course I expect.\n\n\nUpstairs Downstarirs program was the most formative in my own upbringing\ninto British culture - equally I submit - to my earlier years in British\nBoarding school.\n\nThere is no achievement that matches what is British competence in civilized\nChristianly engagement on this earth, and we think it is no less that a\nChristianly mission to crusade in favour of bringing such fine programming\nas this to you all that want to partake of it all, and help spread the great\nword.\n\nThe examples of fine articulation in this best of British (relatively) \ncontemporary Television programming  - are the best as we have achieved.\n\nLord Bellamy is a man much to be respected and emulated in what are\nhis basic instincts and Gentlemanly example to all the men of Europe \ncertainly. There is no substitute for having the best basic character\nand willingness to be good and decent - add to this such fine programming\nbeginning at the earliest ages - and we'd make I think for an even better\nworld than what we have so far achieved - given that we seem to be in a\nperiod of sliding away from it all - as though our foundations hadn't taken\na sound enough hold on our sense of commitment to continuing on with\nthe fine examples set here. All have to learn to better respect the man -\ndespite his good decent nature - or rather because of it - (I submit)!\n\nThis is the greatest of all the British programs in my own personal view\nand it is with great pride and joy that I launch it for you here today\nwith the expectation that I might consider it among my best achievements\nalbeit a modest effort in what we bring you here in terms of quality even\nat this point.\n\nWe have a 1000k video bitrate offering here with 192k audio (the Xvid\ntorrent we found were much below this video bitrate despite being indicated\notherwise). These video files are all converted for you to the full 720 X 480\nfrom the NTSC Disc collection of the BBC A&amp;E version.\n\nWe hope this program will be offered long into the future with the blessings\nof all concerned as a reasonable and responsible effort in promoting\nBritish culture around all Europe and elsewhere similarly suited.\n\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:9f3774851050acb22e9c5019bf66ab166a342330","amp;dn":"Upstairs+Downstairs+%28DivX%29+29GB+collection+-+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f3774851050acb22e9c5019bf66ab166a342330","infoHashBuffer":{"type":"Buffer","data":[159,55,116,133,16,80,172,178,46,156,80,25,191,102,171,22,106,52,35,48]},"announce":[],"urlList":[]}}