{"title":"Quantum and Woody complete series with HAEDUS one shot","uid":5119178,"size":320230145,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9fba260e1326e4bae0c7d1c8fef7cd8c24e7b5b4&amp;dn=Quantum+and+Woody+complete+series+with+HAEDUS+one+shot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"jwillis2003","files":26,"time":1255227932,"description":"QUANTUM &amp; WOODY is &quot;the world's worst super-team&quot;, a dysfunctional version of BATMAN &amp; ROBIN -- polar opposites handcuffed to one another in a twisted take on &quot;The Defiant Ones,&quot; as the pair stumbles across a comedic action/adventure.\n\nQuantum &amp; Woody is more like M.A.S.H. than Perfect Strangers. It is a sophisticated, multi-faceted drama about two best friends.\n\nERIC (?Quantum&quot;) is a decorated Army tactical officer. Every move this type-A, African-American makes is planned with precision. His self-styled battle uniform contains dozens of sophisticated surveillance devices and defensive weapons.\n\nWOODY (&quot;Woody&quot;) is a goofy white guy with a guitar (but no band), whose idea of detective work is hanging a suspect out a window. He carries a nine millimeter and a Zippo lighter.\n\nAnd they're stuck with each other.\n\nInvestigating the suspicious helicopter crash that killed their fathers, Eric and Woody are the victims of a high-tech industrial accident. Their bodies are turned into pure energy, and the stylized metal gauntlet they each wear is now the only thing keeping them in one piece. These gauntlets cannot be removed, and Eric and Woody must slam them together every 24 hours, to reset their energy matrix ? or their atoms will break apart and their bodies will fade away.\n\nEric takes the code name &quot;Quantum&quot; to work undercover and find his father's killer. Woody wants to avenge his father's death, too -- but code names are stupid; people can call him &quot;Woody.&quot; Together, they embark on a funny, &quot;Lethal Weapon&quot;-style action-adventure that takes two unlikely partners, and turns them into best friends.\n\nQuantum &amp; Woody don't have &quot;super powers&quot; in the way the &quot;Fantastic Four&quot; do. But their bodies are now pure energy, so it makes them pretty much invulnerable (at least to traditional bullets); They have some energy-based abilities, and the gauntlets have some powers too.\n\nTorrent contains complete run, some unpublished artwork, and a text file with the script for issue #24\n\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Quantum_%26_Woody&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Quantum_%26_Woody&lt;/a&gt;\t\t\n\nUpdated: Has Goat:HAEDUS one shot!","torrent":{"xt":"urn:btih:9fba260e1326e4bae0c7d1c8fef7cd8c24e7b5b4","amp;dn":"Quantum+and+Woody+complete+series+with+HAEDUS+one+shot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fba260e1326e4bae0c7d1c8fef7cd8c24e7b5b4","infoHashBuffer":{"type":"Buffer","data":[159,186,38,14,19,38,228,186,224,199,209,200,254,247,205,140,36,231,181,180]},"announce":[],"urlList":[]}}