{"title":"Metric - Synthetica [24 bit FLAC] vinyl","uid":8200380,"size":905505856,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9fee3a4bdf38ace5134318587b76128575fd2720&amp;dn=Metric+-+Synthetica+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"24.96","files":-1,"time":1362000133,"description":"  Metric - Synthetica (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Artificial Nocturne\n  02. Youth Without Youth\n  03. Speed the Collapse\n  04. Breathing Underwater\n  05. Dreams So Real\n  06. Lost Kitten\n  07. The Void\n  08. Synthetica\n  09. Clone\n  10. The Wanderlust (feat. Lou Reed)\n  11. Nothing but Time\n\n  After the commercial breakthrough of their 2009 album Fantasies, it would seem kind of unfair to ask Metric to do anything differently on their next outing. That album perfectly took their usual tuneful blend of hooky new wave and spooky synth pop and blew it up to stadium-huge levels while adding more emotional content than ever before. It was a trick that seemed so improbable in the first place that it would be crazy for the group not to try re-creating it on Synthetica. So they did. The album has the same glossy textures, gigantic sounding arrangements, huge choruses, and open-hearted vocals as Fantasies did, but keeps the instantly memorable songs and exposed emotions intact. It also retains the same balance of super hooky songs and gloomy ballads, hitting you in the gut one minute and sending you off cheerfully singing along the next. (It's the same kind of trick Garbage were able to pull off in their prime, and Metric sound very much like a widescreen Garbage throughout Synthetica.) The success that band has achieved hasn't exactly healed Emily Haines' wounds, and her vocals have the same powerfully aching quality that has always been there -- they cut through the music and right to the heart of the listener. Songs like &quot;Artificial Nocturne&quot; and &quot;Dreams So Real&quot; hit very, very hard thanks to her vocals. Elsewhere, she shows a ton of range on tracks as varied as the dramatic &quot;Speed the Collapse,&quot; the creepily cute &quot;Lost Kitten,&quot; and the dreamily desolate &quot;Nothing But Time.&quot; The band provides capable backing throughout, framing her voice in a soft web of sound and creating modern pop that goes down easily but never bores. Only the unwelcome appearance of Lou Reed on &quot;The Wanderlust&quot; breaks the mood of the record and brings it down to earth a bit. Even with his warbling croak gumming things up, the song is a highlight on an album full of them. That Metric were able to follow up their best record with another just as good is quite an achievement, hopefully something they will do again and again.","torrent":{"xt":"urn:btih:9fee3a4bdf38ace5134318587b76128575fd2720","amp;dn":"Metric+-+Synthetica+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fee3a4bdf38ace5134318587b76128575fd2720","infoHashBuffer":{"type":"Buffer","data":[159,238,58,75,223,56,172,229,19,67,24,88,123,118,18,133,117,253,39,32]},"announce":[],"urlList":[]}}