{"title":"HISTORY OF POP AND ROCK MUSIC - part 545","uid":9495479,"size":1052249130,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a008633ee65e4a1cb80b10a33f176a081ade48f9&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+545&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1390092504,"description":"\n\n                 PART  545\n\n\n        IT'S A BEAUTIFUL DAY  -  Bombay Calling  (1967)\n        DEEP PURPLE  -  Child In Time  (1970)\n        IAN GILLAN BAND  -   Child In Time (1977) \n\n\n\n         &quot;It's a Beautiful Day&quot; is an American band formed in San Francisco, California, in 1967, featuring vocalist Pattie Santos along with violinist David LaFlamme and his wife, Linda LaFlamme, on keyboards.  Although they were one of the earliest and most important San Francisco bands to emerge from 1967's social phenomenon Summer of Love, the band never quite achieved the success of contemporaries such as Grateful Dead, Jefferson Airplane and Santana, with whom they had connections. The band created a unique blend of rock, jazz, folk, classical and world beat styles during the initial seven years it was officially together. The band's debut album,&quot; It's a Beautiful Day&quot;, was produced by David LaFlamme in Los Angeles, California, and released by Columbia Records in 1969. It features tracks such as &quot;White Bird&quot;, &quot;Hot Summer Day&quot; and &quot;Time Is&quot;. The album reached number 47 in the U.S. charts and number 58 in the UK.  The theme from the song &quot;Bombay Calling&quot; was later used, at a slower tempo, by Deep Purple as the intro to &quot;Child in Time&quot; on its Deep Purple &quot;In Rock&quot; album.\n\n         As Ian Gillan put it in a 2002 interview, &quot;There are two sides to that song - the musical side and the lyrical side. On the musical side, there used to be this song 'Bombay Calling' by a band called It's A Beautiful Day. It was fresh and original, when Jon was one day playing it on his keyboard. It sounded good, and we thought we'd play around with it, change it a bit and do something new keeping that as a base. But then, I had never heard the original 'Bombay Calling'. So we created this song using the Cold War as the theme, and wrote the lines 'Sweet child in time, you'll see the line.' That's how the lyrical side came in. Then, Jon had the keyboard parts ready and Ritchie had the guitar parts ready. The song basically reflected the mood of the moment, and that's why it became so popular.&quot; &quot;Child in Time&quot; is an essentially simple composition, featuring an organ intro, three power chords, and a two minute long guitar solo. Lyrically dark, vocalist Ian Gillan utilizes his wide vocal range and goes from quiet singing to loud, high-pitched, banshee-esque falsetto screaming. Guitarist Ritchie Blackmore comes in with a slow solo, which builds up to a fast-pace playing and then ends abruptly, with the whole song cycle starting over again. Blackmore is normally associated with playing a Fender Stratocaster, however, he played a Gibson ES-335 on the studio version of the song.\n        A live version later appeared on the 1972 live album &quot;Made in Japan&quot;. Another live version can be found on the Scandinavian Nights / Live in Stockholm live album, recorded in September 1970. \n\n     Gillan also featured a live jazz influenced version of the song in his Ian Gillan Band project of the late ","torrent":{"xt":"urn:btih:a008633ee65e4a1cb80b10a33f176a081ade48f9","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+545","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a008633ee65e4a1cb80b10a33f176a081ade48f9","infoHashBuffer":{"type":"Buffer","data":[160,8,99,62,230,94,74,28,184,11,16,163,63,23,106,8,26,222,72,249]},"announce":[],"urlList":[]}}