{"title":"[FakeHospital] Sexy graduate gets licked and fucked","uid":11586507,"size":833428200,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a00c049194e7e43f937ed3d60076cb5acbc68ba9&amp;dn=%5BFakeHospital%5D+Sexy+graduate+gets+licked+and+fucked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"imgbabes","files":1,"time":1417180330,"description":"screens;\n &lt;a href=&quot;\nhttp://imgbays.com/img-5478667450682.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgbays.com/img-5478667450682.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgbays.com/img-547866745935e.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgbays.com/img-547866745935e.html&lt;/a&gt;\n\nYou know what I love about medical graduates? It's the fact that there's so many of them, yet only a few jobs to go round. This sexy young graduate came to me looking for a recommendation and a possible job working at our clinic. I tried to explain to her that anyone that worked here with us had very over friendly relationships, and she immediately got cold feet. She said she had a boyfriend and a wedding coming up and wanted to keep things in the workplace strictly professional. However, when I hinted that my recommendation may not be very good for her, she soon saw the benefits of some extra curricular sexy activity. After promising her boyfriend would not find out I soon had my cock stuck in her hot, wet mouth. This woman was fantastic, I'm sure we would all love to work with her. She sucked my cock like it was the best tasting ice cream in the world, and then I got her on my desk and licked and sucked her pussy with my oral massage skills. She was loving it and after riding me in cowgirl I bent her over the desk to continue giving her the recommendation she was after. Her tight pussy was contracting as she orgasmed, squeezing my cock, trying to drain my medical waste out of me. I couldn't keep going much longer, just having her bent over my desk as I fucked her from behind was too much. I gave a loud cry and shot my load deep inside her tight, velvet pussy. What an amazing day and I hadn't even seen my first patient yet","torrent":{"xt":"urn:btih:a00c049194e7e43f937ed3d60076cb5acbc68ba9","amp;dn":"%5BFakeHospital%5D+Sexy+graduate+gets+licked+and+fucked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a00c049194e7e43f937ed3d60076cb5acbc68ba9","infoHashBuffer":{"type":"Buffer","data":[160,12,4,145,148,231,228,63,147,126,211,214,0,118,203,90,203,198,139,169]},"announce":[],"urlList":[]}}