{"title":"Aerosmith - Rock For The Rising Sun (restored by }{eywood)","uid":9219284,"size":707734820,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a07d71777ea138fddd7c2c1a7d04bcfacec2bee8&amp;dn=Aerosmith+-+Rock+For+The+Rising+Sun+%28restored+by+%7D%7Beywood%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"}{eywood","files":22,"time":1384910045,"description":"Aerosmith\nRock for the Rising Sun\n\nAs with You Gotta Move, Aerosmith really screwed up a decent concert video by cutting a bunch of interviews in between - and over - the songs. And unfortunately, unlike You Gotta Move, those interviews are mixed into the front L &amp; R channels of the surround mix and not the center. On my previous rescue of a badly produced Aerosmith DVD I removed the interviews by killing the center channel, thus revealing the music buried beneath, but on this one that wasn't possible. I therefore had to cheat and use a few bits from other shows. Every available bit of music on RftRS is here, but with additions making it sound like a complete concert.\n\nThe beginning of the show was constructed by using audience noise and an air raid siren I had on a sound effects collection.\nThe very last part of the vocal note at the end of LiaE is from my reworking of You Gotta Move (two shows recorded in Florida in early April 2004), as is the start of TitA up to the vocal coming in.\nThe final note of Toys and the audience following it is from Central Park in NYC way back in 75 (Hey! It's the same guys, the same song, the same note, and it had a sympathetic sound to that of the Japanese stuff. You can forgive me for reaching that far back).\nThe beginning for Livin' on the Edge is from You Gotta Move while the ending was taken from A Little South of Sanity.\nThe first verse of Rats in the Cellar is also from You Gotta Move, EQ'd, tempo corrected and reverbed to match this concert better.\nThe first 1:12 of S.O.S. is the one I may not be forgiven for. I have no idea where this is from. It's on a live compilation I have, and it's vintage. The guitar tones don't really match the show I'm recreating here, but it's the best match I could find. Couldn't use the song without the first minute, now could I?\nAnd finally I tracked down the full version of Train Kept a' Rollin' and used the ending to complete the song where it was faded out after about a minute on the DVD. (I also found the songs &quot;Stop Messin' Round&quot; and &quot;I Don't Want to Miss a Thing&quot;, but the audio quality sounded too obviously lossy to use here).\n\nThe only song on the RftRS DVD not appearing here is Hangman Jury because they only used half the song and I couldn't find a decently matching version to make up the first half.\n\n\n\n01 Draw The Line\n02 Love In An Elevator\n03 Toys In The Attic\n04 Monkey On My Back\n05 Livin' On The Edge\n06 Mama Kin\n07 Listen To The Thunder\n08 Lick And A Promise\n09 Movin' Out\n10 Rats in the Cellar\n11 Last Child\n12 Boogie Man\n13 No More No More\n14 S.O.S. (Too Bad)\n15 One Way Street\n16 Sweet Emotion\n17 Train Kept A Rollin'\n18 Walk This Way\n\n}{eywood 11/18/13","torrent":{"xt":"urn:btih:a07d71777ea138fddd7c2c1a7d04bcfacec2bee8","amp;dn":"Aerosmith+-+Rock+For+The+Rising+Sun+%28restored+by+%7D%7Beywood%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a07d71777ea138fddd7c2c1a7d04bcfacec2bee8","infoHashBuffer":{"type":"Buffer","data":[160,125,113,119,126,161,56,253,221,124,44,26,125,4,188,250,206,194,190,232]},"announce":[],"urlList":[]}}