{"title":"Ten Thousand Birds(PDF,Retail){32Skulls}","uid":10968253,"size":23053355,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0b6c60fac50db977ab198b800638eca59a77480&amp;dn=Ten+Thousand+Birds%28PDF%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409770128,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nTen Thousand Birds provides a thoroughly engaging and authoritative history of modern ornithology, tracing how the study of birds has been shaped by a succession of visionary and often-controversial personalities, and by the unique social and scientific contexts in which these extraordinary individuals worked. This beautifully illustrated book opens in the middle of the nineteenth century when ornithology was a museum-based discipline focused almost exclusively on the anatomy, taxonomy, and classification of dead birds. It describes how in the early 1900s pioneering individuals such as Erwin Stresemann, Ernst Mayr, and Julian Huxley recognized the importance of studying live birds in the field, and how this shift thrust ornithology into the mainstream of the biological sciences. The book tells the stories of eccentrics like Colonel Richard Meinertzhagen, a pathological liar who stole specimens from museums and quite likely murdered his wife, and describes the breathtaking insights and discoveries of ambitious and influential figures such as David Lack, Niko Tinbergen, Robert MacArthur, and others who through their studies of birds transformed entire fields of biology.\n\nTen Thousand Birds brings this history vividly to life through the work and achievements of those who advanced the field. Drawing on a wealth of archival material and in-depth interviews, this fascinating book reveals how research on birds has contributed more to our understanding of animal biology than the study of just about any other group of organisms.\n\n\nBy Tim Birkhead, Jo Wimpenny, Bob Montgomerie\nPublished by Princeton University Press in 2014\nPDF, Retail, 545 pages, English","torrent":{"xt":"urn:btih:a0b6c60fac50db977ab198b800638eca59a77480","amp;dn":"Ten+Thousand+Birds%28PDF%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0b6c60fac50db977ab198b800638eca59a77480","infoHashBuffer":{"type":"Buffer","data":[160,182,198,15,172,80,219,151,122,177,152,184,0,99,142,202,89,167,116,128]},"announce":[],"urlList":[]}}