{"title":"Smith_Christopher-A_Rush_to_Violence.epub","uid":9220289,"size":307561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1b090d613216f5f93403cdb20791533df3adb56&amp;dn=Smith_Christopher-A_Rush_to_Violence.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":1,"time":1384922819,"description":"STEPHEN KING ON CHRISTOPHER SMITH: &quot;Put me down as an enthusiastic Christopher Smith fan. Smith is a cultural genius.&quot; From the #1 International Best-selling author of &quot;Fifth Avenue&quot; comes Smith's best thriller yet! Description: A billionaire investor dealt a grisly death. The suspects? Six of his seven children, all so desperate for their father's money, they'd kill for it. His seventh child, Camille, a former assassin who left that life behind to raise her now sixteen-year-old daughter Emma, must tap into old instincts to learn who killed her father and why. What she never sees coming are Emma's plans to go into Manhattan and find out on her own. Meanwhile, Camille must be found. Private investigator Marty Spellman is threatened by a mysterious man to find her. He has seventy-two hours or do so--or members of his own family die. Over the course of one day, Spellman, Camille, Emma and Spellman's own fifteen-year-old daughter, Beth, must intervene to finish this and shut it down. Twists abound. Few are who they appear to be. Soon, all parties are in a rush to violence, but in spite of how quickly they act, it's clear that no one is safe.","torrent":{"xt":"urn:btih:a1b090d613216f5f93403cdb20791533df3adb56","amp;dn":"Smith_Christopher-A_Rush_to_Violence.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1b090d613216f5f93403cdb20791533df3adb56","infoHashBuffer":{"type":"Buffer","data":[161,176,144,214,19,33,111,95,147,64,60,219,32,121,21,51,223,58,219,86]},"announce":[],"urlList":[]}}