{"title":"Fascist Scotland: Caledonia... (2013) Gavin Bowd (multi)","uid":9540550,"size":7808853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a20b7f928fbb7e1977231364e045f734776cb885&amp;dn=Fascist+Scotland%3A+Caledonia...+%282013%29+Gavin+Bowd+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391034239,"description":"Fascist Scotland: Caledonia and the Far Right (2013) Gavin Bowd (multi)\n\n\nFascist Scotland: Caledonia and the Far Right by Gavin Bowd\n\n\nFormat: mobi/epub/azw3\nLength: 256 pages\nGenre: Non-Fiction/History\nDate: 1 July 2013\n\nIn this book Gavin Bowd relates a fascinating and little-known part of our history which reveals some uncomfortable truths which are bound to stimulate debate even now.\n\nOn 10 May 1941, Rudolf Hess, Deputy Fuhrer of the Third Reich, entered Scottish airspace in an ill-fated attempt to discuss peace with the Duke of Hamilton. For the Nazis, Hess was the victim of 'tragic hallucinations'. But how far had Hess really flown from reality?\n\nAlthough Fascism in Britain is normally associated with England, and especially the East End of London, and even then dismissed as a marginal political phenomenon, Fascism did find support in Scottish society. Scotland has provided its own cohort of idealists, fanatics and traitors for extreme racist, nationalist and authoritarian politics.\n\nFrom Dumfries to Alness, one of the main ideologies of the first half of the twentieth century found its standard-bearers. But when Fascism crossed the Cheviots, it found itself in a restless part of a multi-nation state, riven by sectarian hatreds. Rudolf Hess felt the natives looked at him 'in a compassionate way', but Scottish Fascism had to carve out a niche in a crowded market for bigotry.\n\nAuthor:\n\nGavin Bowd is a lecturer in French at the University of St Andrews. His research covers various aspects of modern and contemporary France, Romania, and Scotland; Communism and post-Communism; the remembrance and representation of war; colonial geography; and geopoetics. He is a published translator, journalist, and creative writer","torrent":{"xt":"urn:btih:a20b7f928fbb7e1977231364e045f734776cb885","amp;dn":"Fascist+Scotland%3A+Caledonia...+%282013%29+Gavin+Bowd+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a20b7f928fbb7e1977231364e045f734776cb885","infoHashBuffer":{"type":"Buffer","data":[162,11,127,146,143,187,126,25,119,35,19,100,224,69,247,52,119,108,184,133]},"announce":[],"urlList":[]}}