{"title":"The Brand New Heavies - Get Used to It - (2006)[EAC-MP3@320KBPS]","uid":4210624,"size":124644952,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a2d3eba718de361aac33c8486b2637f92d61fb96&amp;dn=The+Brand+New+Heavies+-+Get+Used+to+It+-+%282006%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"seanprince","files":22,"time":1212049723,"description":"The Brand New Heavies - Get Used to It - (2006)[EAC-MP3@320KBPS]\n\nTrack list\n\nThe Brand New Heavies - Get Used to It\n\n01.\tWe&amp;#039;ve Got\t\t\t\t04:43\n02.\tI Don&amp;#039;t Know Why (I Love You)\t\t03:31\n03.\tGet Used To It\t\t\t\t03:26\n04.\tSex God\t\t\t\t\t04:54\n05.\tLet&amp;#039;s Do It Again\t\t\t05:08\n06.\tWe Won&amp;#039;t Stop\t\t\t\t04:08\n07.\tRight On\t\t\t\t04:05\n08.\tMusic\t\t\t\t\t03:35\n09.\tI Just Realized\t\t\t\t04:35\n10.\tAll Fired Up\t\t\t\t04:12\n11.\tLove Is\t\t\t\t\t04:15\n12.\tI&amp;#039;ve Been Touched\t\t\t04:11\n\nBiography\t\nPioneers of the London acid jazz scene, the Brand New Heavies translated their love for the funk grooves of the 1970s into a sophisticated sound that carried the torch for classic soul in an era dominated by hip-hop. Formed in 1985 by drummerkeyboardist Jan Kincaid, guitarist Simon Bartholomew, and bassistkeyboardist Andrew Levy -- longtime school friends from the London suburb of Ealing -- the Brand New Heavies were originally an instrumental unit inspired by the James Brown and Meters records its members heard while clubbing the rare groove scene in vogue at the moment. The trio soon began recording their own music, gaining enormous exposure when their demo tracks were spun at the influential Cat in the Hat Club.\nEventually adding a brass section, the Brand New Heavies built a cult following throughout the London club circuit, surviving the shift that saw the rare groove scene fade in the wake of acid house. After an earlier recording deal with Cooltempo yielded the single Got to Give, the Heavies -- now including vocalist Jay Ella Ruth -- signed with the fledgling indie label Acid Jazz; recorded on a budget of just 8,000 pounds, the group&amp;#039;s self-titled LP appeared in 1990 to strong critical acclaim, resulting in a licensing deal with the American company Delicious Vinyl. With Ruth now out of the band, Delicious Vinyl hand-picked N&amp;#039;dea Davenport as her successor, insisting the Heavies re-record tracks from their debut for their first U.S. effort, also an eponymous release that appeared in 1992.\nAfter scoring at home with Dream Come True and Stay This Way, the single Never Stop soon landed on the American R&amp;B charts, with the Heavies the first British group to accomplish such a feat with a debut single since Soul II Soul several years earlier; a subsequent New York performance augmented by rappers Q-Tip (A Tribe Called Quest) and MC Serch (3rd Bass) inspired the group to begin absorbing hip-hop, and that summer they cut Heavy Rhyme Experience, Vol. 1, an album including guest appearances by rappers including Main Source, Gang Starr, Grand Puba, and the Pharcyde. 1994&amp;#039;s Brother Sister, which went platinum in Britain, was Davenport&amp;#039;s last recording with the Heavies before beginning a solo career; she was replaced by singer Siedah Garrett in time for 1997&amp;#039;s Shelter. Two years later, the group reappeared with a British best-of album entitled Trunk Funk The Best of the Brand New Heavies; the title was recycled the following year for an American compilation, Trunk Funk Classics 1991-2000, which featured a new song recorded with Davenport. In early 2006 it was announced that Davenport would be reuniting with the group. A new album, Get Used to It, was released later that year and was followed by a tour of the U.K. and Europe.\n\nReview\nThe most surprising thing about Get Used to It is that the Brand New Heavies sound very much like an honest to gosh band instead of the instrumental unit with a hired frontwoman they always have been. Out of the BNH crew for a decade, vocalist N&amp;#039;Dea Davenport returns and it&amp;#039;s both familiar and just like starting over. Young upstart hunger drips out of the opening &quot;We&amp;#039;ve Got,&quot; a slinky slice of funk that introduces what&amp;#039;s going to be a mature album with more punch than ever. There are the usual horns and &quot;music turns me on&quot; type lyrics plus Davenport&amp;#039;s just perfect voice, but Get Used to It resists wandering into the musical theatrics this skillful group could be accused of overindulging in the past. While the glorious &quot;Music&quot; flirts with electronic dance music and the cool &quot;Don&amp;#039;t Know Why (I Love You)&quot; lays some unneeded strings onto its soulful groove, the majority of the album is stripped-down and wonderfully tight. The songwriting is right there, too, with Davenport delivering a handful of empowering or poignant songs that temper drummer and other main lyricist Jan Kincaid&amp;#039;s cool acid jazz anthems. As the organic and easy rolling &quot;I&amp;#039;ve Been Touched&quot; delicately comes apart and fades, it&amp;#039;s hard to recall a time this band have delivered an album so well constructed start to finish. They&amp;#039;ve traded fireworks for fire here, and no one who loves gutsy, vintage grooves should be caught without a copy.\n\nEnjoy. ","torrent":{"xt":"urn:btih:a2d3eba718de361aac33c8486b2637f92d61fb96","amp;dn":"The+Brand+New+Heavies+-+Get+Used+to+It+-+%282006%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2d3eba718de361aac33c8486b2637f92d61fb96","infoHashBuffer":{"type":"Buffer","data":[162,211,235,167,24,222,54,26,172,51,200,72,107,38,55,249,45,97,251,150]},"announce":[],"urlList":[]}}