{"title":"Bernstein - The Birth of Plenty; How the Prosperity of the Moder","uid":6813880,"size":1997057,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3ca67e0da4c8a68b4ef0978d770d2c2127804cf&amp;dn=Bernstein+-+The+Birth+of+Plenty%3B+How+the+Prosperity+of+the+Moder&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"jakcreed2","files":1,"time":1321125708,"description":"&quot;A tour de force...prepare to be amazed.&quot;\n--John C. Bogle, Founder and Former CEO, The Vanguard Group\n\nWhy didn't the Florentines invent the steam engines and flying machines that Da Vinci sketched? What kept the master metallurgists of ancient Rome from discovering electricity? The Birth of Plenty takes a fascinating new look at the key conditions that had to be in place before world economic growth--and the technological progress underlying it--could occur, why those pathways are still absent in many parts of today's world, and what must be done before true, universal prosperity can become a reality.\n\nThe Birth of Plenty doesn't mean to suggest that nothing of note existed before 1820. What The Birth of Plenty suggests that, from the dawn of recorded history through 1820, the &quot;mass of man&quot; experienced essentially zero growth, either in economic standing or living standards. It was only in the third decade of the nineteenth century that the much of the world's standard of living began to inexorably and irreversibly improve, and the modern world was born.\n\nBut what changed, and why then? Noted financial expert and neurologist William Bernstein isolates the four conditions which, when occurring simultaneously, constitute an all-inclusive formula for human progress:\n\n    Property rights--Creators must have proper incentives to create\n    Scientific rationalism--Innovators must be allowed to innovate without fear of retribution\n    Capital markets--Entrepreneurs must be given access to capital to pursue their visions\n    Transportation/communication--Society must provide mechanisms for effective communication of ideas and transport of finished products \n\nBeyond just shining a light on how quickly progress occurs once the building blocks are in place, however, The Birth of Plenty examines how their absence constitutes nothing less than a prescription for continued human struggle and pain. Why do so many parts of the world remain behind, while others learn to adapt, adopt, and move forward? What must long-troubled nations do to pull themselves from the never-ending spiral of defeatism? The Birth of Plenty addresses these timely and vital questions head-on, empirically and without apology, and provides answers that are both thought-provoking and troubling.\n\nThe Birth of Plenty frames the modern world's prosperity--or, in far too many cases, continuing lack of prosperity--in terms that are ingenious yet simple, complex yet easily understood. Entertaining and provocative, it will forever change the way you view the human pursuit of happiness, and bring the conflicts of both the world's superpowers and developing nations into a fascinating and informative new\nEnjoy and seed","torrent":{"xt":"urn:btih:a3ca67e0da4c8a68b4ef0978d770d2c2127804cf","amp;dn":"Bernstein+-+The+Birth+of+Plenty%3B+How+the+Prosperity+of+the+Moder","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3ca67e0da4c8a68b4ef0978d770d2c2127804cf","infoHashBuffer":{"type":"Buffer","data":[163,202,103,224,218,76,138,104,180,239,9,120,215,112,210,194,18,120,4,207]},"announce":[],"urlList":[]}}