{"title":"Nanozymes - Next Wave of Artificial Enzymes","uid":15452627,"size":4645237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a41a7d8996868c127bdeec02cceecd472a348fa1&amp;dn=Nanozymes+-+Next+Wave+of+Artificial+Enzymes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469957522,"description":"Nanozymes - Next Wave of Artificial Enzymes - Xiaoyu Wang et al. (Springer, 2016).pdf\r\n\r\nThis book describes the fundamental concepts, the latest developments and the outlook of the field of nanozymes (i.e., the catalytic nanomaterials with enzymatic characteristics). As one of today’s most exciting fields, nanozyme research lies at the interface of chemistry, biology, materials science and nanotechnology. Each of the book’s six chapters explores advances in nanozymes. Following an introduction to the rise of nanozymes research in the course of research on natural enzymes and artificial enzymes in Chapter 1, Chapters 2 through 5 discuss different nanomaterials used to mimic various natural enzymes, from carbon-based and metal-based nanomaterials to metal oxide-based nanomaterials and other nanomaterials. In each of these chapters, the nanomaterials’ enzyme mimetic activities, catalytic mechanisms and key applications are covered. In closing, Chapter 6 addresses the current challenges and outlines further directions for nanozymes. Presenting extensive information on nanozymes and supplemented with a wealth of color illustrations and tables, the book offers an ideal guide for readers from disparate areas, including analytical chemistry, materials science, nanoscience and nanotechnology, biomedical and clinical engineering, environmental science and engineering, green chemistry, and novel catalysis","torrent":{"xt":"urn:btih:a41a7d8996868c127bdeec02cceecd472a348fa1","amp;dn":"Nanozymes+-+Next+Wave+of+Artificial+Enzymes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a41a7d8996868c127bdeec02cceecd472a348fa1","infoHashBuffer":{"type":"Buffer","data":[164,26,125,137,150,134,140,18,123,222,236,2,204,238,205,71,42,52,143,161]},"announce":[],"urlList":[]}}