{"title":"Unexpected Series (1-2) by Anne Leigh [MU]","uid":8583355,"size":2662353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a47e514a5ceb216bfda424126a4f936dc82976d5&amp;dn=Unexpected+Series+%281-2%29+by+Anne+Leigh+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1371429655,"description":"Unexpected Series (1-2) by Anne Leigh in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - http://calibre-ebook.com/download \nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \n\nLove Unexpected (Unexpected #1) by Anne Leigh (January 19th 2013)\n\nThere are times, when you least expect it, where fate hands you the one person you cannot live without.\n\nSedona Mackenzie had her life perfectly planned; down to the coffee that she drank, the curfew that she lived by, and formulas that she solved to release stress. She had everything figured out, in a neat, little timeline. Then, fate chose to intervene in the form of a chance meeting with a guy who stirs unknown emotions inside her, leaving her reeling and wanting for more.\n\nZander Zebowski is not your typical college jock. For one, he's a good guy. Second, he's pretty smart. And, he's level-headed. The farthest thing on his mind was smacking into a woman who may just be his undoing.\n\nThis is not your typical bad boy meets good girl love story. This is a story between two people who are great on their own. But, with each other, they are absolutely perfect.\n\nLove Unmatched (Unexpected #2) by Anne Leigh (April 9th 2013)\n\nLove Unmatched \n\nFate brought them together.\n\nLove kept them together.\n\nLife could tear them apart. \n\n23 year-old Zander Zobowski, football wonderkid and only son of a tech giant and a well-known philanthropist, fell hard for one woman and never got back up.\n\n21 year-old uber-planner and borderline genius, Sedona Mackenzie, carefully crafted her life to only have it turned inside-out when she met a guy who made her feel things that she's never felt before. \n\nNot all stories are born out of darkness and deception. Theirs was created with the undeniable attraction for each other; nurtured by Zander's patience, and strengthened by Sedona's will. \n\nWill their love be enough to withstand the challenges that come their way? Or will it crumble through the test of time?\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:a47e514a5ceb216bfda424126a4f936dc82976d5","amp;dn":"Unexpected+Series+%281-2%29+by+Anne+Leigh+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a47e514a5ceb216bfda424126a4f936dc82976d5","infoHashBuffer":{"type":"Buffer","data":[164,126,81,74,92,235,33,107,253,164,36,18,106,79,147,109,200,41,118,213]},"announce":[],"urlList":[]}}