{"title":"Eazy-E - Eazy-Duz-It [FLAC+MP3](Big Papi) Rap 1988","uid":10319297,"size":439444996,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a48271c430399b642a281f44839a3fefa69ef496&amp;dn=Eazy-E+-+Eazy-Duz-It+%5BFLAC%2BMP3%5D%28Big+Papi%29+Rap+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":7,"uploader":"Big-Papi","files":-1,"time":1402286479,"description":"Source: Original Release 1988 CD\n\nBy Mike J\nFormat:Audio CD\nAs the notorious first &quot;official&quot; full length album from the NWA camp, Eazy-E helped establish a stranglehold on the &quot;Gangsta Rap&quot; genre before there ever was such a term. While Eazy had already made a name for himself with his independently released single &quot;Boyz In Tha Hood&quot;, (which he had reportedly sold out of his trunk), it was Eazy-Duz-It that made the then unsuspecting Hip-Hop nation take notice of the diminuitive ex-drug dealer turned rapper. While tales of his street exploits, using drug money to start his label, and &quot;Ruthless&quot; business acumen are the stuff of legends, it was this album that most would choose to use as their best memories of the now deceased Eric Wright.\n\nPrior to the release of his single and video &quot;We Want Eazy&quot;, the streets of Cali were already abuzz with the mere mention that a whole album was being released by Eazy. He and his crew had already established a loyal following with the flood of singles they had already released. When Eazy-Duz-It was released, Eazy was already in regular rotation from Greg Mack's Rap Attack radio show in LA all the way up to Nasty Nes' show in Seattle. Despite the familiarity with the young sounding rapper, no one was ready for the brashness that the L.P. would offer.\n\nFrom the start, every offensive, violent, and yes, humourous rhyme was clearly designed to either shock or excite Eazy's audience. Like Too $hort and 2 Live Crew before him, Eazy went for a dirty side and a clean side to his album. The fact that he started off with the dirty side seemed to make the statement that the priorty with Eric &amp; Co. was streets first, then radio. Like Ice-T's Rhyme Pays, Eazy-Duz-It was an uncompromising look at the rough inner-city with tales of drugs, prostitution and violence. What was different from any of these predecessors was the amazing lack of any sort of remorse for the crime or positivity to counter the negative messages and images. This rapper was cut from a different cloth than his other Hip-Hop bretheren.\n\nLyrically, Eric's ghost writters Ice Cube, MC Ren, and The D.O.C. injected him with a sense of reality and depth that sounded shockingly unlike any other prior release. These harsh realites came to you from this kid who had previously stated, albeit misleadingly, that he was only 16 or 17 years old at the time the album was released. To hear the tales of bank robberies gone awry (&quot;Nobody Move&quot;), violent street confrontations with rival gangs (&quot;Boyz-N-Tha Hood remix&quot; &amp; &quot;Eazy-Duz-It&quot;), and explicit tales of sexual exploits (&quot;Still Talkin'&quot;) coming from the mouth of what sounded to be a young teen was astounding unto itself. But perhaps more amazing still was the fact that the second &quot;radio friendly&quot; half of the album was as equally uncompromising in content and depth as the first despite its lack of curses. The fact that the Street side doesn't outweigh the Radio side in terms of it's quality is a statement unto itself.\n\nBeatwise, the blueprint laid out by Eric B and Rakim's heavy use of funk loops and samples on both Paid In Full and Follow the Leader were taken in a new direction by producer/DJ Dr. Dre. Prior to Eazy-Duz-It, most LA hip hop releases had a very strong prevalence of cheap sounding keyboards and drum machines. New York was still mostly stuck in James Brown land. Eazy-Duz-It came alive through use creative usage of Sly &amp; The Family Stone, Bootsy Collins, Parliament, Brick, Brass Construction and others. This funk style of production became Dr. Dre's signature and set the trend for future West Coast releases up to today.\n\nWhile all the highs and lows that were to follow this album's release are sure to spark a heated discussion in any group of Hip-Hop listeners, this album remains a testament to the strength of both Eazy and NWA. Sure, he didn't write his own lyrics. Sure Dre had to &quot;punch&quot; Eric into his own vocal tracks endlessly to create the illusion that Eazy could actually flow naturally. Yes there was the eventual falling out and self-implosion within NWA. And there were the many desperate attempts Eazy made to reclaim his credibility in the music community afterwards, (several of which are on this re-release version with the inclusion of his 5150 EP). None of these truths or eventual results should detract from the greatness of this release.\n\nimage\n\n---------------------------------------------------------------------\nEazy-E - Eazy-Duz-It\n---------------------------------------------------------------------\n\nArtist...............: Eazy-E\nAlbum................: Eazy-Duz-It\nGenre................: Rap\nSource...............: CD\nYear.................: 1988\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 64 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 264kbps)\nChannels.............: Joint Stereo / 44100 hz\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Eazy-E - 2 Hard Mutha's [04:26]\n2. Eazy-E - Boyz-n-the Hood [06:22]\n3. Eazy-E - Eazy - Chapter 8 Verse 10 [02:10]\n4. Eazy-E - Eazy-Duz-It [04:21]\n5. Eazy-E - Eazy-Er Said Than Dunn [03:41]\n6. Eazy-E - I'mma Break It Down [03:29]\n7. Eazy-E - No More ?'s [03:55]\n8. Eazy-E - Nobody Move [04:49]\n9. Eazy-E - Radio [04:58]\n10. Eazy-E - Ruthless Villain [02:59]\n11. Eazy-E - Still Talkin' [03:50]\n12. Eazy-E - We Want Eazy [05:01]\n\nPlaying Time.........: 50:06","torrent":{"xt":"urn:btih:a48271c430399b642a281f44839a3fefa69ef496","amp;dn":"Eazy-E+-+Eazy-Duz-It+%5BFLAC%2BMP3%5D%28Big+Papi%29+Rap+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a48271c430399b642a281f44839a3fefa69ef496","infoHashBuffer":{"type":"Buffer","data":[164,130,113,196,48,57,155,100,42,40,31,68,131,154,63,239,166,158,244,150]},"announce":[],"urlList":[]}}