{"title":"Chicago 10","uid":4842696,"size":1225723176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a49f6b990d53ab3e165c46ff53e329ee8e41be7b&amp;dn=Chicago+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rocapp","files":-1,"time":1239562951,"description":"Chicago 10: Speak Your Peace (2007) is a partly-animated film written and directed by Brett Morgen that tells the story of the Chicago Seven. The film features the voices of Hank Azaria, Dylan Baker, Nick Nolte, Mark Ruffalo, Roy Scheider, Liev Schreiber, and Jeffrey Wright in an animated reenactment of the trial based on transcripts and rediscovered audio recordings, making the film fall in the animated documentary genre. It also contains archive footage of David Dellinger, Abbie Hoffman, William Kunstler, Jerry Rubin, Bobby Seale, and Leonard Weinglass, and of the protest and riot itself. The title is drawn from a quote by Rubin, who said, &quot;Anyone who calls us the Chicago Seven is a racist. Because you're discrediting Bobby Seale. You can call us the Chicago Eight, but really we're the Chicago Ten, because our two lawyers went down with us.&quot; [1]\n\nThe film premiered January 18, 2007 at the 2007 Sundance Film Festival. It later premiered at Silverdocs, the AFI/Discovery Channel Documentary Festival in Downtown Silver Spring, Maryland. The film opened in limited release in the United States on February 29, 2008.[1] It was aired nationally on the PBS program, Independent Lens, on October 22, 2008.","torrent":{"xt":"urn:btih:a49f6b990d53ab3e165c46ff53e329ee8e41be7b","amp;dn":"Chicago+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49f6b990d53ab3e165c46ff53e329ee8e41be7b","infoHashBuffer":{"type":"Buffer","data":[164,159,107,153,13,83,171,62,22,92,70,255,83,227,41,238,142,65,190,123]},"announce":[],"urlList":[]}}