{"title":"The Happy Vegan: A Guide to Living a Long, Healthy, and Successf","uid":12846538,"size":1619900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a4cc3de9122a730aadb5a821a05d9429c14c1e21&amp;dn=The+Happy+Vegan%3A+A+Guide+to+Living+a+Long%2C+Healthy%2C+and+Successf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1448560259,"description":"The Happy Vegan: A Guide to Living a Long, Healthy, and Successful Life \r\n\r\n\r\nMaster entrepreneur, original hip-hop mogul, and three-time New York Times bestselling author Russell Simmons offers an inspiring guide to the benefits of conscious eating and veganism\r\n\r\nIn the New York Times bestseller Success Through Stillness, Russell Simmons shared how meditation can be used as a powerful tool to access potential in all aspects of life, having seen himself how achieving inner peace led to outward success.\r\n \r\n\r\nIn The Happy Vegan, Simmons shares how once he started practicing yoga and meditation, he became more conscious of his choices, particularly the choices he made regarding his diet. Simmons first adopted a vegetarian and then vegan diet, and almost immediately began to experience the physical, mental, and emotional benefits of eating green and clean. He delves into research about mindful eating, the links between stress and poor eating habits, the importance of listening to your body, the well-documented problems associated with eating animal products and processed foods, along with tips on how to transition to a vegan diet.\r\n \r\n\r\nDrawing on his own experience, the experiences of others, and science and research on the health benefits of conscious eating and veganism, The Happy Vegan is an accessible and inspiring guide to help others make the move toward a vegan diet and a more successful, focused, and purposeful life.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:a4cc3de9122a730aadb5a821a05d9429c14c1e21","amp;dn":"The+Happy+Vegan%3A+A+Guide+to+Living+a+Long%2C+Healthy%2C+and+Successf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4cc3de9122a730aadb5a821a05d9429c14c1e21","infoHashBuffer":{"type":"Buffer","data":[164,204,61,233,18,42,115,10,173,181,168,33,160,93,148,41,193,76,30,33]},"announce":[],"urlList":[]}}