{"title":"Little.Steven.&amp;.The.Disciples.Of.Soul-.Discography.(1982-1999)","uid":5394102,"size":708587307,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a516ee96b9581fabf87ae9490f3a54f96be607da&amp;dn=Little.Steven.%26.The.Disciples.Of.Soul-.Discography.%281982-1999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"novamdm","files":96,"time":1267171497,"description":"Steven Van Zandt grew up in the same south New Jersey shore scene as Bruce Springsteen and Southside Johnny Lyon, and was closely associated with them. He was a member of Springsteen's band Steel Mill in 1969-1970 and the Bruce Springsteen Band in 1971. He toured with the Dovells, then worked with Southside Johnny, helping him form the Asbury Jukes in 1974 and playing with the group; but he re-joined Springsteen in the E Street Band in early 1975. This group went on to massive success, and Van Zandt worked closely with Springsteen, co-producing The River (1980) and Born in the U.S.A. (1984) while also producing and writing material for Southside Johnny and Gary &quot;U.S.&quot; Bonds. In 1982, he organized Little Steven &amp; the Disciples of Soul and released Men Without Women that year. He left the E Street Band on amicable terms in April 1984 and released the second Disciples of Soul album, Voice of America, that spring.\n\nHis work as Little Steven found him taking an overt left-wing political stance; and in 1985 he organized Artists United Against Apartheid, recording the all-star Top 40 single &quot;Sun City,&quot; which increased awareness about apartheid in South Africa and the fact that musicians appeared at the country's Sun City entertainment complex. In 1987, having shed the Disciples of Soul, he released his third album, Freedom, No Compromise. Revolution followed in 1989. Though Van Zandt was without a record contract during the 1990s, he produced other artists and was involved in soundtrack work. In 1995, he re-joined the E Street Band for recordings and performances in connection with Springsteen's Greatest Hits album. He turned to acting in 1998, taking a featured role in the successful television series The Sopranos. In 1999, he again re-joined the E Street Band for its reunion tour, and he released a new album, Born Again Savage. \n\n\nContains 7 albums by E-Street guitarist and prolific Jersey songwriter Steven Van Zandt/Little Steven.  5 Studio albums, 1 Greatest Hits compilation, 1 bootleg (from pressed disc).\n\nMen Without Women (1982).  Self ripped from CD.  LAME 3.97, average bitrate 231kbps.\n\nVoice of America (1984).  Self ripped from CD. LAME 3.98, average bitrate 248kbps.\n\nFreedom No Compromise (1987).  Self ripped from CD.  LAME 3.98, average bitrate 256kbps.\n\nNative American [Bootleg] (1987).  Also known as &quot;Live at the Ritz&quot;.  Self ripped from CD. LAME 3.90.3, average bitrate 240kbps.\n\nRevolution (1989).  Self ripped from CD.  LAME 3.90.3, average bitrate 246kbps.\n\nBorn Again Savage (1999).  Self ripped from CD. LAME 3.90.3, average bitrate 250kbps.\n\nGreatest Hits (1999). Third party CD rip.  LAME 3.98, average bitrate 220kbps.\n\n\n\nAll albums have been tagged, MP3 GAINed, and optimized with MP3packer. &lt;a href=&quot;\nhttp://www.littlestevensundergroundgarage.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.littlestevensundergroundgarage.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gnfwxqwdldae&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gnfwxqwdldae&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Little_Steven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Little_Steven&lt;/a&gt;","torrent":{"xt":"urn:btih:a516ee96b9581fabf87ae9490f3a54f96be607da","amp;dn":"Little.Steven.%26.The.Disciples.Of.Soul-.Discography.%281982-1999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a516ee96b9581fabf87ae9490f3a54f96be607da","infoHashBuffer":{"type":"Buffer","data":[165,22,238,150,185,88,31,171,248,122,233,73,15,58,84,249,107,230,7,218]},"announce":[],"urlList":[]}}