{"title":"The Stunt Man 1980 DvdRip Avi Lee1001","uid":9825719,"size":1761832974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a52df81e89789628722fe6aa14a14ff322bba7eb&amp;dn=The+Stunt+Man+1980+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xultfoad","files":2,"time":1395772344,"description":"The Stunt Man 1980 DvdRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0081568/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0081568/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Stunt_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Stunt_Man&lt;/a&gt;\nThe Stunt Man is an American comedy thriller film first released in 1980, directed by Richard Rush. The film is based on a novel by Paul Brodeur and stars Peter O'Toole, Steve Railsback, Barbara Hershey and Allen Garfield and Alex Rocco. It is a Simon Productions production, produced by Paul Lewis.\n\nRush was involved with The Stunt Man for some six years before shooting began and then, amazingly for so accomplished a piece of work, the finished picture languished without a distributor for two years. Fortunately, it garnered excellent reviews and won the Grand Prize at the Montreal Film Festival as well as several Oscar nominations and the studios eventually consented to show it.\n\nPeter O'Toole gives one of his best performances (and that's saying something) as flamboyant, autocratic film director Eli Cross who's shooting a World War One epic. Onto the set stumbles Vietnam vet Cameron (Railsback), on the run from the police. Cross offers to hide Cameron by giving him the job of stunt double for the star of his movie. The previous incumbent died attempting to kill Cameron by driving his car at him on a narrow bridge.\nCameron, with no other option available, accepts Cross' terms and soon, happy with the high pay for the job, is successfully performing a series of increasingly perilous stunts. Drawn into a love affair with the picture's leading lady Nina Franklin (Hershey), the stunt man seems to become a pawn in the hands of Cross but as each stunt becomes more death-defying, he starts to believe that he is about to meet the same fate as his predecessor just so Cross can capture the ultimate stunt on camera: drowning.\nThe Stunt Man offers a wry and absorbing look at the mechanics of movie making and fakery involved in bringing a film to the screen and Rush's message that in life, as at the pictures, nothing and no-one is quite what they appear to be, is put over with infectious brio.\n\nRush's technique is dazzling, with fantastically shot action sequences, constant and clever camera trickery and a fine mixture of pathos, bathos and humour. And just as Cross manipulates his actors, Rush constantly toys with his audience, inducing a heady feeling of paranoia and confusion. We are never allowed to glimpse the full picture - events are shown only from the point of view of Cameron, the permanently confused lead. By the end of each scene his understanding of his situation is radically altered. It's a dizzying, but euphoric journey.\nVerdict:Meticulously constructed and beautifully realised. At the centre is O'Toole - the film director as God - whose all-out performance commands attention whenever he appears and rightly earned an Academy Award nomination for his performance\n\nIt defied all odds to become the most unexpected and acclaimed cult hit of the 80s, and it remains one of the most slyly subversive and thrillingly original action/comedy/drama motion pictures of all time. The legendary Peter O'Toole in his iconic Oscar nominated performance stars as director Eli Cross, a deliciously megalomaniacal madman commanding a film-set circus where a paranoid young veteran (Steve Railsback) finds himself maybe replacing a dead stunt man, possibly falling for the beautiful leading lady (Barbara Hershey), and discovering that love, death and the mayhem of moviemaking can definitely be the wildest illusions of all\n\nYou simply have to see The Stunt Man. It's an overlooked gem and, despite the wide praise it received, it has never really reached a large audience. Now is definitely the time to rediscover this forgotten classic.\n\nVibrating with energy, the incessantly entertaining The Stunt Man is a puzzle-master's delight. \n\nOverall a funny, compelling and curious film that was sabotaged by the Hollywood suits. \n\nO'Toole based his performance on his experiences with David Lean\n\nVIDEO\nSize.... 1.64gb\nDuration.... 02:10:36\nCodec.... divx\nFrame Width..... 672\nFrame Height.... 368\nData Rate.... 1670kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps.... MP3\n1 Channel mono\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:a52df81e89789628722fe6aa14a14ff322bba7eb","amp;dn":"The+Stunt+Man+1980+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52df81e89789628722fe6aa14a14ff322bba7eb","infoHashBuffer":{"type":"Buffer","data":[165,45,248,30,137,120,150,40,114,47,230,170,20,161,79,243,34,187,167,235]},"announce":[],"urlList":[]}}