{"title":"Os canhões de Navarone (1963) - TVRip - Dublado","uid":12673228,"size":4841166578,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a55fabd803cce873f785ae03356e2a96fc5aca61&amp;dn=Os+canh%26otilde%3Bes+de+Navarone+%281963%29+-+TVRip+-+Dublado&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"orion2017","files":2,"time":1446479520,"description":"Os canhões de Navarone (1963) - TVRip - Dublado - X264\r\n\r\nGregory Peck, Anthony Quinn, David Niven e Anthony Quayle\r\n\r\nEm 1943, 2.000 soldados britânicos estão encurralados na Ilha de Kheros, pertencente à Turquia que ainda não entrou na guerra mas está sendo pressionada pelos alemães. Não podem ser resgatados pela Marinha em função de dois enormes canhões alemães construídos na escarpada ilha grega de Navarone. Os aliados resolvem montar uma expedição secreta, para dinamitar os canhões. Liderada pelo valente Major Roy Franklin (Anthony Quayle), que convence o Cap. Keith Mallory (Gregory Peck), um grande alpinista antes da guerra e que fala várias línguas, a levar um grupo de homens para escalar a encosta e explodir as armas. Faz parte da expedição um grego, Cel. Andrea Stavros (Anthony Quinn), que lutou ao lado do Capitão mas o culpa pela morte da família e o jurou de morte para quando a guerra acabar. O cabo Miller (David Niven), amigo de Franklin, é o perito em explosivos. Outros membros do grupo são assassinos treinados em corpo-a-corpo e mecânico de navios. Depois de uma violenta tempestade, Franklin é ferido e tem uma perna gangrenada. Mallory assume o comando, sob a desconfiança de Miller, que acha que o capitão quer se livrar de Franklin, que estaria dificultando o alcance do já incerto êxito da missão.\r\nOs Canhões de Navarone. Apoiado num elenco de astros e produção grandiosa, o filme fez enorme sucesso, recebendo sete indicações para o Oscar de 1961 (inclusive Melhor Filme) e vencendo a de Melhores Efeitos Especiais. Apesar de Foreman ter marcado seu gol, foi MacLean o verdadeiro beneficiado; seu romance tornou-se fonte para muitas aventuras épicas no cinema, incluindo Estação Polar e Desafio das Águias. Contudo, é Canhões de Navarone que permace não apenas como uma das melhores adaptações de MacLean, mas um dos maiores espetáculos de ação e aventura já produzidos","torrent":{"xt":"urn:btih:a55fabd803cce873f785ae03356e2a96fc5aca61","amp;dn":"Os+canh%26otilde%3Bes+de+Navarone+%281963%29+-+TVRip+-+Dublado","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a55fabd803cce873f785ae03356e2a96fc5aca61","infoHashBuffer":{"type":"Buffer","data":[165,95,171,216,3,204,232,115,247,133,174,3,53,110,42,150,252,90,202,97]},"announce":[],"urlList":[]}}