{"title":"Los Secretos del Vaticano [DVDRip][Spanish]","uid":6804922,"size":734011392,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a59c83b805f933340d75028e29bba56dc1bece1a&amp;dn=Los+Secretos+del+Vaticano+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"virana","files":-1,"time":1320826687,"description":"Los Secretos Del Vaticano dvd Documental\nLos Secretos Del Vaticano dvd Documental\n\n\n\nEl Vaticano es siempre asociado con el Papa Juan Pablo II, La iglesia cristiano en un arte y arquitectura esplendorosa. Pero hay mucho mas en este estado eclesiÃƒÂ¡stico. Los secretos del Vaticano permite conocer al espectador uno de los lugares mas venerados del mundo y presenciar ceremonias litÃƒÂºrgicas raramente contempladas por extraÃƒÂ±os. En este viaje se incluyen entrevistas con los hombre y mujeres restauradores restauradores de artes a lideres religiosos que vienen y trabajan en el interior del Vaticano. A travÃƒÂ©s de sus fascinantes historias el documental presenta lo que significa conservar la pinturas, Tapices y documentos de una instituciÃƒÂ³n cuya historia empezÃƒÂ³ en primer siglo de nuestra era.\n\n\nAl Vaticano se le acusa de intentar ocultar sus archivos secretos. Este siempre se ha defendido argumentando que tambien es un Estado nacional Soberano y debe guardar sus documentos. Pero no ha sido suficiente para sus detractores. Por fin, Juan Pablo II decidio publicar sus archivos que incluso estan en la red como Archivo Secreto.\nLa Realizacion de este documental no solo examina tales archivos mostrando sus originales, sino que hace una sinopsis del unico estado absolutista de occidente, la vida de sus subditos y una descripcion detallada de las funciones de cada uno.\nÃ‚Â¿Sabian que el Vaticano es la unica Nacion Monarquica que no conoce de Huelgas ni Paros?\n","torrent":{"xt":"urn:btih:a59c83b805f933340d75028e29bba56dc1bece1a","amp;dn":"Los+Secretos+del+Vaticano+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59c83b805f933340d75028e29bba56dc1bece1a","infoHashBuffer":{"type":"Buffer","data":[165,156,131,184,5,249,51,52,13,117,2,142,41,187,165,109,193,190,206,26]},"announce":[],"urlList":[]}}