{"title":"N.T. Wright - Matthew for Everyone part 2 (pdf)","uid":8205746,"size":2320421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5a3093ab7b020b26568d3a3cb09b47203078005&amp;dn=N.T.+Wright+-+Matthew+for+Everyone+part+2+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1362119152,"description":"N. T. Wright - Matthew for Everyone, Part 2: Chapters 16-28 (Westminster John Knox Press, 2004). 227 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThis is the second of two volumes, and is part of a series covering the whole New Testament. They are brief commentaries oriented to laypeople and written from a perspective that can inadequately be called moderately conservative (but not fundamentalist). N. T. Wright is widely regarded as one of the top New Testament scholars in the world.\n\nI will be posting all the books in the series here over the next few weeks. \n\nPart 1 is here: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8201402/N.T._Wright_-_Matthew_for_Everyone_part_1_(pdf)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8201402/N.T._Wright_-_Matthew_for_Everyone_part_1_(pdf)&lt;/a&gt;\n\nDescription:\n\nTom Wright's eye-opening comments on the Gospel of Matthew and what it might mean for us are combined, passage-by-passage, with his fresh translation of the Bible text. Making use of his true scholar's understanding, yet writing in an approachable and anecdotal style, Wright captures the urgency and excitement of Matthew's Gospel in a way few writers have.Tom Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nReview\n\nIn this series [Wright] excels as a communicator, making this the most exciting study guide since Barclay's Daily Study Bible. -- Expository Times\n\nIf you wish to meet the Jesus who broke into people's lives while on earth, I heartily recommend these guides. -- The Christian Herald\n\n\nWright writes well and with an easy style. The short commentaries tackle New Testament books without being weighed down ... --Publishers Weekly\n\n\nA rare event: a commentary that is learned without being stuffy, accessible without being reductionist. Tom Wright joins us in our homes and workplaces, our sanctuaries and classrooms, in genial, prayerful conversation over this text that forms our lives, the New Testament scriptures. --Eugene Peterson, Professor Emeritus of Spiritual Theology, Regent College, and author of The Message\t\t","torrent":{"xt":"urn:btih:a5a3093ab7b020b26568d3a3cb09b47203078005","amp;dn":"N.T.+Wright+-+Matthew+for+Everyone+part+2+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5a3093ab7b020b26568d3a3cb09b47203078005","infoHashBuffer":{"type":"Buffer","data":[165,163,9,58,183,176,32,178,101,104,211,163,203,9,180,114,3,7,128,5]},"announce":[],"urlList":[]}}