{"title":"[ExploitedCollegeGirls] Mia (15.01.2015)","uid":11680455,"size":620700341,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a609f2ab0242e664258985ce7a2128965b960755&amp;dn=%5BExploitedCollegeGirls%5D+Mia+%2815.01.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"2.No.2","files":1,"time":1423063600,"description":"[ExploitedCollegeGirls] Mia (15.01.2015)\n\nThe reason we focus on recruiting the freshest college girls we possibly can is perfectly summed up by Mia: perky, young, gravity defying tits adorning a tight, taut little body and a try anything, do anything, YOLO attitude. Throw in a deliciously creamy pussy that gets creampied and a couple of real orgasms and you've got a little thing we at Ex Co Gi call striking gold.\nWe get to know Mia on the drive to Jay's secret studio location (aka a reasonably priced hotel he gets reward points at) as she tells us about her sexual interests. You'll probably find this shocking coming from a girl who dresses like she takes fashion tips from Marilyn Manson but Mia is into BDSM. She declares that she loves being dominated and is a submissive at heart. Definitely something our man Jay can work with. You can practically hear him planning how he's going to bang Mia to multiple O's as he guides his car into a secluded spot for a little pre-shoot car head.\nAfter they arrive at the location, Jay goes back in for some more interview but this girl is just vibrating with sexual energy and he knows to take advantage of it. He gets her naked and starts in with his fingers on her already damp pussy. Before long she's overtaken by a very vocal orgasm and then another as Jay switches to a vibrator. Caught up in Mia's enthusiasm, Jay has her lay face down on the bed so he can get behind her and take straight to pound town. Judging by the way she writhes and vocalizes and the way her pussy creams up, Jay must be scoring bullseye after bullseye on her g-spot. Which leads to another intense, leg shaking orgasm as Jay wraps her hair around her neck and dominates her.\nAfter jackhammering Mia to several more loud orgasms, Jay gets behind her for a big creampie finish as he fucks her from the side. The new angle takes Mia by surprise and she has the biggest orgasm of the shoot as Jay unloads a huge internal cumshot. Creampie lovers rejoice, Mia's tight pussy squeezes every drop right back out and Jay captures all of it for you with some really detailed close ups.\n\nAmateur, All Sex\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=djshimqit4zb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=djshimqit4zb.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=9rd8ufm122re.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=9rd8ufm122re.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a609f2ab0242e664258985ce7a2128965b960755","amp;dn":"%5BExploitedCollegeGirls%5D+Mia+%2815.01.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a609f2ab0242e664258985ce7a2128965b960755","infoHashBuffer":{"type":"Buffer","data":[166,9,242,171,2,66,230,100,37,137,133,206,122,33,40,150,91,150,7,85]},"announce":[],"urlList":[]}}