{"title":"Leah Darrow - Made for Greatness: Runway Model Turns to Christ","uid":15615445,"size":21998903,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a6e10b104c5d429bce2be7cc50201e2f6c1ae46a&amp;dn=Leah+Darrow+-+Made+for+Greatness%3A+Runway+Model+Turns+to+Christ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"catholicstuff","files":1,"time":1471826625,"description":"Leah Darrow - Made for Greatness: Runway Model Turns to Christ [audio presentation]\r\n\r\n&quot;Leah Darrow's testimony is a powerful example of God's mercy at work.&quot; \r\n-Jason Evert, founder of Chastity Project\r\n\r\n&quot;Leah Darrow has a true gift for sharing a Christ-Centered vision that is relevant, compelling, and engaging.&quot; \r\n- Curtis Martin, founder of FOCUS\r\n\r\nLeah Darrow was a fashion model in New York City and a reality TV contestant on America's Next Top Model. She now travels the world sharing her unique experiences in the beauty industry. Leah now speaks to tens of thousands of people each year to audiences as diverse as a United Nations panel, the World Trade Center in Manila Phillipines, Pro-Life events, and local parishes on five different continents. In this presentation, learn how the pursuit of pop culture's definition of love and happiness led to a moment of mercy and conversion in Leah's life.\r\n\r\nTo learn more about Leah's ministry, to read her blog, or to have Leah speak at your next event, visit LeahDarrow.com and follow her onInstagram, and Twitter.\r\n \nhttps://www.lighthousecatholicmedia.org/store/title/made-for-greatness-runway-model-turns-to-christ\r\n\r\n---\r\n\r\nIf you enjoy this presentation, please support Lighthouse Catholic Media, NFP, which is a 501(c)(3) Not For Profit Company that seeks to answer the call for a New Evangelization. Lighthouse Catholic Media specializes in promoting the Catholic Faith through high quality presentations on audio CDs and MP3s from many of the best Catholic speakers in both English and Spanish. You can purchase CD copies of this presentation to give to your friends and family and find many other wonderful presentations available for MP3 download at https://www.lighthousecatholicmedia.org/ \r\n\r\nYou can also support Lighthouse Catholic Media and the New Evangelization by making a tax-deductible donation at https://www.lighthousecatholicmedia.org/donate\r\n\r\n\r\nPlease seed!\r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.se/user/catholicstuff/","torrent":{"xt":"urn:btih:a6e10b104c5d429bce2be7cc50201e2f6c1ae46a","amp;dn":"Leah+Darrow+-+Made+for+Greatness%3A+Runway+Model+Turns+to+Christ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6e10b104c5d429bce2be7cc50201e2f6c1ae46a","infoHashBuffer":{"type":"Buffer","data":[166,225,11,16,76,93,66,155,206,43,231,204,80,32,30,47,108,26,228,106]},"announce":[],"urlList":[]}}