{"title":"Call of Duty Black Ops II DLC + Update + Operation2[ASkyNinja]","uid":8869841,"size":4797552269,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a700f78d15599f7740d537932e48f41faa1379ad&amp;dn=Call+of+Duty+Black+Ops+II+DLC+%2B+Update+%2B+Operation2%5BASkyNinja%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ASkyNinja","files":-1,"time":1378030766,"description":"Call of Duty: Black Ops II is a First-Person Shooter (FPS) that revolves around unique gameplay that propels the Call of Duty franchise into a world of future warfare, and back again to the modern era. The game is a sequel to the 2010 release, Call of Duty: Black Ops, and features returning Black Ops characters Sgt. Frank Woods and Agent Alex Mason, joined by a wealth of new characters. Additional features include: two distinct yet linked playable time periods, advanced weaponry, branching storylines created by player choices in Strike Force missions, exciting multiplayer options, and more\n\nCall of Duty: Black Ops II game logoA gas masked character backed up by combat drone support in Call of Duty: Black Ops II\n\nA whole new future war Call of Duty scenario affected by player decisions in mission play\n\n\nTo Understand the Future, you Must Understand the Past\n\n\n\nPushing the boundaries of what fans have come to expect from the record-setting entertainment franchise, Call of Duty: Black Ops II propels players into a near future, 21st Century Cold War, where technology and weapons have converged to create a new generation of warfare between old and new foes. In this conflict, the mechanized creations of men reign supreme, facing off against each other as their creators stay safe and unconflicted, and in the process grow ever softer. In this scenario an important question will be asked: What happens when enemy steals the keys? To understand such a possible future, you must understand where you have been\n\nPlayers of Call of Duty: Black Ops II gain an understanding of this and more through the game's additional timeline set in the late Cold War era of the 1980's. Within the campaign story, which spans these two eras, players will see familiar faces such as Alex Mason, his son David Mason, and Sgt. Frank Woods. Linking these together will be the rise of another player in the conflict, Raul Menendez\n\n\n\nKey Game Features\n\n\n\nAn all-new Call of Duty: Black Ops II storyline featuring new characters and and returning characters\n\nA unique single-player campaign that contains two time periods linked by characters and their actions\n\nSpecial Strike Force missions, in which the players action affect the outcome of gameplay and the overall campaign\n\nA variety of multiplayer modes and play options\n\nZombies\n\n\n\nThe Biggest Zombies Experience to Date: Call of Duty: Black Ops II Zombies features three different ways to survive the zombie apocalypse. Unravel the mysteries of a dying Earth in Tranzit, fight endless waves of zombies in Survival mode, or compete in the new 4z4 last-human-standing mode, Grief\n\n\n\nTranzit\n\n1-4 player co-op in a large open world with a variety of locations. The new Buildables gameplay elements help players move through each area to find the key tidbits that reveal why they are there and what they must do to survive. All the while, public transportation is still operational, as a bus will regularly stop at each location. Zombies ride for free\n\n\n\nSurvival\n\nRecreating the classic mode of just purely surviving the shambling, incoming Zombie horde, Survival mode allows you to play 1-4 players co-op in specific locations from the much larger Tranzit area\n\n\n\nGrief\n\nYou and friends can take on up to 4 people in a team vs. Zombies vs. team scenario. 2-8 players are thrown in a situation to be the last humans standing\n\n\n\nMP Technology with Zombies: Call of Duty: Black Ops II features new and extensive stat tracking as well as leaderboards for bragging rights. New skill-based matchmaking system will allow players of the same ability to take on the horrors of the night in public game modes. For players that are looking for an extra challenge, Zombies features custom games: Headshots only, higher starting rounds, and toggling of extra items are all available","torrent":{"xt":"urn:btih:a700f78d15599f7740d537932e48f41faa1379ad","amp;dn":"Call+of+Duty+Black+Ops+II+DLC+%2B+Update+%2B+Operation2%5BASkyNinja%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a700f78d15599f7740d537932e48f41faa1379ad","infoHashBuffer":{"type":"Buffer","data":[167,0,247,141,21,89,159,119,64,213,55,147,46,72,244,31,170,19,121,173]},"announce":[],"urlList":[]}}