{"title":"Medieval Mysteries by Joan Wolf","uid":9637321,"size":758823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a77fc4dda23414fb328d8b865a27e81db5293c96&amp;dn=Medieval+Mysteries+by+Joan+Wolf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PirateBook","files":2,"time":1392862073,"description":"\nJoan Wolf (born 1951 in Bronx, New York) is an American writer of romance novels. Wolf grew up in the Bronx, New York. \n\nShe obtained a Bachelor's degree in Mercy College and Master in English and Comparative Literature in Hunter College.\nWarrior Kings Trilogy is also known as Dark Ages of Britain.\n\nGenre: Mystery/Historical\n\n\nNo Dark Place (Medieval Mysteries #1)\n\nIn the turbulent realm of Norman England, a young nobleman discovers that his identity is the link to an incredible mystery. Hugh Corbaille has just lost the person he cares for most in the world, his adoptive father, the Sheriff of Lincoln. While Hugh's grief is still raw, he is approached by a visiting knight with an unbelievable tale: Hugh may actually be Hugh de Leon, sole child of the Earl of Wiltshire, mysteriously abducted thirteen years before on the day of his father's murder. With no memory of his early years, Hugh sets out to find the truth. He soon unearths a web of death and intrigue beginning in the lost days of his childhood when he may have witnessed the stabbing of his birth father. Tormented by this tragic puzzle, Hugh must turn to the mother he has never known, a court of strangers, and the young woman whose sympathy and healing are his one support, to try to piece together his splintered past and put an end to a reign of danger and deception.\n\nThe Poisoned Serpent (Medieval Mysteries #2)\n\nNorman England has little to celebrate in the new year of 1140. The country is immersed in a bitter civil war from which no one is immune, including Hugh de Leon, heir to an earldom. His Uncle Guy has arranged his marriage to the spoiled daughter of the newly named Earl of Lincoln. It is a merger that will combine two of the land's largest fortunes -- and give the de Leons unparalleled power. Hugh's heart, however, belongs to the Lady Cristen, and he will do everything he can -- including eloping -- to make her his own.\nHis plan is simple enough-until the new Earl of Lincoln is murdered, and a friend of Hugh's is accused of the crime. Though he has little time in which to foil his uncle's arrangement, Hugh cannot see an innocent man wrongly hanged. To save his friend and marry the woman he loves, Hugh must work fast to track down a deadly -- and wily -- serpent. But when he grabs it by the tail, can he avoid its poisonous bite?","torrent":{"xt":"urn:btih:a77fc4dda23414fb328d8b865a27e81db5293c96","amp;dn":"Medieval+Mysteries+by+Joan+Wolf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a77fc4dda23414fb328d8b865a27e81db5293c96","infoHashBuffer":{"type":"Buffer","data":[167,127,196,221,162,52,20,251,50,141,139,134,90,39,232,29,181,41,60,150]},"announce":[],"urlList":[]}}