{"title":"12 Rods - Split Personalities [1998] [EAC,log,cue. FLAC]","uid":9034441,"size":368694205,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a7f860f85730a562f248817d93f792acc4a85e32&amp;dn=12+Rods+-+Split+Personalities+%5B1998%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":13,"time":1381481536,"description":"Artist:12 Rods\nRelease:Split Personalities\nReleased:  1998\nLabel:  V2\nCatalog#: 27015\nFormat:  FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: indie rock\n\n1. Split Personality (5:36)\n2. Red (6:35)\n3. I Am Faster (6:43)\n4. Chromatically Declining Me (3:55)\n5. Part of 2 (3:23)\n6. The Stupidest Boy (5:17)\n7. I Wish You Were a Girl (5:37)\n8. Lovewaves (3:50)\n9. Make-Out Music (4:02)\n10. Girl Sun (6:13)\n\n1997 saw Minneapolis' best-loved local band get signed to an up-and-coming label on the strength of their phenomenal self-produced EP, Gay?. Everyone in the city cheered, spilled their drinks, waited, and waited some more. The album's release date was endlessly postponed. People fell asleep, dreaming of the day the band's album might see daylight. The record was postponed again. Everyone got old. But today, the 368,383 residents of Minneapolis are about to be awakened with a thunderous noise called Split Personalities. Yes, people... the day has come. 12 Rods' debut long-player is finally out.\n\nHow's it sound? Well, to paraphrase lead vocalist Ryan Olcott, it's easy to swallow and easier to digest. The album opens with the bluesy &quot;Split Personality&quot; and in an instant, you know how it's all gonna go down: For weeks you'll eat, sleep and dream this album, whether you care to or not. But that's fine. The music continues.\n\nThe band's sound has changed a bit from Gay?. Olcott's vocals are at the front of the mix rather than drowned out by the furious wall of sound that backs him up, and their songs are a little noisier (as evidenced by tracks like the Duran Duran/Smashing Pumpkins hybrid &quot;Chromatically Declining Me&quot; and the dizzying &quot;The Stupidest Boy&quot;;). Otherwise, these are the same three geeks we've always known and loved.\n\nTheir new arsenal of material is shockingly good. As usual, the songs do a wonderful job of combining gooey sentimentality with violent frustration, and Ryan Olcott's trademark awkwardness and self-loathing delivers his message perfectly. Tonight in Minneapolis, people will cheer, spill their drinks and riot, their souls filled with rock and roll. Sweet, sweet gift we finally have.\n","torrent":{"xt":"urn:btih:a7f860f85730a562f248817d93f792acc4a85e32","amp;dn":"12+Rods+-+Split+Personalities+%5B1998%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f860f85730a562f248817d93f792acc4a85e32","infoHashBuffer":{"type":"Buffer","data":[167,248,96,248,87,48,165,98,242,72,129,125,147,247,146,172,196,168,94,50]},"announce":[],"urlList":[]}}