{"title":"Relationship Based Social Work","uid":6805938,"size":9570760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8348397bb0b1229d965a9061a5bb4bedbfb9bb6&amp;dn=Relationship+Based+Social+Work&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TheBookie","files":-1,"time":1320863857,"description":"Relationship Based Social Work\n\n\nRelationship-based practice is founded on the idea that human relationships are of paramount importance and should be at the heart of all good social work practice. This book provides a thorough guide to relationship-based practice in social work, integrating the ideas behind it using illustrative case studies and offering a model for practice. Case examples cover the different service user groups, such as older people, people with disabilities and people with mental health difficulties, illustrate how relationship-based practice works in reality and explore the ranges of emotions that practitioners may encounter. The book outlines key skills such as how to establish rapport with the client and using empathy to build a relationship. It also explores incorporating service user perspectives, appropriate support systems and effective leadership into relationship focused work. This book will be an invaluable textbook for undergraduate and post-graduate social work students, practitioners on post-qualifying courses and all social work and allied professionals.","torrent":{"xt":"urn:btih:a8348397bb0b1229d965a9061a5bb4bedbfb9bb6","amp;dn":"Relationship+Based+Social+Work","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8348397bb0b1229d965a9061a5bb4bedbfb9bb6","infoHashBuffer":{"type":"Buffer","data":[168,52,131,151,187,11,18,41,217,101,169,6,26,91,180,190,219,251,155,182]},"announce":[],"urlList":[]}}