{"title":"Warriors Orochi 2 NTSC USA","uid":4432319,"size":2287793414,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:a88313675234ccecc9644791f2f552ead909795d&amp;dn=Warriors+Orochi+2+NTSC+USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"FranckKnight","files":-1,"time":1223351287,"description":"Warriors Orochi 2 - NTSC USA - English\n\nShattering time and space, the venomous Serpent King Orochi kidnapped the \nDynasty Warriors and Samurai Warriors in scheme to test his might. The heroes \neventually defeated Orochi and his menacing army. While the slain Orochi lies \nin the netherworld, a mysterious alliance is hatching an otherworldly plan so \nthat the Serpent King may rise again. Now a new group of warriors must join \nforces with history&amp;#039;s finest in an effort to stop this evil resurrection. \n\nWarriors Orochi 2 takes place after the events of the original game. The game&amp;#039;s \nmain &quot;Story&quot; mode features storylines for the kingdoms of Wu, Wei, and Shu, and \nthe Samurai Warriors, while a new Orochi storyline looks back to the first \nseries of wars to expose some of the Serpent King&amp;#039;s secrets. \n\nThe game&amp;#039;s newly added &quot;Dream&quot; mode features an original storyline different \nfrom that of Story Mode. A new two-player &quot;Versus&quot; mode comes action-packed \nwith four different games including &quot;Tag Team&quot; matches that pit individual \nfighters in lethal head-to-head combat. \n\nThe popular &quot;Team Battle System&quot; which lets players create their own \nthree-person fighting unit returns for this sequel. At any given time, one \nwarrior will be engaged in battle, while the other two are recuperating; \nrestoring their Life Meters and Musou Gauges. \n\nWarriors Orochi 2 features an overwhelming lineup of over 90 playable \ncharacters from both franchises including Samurai Warriors 2 Extreme Legends, \nplus new characters from Chinese and Japanese history. ","torrent":{"xt":"urn:btih:a88313675234ccecc9644791f2f552ead909795d","amp;dn":"Warriors+Orochi+2+NTSC+USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88313675234ccecc9644791f2f552ead909795d","infoHashBuffer":{"type":"Buffer","data":[168,131,19,103,82,52,204,236,201,100,71,145,242,245,82,234,217,9,121,93]},"announce":[],"urlList":[]}}