{"title":"White Out: The Secret Life of Heroin (2013) Michael W Clune (mul","uid":9549251,"size":4215362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8f23a6038d374fcf8f4d8ed83dc2137de67be0f&amp;dn=White+Out%3A+The+Secret+Life+of+Heroin+%282013%29+Michael+W+Clune+%28mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7","files":-1,"time":1391205511,"description":"\nWhite Out: The Secret Life of Heroin by Michael W Clune\n\n\nFormat: mobi/epub/azw3\nLength: 274 pages\nGenre: Non-Fiction/Biography/Addiction\nDate: 1 April 2013\n\nThen I see a white-topped vial. Wow. I stare at it. It's the first time I've ever seen it. I know I've seen it ten thousand times before. I know it only leads to bad things. I know I've had it and touched it and used it and shaken the last particles of white from the thin deep bottom one thousand times. But there it is. And it's the first time I've ever seen it.--Excerpt, White Out\n\nHow do you describe an addiction in which the drug of choice creates a hole in your memory, a &quot;white out,&quot; so that every time you use it is the first time--new, fascinating, and vivid--Michael W. Clune's original, edgy yet literary telling of his account of life inside the heroin underground reads like no other, as we enter the mind of the addict and navigate the world therein. After his descent into addiction, we go with him through detox, treatment, and finally into recovery as he returns to his childhood home. There his heroin-induced &quot;white out&quot; begins to fade.\n\nClune's razor-sharp description of the magical first time he got high exemplifies why this stands out among dime-a-dozen addiction memoirs. At its best, this chronicle keenly touches on the devastations of heroin with disciplined literary flair.--Publishers Weekly\n\nAuthor:\n\nMichael W. Clune is an assistant professor at Case Western Reserve University and is the author of a scholarly book on American literature published by Cambridge University Press.\n\n","torrent":{"xt":"urn:btih:a8f23a6038d374fcf8f4d8ed83dc2137de67be0f","amp;dn":"White+Out%3A+The+Secret+Life+of+Heroin+%282013%29+Michael+W+Clune+%28mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f23a6038d374fcf8f4d8ed83dc2137de67be0f","infoHashBuffer":{"type":"Buffer","data":[168,242,58,96,56,211,116,252,248,244,216,237,131,220,33,55,222,103,190,15]},"announce":[],"urlList":[]}}