{"title":"Iggy Pop - New Values [Bonus Tracks]  320 bit","uid":6875334,"size":106497943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a9d9dbefe9969432afaf0a7db9173f6b527ea7fc&amp;dn=Iggy+Pop+-+New+Values+%5BBonus+Tracks%5D++320+bit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Gumball66","files":-1,"time":1323395611,"description":"Track Listing\n\n   1. Tell Me a Story                                    2:50\n   2. New Values (Iggy Pop, Scott Thurston)              2:39\n   3. Girls                                              3:00\n   4. I'm Bored                                          2:47\n   5. Don't Look Down (Pop, James Williamson)            3:39\n   6. The Endless Sea                                    4:50\n   7. Five Foot One                                      4:29\n   8. How Do Ya Fix a Broken Part                        2:55\n   9. Angel (Pop, Thurston)                              3:44\n  10. Curiosity (Pop, Thurston)                          2:29\n  11. African Man (Pop, Thurston)                        3:35\n  12. Billy Is a Runaway (Pop, Thurston)                 2:31\n\nBonus Tracks\n\n  13. Chains                                             2:44\n  14. Pretty Flamingo                                    2:55\n\n\nFrom Wikipedia:\n\nNew Values was Iggy Pop's third solo studio album and his first since The Stooges' Fun House without any involvement from David Bowie. Released in 1979, it was Pop's first record for Arista and the first collaboration by Pop and James Williamson since Kill City. The album also reunited Pop and Williamson with multi-instrumentalist Scott Thurston, who had played live piano for The Stooges on Metallic K.O. and Kill City. Although guitar was played by Williamson on &quot;Don't Look Down&quot;, Scott Thurston played guitar on all other tracks, with Williamson concentrating on production.[2] Likewise, although one of the songs was written by Pop and Williamson, five tracks were collaborations between Pop and Thurston.\n\nAlthough well received critically and now regarded as one of Pop's best solo efforts, the album was not a commercial success, only reaching number 180 in the Billboard Top 200 album chart. Videos were made for &quot;I'm Bored&quot; and &quot;Five Foot One&quot;. David Bowie later covered the New Values track &quot;Don't Look Down&quot; on his album Tonight (1984) and used it for the opening and closing titles of his short film Jazzin' for Blue Jean.\n\n\nReview from Allmusic.com\n\n\nby Mark Deming\n\nFrom the time the Stooges first broke onto the music scene in 1967, Iggy Pop was rock's most remarkable one-man freak show, but by the mid-'70s, after the Stooges' messy collapse, Iggy found himself in need of a stable career. The rise of punk rock finally created a context in which Iggy's crash-and-burn theatrics seemed like inspired performance rather than some sort of cry for help, and in 1979, with everyone who was anyone name-checking Iggy as punk's Founding Father, he scored a deal with Arista Records, and New Values became his first recording since the new rock gained a foothold. These days, New Values sounds like Iggy Pop's new wave album; while former Stooges associates James Williamson and Scott Thurston worked on the album, the arrangements were dotted with synthesizer patches and electronic percussion accents that have not stood the test of time well at all, and the mix speaks of a more polite approach than the raw, raging rock of Iggy's best work. But the growth as a songwriter that David Bowie encouraged in Iggy on The Idiot and Lust for Life is very much in evidence here; &quot;Tell Me a Story,&quot; &quot;Billy Is a Runaway,&quot; and &quot;How Do Ya Fix a Broken Part&quot; are tough, unblinking meditations on Iggy's war with the persona he created for himself, and &quot;I'm Bored&quot; and &quot;Five Foot One&quot; proved rock's first great minimalist still had some worthy metaphors up his sleeve. If New Values wasn't a great Iggy Pop album, it was a very good one, and proved that he had a future without David Bowie's guidance, something that didn't seem so certain at the time. ","torrent":{"xt":"urn:btih:a9d9dbefe9969432afaf0a7db9173f6b527ea7fc","amp;dn":"Iggy+Pop+-+New+Values+%5BBonus+Tracks%5D++320+bit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9d9dbefe9969432afaf0a7db9173f6b527ea7fc","infoHashBuffer":{"type":"Buffer","data":[169,217,219,239,233,150,148,50,175,175,10,125,185,23,63,107,82,126,167,252]},"announce":[],"urlList":[]}}