{"title":"David M. Berry - The Philosophy of Software. Code and Mediation ","uid":10391757,"size":2467503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9f4b5fa5bdb7aea67fa77e133ac5b2970b09302&amp;dn=David+M.+Berry+-+The+Philosophy+of+Software.+Code+and+Mediation+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403201875,"description":"Description\nProduct Details\nBook Title: The Philosophy of Software: Code and Mediation in the Digital Age\t\nBook Author: David M. Berry (Author)\nHardcover: 200 pages\nPublisher: Palgrave Macmillan (May 10, 2011)\nLanguage: English\nISBN-10: 0230244181\nISBN-13: 978-0230244184\n\n===================================================================================\nBook Description\nPublication Date: May 10, 2011\nThe Philosophy of Software is a critical introduction to the subject of code and software, and develops an understanding of its social and philosophical implications in the digital age. The book has been written specifically for people interested in the subject from a non-technical background and provides a lively and interesting analysis of these new media forms. Software is a tangle, a knot, which ties together the physical and the ephemeral, the material and the ethereal, into a complete system that can be controlled and directed. However, software exceeds our ability to place limits on its entanglement, for it has in the past decade entered the everyday home through electronic augmentation that has replaced the mechanical world of the twentieth century. From washing machines to central heating systems, children's toys to television and video; the old electro-magnetic and servo-mechanical world is being revolutionised by the silent logic of virtual devices. It is time, therefore, to examine our virtual situation.\n\n===================================================================================\nReview\n&quot;This is a beautifully written book that pulls off the difficult task of introducing the subject of Software and the workings of Code to the non specialist whilst also providing an original take of the philosophical and the cultural importance of Code in contemporary culture.&quot;-- Michael Bull, University of Sussex, UK\n\n===================================================================================\nAbout the Author\nDAVID BERRY is Lecturer in Media Studies in the Department of Political and Cultural Studies at the University of Swansea, UK. His research is particularly focused on theories of digital code and software, computational creativity, and cultural political economy. He is the author of Copy, Rip, Burn: The Politics of Copyleft and Open Source (2008) and co-editor of Libre Culture (2008). He has also published in journals such as Theory, Culture and Society, Critical Discourse Studies and The Journal of Internet Research.\n===================================================================================","torrent":{"xt":"urn:btih:a9f4b5fa5bdb7aea67fa77e133ac5b2970b09302","amp;dn":"David+M.+Berry+-+The+Philosophy+of+Software.+Code+and+Mediation+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9f4b5fa5bdb7aea67fa77e133ac5b2970b09302","infoHashBuffer":{"type":"Buffer","data":[169,244,181,250,91,219,122,234,103,250,119,225,51,172,91,41,112,176,147,2]},"announce":[],"urlList":[]}}