{"title":"Boik-Natural Compounds in Cancer Therapy(2001)","uid":4533181,"size":5189363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa907addb1b135666e50da2674f9d02d2b105c4c&amp;dn=Boik-Natural+Compounds+in+Cancer+Therapy%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227636450,"description":"This is John Boik&amp;#039;s mindblowing book Boik - Natural Compounds in Cancer Therapy - Promising Nontoxic Antitumor Agents from Plants &amp; other Natural Sources (2001) which is a meticulous, scholarly, comprehensive and invaluable review of the actions and potential clinical use of more than three dozens carefully selected natural compounds which can be used to natually treat cancer and other diseases. Nearly 4,000 references are included as Boik comprehensively and systematically examines the actions, pharmacology, toxicology, and potential clinical use of natural compounds as anticancer agents in the biological processes involved in cancer progress. No hoaxes, no magic bullets, no promises. Natural Compounds in Cancer Therapy is an up-to-date, scientific compilation of the state of research in the field of natural products in cancer treatments. This book is very important due to the tremendous growth in both research and interest in natural compounds over the past several years. The author is able to explain the how and why of over three dozen compounds that have confirmed anti-cancer activity. Oncologists and other physicians working with cancer and cancer patients should consider owning a copy of this book. It is an authoritative, insightful and thoroughly researched reference book. Patients are exposed to these compounds and to misleading information about them. Dr. Boik&amp;#039;s summaries of vitamins, herbs and other compounds are more than simply educative. Sections of this book would help physicians give patients accurate, scientific and perhaps creative information to complement their cancer treatment responsibly. A reference for those working in medicinal botanicals, offering a snapshot of the field of cancer treatment with nontoxic compounds in its infancy. Presents the current state of knowledge regarding the use of botanicals to treat cancer. Features discussion of how DNA plays a role in cancer and its treatment, and chemical breakdowns of how substances are metabolized. Find out how you simply don&amp;#039;t need any of those &quot;magic&quot; drugs, you only need to fix yourself a solid date with nature. 540 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:aa907addb1b135666e50da2674f9d02d2b105c4c","amp;dn":"Boik-Natural+Compounds+in+Cancer+Therapy%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa907addb1b135666e50da2674f9d02d2b105c4c","infoHashBuffer":{"type":"Buffer","data":[170,144,122,221,177,177,53,102,110,80,218,38,116,249,208,45,43,16,92,76]},"announce":[],"urlList":[]}}