{"title":"Heroes 4 + 2 complementary","uid":4318648,"size":1268658332,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ab7ac8380331ac93b9d82023a8cf65c0c89710eb&amp;dn=Heroes+4+%2B+2+complementary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"enci100","files":1,"time":1217263168,"description":"use DAEMON TOOLS http://www.letoltokozpont.hu/letoltes_programok_reszletes.php?a=933&amp;k=32\n\nHEROES OF MIGHT &amp; MAGIC IV Complete:\nIncludes Heroes of Might &amp; Magic IV and its two expansion packs, The Gathering Storm and Winds of War. \n\nHeroes of Might &amp; Magic IV:\n\nHeroes of Might and Magic IV is the highly anticipated next chapter in the award-winning Heroes of Might &amp; Magic series. This stellar new addition to the Heroes line combines the proven award-winning gameplay with an all-new state-of-the-art engine. Heroes IV showcases an all new highly detailed fantasy world where players will be immersed in a battle for territory and resources. Rise to the challenge by commanding armies comprised of skillful heroes and fantastic creatures, collect vital resources, artifacts, and fight enemies and capture towns. Strategic planning and tactical cunning are instrumental in your goal to be undisputed ruler of the new world.\n\nHeroes of Might &amp; Magic IV: The Gathering Storm\n\nThe newest offering in the ever-popular Heroes of Might and Magic series, Heroes of Might and Magic IV: The Gathering Storm expansion pack broadens the magical world that gamers entered in Heroes of Might and Magic IV. With more than 20 all-new maps and campaigns, Heroes IV: The Gathering Storm promises to deliver more detailed fantasy worlds, all new heroic characters to take into battle and incredible new creatures for fighting enemies. Pick up your sword, gather your army and get ready for battle in this all-new Heroes adventure!\n\nHeroes of Might &amp; Magic IV: Winds of War\n\nIn Heroes of Might and Magic IV: Winds of War, players are transported to the land of Channon, a large and populous kingdom occupying most of Axeoth&amp;#039;s northern continent. The shining capital city has become the target of no less than five invading armies who covet its lands and riches. Players assume the roles of five conquerors, each staging his own uniquely driven invasion, before facing a showdown for ultimate control.","torrent":{"xt":"urn:btih:ab7ac8380331ac93b9d82023a8cf65c0c89710eb","amp;dn":"Heroes+4+%2B+2+complementary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab7ac8380331ac93b9d82023a8cf65c0c89710eb","infoHashBuffer":{"type":"Buffer","data":[171,122,200,56,3,49,172,147,185,216,32,35,168,207,101,192,200,151,16,235]},"announce":[],"urlList":[]}}