{"title":"Watching My Mom Go Black- Phyllisha Anne Haley Sweet 720P","uid":14754515,"size":712233887,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:abf02a38227fb706251174909cb828a007601ba7&amp;dn=Watching+My+Mom+Go+Black-+Phyllisha+Anne+Haley+Sweet+720P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"distinc","files":1,"time":1464790712,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4621364558\r\n \nhttp://imagedisco.net/?g=4752762881\r\n\r\n\r\nPlot:\r\n\r\nHaley Sweet has just experienced something all children fear: Walking in on their parents doing something filthy. Haley's mom, Phyllisha Anne, is cheating on her husband and Haley's caught mom with her hand in the black cookie jar. Phyllisha has such a stranglehold on her daughter that she forbids her from fucking black men-even though mom loves it. This potential family feud turns into a threesome with Shane's big, black cock as mediator. Haley sucks on the same massive black cock that was just earlier inside her mom's skull. Phyllisha has already broken the sacred bond of marriage. What would it matter if her and the apple of her eye shared Shane's gigantic salami? Phyllisha even spouts off a few &quot;N bombs&quot; at the very start of the festivities. Both generations of whores take turns riding the black rollercoaster that is Shane Diesel. Face down, ass up apparently runs in the family as both ladies get slammed by Shane while the patriarch of the family is out slaving away at some horrible job. Haley keeps rubbing her oozing snatch while her mom gets stuffed full of black sausage. Haley-always one to try to be the alpha female in the house-climbs on Shane's enormous black cock while her mom gets a much needed timeout. It looks as if her mom is in the giving mood, which means she's allowing Haley the benefit of getting a face full of black sauce. Phyllisha's husband will know something's up when both ladies smile at one another at the dinner table","torrent":{"xt":"urn:btih:abf02a38227fb706251174909cb828a007601ba7","amp;dn":"Watching+My+Mom+Go+Black-+Phyllisha+Anne+Haley+Sweet+720P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf02a38227fb706251174909cb828a007601ba7","infoHashBuffer":{"type":"Buffer","data":[171,240,42,56,34,127,183,6,37,17,116,144,156,184,40,160,7,96,27,167]},"announce":[],"urlList":[]}}