{"title":"The Audreys - Sometimes The Stars (2010)","uid":6153156,"size":77416386,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac3888b8416b35ff0875f01270b18e3d64c87041&amp;dn=The+Audreys+-+Sometimes+The+Stars+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"piratetorrent1989","files":-1,"time":1296941735,"description":"The Audreys are an ARIA Award-winning Australian five-piece blues/roots band who formed in Adelaide, South Australia in 2004.\n\nThe pre-cursor to The Audreys started in Melbourne as a duo consisting of lead singer Taasha Coates and guitarist Tristan Goodall. After dropping out of university in Adelaide, the two moved to Melbourne where they played original pop songs and slowed-down versions of 1980s songs. An impromptu jam session with a bluegrass band inspired them to change direction from pop music to the folk and blues music they preferred, and the two moved back to Adelaide, where they formed The Audreys along with Cameron Goodall and Michael Green.\n\nThe band's debut album Between Last Night And Us was released in February 2006, and featured the singles &quot;Oh Honey&quot;, &quot;You &amp; Steve McQueen&quot;, &quot;Banjo &amp; Violin&quot; and &quot;Don't Change&quot;. Between Last Night And Us won the 2006 ARIA award for best Blues &amp; Roots Album, and its songs were used as the soundtrack for the 2007 ABC TV series, Rain Shadow. Their second album, When the Flood Comes, was released in April 2008, and won the ARIA Award for Best Blues and Roots Album in 2008. The album featured the single &quot;Paradise City&quot;. Tracks &quot;Small Things&quot; and &quot;Lay Me Down&quot; have been included on movie and television program soundtracks both in Australia and the USA. &quot;Sally and the Preacher&quot; was used as soundtrack music in the November 2010 episode of Neighbours, when Steph Scully was sentenced to 6 years in jail for the death of Ringo Brown.\n\nThe band have appeared at Australian festivals such as A Day on the Green, Woodford Folk Festival, Red Hill Harvest Festival, Port Fairy Folk Festival, The Great Escape, The East Coast Blues &amp; Roots Music Festival, Southbound, Mossvale Music Festival, Great Southern Blues &amp; Rockabilly Festival, The Falls Festival and the Adelaide leg of the Big Day Out in 2007. They have also toured overseas, including shows in the USA, Canada, the United Kingdom, France and Russia.\n\nTrack Listing\n\n1\tComfort Me\t\t\t\t\n2\tI'll Take What's Mine\t\t\t\t\n3\tTroubles Somehow\t\t\t\t\n4\tPoorhouse\t\t\t\t\n5\tMonster Part II\t\t\t\t\n6\tFalling Down\t\t\t\t\n7\tSometimes The Stars\t\t\t\t\n8\tTwo States Away\t\t\t\t\n9\tLittle Molly\t\t\t\t\n10\tLonesome Valley\n11      I Wanna Be Loved By You (Live From Notes)\n12      Poorhouse (Live From Notes)\n13      Monster Part I (Live From Notes)\n14      Lay Me Down (Live From Notes)\n\n192 aac","torrent":{"xt":"urn:btih:ac3888b8416b35ff0875f01270b18e3d64c87041","amp;dn":"The+Audreys+-+Sometimes+The+Stars+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3888b8416b35ff0875f01270b18e3d64c87041","infoHashBuffer":{"type":"Buffer","data":[172,56,136,184,65,107,53,255,8,117,240,18,112,177,142,61,100,200,112,65]},"announce":[],"urlList":[]}}