{"title":"Osho_Bodhidharma The Greatest Zen Master-11.avi","uid":15233993,"size":210874760,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:acc25f2f481d2c6a84d5b6785ed1172dbf4b8410&amp;dn=Osho_Bodhidharma+The+Greatest+Zen+Master-11.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"drugarica","files":1,"time":1467860481,"description":"Bodhidharma: The Greatest Zen Master\r\nChapter #11\r\nChapter title: Mind is the greatest enemy of man\r\n10 July 1987 am in Gautam the Buddha Auditorium\r\nLength: \t111 mins\r\n\r\nBELOVED Bhagwan,\r\n\r\nTHE SUTRAS SAY, &quot;NOT TO LET GO OF WISDOM IS STUPIDITY.&quot; WHEN THE MIND DOESN'T EXIST, UNDERSTANDING AND NOT UNDERSTANDING ARE BOTH TRUE. WHEN THE MIND EXISTS, UNDERSTANDING AND NOT UNDERSTANDING ARE BOTH FALSE.\r\nWHEN YOU UNDERSTAND, REALITY DEPENDS ON YOU. WHEN YOU DON'T UNDERSTAND, YOU DEPEND ON REALITY.\r\nWHEN REALITY DEPENDS ON YOU, THAT WHICH ISN'T REAL BECOMES REAL. WHEN YOU DEPEND ON REALITY, THAT WHICH IS REAL BECOMES FALSE. WHEN YOU DEPEND ON REALITY, EVERYTHING IS FALSE. WHEN REALITY DEPENDS ON YOU, EVERYTHING IS TRUE ....\r\nTHUS, THE SAGE DOESN'T USE HIS MIND TO LOOK FOR REALITY, OR REALITY TO LOOK FOR HIS MIND, OR HIS MIND TO LOOK FOR HIS MIND, OR REALITY TO LOOK FOR REALITY. HIS MIND DOESN'T GIVE RISE TO REALITY. AND REALITY DOESN'T GIVE RISE TO HIS MIND. AND BECAUSE BOTH HIS MIND AND REALITY ARE STILL, HE'S ALWAYS IN SAMADHI.      ...THE SUTRAS SAY, &quot;NOTHING HAS A NATURE OF ITS OWN.&quot; ACT. DON'T QUESTION. WHEN YOU QUESTION, YOU'RE WRONG. WHEN YOU'RE DELUDED, THE SIX SENSES AND FIVE SHADES ARE CONSTRUCTS OF SUFFERING AND MORTALITY. WHEN YOU WAKE UP, THE SIX SENSES AND FIVE SHADES ARE CONSTRUCTS OF NIRVANA AND IMMORTALITY.\r\nSOMEONE WHO SEEKS THE WAY DOESN'T LOOK BEYOND HIMSELF. HE KNOWS THAT THE MIND IS THE WAY. BUT WHEN HE FINDS THE MIND, HE FINDS NOTHING. AND WHEN HE FINDS THE WAY, HE FINDS NOTHING. IF YOU THINK YOU CAN USE THE MIND TO FIND THE WAY, YOU'RE DELUDED. WHEN YOU'RE DELUDED, BUDDHAHOOD EXISTS. WHEN YOU'RE AWARE, IT DOESN'T EXIST. BECAUSE AWARENESS IS BUDDHAHOOD.      ...DON'T HATE LIFE AND DEATH OR LOVE LIFE AND DEATH. KEEP YOUR EVERY THOUGHT FREE OF DELUSION, AND IN LIFE YOU'LL WITNESS THE BEGINNING OF NIRVANA, AND IN DEATH YOU'LL EXPERIENCE THE ASSURANCE OF NO REBIRTH.\r\nTO SEE FORM BUT NOT BE CORRUPTED BY FORM OR TO HEAR SOUND BUT NOT BE CORRUPTED BY SOUND IS LIBERATION. EYES THAT AREN'T ATTACHED TO FORM ARE THE GATES OF ZEN. EARS THAT AREN'T ATTACHED TO SOUND ARE ALSO THE GATES OF ZEN. IN SHORT, THOSE WHO PERCEIVE THE EXISTENCE OF PHENOMENA AND REMAIN UNATTACHED ARE LIBERATED ....\r\nWHEN DELUSIONS ARE ABSENT, THE MIND IS THE LAND OF BUDDHAS. WHEN DELUSIONS ARE PRESENT, THE MIND IS HELL.\r\n\r\nThe understanding of Bodhidharma's teachings will be easier if you understand a few points. First is the hypothesis of reincarnation. All the religions born outside of India believe in only one life. The religions born in India differ on every point, but not on reincarnation. They all insist that you don't have only one life. You have had thousands of lives before and you will go on having lives again and again until you realize your self nature","torrent":{"xt":"urn:btih:acc25f2f481d2c6a84d5b6785ed1172dbf4b8410","amp;dn":"Osho_Bodhidharma+The+Greatest+Zen+Master-11.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc25f2f481d2c6a84d5b6785ed1172dbf4b8410","infoHashBuffer":{"type":"Buffer","data":[172,194,95,47,72,29,44,106,132,213,182,120,94,209,23,45,191,75,132,16]},"announce":[],"urlList":[]}}