{"title":"Doctor Who Confidential - 2010 - Season 05 - 13 HD Episodes + 1","uid":10877633,"size":15260181341,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:adb6700bc850932ff30330a312a1dc7df0f32e7c&amp;dn=Doctor+Who+Confidential+-+2010+-+Season+05+-+13+HD+Episodes+%2B+1+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"bnaron","files":-1,"time":1409005375,"description":"Doctor Who Confidential - 2010 - Season 05 - 13 HD Episodes + 1 SD Special\n\n\nSeries Description Courtesy:\n\nWikipedia, The Free Encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&lt;/a&gt;\n\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third. BBC Three also broadcast a cut-down edition of the program, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\n\nAlex Price is the narrator for this season, while Russell Tovey narrated the Christmas special.\n\nNOTE: Although the special 'Allons-Y' was noted by BBC as part of Season 4, because it was televised in 2010, I placed it in this torrent.\n\n\nEpisode Synopses Courtesy Of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2010-04-03 - Call Me The Doctor (Video:H264 1280x720, 3382kbps, 25fps - Audio:AAC 44.1kHz, 105kbps)\n\nBehind-the-scenes look at the making of Doctor Who, capturing all the backstage treats from Matt Smith's first action-packed episode and giving a real 'getting to know you' taster of life as The Doctor. \n\nThere's a Cribs-style tour of the TARDIS with Matt and production designer Edward Thomas, a glimpse of the episode 1 read-through and an insight into life on set as the nation's favorite Time Lord. \n\nNarrated by Alex Price and featuring interviews with Matt Smith, Karen Gillan, Steven Moffat. \n\n\n2010-04-10 - All about the Girl (Video:H264 1280x720, 3433kbps, 25fps - Audio:AAC 44.1kHz, 104kbps)\n\nBehind-the-scenes series looking at the making of Doctor Who features new companion Amy Pond and her adventures with the Doctor on-board the Starship UK. Find out just what makes the sinister smilers tick and get right in the thick of the action with actress Karen Gillan. Also, the show goes behind the mask to explore the secret of Liz Ten as Oscar-nominated actress Sophie Okenedo talks about creating this extraordinary character. Narrated by Alex Price.\n\n\n2010-04-17 - War Games (Video:H264 1280x720, 3412kbps, 25fps - Audio:AAC 44.1kHz, 102kbps)\n\nA behind the scenes look at the story of the rebirth of the Daleks. Confidential follows writer Mark Gatiss as he visits the Churchill Museum, and discusses writing the episode.  Ian McNiece discusses his role as Winston Churchill.\n\n\n2010-04-24 - Eyes Wide Open (Video:H264 1280x720, 3376kbps, 25fps - Audio:AAC 44.1kHz, 107kbps)\n\nAlex Kingston, who plays River Song, talks about the highs and lows of being suspended on wires, and there's a look back with cast and crew at the Doctor and River Song's relationship so far. The Weeping Angels get a makeover for their long-awaited comeback and Matt Smith is photographed, scanned and 'rotoscoped' for the new online Doctor Who Adventure Games. Narrated by Alex Price and featuring interviews with Matt Smith and Karen Gillan.             \n\n\n2010-05-01 - Blinded by the Light (Video:H264 1280x720, 3341kbps, 25fps - Audio:AAC 44.1kHz, 108kbps)\n\nActress Karen Gillan tells how the 'Crack in Time' series story arc fits into this episode, while writer Steven Moffat describes how the very first crack in time was actually in his son's bedroom wall. As we prepare to say goodbye (for now) to River Song, the cast and crew examine the character's shady story so far and speculate about her possibly even shadier future, while Gillan gives a guided tour to Amy Pond's bedroom. Featuring interviews with Matt Smith, Karen Gillan and Alex Kingston.\n\n\n2010-05-08 - Death in Venice (Video:H264 1280x720, 3554kbps, 25fps - Audio:AAC 44.1kHz, 106kbps)\n\nThe cast and crew get a trip abroad. But not to Venice, because as episode writer Toby Whithouse explains, modern day Venice doesn't really look like 16th century Venice anymore. Instead the episode is shot in Trogir, a small medieval town in Croatia that is the spitting image of 16th century Venice.\n\nHowever, Matt Smith and Toby Whithouse do take a trip to Venice and meet up with Francesco Da Mosto, who takes them on his boat and gives them a unique tour to illustrate how the world's most beautiful city works as a back drop to Toby's fiction.\n\nNarrated by Alex Price and featuring interviews with Matt Smith, Karen Gillan and Francesco Da Mosto.\n\n\n2010-05-15 - Arthurian Legend (Video:H264 1280x720, 3402kbps, 25fps - Audio:AAC 44.1kHz, 115kbps)\n\nBehind-the-scenes of Doctor Who. Arthur Darvill, who plays Rory, explains how the three companions set about solving a reality dilemma created by the Dream Lord.\n\n\n2010-05-22 - After Effects (Video:H264 1280x720, 3564kbps, 25fps - Audio:AAC 44.1kHz, 103kbps)\n\nBehind-the-scenes series about the making of Doctor Who. Includes a journey through the production process of a Doctor Who episode from cutting room to living room.\n\n\n2010-05-29 - What Goes on Tour (Video:H264 1280x720, 3235kbps, 25fps - Audio:AAC 44.1kHz, 121kbps)\n\nThe Confidential cameras follow the Doctor Who team as they travel the length and breadth of the UK to launch the new series, getting up close and personal with Matt Smith and Karen Gillan as they journey from Belfast to London, taking in emotional whistle-stop visits to their home towns along the way. There's exclusive access and personal insights from everyone involved with this unique tour.\n\n\n2010-06-06 - A Brush with Genius (Video:H264 1280x720, 3538kbps, 25fps - Audio:AAC 44.1kHz, 106kbps)\n\nThe Doctor and Amy team up with artist Vincent van Gogh, the cast and crew travel to Croatia to see if they can recreate 19th century France in 21st century Trojir, and actor Tony Curran takes a tour of the J Paul Getty Museum in Los Angeles to look at one of Van Gogh's most valuable paintings.\n\n\n2010-06-12 - Extra Time (Video:H264 1280x720, 3372kbps, 25fps - Audio:AAC 44.1kHz, 105kbps)\n\nConfidential gets on set and on side with James Corden as the Doctor decides it's time for a new housemate and ends up as the star of the local pub football team. Karen Gillan is starry eyed when she visits the Royal Greenwich Observatory to meet space scientist Maggie Aderin and discover what the time really is. Backstage, the Doctor is ready to find out what's lurking upstairs in Craig's house.\n\n\n2010-06-19 - Alien Abduction (Video:H264 1280x720, 3133kbps, 25fps - Audio:AAC 44.1kHz, 118kbps)\n\nThe crew set out in the middle of a cold winter's night to film on the ancient site of Stonehenge, and take the ride of their lives to discover the true origin of the Pandorica.\n\n\n2010-06-26 - Out of Time (Video:H264 1280x720, 3414kbps, 25fps - Audio:AAC 44.1kHz, 103kbps)\n\nConfidential takes a closer look at the earth-shattering action of the series finale, helping viewers to make sense of the epic series of events that unfold. And in an exciting departure, Matt Smith and Karen Gillan take a bite out of the Big Apple to help launch the new series in the USA. Featuring interviews with Matt and Karen.\n\n\nSeason 5 (2010) - Specials\n\n\n2010-01-01 - Special - Allons-Y (Video:H264 624x352, 988kbps, 25fps - Audio:AAC 44.1kHz, 100kbps)\n\nDoctor Who Confidential gets up close and personal with David Tennant as he contemplates his last days as the Doctor. On set for his final episode, his final scenes, his final words, the tenth Doctor's time has come to an end and Confidential is there to follow him every step of the way. Witnessing everything from his final showdown, his poignant goodbyes and, of course, his regeneration, this intimate account of TV history pulls out all the stops for the ultimate Doctor Who finale.\n\n\n","torrent":{"xt":"urn:btih:adb6700bc850932ff30330a312a1dc7df0f32e7c","amp;dn":"Doctor+Who+Confidential+-+2010+-+Season+05+-+13+HD+Episodes+%2B+1+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adb6700bc850932ff30330a312a1dc7df0f32e7c","infoHashBuffer":{"type":"Buffer","data":[173,182,112,11,200,80,147,47,243,3,48,163,18,161,220,125,240,243,46,124]},"announce":[],"urlList":[]}}