{"title":"CorelDRAW Graphics Suite X5 Service Pack 2 (ITA)","uid":5981909,"size":615668985,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:adc8bd2896f604f1b2e0f3834048d4505f7d3c87&amp;dn=CorelDRAW+Graphics+Suite+X5+Service+Pack+2+%28ITA%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"nikita200","files":1,"time":1290617362,"description":"NovitÃƒÆ’Ã‚Â \n\nStability is improved when you edit curve segments using the Virtual Segment Delete tool, Reduce Nodes and the Fillet/Scallop/Chamfer. Curves edited with these tools were previously interpreted as invalid. \nPrinting\nDeviceN bitmaps that contain Lab colors generate errors when you use Ghost Script 8.70 or earlier versions. Support of PostScript Level 3 is required for such bitmaps. \nGhost Script Ver. 9.00 renders Spot colors with overprints incorrectly \nColor Styles\nYou can delete all color styles in a document with one click. Open the Color Styles docker, select the document folder that contains multiple color styles in the Color Styles docker, and click the new Delete Color Styles button. \nColor Palettes\nPANTONE PLUS process and spot color palettes have been included for use in CorelDRAW and Corel PHOTO-PAINT. These palettes are updated versions of the PANTONE MATCHING SYSTEM and contain new colors as well as updated Lab, RGB and CMYK equivalent colors. Files created in the GM or SP1 version of CorelDRAW Graphics Suite X5, and previous versions, will continue to use the colors from the older palettes files so they will have the same appearance when opened in SP2. If you are opening an EPS, PDF, PSD or AI file that has a color included in both the old and new palettes, you are prompted to choose which palette you would like to use. You can also set an application preference to use the older or new palettes from Tools&gt;Options&gt;Global&gt;Color. \nThe default spot color palette, which is the palette selected on the Palettes tab of the Color docker, can now be set on the Color page of the Tools dialog box if you want to use a different palette than the current default. \nFilters\nExport AI: In order maintain enhanced line styles (created in Corel DESIGNER) in your file, you must select the option Convert Outline to Object in the AI export dialog box. \nExport AI: To maintain arrowheads in the exported file, lines ending arrowheads must be converted to objects prior to export. \nVery large images are no longer downsampled in the Export dialog boxes \nRAW libraries\nThe RAW libraries were updated to support the following new camera models as well as A100 images modified by Sony software.\n\nFuji FinePix S200EXR \nFuji FinePix S5100/S5500 \nKodak Z981 \nOLYMPUS E-P2 \nPanasonic DMC-G1 \nPanasonic DMC-G2 \nSONY DSLR-A450 \nCanon SX20 IS \nSamsung EX1 \nSamsung WB550 and NX10, Casio EX-Z1050, and Fuji HS10/HS11 \nCanon EOS 550D / Digital Rebel T2i / Kiss Digital X4 ","torrent":{"xt":"urn:btih:adc8bd2896f604f1b2e0f3834048d4505f7d3c87","amp;dn":"CorelDRAW+Graphics+Suite+X5+Service+Pack+2+%28ITA%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adc8bd2896f604f1b2e0f3834048d4505f7d3c87","infoHashBuffer":{"type":"Buffer","data":[173,200,189,40,150,246,4,241,178,224,243,131,64,72,212,80,95,125,60,135]},"announce":[],"urlList":[]}}