{"title":"Doctor Who-Tomb Of The Cybermen-1967[DVDRip]","uid":7042499,"size":8920060819,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:adfbf3c3aa9a7dfedd892e99596213bf8df4a50f&amp;dn=Doctor+Who-Tomb+Of+The+Cybermen-1967%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":null,"files":-1,"time":1329602159,"description":"Doctor Who - Revisitations 3 Boxset - Tomb Of The Cybermen (1967)[DVDRip]\n\nThese are dvd rips of discs 1 and 2 of the Patrick Troughton Doctor Who Story 'Tomb Of The Cybermen' from the recently released revisitations 3 DVD Boxset.\nSpecial Editions of three classic Doctor Who DVD Releases (Tomb of the cybermen, The Three Doctors,&amp; The Robots Of Death)\nRemastered, Repackaged, Reappraised. With exclusive new Special Features\n\nDVD release Date :- 13/02/2012\n\nPlot Summary ...\n\nFor centuries, the disappearance of the Cybermen from the universe has been a mystery.\nThe Doctor, Jamie and Victoria arrive on Telos - once the Cyber home world - just as an Earth expedition uncovers the entrance to a long-lost control centre filled with baffling technology.\n\nWith the Doctor's help, the archaeological party discover the last of the Cybermen, frozen and entombed in a vastunderground cavern.  But by entering the tombs, the humans have sprung a fiendish trap. All around them, the Cybermen begin to rise from the dead....\n\nProduced by Peter Bryant\nDirected by ... Morris Barry\nWritten by... Gerry Davis and Kit Pedler\n\nCast...\n\nPatrick Troughton ... Dr. Who\nFrazer Hines ... Jamie McCrimmon\nDeborah Watling ... Victoria Waterfield\nRoy Stewart ... Toberman\nAubrey Richards ... Professor Parry\nCyril Shaps ... John Viner\nClive Merrison ... Jim Callum\nShirley Cooklin ... Kaftan\nGeorge Roubicek ... Captain Hopper\nGeorge Pastell ... Eric Klieg\nAlan Johns ... Ted Rogers\nBernard Holley ... Peter Haydon\nRoy Grover ... Crewman\nMichael Kilgarriff ... Cyberman Controller\nHans De Vries ... Cyberman\nTony Harwood ... Cyberman\nJohn Hogan ... Cyberman\nRichard Kerley ... Cyberman\nRonald Lee ... Cyberman\nCharles Pemberton ... Cyberman\nKenneth Seeger ... Cyberman\nReg Whitehead ... Cyberman\nPeter Hawkins ... Cybermen (voice)\n\n\nOriginally Transmitted  2nd September 1967 to 23rd September 1967\n\n\nExtras...\n\nCommentary #1 by Deborah Watling (Victoria) and Frazer Hines (Jamie) (recorded in 2001).\n\nCommentary #2 by  Deborah Watling (Victoria) , Frazer Hines (Jamie) , Bernard Holley (Haydon) , Shirley Cooklin (Kaftan) , Reg Whitehead (Cyberman) and Victor Pemberton (script Editor) , moderated by Toby Hadoke, recorded in 2010.\n\nMorris Barry Introduction... The director's introduction from the 1993 VHS release.\n\nTitle Sequence Tests... Tests and build-up elements from Patrick Troughtons Doctor Who title sequence.\n\nLate Night Line-up...  This segment from the 1967 arts programme sends Joan Bakewell behind the scenes at the BBC Visual Effects department to interview Jack Kine.\n\nThe Final End...  The Evil Of The Daleks is mostly missing from the BBC archives. A small taste of the climactic battle from Episode 7 has been put together from an off-air audio recording coupled with 8mm film shot by Tony Cornell, a designer at Ealing Studios.\n\nThe Abominable Snowmen Audio Trailer... An off-air amateur recording of the BBC1 trailer for the story which followed The Tomb Of The Cybermen\n\nProduction Subtitles\n\nComing soon\n\n\nDisc 2\n\nExtras...\n\nThe Lost Giants ... Cast and crew look back on the making of The Tomb Of The Cybermen. With Deborah Watling, Frazer Hines, Shirley Cooklin, Bernard Holley and Michael Kilgarriff, script editor Victor Pemberton and visual effects designer Peter Day.\n\nThe Curse Of The Cybermen's Tomb ...  Sir Christopher Frayling and Dr. Debbie Challis examine the ancient Egyptian origins to the story of the Cybermen's tomb on Telos.\n\nCybermen - Extended Edition ... A history of the Cybermen, presented by writer and broadcaster Matthew Sweet.\n\nThe Magic Of VidFIRE ... A look at the technology behind the VidFIRE process, developed specifically for the Doctor Who DVD range in order to restore the original live studio video look to episodes that now only survive as film recordings.\n\nSky Ray Advert ... 1960's Doctor Who-themed promo for Walls Sky Ray ice lolly.\n\nPDF Materials (DVD ROM) ... Printed material from the Walls Sky Ray promotion, and listings for this story from the Radio Times\n\n","torrent":{"xt":"urn:btih:adfbf3c3aa9a7dfedd892e99596213bf8df4a50f","amp;dn":"Doctor+Who-Tomb+Of+The+Cybermen-1967%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adfbf3c3aa9a7dfedd892e99596213bf8df4a50f","infoHashBuffer":{"type":"Buffer","data":[173,251,243,195,170,154,125,254,221,137,46,153,89,98,19,191,141,244,165,15]},"announce":[],"urlList":[]}}