{"title":"Trees - (The Garden of Jane Delawney) (On The Shore)-(1970)(mp3)","uid":8848336,"size":236599472,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ae21aab8cedf7c46b6ab9969848e01dfd9e7a81c&amp;dn=Trees+-+%28The+Garden+of+Jane+Delawney%29+%28On+The+Shore%29-%281970%29%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"glngwl","files":32,"time":1377457238,"description":"Trees - &quot;The Garden of Jane Delawney&quot; and &quot;On The Shore&quot; (1970) (mp3)\n\nEnglish folk rock group, with five members:\n\nTobias (Bias) Boshell - bass guitar, guitar, vocals\nCelia Humphris - lead vocals\nBarry Clarke - lead guitar\nDavid Costa - acoustic guitars\nUnwin Brown - drums\n\nNeither of the group's only two albums is available here at TPB in MP3 rips, so I have made them both into one torrent.\n\nThe group had little success in its time, but its reputation has grown over the years.  Like other folk contemporaries, Trees was influenced by Fairport Convention, but it had a heavier and more psychedelic edge. The group's material included both adaptations of traditional songs and original compositions.\n\nTrees produced two studio albums, both in 1970:\n- &quot;The Garden of Jane Delawney&quot; (released 24 April, 1970)\n- &quot;On The Shore&quot; (recorded in October 1970, released in January 1971) (featuring cover artwork by the Hipgnosis studio)\n\nThe original group disbanded after recording the two albums, when Boshell and Brown left.\n\n(A second Trees incarnation formed and played until 1973, with new members Barry Lyons and Alun Eden (both ex-Mr Fox) and Chuck Fleming (ex-JSD Band). Recordings by this 6-person line-up can be found on bootleg releases.)\n\nBoth studio albums of the original line-up have been released on CD:\n- a deluxe two-disc edition of &quot;On the Shore&quot; was released in 2007 containing previously unreleased material.\n- a new edition of the debut album followed in 2008, also containing previously unreleased material and new recordings.\n\nThis torrent contains front/back cover scans, and MP3 rips of:\n- the original album &quot;The Garden of Jane Delawney&quot; (160 kbps)\n- the second album &quot;On The Shore&quot;, together with the 2007 reissue bonus disc (both 256 kbps).","torrent":{"xt":"urn:btih:ae21aab8cedf7c46b6ab9969848e01dfd9e7a81c","amp;dn":"Trees+-+%28The+Garden+of+Jane+Delawney%29+%28On+The+Shore%29-%281970%29%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae21aab8cedf7c46b6ab9969848e01dfd9e7a81c","infoHashBuffer":{"type":"Buffer","data":[174,33,170,184,206,223,124,70,182,171,153,105,132,142,1,223,217,231,168,28]},"announce":[],"urlList":[]}}