{"title":"Mayor Of Hell The (James Cagney) [1933]  @! .avi","uid":4740050,"size":553550542,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af5bfa1a9b232d4db52f11a06ee3b011c5d46b71&amp;dn=Mayor+Of+Hell+The+%28James+Cagney%29+%5B1933%5D++%40%21+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"alien99","files":1,"time":1235505410,"description":"\n\tJames Cagney\t... \tRichard 'Patsy' Gargan\n\tMadge Evans\t... \tDorothy Griffith\n\tArthur Byron\t... \tJudge H.J. Gilbert\n\tAllen Jenkins\t... \t'Uncle' Mike\n\tDudley Digges\t... \tMr. Thompson\n\tFrankie Darro\t... \tJames 'Jimmy' Smith\n\nFive members of a teen-age gang, including leader Jimmy Smith, are sent to the State Reformatory, presided over by the melodramatically callous Thompson. Soon, Patsy Gargan, a former gangster appointed Deputy Commissioner as a political favor, arrives complete with hip flask and blonde. Gargan falls for activist nurse Dorothy and, inspired by her, takes over the administration to run the place on radical principles. But Thompson, to conceal his years of graft, needs a quick way to discredit Gargan..\nFive years before the film Dead End hit theaters, this film was produced. This was definitely a film that tried to show what reformatories were really like. In most cases, the kids who were sent there didn't become reformed, they only came out harder and moved on to bigger crimes. James Cagney is great in this early role as Patsy, the racketeer who tries to keep the kids from making some of the same mistakes that he did by making conditions better for the boys in the camp. Dudley Digges played the perfect villain in Thompson, the warden of the school. He pretty much showed how when the odds were against Thompson and his cronies that he was nothing more than a coward. Also Allen Jenkins, who ironically would appear a few years later in the aforementioned Dead End, provided a lot of the humor as Patsy's stooge &quot;Uncle Mike&quot;. Too bad this little gem is rarely shown on television anymore ","torrent":{"xt":"urn:btih:af5bfa1a9b232d4db52f11a06ee3b011c5d46b71","amp;dn":"Mayor+Of+Hell+The+%28James+Cagney%29+%5B1933%5D++%40%21+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af5bfa1a9b232d4db52f11a06ee3b011c5d46b71","infoHashBuffer":{"type":"Buffer","data":[175,91,250,26,155,35,45,77,181,47,17,160,110,227,176,17,197,212,107,113]},"announce":[],"urlList":[]}}