{"title":"VA - James Brown's Funky People (Part 2)@flac","uid":5468869,"size":403521810,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0482765cf87ffe641812c3ad76eead109156759&amp;dn=VA+-+James+Brown%5C%27s+Funky+People+%28Part+2%29%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alekow1","files":23,"time":1269773776,"description":"\nOne of the best-ever compilations of James Brown work -- and the second slammin' hard compilation of great tracks from the People label. \nThis one's got some more obscure stuff (including 2 unreleased tracks), and material by Bobby Byrd, Vicki Anderson, Maceo, Marva Whitney, Hank Ballard, and more!\n\n\nBobby Byrd shines on the all-time classic cut &quot;I Know You Got Soul&quot;, the song that later revived interest in all things J.B. when Eric B. &amp; Rakim sampled it in the mid-80's. In fact, most of the songs on this album have been put to use in classic hip-hop records, for instance Bobby Byrd's other track, &quot;Hot Pants... I'm Coming, I'm Coming, I'm Coming&quot;, perhaps the slamminest on this collection, was manipulated to great effect by Marley Marl for Big Daddy Kane's &quot;Raw&quot;. My only disappointment, as far as Bobby Byrd is concerned, is that his amazing tune &quot;Keep On Doin' (What You're Doin' Baby)&quot; is overlooked here.\nBut no bother, 'cause there's much to make up for it. &quot;Soul Power '74&quot; by Maceo &amp; The Macks is a showcase for the tightest horn section in history, over an instrumental version of &quot;Soul Power&quot;. Not only is this particular record sampled more than hors douvres in a supermarket aisle, it contains samples itself in the form of tape overlays of civil rights rallies, a Dr. King speech, and an announcement of King's assassination. This track and several others are also available on the JB's Anthology, but don't let that scare you away...\n...Because...[he] has a stable of female vocalists available only in this Funky People series. And man are they the rawest, most soulful singers you'll find. Marva Whitney, of &quot;It's My Thing&quot; fame, appears here with one of the most high-powered cuts on the album. &quot;What Do I Have to Do to Prove My Love to You&quot; is a hi-ball freight train of horns that is a gas to dance to, and ends before you've had time to make sense of it all. Lynn Collins (the Female Preacher), the featured diva on Funky People Pt. 1, turns in a seriously fried-chicken greasy live version of Isaac Hayes' &quot;Do Your Thing&quot;. And Myra Barnes' oft-sampled &quot;The Message From the Soul Sisters&quot;, with its prominent piano groove, and &quot;Super Good&quot;, a vamp on Wilson Pickett's incredible &quot;Engine #9&quot;, are two scoops of pure flavor. \nThis collection closes out with one of my personal favorite jams by the JB's, &quot;Blow Your Head&quot;. It doesn't get much better than this. James Brown plays the far-out Moog synthesizer in a virtual free-jazz style over the rhythm section and aggressive horns. Hip-hop fans may recognize this tune as the source for Public Enemy's very first song, the brilliantly grating &quot;Public Enemy #1&quot;. All in all Funky People Pt. 2 is a must for soul and hip-hop collectors, as well as a thoroughly enjoyable time-warp for the average listener. (Customer from Amazon)\n\n\n\n\n\n01. Bobby Byrd - I Know You Got Soul (Long Version)\n02. Hank Ballard &amp; The Midnight Lighters - From The Love Side\n03. Marva Whitney - What Do I Have To Do To Prove My Love To You\n04. Maceo &amp; The Macks - Soul Power '74\n05. Lyn Collins - Put  It On The Line\n06. Fred Wesley &amp; The JB's - You Can Have Watergate, But Gimme  Some Bucks and I'll Be Straight (Parts 1 &amp; 2)\n07. Maceo &amp; The Macks - Cross The Track (We Better Go Back)\n08. Myra Barnes (Vicki Anderson) - The Message From The Soul Sisters (Parts 1 &amp; 2)\n09. Bobby Byrd - Hot Pants . . . I'm Coming, Coming, I'm Coming\n10. Lyn Collins - Do Your Thing\n11. Fred Wesley &amp; The JB's - I'm Paying Taxes, What Am I Buying\n12. Myra Barnes (Vicki Anderson) - Super Good (Parts 1 &amp; 2)\n13. Fred Wesley &amp; The JB's - Blow Your Head  \n\n\n\n\nTracks 12 &amp; 13 are CD only Bonus Tracks. \n\nTracks 1 &amp; 10 are previously unreleased. \n\n\nTrack 1: Recorded April 8th 1971, King Studios, Cincinnati, Ohio. \nTrack 2: Original track recorded September 3rd 1969, King Studios, Cincinnati, Ohio; \nOverdubbed April 1972, A&amp;R Studios, New York, N.Y. \nTrack 3: Recorded October 10th 1968, King Studios, Cincinnati, Ohio. \nTrack 4: Original track recorded January 26th 1971, Rodel Studios, Washington, D.C.; \nOverdubbed October 1973, International Studios, Augusta, Georgia. \nTrack 5: Recorded 1975, Sound Ideas Studios, New York, N.Y. \nTrack 6: Recorded May 1973, International Studios, Augusta, Georgia. \nTrack 7: Recorded June 13th 1974, Criteria Studios, Miami, Florida. \nOverdubbed July 17th, 1974, Unknown Studio, New York, N.Y. \nTrack 8: Recorded September 9, 1970, King Studios, Cincinnati, Ohio. \nTrack 9: Recorded June 9th 1971, Capricorn Studios, Macon, Georgia. \nTrack 10: Previously Unreleased Live Performance. \nRecorded September 14th, 1972 at the Apollo Theatre, New York, N.Y. \nTrack 11: Recorded February 1974, unknown location. \nTrack 12: Recorded November 3rd 1970, King Studios, Cincinnati, Ohio. \nTrack 13: Recorded February 1974, Sound Ideas Studios, New York, N.Y. \n\n\n\n\nLabel: Polygram\nReleased: 1988\n\n\n\nCodec: Flac\nCompression Level: 3\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:b0482765cf87ffe641812c3ad76eead109156759","amp;dn":"VA+-+James+Brown%5C%27s+Funky+People+%28Part+2%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0482765cf87ffe641812c3ad76eead109156759","infoHashBuffer":{"type":"Buffer","data":[176,72,39,101,207,135,255,230,65,129,44,58,215,110,234,209,9,21,103,89]},"announce":[],"urlList":[]}}