{"title":"Zygmunt Miloszewski - cykl Teodor Szacki 1-3 [PDF] [PL]","uid":13216978,"size":5115758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0c9a6bed6aa138f64678e6d3691010ce21ee082&amp;dn=Zygmunt+Miloszewski+-+cykl+Teodor+Szacki+1-3+%5BPDF%5D+%5BPL%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"everdarksoul","files":4,"time":1452716247,"description":"Zygmunt Miłoszewski - cykl: Prokurator Teodor Szacki\r\nTomy 1-3 (komplet) / format: PDF / jakość: db. i bdb.\r\n\r\nTom 1 - Uwikłanie. Miejsce akcji - Warszawa\r\nPowieść otwiera cykl z kultową już postacią prokuratora Szackiego - eleganckiego, przenikliwego i z dystansem do rzeczywistości. W klasztorze znaleziono zwłoki Henryka Telaka - mężczyzny biorącego udział w kontrowersyjnej terapii psychiatrycznej, której uczestnicy wcielają się w swoich bliskich. Jego córka popełniła samobójstwo, a syn jest śmiertelnie chory.\r\nCzy Telak jest ofiarą zbrodniczego eksperymentu - czy też wiedział, zobaczył coś, czego nie powinien...? Wstrząsające, drobiazgowe śledztwo i ponure, sarkastyczne poczucie humoru Szackiego nie pozwalają na sekundę nudy. Uwikłanie otrzymało Nagrodę Wielkiego Kalibru dla najlepszej powieści kryminalnej i sensacyjnej w 2007 roku. Książka ukazała się m.in. w USA, Wielkiej Brytanii, Chorwacji, Czechach i na Ukrainie, a na jej motywach powstał film w reżyserii Jacka Bromskiego.\r\n\r\nTom 2 - Ziarno Prawdy. Miejsce akcji - Sandomierz\r\nDruga część bestsellerowej trylogii o prokuratorze Szackim! Wiosna 2009 roku, rozczarowany prokurator żegna się z Warszawą i przenosi się do Sandomierza. Tuż po Wielkanocy pod murami starej synagogi zostają znalezione zwłoki działaczki społecznej. Śledztwo objmuje obcy i samotny &quot;uciekinier&quot; z Warszawy Teodor Szacki. Szybko dowiaduje się, że małe miasto może mieć wielkie tajemnice... Powracają dawne winy i zbrodnie, w XXI wieku ożywają dawne, antysemickie przesądy, a histeria i psychoza skutecznie ryglują wszystkie drzwi i usta. Szacki musi zmierzyć się ze ścianą milczenia i medialną gorączką - i z historią, która wydarzyła się przeszło sześćdziesiąt lat wcześniej. Wśród zagadek i kłamstw prokurator próbuje odnaleźć ziarno prawdy.\r\nPodobnie jak pierwsza część trylogii, Ziarno Prawdy otrzymało Nagrodę Wielkiego Kalibru za najlepszą powieść kryminalną i sensacyjną (2012). Powieść została też sfilmowana przez Borysa Lankosza w 2015, a w rolę prokuratora Szackiego wcielił się Robert Więckiewicz. \r\n\r\nTom 3 - Gniew. Miejsce akcji - Olsztyn\r\nZnudzony rutyną, skłócony z narzeczoną i nastoletnią córką, niezbyt sympatyczny twardziel popijający gorzką, mocną kawę - Teodor Szacki - w swoim ostatnim zadaniu. 25 listopada 2013 prokurator Teodor Szacki zostaje wezwany do zrujnowanego bunkra koło poniemieckiego szpitala miejskiego. W czasie robót drogowych odnaleziono tam stary szkielet. Szacki bezrefleksyjnie &quot;odfajkowuje Niemca&quot; (jak się tutaj nazywa wojenne szczątki), i każe przekazać je uczelni medycznej, gdzie wiecznie brakuje eksponatów do celów dydaktycznych. Nie przypuszcza nawet że to, co wydawało się końcem rutynowej procedury - jest w istocie początkiem najtrudniejszej sprawy w jego prokuratorskiej karierze. Sprawy, która pozbawi go prawniczego dystansu, zmusi do wyborów ostatecznych - i ostatecznie okaże się ostatnim dochodzeniem prokuratora Teodora Szackiego...\r\nTo wstrząsający, jeden z bardziej okrutnych kryminałów Miłoszewskiego, nieprzewidywalny do ostatniego słowa! Sarkastyczny, przystojny prokurator nie zawiedzie swoich fanów - ani też tych, którzy będą rozwiązywać zagadkę z Szackim po raz pierwszy. Zaskoczy każdego","torrent":{"xt":"urn:btih:b0c9a6bed6aa138f64678e6d3691010ce21ee082","amp;dn":"Zygmunt+Miloszewski+-+cykl+Teodor+Szacki+1-3+%5BPDF%5D+%5BPL%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c9a6bed6aa138f64678e6d3691010ce21ee082","infoHashBuffer":{"type":"Buffer","data":[176,201,166,190,214,170,19,143,100,103,142,109,54,145,1,12,226,30,224,130]},"announce":[],"urlList":[]}}