{"title":"Fall Away Series Audiobooks (1-4) by Penelope Douglas","uid":14337978,"size":1379975877,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b122507b4698f4a9d119bfb15bcda6230e2dcab4&amp;dn=Fall+Away+Series+Audiobooks+%281-4%29+by+Penelope+Douglas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"yousef86","files":46,"time":1460730813,"description":"Fall Away Series Audiobooks (1-4) by Penelope Douglas\r\nEnglish | 56-64kbps CBRVBR | 48:48:52 | 1.28 GB\r\nGenre: Contemporary Romance\r\n\r\n\r\n\r\n1 Bully\r\nRelease Date: May 26, 2014 | Narrator: Abby Craden | 09:29:59 | ASIN: B00KGI0TX4 | 260 MB\r\n\r\nMy name is Tate. He doesn't call me that, though. He would never refer to me so informally, if he referred to me at all. No, he'll barely even speak to me.\r\n\r\nBut he still won't leave me alone.\r\n\r\nWe were best friends once. Then he turned on me and made it his mission to ruin my life. I've been humiliated, shut out, and gossiped about all through high school. His pranks and rumors got more sadistic as time wore on, and I made myself sick trying to stay out of his way. I even went to France for a year, just to avoid him.\r\n\r\nBut I'm done hiding from him now, and there's no way in hell I'll allow him to ruin my senior year. He might not have changed, but I have. It's time to fight back.\r\n\r\nI'm not going to let him bully me anymore.\r\n\r\n\r\n1.5 Until You\r\nRelease Date: May 29, 2014 | Narrator: Nelson Hobbs | 09:31:58 | ASIN: B00KFO7Q9Y | 261 MB\r\n\r\nHave you ever been so angry that hitting things felt good? Or so numb that you actually felt high? The past few years have been like that for me. Traveling between fury and indifference with no stops in between.\r\n\r\nSome people hate me for it, while others are scared of me. But none of them can hurt me, because I don't care about anything or anyone.\r\n\r\nExcept Tatum.\r\n\r\nI love her so much that I hate her. We used to be friends, but I found out that I couldn't trust her or anyone else.\r\n\r\nSo I hurt her. I pushed her away.\r\n\r\nBut I still need her. The sight of her centers me, and I can pool all of my anger into her. Engaging her, challenging her, bullying her... they are my food, my air, and the last part of me that feels anything human.\r\n\r\nBut she left. She went to France for a year, and came back a different girl.\r\n\r\nNow, when I push, she pushes back.\r\n\r\n\r\n2 Rival\r\nRelease Date: August 26, 2014 | Narrator: Abby Craden, Nelson Hobbs | 09:25:49 | ASIN: B00MYA0AV8 |259 MB\r\n\r\nShe's back. For the two years she's been away at boarding school, and there was no word from her. Back when we lived in the same house, she used to cut me down during the day and then leave her door open for me at night. I was stupid then, but now I'm ready to beat her at her own game.\r\n\r\nI'm back. Two years and I can tell he still wants me, even if he acts like he's better than me. But I won't be scared away. Or pushed down. I'll call his bluff and fight back. That's what he wants, right? As long as I keep my guard up, he'll never know how much he affects me.\r\n\r\n\r\n3 Falling Away\r\nRelease Date: March 10, 2015 | Narrator: Abby Craden, Nelson Hobbs | ISBN: 1494552159 | 11:58:27 | 328 MB\r\n\r\nK.C. Carter has always followed the rules, until she makes a mistake that leaves her the talk of her college campus and brings her carefully arranged life crashing to a halt. Now she's stuck in her small hometown for the summer so she can complete her court-ordered community service. To make matters worse, trouble is living right next door.\r\n\r\nJaxon Trent is the worst kind of temptation and exactly what K.C. was supposed to stay away from in high school. But he never forgot her. She was the one girl who wouldn't give him the time of day and the only one to ever say no. Fate has brought K.C. back into his life, except what he thought was a great twist of luck turns out to be too close for comfort. As they grow closer, he discovers that convincing K.C. to get out from under her mother's shadow is hard, but revealing the darkest parts of his soul is nearly impossible.\r\n\r\n\r\n4 Aflame\r\nRelease Date: April 21, 2015 | Narrator: Abby Craden, Nelson Hobbs | ASIN: B00VVUE8U6 | 08:22:37 | 205 MB\r\n\r\nEveryone wants to be me. Maybe it's the sway of my skirt or the way I flip my hair, but I don't care. Even though their attention is the last thing I crave, I just can't stop. I dominate the track, the speed rattles my bones, and the wind and the crowd screams my name. I'm her. The girl driver. The queen of the race. And I'm surviving - something he thought I'd never do.\r\n\r\nThey all talk about him. Did you see Jared Trent on TV? What did you think of his last race, Tate? When is he coming back to town, Tate? But I refuse to care too much. Because when Jared does come home, I won't be here. Tatum Brandt is gone. I'm someone new","torrent":{"xt":"urn:btih:b122507b4698f4a9d119bfb15bcda6230e2dcab4","amp;dn":"Fall+Away+Series+Audiobooks+%281-4%29+by+Penelope+Douglas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b122507b4698f4a9d119bfb15bcda6230e2dcab4","infoHashBuffer":{"type":"Buffer","data":[177,34,80,123,70,152,244,169,209,25,191,177,91,205,166,35,14,45,202,180]},"announce":[],"urlList":[]}}