{"title":"Stossel.2013.06.20.[Puritanical Government].Fox Business.CF.avi","uid":8604370,"size":328306576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b18af49eb444cd5416e751b53c4adcfb1e3a99ab&amp;dn=Stossel.2013.06.20.%5BPuritanical+Government%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1371970541,"description":"----------\n\nSTOSSEL - [Puritanical Government] - Fox Business Network\n2013, June 20, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nAmerica is said to be a &quot;free&quot; country. But what if you want to have a drink? A cigarette? Make a bet? government wants to stop you, to protect you from yourself.\n\nDRINKING AND DRIVING: MADD vice president for public policy, JT Griffin, says we need stronger drunk driving laws but Radley Balko argues that the law should be based on &quot;reckless driving,&quot; not blood alcohol levels.\n\nSpecial Correspondent Kennedy got drunk and then drove to test the test.\n\nGAMBLING: I love to gamble, but University of Illinois business professor, John Kindt, says gambling, especially internet gambling, should be banned.\n\nVIOLENT VIDEO GAMES: Billy Graham Evangelistic Association CEO, Franklin Graham, says violent video games are murder simulators that lead to real murder. He wants to tax those games to protect kids.\n\nNUDGE LAWS: Michael Thomas, co-author of this Mercatus Center &quot;sin tax&quot; study, says taxing sinful behavior just drives markets underground.\n\nSEX: Dennis Hof owns the Moonlite BunnyRanch, a legal brothel in Nevada. He and BunnyRanch sex workers Brooke Taylor and Krissy Scott say legal prostitution is good, and safer. Former prosecutor Fred Tecce disagrees.\n\nTo protect actors from STDs, Los Angeles passed a law requiring all porn stars to wear condoms. That's a great thing, says Dr. Jeffery Klausner, professor of public health at UCLA. But Criminal Defense Attorney Paul Cambria points out that the law just caused business to move to neighboring counties.\n\nWe libertarians don't say there should be no laws. If you hurt others, government has a duty to punish you.\n\nBut otherwise, government should leave us alone to do anything that's peaceful.","torrent":{"xt":"urn:btih:b18af49eb444cd5416e751b53c4adcfb1e3a99ab","amp;dn":"Stossel.2013.06.20.%5BPuritanical+Government%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b18af49eb444cd5416e751b53c4adcfb1e3a99ab","infoHashBuffer":{"type":"Buffer","data":[177,138,244,158,180,68,205,84,22,231,81,181,60,74,220,251,30,58,153,171]},"announce":[],"urlList":[]}}