{"title":"Daryl.Hall.Live.from.Daryl's.House.E66.Amos.Lee.WEB-DL.[PSoul]","uid":10010819,"size":441950129,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b1a264e8f68665ff4a269a3d50879fa64d0710d9&amp;dn=Daryl.Hall.Live.from.Daryl%27s.House.E66.Amos.Lee.WEB-DL.%5BPSoul%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"PhillySoul","files":16,"time":1398097479,"description":"Amos Lee\n\nAmos has toured with legendary artists like Bob Dylan and Paul Simon, collaborated with Norah Jones, Lucinda Williams and Zac Brown Band, and been touted as a favorite songwriter and performer by The Band Perry and Lady Antebellum. He followed his 2004 debut with the critically acclaimed Supply and Demand (2006) and Last Days at the Lodge (2008). 2011's Mission Bell entered the Billboard 200, Amazon, and iTunes charts at # 1 and contained the chart-topping Triple A radio hit &quot;Windows are Rolled Down.&quot; His latest album, Mountains of Sorrow, Rivers of Song (2013), topped the Americana radio chart for two consecutive months, featuring guest appearances by Alison Krauss and Patti Griffin. The New York Times hailed it as &quot;serenely sure-footed&quot; while Elmore noted it &quot;may be Lee's finest yet.&quot;\n\nLee will appear on an upcoming Jimmy Kimmel Live!, guest on Tavis in March and be featured on an episode of PBS' Music City Roots, a new variety show hosted by Jim Lauderdale in Nashville. This summer, he is scheduled to perform at Bonnaroo Music and Arts Festival (June 12-15) and Firefly Music Festival in Dover, DE (June 17-19).He will be accompanied by the Colorado Symphony Orchestra when he plays his first headline show at Red Rocks Amphitheatre in Morrison, CO, on August 1. Amos is donating $1 from each ticket sold for the tour to Musicians on Call (www.musiciansoncall.org/amos), a non-profit organization that brings live and recorded music to the bedsides of patients in healthcare facilities. ","torrent":{"xt":"urn:btih:b1a264e8f68665ff4a269a3d50879fa64d0710d9","amp;dn":"Daryl.Hall.Live.from.Daryl%27s.House.E66.Amos.Lee.WEB-DL.%5BPSoul%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1a264e8f68665ff4a269a3d50879fa64d0710d9","infoHashBuffer":{"type":"Buffer","data":[177,162,100,232,246,134,101,255,74,38,154,61,80,135,159,166,77,7,16,217]},"announce":[],"urlList":[]}}