{"title":"The Annual Reith Lectures from BBC","uid":4607699,"size":903790010,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b2094b7495fdecac6085de3dfb91519fc72418b2&amp;dn=The+Annual+Reith+Lectures+from+BBC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rpzeppelin","files":150,"time":1230527491,"description":"Since 1948 The BBC has broadcast an annual lecture given by a preeminent scientist in various regions. The first lecture was delivered by Bertrand Russell, and dealt with an individual authority in larger social structures. From there it blossomed into a tradition including prestigious figures from the arts, neuroscience, political science, genetics, religion, and a slew of other intellectual industries.\n\nThese are the lectures freely available from BBC4 radio. Why put them in a torrent? The website that hosts them was very poorly designed and uses RealMedia audio streams. To get them as mp3's I had to download the .Ram stream playlists, translate the URL into a download manager capable of transferring in the RealMedia protocol, then transcode them to mp3's, name and organize them, and I also included both text file transcripts of the lectures and pdf's of the transcript; that way you have a choice in how to view it.\n\nI apologize for the lack of audio files for the 2000 lecture, and most of the lectures before 1999; they weren't available. Each lecture is organized by year, with the title of the lecture in the folder name, and then organized into (usually) five parts, each with their own title and subject, along with the transcripts of the lecture.\n\nI can very highly recommend the lectures from 2003 on Neuroscience by Dr. Vilayanur Ramachandran.\n\n\n\nIF YOU LIKE LECTURES LIKE THESE: Please go to www.ted.com and listen to some of the lectures there; my favorites are Richard Dawkins, Dan Gilbert, Lennart Green, Sir Ken Robinson, Vilayanur Ramachandran, Barry Schwartz, Dan Dennet, STEPHEN PINKER, and Steven Levitt. You won't regret it; I promise!","torrent":{"xt":"urn:btih:b2094b7495fdecac6085de3dfb91519fc72418b2","amp;dn":"The+Annual+Reith+Lectures+from+BBC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2094b7495fdecac6085de3dfb91519fc72418b2","infoHashBuffer":{"type":"Buffer","data":[178,9,75,116,149,253,236,172,96,133,222,61,251,145,81,159,199,36,24,178]},"announce":[],"urlList":[]}}