{"title":"Cradle to Cradle - Remaking the Way We Make Things (Audiobook) (","uid":7251405,"size":76695778,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b20fecf7c85ef2e0aca87b13e033a06f284d7dea&amp;dn=Cradle+to+Cradle+-+Remaking+the+Way+We+Make+Things+%28Audiobook%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1336460610,"description":"Cradle to Cradle Remaking the Way We Make Things (Unabridged)\nWilliam McDonough, Michael Braungart\nPublisher: Tantor Media; Unabridged,MP3 - Unabridged CD edition (August 11, 2008)\nLanguage: English\nISBN-10: 1400157617\nISBN-13: 978-1400157617\n\nUploaded because everyone hates DRM Audible Audio files, if you like the audiobook please give back to the authors by purchasing the book.\n\nReduce, reuse, recycle, urge environmentalists. In other words, do more with less in order to minimize damage. William McDonough and Michael Braungart argue in this provocative book that this approach perpetuates a one-way, cradle to grave manufacturing model that dates back to the Industrial Revolution, a model that casts off as much as 90 percent of the materials it uses as waste, much of it toxic. They challenge the notion that human industry must inevitably damage the natural world.\nWhy not take nature itself as our model? A tree produces thousands of blossoms in order to create another tree, yet we do not consider its abundance wasteful but safe, beautiful, and highly effective. Waste equals food is the first principle the book sets forth. Products might be designed so that, after their useful life, they provide nourishment for something new - either as biological nutrients that safely re-enter the environment or as technical nutrients that circulate within closed-loop industrial cycles without being downcycled into low-grade uses (as most recyclables now are).\nElaborating their principles from experience redesigning everything from carpeting to corporate campuses, the authors make an exciting and viable case for change.","torrent":{"xt":"urn:btih:b20fecf7c85ef2e0aca87b13e033a06f284d7dea","amp;dn":"Cradle+to+Cradle+-+Remaking+the+Way+We+Make+Things+%28Audiobook%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b20fecf7c85ef2e0aca87b13e033a06f284d7dea","infoHashBuffer":{"type":"Buffer","data":[178,15,236,247,200,94,242,224,172,168,123,19,224,51,160,111,40,77,125,234]},"announce":[],"urlList":[]}}