{"title":"The Case For Israel","uid":5968594,"size":657555420,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b24f57cd14c84bf09904ea19976a4261201f2e66&amp;dn=The+Case+For+Israel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ugox","files":1,"time":1290197569,"description":"&quot;We made this film as a proactive defense of Israel.&quot;\n\nWhile Israel repeatedly demonstrates its commitment to peace, anti-Israel activity continues to rise in the media, on campuses, in the churches and in the international community. Israel's detractors-some with international prominence-blame Israel for the conflict. They deny the fact that Israel has made painful concessions in working toward a two-state solution, which include the 2005 withdrawal from Gaza initiated by former Prime Minister Ariel Sharon, and that Israel has expressed readiness to take additional painful measures. They ignore the rise in Gaza of Hamas, which rejects peaceful coexistence. They turn a blind eye to the grave challenges inherent in the Palestinian Authority's unstable governance of the West Bank under Mahmoud Abbas. They rarely acknowledge the ongoing terrorist attacks against Israeli children and other civilians, and they equate that terrorism with Israel's attempts to protect its citizens. For Israel's detractors, there is only one focus for fault: Israel. Clearly, as Harvard Law School Professor Alan Dershowitz states in his seminal work The Case for Israel, &quot;the time has come for a proactive defense of Israel to be offered in the court of public opinion.&quot;\n\nWe produced this documentary to present a vigorous case for Israel-for its basic right to exist, to protect its citizens from terrorism, and to defend its borders from hostile enemies-in a highly accessible multimedia format. Alan Dershowitz has achieved international distinction as one of Israel's most prominent and articulate advocates. He plays a central role in this documentary as adviser and on-camera presence and argues forcefully that real peace in the Middle East can only occur when the Palestinians, Arabs and their allies value the creation of a Palestinian homeland more than they oppose the presence of a Jewish state. Through incisive conversations with key judicial, political and academic leaders, Dershowitz refutes deeply entrenched misperceptions about Israel's history, Jewish claims to a homeland, individual rights under Israel's democratic system of government, the security fence, and military conduct in the face of terrorist attacks.\n\nHe closes with a formidable warning that the greatest threat to Israel is also the greatest threat to international peace and security: Iran's aggressive nuclear ambitions, driven by a zealous anti-Zionist, anti-democratic mission that is championed by Mahmoud Ahmadinejad. Unchecked, a nuclear-armed Iran or its terrorist surrogate would imperil targets far beyond Tel Aviv.\n\nMaking this film was the beginning step. We invite you to join us in going forward to make the case for Israel in the court of public opinion.","torrent":{"xt":"urn:btih:b24f57cd14c84bf09904ea19976a4261201f2e66","amp;dn":"The+Case+For+Israel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b24f57cd14c84bf09904ea19976a4261201f2e66","infoHashBuffer":{"type":"Buffer","data":[178,79,87,205,20,200,75,240,153,4,234,25,151,106,66,97,32,31,46,102]},"announce":[],"urlList":[]}}