{"title":"[Kathi Jackson]Steven Spielberg A Biography (Greenwood Biographi","uid":11396294,"size":1221516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2ce154251770e44d6dbb75c530933efd5f45264&amp;dn=%5BKathi+Jackson%5DSteven+Spielberg+A+Biography+%28Greenwood+Biographi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415373850,"description":"Steven Spielberg is hailed as one of the most influential and commercially successful film directors in motion picture history. Through his role in developing, directing, and driving the special effects of many of the biggest blockbusters in movie history, includingJaws, Raiders of the Lost Ark, E.T., Saving Private Ryan, Jurassic Park, Schindler's List, and Minority Report, Spielberg changed the way movies are made and left an indelible mark on popular culture. This biography traces his rise from shooting films as a shy young boy with the family's 8 mm camera to his first unpaid job at Universal Studios, to the rise of DreamWorks, the studio Spielberg founded and quickly turned into a filmmaking powerhouse. While Spielberg's best work may lie ahead, this compelling biography puts his legendary career and work to date into perspective by offering analysis and commentary from fans and critics alike.\n\nWhether about an alien lost in suburbia or the battles of World War II, Spielberg has directed and produced many of the most talked about movies of the past 30 years. Students interested in the history of film and the filmmaking industry will find this biography endlessly fascinating.\n\nPublisher: Greenwood (March 30, 2007)\nLanguage: English\nISBN-10: 0313337969\nISBN-13: 978-0313337963\n\nProduct Description\n\nReview\n&quot;Aimed at high school students and general readers, this accessible biography describes the life and career of movie director Steven Spielberg. The chronologically organized volume covers everything from Spielberg's 1969 professional directing debut on TV's Night Gallery through his many successes with such films as Jaws (1975) and Saving Private Ryan (1998). Jackson also supplies a timeline, filmography, and list of awards won by Spielberg.&quot; - Reference &amp; Research Book News\n\nAbout the Author\nKathi Jackson is the author of They Called Them Angels: American Military Nurses of World War II (Greenwood, 2000). She has also written essays for The Seattle Times and The Denver Post","torrent":{"xt":"urn:btih:b2ce154251770e44d6dbb75c530933efd5f45264","amp;dn":"%5BKathi+Jackson%5DSteven+Spielberg+A+Biography+%28Greenwood+Biographi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ce154251770e44d6dbb75c530933efd5f45264","infoHashBuffer":{"type":"Buffer","data":[178,206,21,66,81,119,14,68,214,219,183,92,83,9,51,239,213,244,82,100]},"announce":[],"urlList":[]}}