{"title":"Killswitch Engage - Alive Or Just Breathing (Optimized) 2008","uid":4376514,"size":314515673,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2e5b4f75f429aab7fe87810291d33e938d63e02&amp;dn=Killswitch+Engage+-+Alive+Or+Just+Breathing+%28Optimized%29+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tech-Noir","files":15,"time":1220439665,"description":"Killswitch Engage - Alive Or Just Breathing 2001 (Custom Optimization, 2008) FLAC\n\n\n---------------------------------------------------------------------\nTechnical Info\n---------------------------------------------------------------------\n\n-Source material:\nFLAC Lossless (took a while to find a source)\n\n\n-New Encoding:\nFLAC Lossless\n\n\n-Total Size:\n299MB\n\n\n-Total Play Time:\n0:44:51\n\n\n-Tracklist:\n\n1. 01-killswitch engage - numbered days-air (3:35)\n2. 02-killswitch engage - self revolution-air (3:08)\n3. 03-killswitch engage - fixation on the darkness-air (3:37)\n4. 04-killswitch engage - my last serenade-air (4:13)\n5. 05-killswitch engage - life to lifeless-air (3:17)\n6. 06-killswitch engage - just barely breathing-air (5:42)\n7. 07-killswitch engage - to the sons of man-air (1:58)\n8. 08-killswitch engage - temple from the within-air (4:04)\n9. 09-killswitch engage - the element of one-air (4:08)\n10. 10-killswitch engage - vide infra-air (3:28)\n11. 11-killswitch engage - without a name-air (1:45)\n12. 12-killswitch engage - rise inside-air (5:56)\n\n\n---------------------------------------------------------------------\nGeneral Info\n---------------------------------------------------------------------\n\n\nOne of my favourite albums, Killswitch Engage anno 2002.\nThe original recording is very nice (Adam D has proven himself to be an excellent producer with, in my humble opinion, great taste in tone, mixing and Equalization).\n\nBut, this album always bugged me since it had a quite harsh high-mid presence, and because it was a bit &quot;dry&quot; in it&amp;#039;s sound, which usually means the low-end needs some improvement to bring that warm foundation to the tracks.\n\nNot much done here really, some EQing, some subtle harmonic processing in the low-end (which is basically the only &quot;creative&quot; change I&amp;#039;ve made). The dynamic range hasn&amp;#039;t been touched at all, no compressors used since the original sound has just the right amount of &quot;glue&quot;, and the output level is very conservative. I just tried to make this, to my ears, more pleasant to listen to. The EQing has emphesized the low-mid spectral range, since that one is my &quot;favourite&quot;, and it is usually the one my ears is least sensitive to at higher volumes. This original album, when I turned the volume up, would immediately start piercing my eardrums with snappy snare attacks. There&amp;#039;s nothing inherently wrong with snappy snare attacks at all, but they very emphesized in the frequency response, meaning they would start hurting my ears before any of the other material in the songs was as loud. I&amp;#039;ve corrected this so that those frequencies are now less emphasized, and they will now be more balanced with the rest of the frequency range, lending a much more balanced appearance tot he sound. Thankfully the sound responded very well to this Equalization, and the vocals, drums and guitars, thanks to the very clean and competent recording, still sound very natural, without any of the &quot;canny&quot; type of sound that can occur when you boost low-mid frequencies. The change is more akin to changing the recording microphones and getting a different frequency response. Different, but imho better and more natural sounding. The snare drum now has some more emphasized lower frequencies that fill its sound out very nicely, and it has a smoother high-frequency response making it less harsh to listen to.\n\nOverall, the sound doesn&amp;#039;t have any harsh bits sticking out anymore. All the peaks and snappy material is still there, I&amp;#039;ve just balanced them more to be more pleasant to listen to. And now when you turn up the volume, you will also be treated to lots of cozy bass and low-mid frequencies.\nI&amp;#039;m really happy with how it turned out, a definite improvement in my opinion at least.\n\n\nComments and criticism is welcome as always. :)","torrent":{"xt":"urn:btih:b2e5b4f75f429aab7fe87810291d33e938d63e02","amp;dn":"Killswitch+Engage+-+Alive+Or+Just+Breathing+%28Optimized%29+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2e5b4f75f429aab7fe87810291d33e938d63e02","infoHashBuffer":{"type":"Buffer","data":[178,229,180,247,95,66,154,171,127,232,120,16,41,29,51,233,56,214,62,2]},"announce":[],"urlList":[]}}