{"title":"The Osbournes - Season 2 (2 DVD's)","uid":4345808,"size":11501686831,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2ea2c2b8cde63e9175888a728e2d50d640fc69e&amp;dn=The+Osbournes+-+Season+2+%282+DVD%5C%27s%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"spiders96","files":39,"time":1218868422,"description":"The modern-day Addams Family returns for a second season of their landmark reality sitcom. Overexposure quickly wore out the Osbournes&amp;#039; welcome, but the season opener, &quot;What Goes Up,&quot; is a reminder of the surreal circus that was their lightning-in-a-bottle 15 minutes of fame. Ozzy and Sharon attend the White House Correspondents&amp;#039; dinner, where Ozzy rates a mention by the president and receives a thundering ovation. Daughter Kelly performs &quot;Papa Don&amp;#039;t Preach&quot; at the MTV Music Awards. And son Jack is thrilled that McDonald&amp;#039;s has brought back the McRib. The next episode, &quot;Must Come Down,&quot; is the reality check, in which Sharon is diagnosed with colon cancer. But the family quickly gets back &quot;to what they usually do,&quot; which is drive each other (and anyone who crosses them) crazy. Jack takes special delight in tormenting trespassing tourists by turning the sprinklers on them. When Kelly brings home her first serious boyfriend, a rock singer, it&amp;#039;s to her mortified horror that Sharon questions him about his obscene nickname. The season does comes to a poignant end with a lavish New Year&amp;#039;s party during which Ozzy and Sharon renew their vows, and ends with Ozzy passed out on the couch (just like their first honeymoon, Sharon sardonically observes).\n\nOf course, there is reality and there is reality. Though not dealt with onscreen, it has since been reported that Jack has undergone rehab for a substance abuse problem, a tragic family legacy. This puts something of a damper on watching the &quot;wacky&quot; antics. But as with the first season, The Osbournes is fun to visit, with cameos by, among others, Natalie Portman, Mandy Moore, P. Diddy, and Marilyn Manson adding to the cachet. But thank god you don&amp;#039;t live there. As with the first season, this two-disc package contains such inspired extras as a translator that provides subtitles for the addled Ozzy&amp;#039;s profanity-laced dialogue and a preferred bleep-free viewing option.\n\n\nSeason 2, Episode 1: What Goes Up...\nOriginal Air Date: 26 November 2002\n\nSeason 2, Episode 2: Must Come Down\nOriginal Air Date: 3 December 2002\n\nSeason 2, Episode 3: The Ozz Man and the Sea\nOriginal Air Date: 10 December 2002\n\nSeason 2, Episode 4: Beauty and the Bert\nOriginal Air Date: 17 December 2002\n\nSeason 2, Episode 5: Smells Like Teen Spirits\nOriginal Air Date: 7 January 2003\n\nSeason 2, Episode 6: Meow Means No!!\nOriginal Air Date: 14 January 2003\n\nSeason 2, Episode 7: It&amp;#039;s a Hard Knock Life\nOriginal Air Date: 21 January 2003\n\nSeason 2, Episode 8: Cleanliness Is Next to Ozzyness\nOriginal Air Date: 28 January 2003\n\nSeason 2, Episode 9: Viva Ozz Vegas\nOriginal Air Date: 4 February 2003\n\nSeason 2, Episode 10: My Big Fat Jewish Wedding\nOriginal Air Date: 11 February 2003\n\nThe is a complete DVD copy for both DVD&amp;#039;s with no reduction in quality. Once I see that several people are seeding the completed set I will then upload the next season.","torrent":{"xt":"urn:btih:b2ea2c2b8cde63e9175888a728e2d50d640fc69e","amp;dn":"The+Osbournes+-+Season+2+%282+DVD%5C%27s%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ea2c2b8cde63e9175888a728e2d50d640fc69e","infoHashBuffer":{"type":"Buffer","data":[178,234,44,43,140,222,99,233,23,88,136,167,40,226,213,13,100,15,198,158]},"announce":[],"urlList":[]}}