{"title":"Small Brown Bike - Discography (1997-2013) [FLAC]","uid":9406929,"size":2316323308,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3177e371a2ccbc167754f27f94fdf225870eeb8&amp;dn=Small+Brown+Bike+-+Discography+%281997-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"politux","files":-1,"time":1388182993,"description":"\n  Small Brown Bike - Discography (1997-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Post-Hardcore, Emo\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1997 No Place Like You\n  1999 Our Own Wars\n  2001 Dead Reckoning\n  2002 Small Brown Bike &amp; The Casket Lottery\n  2003 Nail Yourself to the Ground\n  2003 The River Bed\n  2011 Fell &amp; Found\n  2013 Recollected\n\n  Growing up together in Marshall, MI, the members of Small Brown Bike have been friends, bandmates, and minor bike mechanics the majority of their lives. When brothers Mike and Ben Reed (vocals/guitar and bass/vocals, respectively), Travis Dopp (guitar), and Dan Jaquint (drums) were looking for band names for the project they started in the fall of 1996, they looked back on their collective small-town childhood and came up with Small Brown Bike, named for a sentimental Frankenstein bicycle that they had pieced together from parts as kids. After self-releasing their No Place Like You 7&quot; in 1997 and following up in 1998 with the (and don't forget me) 7&quot; and appearing on a couple compilations, the band attracted the attention of Gainesville, FL's No Idea Records through relentless regional touring and a fraternal relationship with Hot Water Music. No Idea released Our Own Wars in 1999 before Dopp stepped down from guitar and friend Scott Flaster took over. The compilation Collection, including singles and vinyl-only tracks, also appeared that year. Recorded with producer Ed Rose in between touring with HWM and Saves the Day, they followed up with their Dead Reckoning CD/LP in the fall of 2001. Dopp returned to the ranks of Small Brown Bike in January 2002 with a new drummer, Jeff Gensterblum, signing on in March as Jaquint decided to pursue a full-time job and school. The band hooked up with the Casket Lottery for an October split EP. The split was very well received (described as &quot;essential&quot; by some critics) and further caught the attention of Lookout Records, who then released their next album, The River Bed, in September 2003. An EP, Nail Yourself to the Ground, additionally appeared that June on No Idea. After several months of touring in support, however, Small Brown Bike announced their dissolution by the year's end. Their last show was played in 2004 at Chicago's Fireside Bowl.","torrent":{"xt":"urn:btih:b3177e371a2ccbc167754f27f94fdf225870eeb8","amp;dn":"Small+Brown+Bike+-+Discography+%281997-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3177e371a2ccbc167754f27f94fdf225870eeb8","infoHashBuffer":{"type":"Buffer","data":[179,23,126,55,26,44,203,193,103,117,79,39,249,79,223,34,88,112,238,184]},"announce":[],"urlList":[]}}