{"title":"International Encyclopedia of Civil Society{BBS}","uid":6823626,"size":14692390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b31803a0ab09acbe70d99bfcae5f145e9e6e255d&amp;dn=International+Encyclopedia+of+Civil+Society%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321486086,"description":"Renewed and growing interest in the topic of civil society has generated a wealth of new information and knowledge on the subject, but until now, there was no comprehensive reference work to organize and consolidate this knowledge. \n\nThe International Encyclopedia of Civil Society will fill this gap, creating a framework for cross-disciplinary communication by providing succinct summaries of concepts and theories, definitions of terms, biographical entries, and organizational profiles.  It will also serve as a guide to sources of information, and an overview of the contours of civil society, social capital, philanthropy and nonprofits in different parts of the world, and across cultures and historical periods.\n\n \n\nThe key purpose of the encyclopedia is to provide a common set of understandings and a terminological and analytical starting point for the future development in the growing field of civil society studies worldwide. At the international level, the encyclopedia will represent the most systematic intellectual stocktaking of a growing and rapidly developing field.\n\n \n\nThe International Encyclopedia of Civil Society will have considerable appeal to researchers in nonprofit and civil society studies, political science, economics, management studies, social enterprise as well as development studies programs.\n\n\n    * Hardcover: 1712 pages\n    * Publisher: Springer; 1st Edition. edition (December 16, 2009)\n    * Language: English\n    * ISBN-10: 0387939970\n    * ISBN-13: 978-0387939971","torrent":{"xt":"urn:btih:b31803a0ab09acbe70d99bfcae5f145e9e6e255d","amp;dn":"International+Encyclopedia+of+Civil+Society%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b31803a0ab09acbe70d99bfcae5f145e9e6e255d","infoHashBuffer":{"type":"Buffer","data":[179,24,3,160,171,9,172,190,112,217,155,252,174,95,20,94,158,110,37,93]},"announce":[],"urlList":[]}}