{"title":"How Can I Forgive You - (Malestrom)","uid":4798651,"size":1103740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3411535e426c7cd98a5369d15d87454a777a3c4&amp;dn=How+Can+I+Forgive+You+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1237970947,"description":" &lt;a href=&quot;http://www.image-upload.net/images/mrwtko6kasgdy7l91mh.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/mrwtko6kasgdy7l91mh.jpeg&lt;/a&gt;\n\nJanis A. Spring, &quot;How Can I Forgive You?: The Courage To Forgive, the Freedom Not To&quot;\nHarperCollins | 2004 | ISBN: 0060009306 | 272 pages | PDF\n\nAbrahms Spring, a clinical psychologist, follows up her bestselling After the Affair with this new self-help manual that aims to provide a better way to forgive or not forgive others. With the assistance of her husband, and in clear, insightful writing, Abrahms Spring draws on many case studies to fully analyze four categories of forgiveness: cheap forgiveness, refusing to forgive, acceptance and genuine forgiveness. The author is convinced that morally and spiritually a person is no more required to forgive an unrepentant offender than he or she is to love him. When someone who has been truly wronged and forgives too easily (cheap forgiveness), that person is not acting in their own best interest, but rather preserving a relationship at any cost. An absolute refusal to forgive Abrahms, Spring posits, is also harmful to the injured person. Although punishing the offender may provide a sense of power, it also fosters negativity and self-isolation. The author advises that when genuine forgiveness is impossible, because the injury is too great or the offender will not apologize, a better decision than holding onto anger is to work through the injury, or acceptance. This healing process will lead to emotional resolution and the ability to move on with one's life. Genuine forgiveness, Abrahms Spring maintains, occurs when both parties negotiate a process during which the hurt person expresses his or her pain, and the offender apologizes and takes responsibility for his or her poor behavior. In the end, this is a thoughtful exposition on the nuanced role of forgiveness in relationships that goes beyond the average self-help book. ","torrent":{"xt":"urn:btih:b3411535e426c7cd98a5369d15d87454a777a3c4","amp;dn":"How+Can+I+Forgive+You+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3411535e426c7cd98a5369d15d87454a777a3c4","infoHashBuffer":{"type":"Buffer","data":[179,65,21,53,228,38,199,205,152,165,54,157,21,216,116,84,167,119,163,196]},"announce":[],"urlList":[]}}