{"title":"Kami Garcia &amp; Margaret Stohl - Beautiful Creatures. NL Ebook","uid":11457466,"size":3890131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b39e1097745d6826a0e9051eb539cacfbf61edcf&amp;dn=Kami+Garcia+%26amp%3B+Margaret+Stohl+-+Beautiful+Creatures.+NL+Ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"BiWild","files":-1,"time":1415959169,"description":"Kami Garcia &amp; Margaret Stohl - Beautiful Creatures. NL Ebook. DMT \n\nAfbeelding\n\nAuteur: Kami Garcia &amp; Margaret Stohl \nPagina's: 455/436/419/314\nTaal: Dutch/Nederlands\nUitgever: The House of Books\nJaar van uitgifte: 2010/2013\nGenre: Jeugd\n\nSamenvating\n\n\ndeel 1 - Betoverd\nLena Duchannes is geen gewoon tienermeisje. Lena en haar familie worden al generaties lang achtervolgd door een vloek. \nEthan Wate droomt over een mooi meisje dat hij nog nooit heeft ontmoet. Wanneer Lena in Gatlin komt wonen, op het oudste en \nmeest beruchte landgoed in de omgeving, voelt Ethan zich op onverklaarbare wijze tot haar aangetrokken. Hij is vastbesloten \nom te ontdekken hoe en waarom zij zo met elkaar verbonden zijn. Lena doet haar best om de vloek en haar macht geheim \nte houden. Maar zelfs in een stadje waar nooit iets gebeurt, kan een geheim niet eeuwig verborgen blijven...\n\n\nDeel 2 - Vervloekt\nEthan wist zeker dat er in Gatlin nooit iets gebeurde. Tot hij Lena ontmoette, die hem een wereld toonde die al die tijd verborgen was gebleven. \nEen Gatlin dat eeuwenoude geheimen herbergde, onder de met mos bedekte bomen en afgebrokkelde trottoirs. Samen kunnen ze alles aan, \nmaar na een tragisch sterfgeval begint Lena afstand te nemen van Ethan. Ze houdt geheimen achter die hun relatie ernstig op de proef stellen. \nEn nu Ethan openstaat voor de duistere kant van het stadje en opgejaagd wordt door visioenen die alleen hij kan zien, is er geen weg meer terug.\n\n\nDeel 3 - Chaos\nEthan dacht dat hij gewend begon te raken aan vreemde, onmogelijk gebeurtenissen in Gatlin. Maar nu Ethan en Lena weer thuis zijn, hebben\nde woorden 'vreemd'en 'onmogelijk' nieuwe betekenissen gekregen. Zwermen sprinkhanen, recordbrekende hitte en verwoestende stormen \nteisteren Gatlin. Ethan en Lena proberen te begrijpen wat de vloek van Lena nu eigenlijk betekent. Zelfs Lena's familie moet geloven aan de chaos. \nAls de tijd verstrijkt wordt de vraag steeds belangrijker: wat - of wie - moet worden opgeofferd om Gatlin te redden?\n\n\nDeel 4 - De Aflossing\nVerpletterend slot van de Beautiful Creatures-reeks. Is de dood het einde of alleen het begin? Ethan, die nooit had gedacht in Gatlin het meisje \nvan zijn dromen te vinden en niet kon verzinnen dat hij ooit zo graag terug zou willen naar het saaie stadje, moet nu hemel en aarde bewegen \nom terug te gaan naar de plek die hem zo dierbaar is. In Gatlin probeert Lena er alles aan te doen om Ethans terugkeer mogelijk te maken, \nook al moet ze hiervoor oude vijanden vertrouwen en het leven van anderen op het spel zetten. Ver van elkaar proberen \nEthan en Lena opnieuw samen hun lot te herschrijven.\n\n\nMet dank aan de originele poster !! \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:b39e1097745d6826a0e9051eb539cacfbf61edcf","amp;dn":"Kami+Garcia+%26amp%3B+Margaret+Stohl+-+Beautiful+Creatures.+NL+Ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b39e1097745d6826a0e9051eb539cacfbf61edcf","infoHashBuffer":{"type":"Buffer","data":[179,158,16,151,116,93,104,38,160,233,5,30,181,57,202,207,191,97,237,207]},"announce":[],"urlList":[]}}