{"title":"Wade Davis: Cultures at the far edge of the world","uid":4671421,"size":79861034,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b4952ceb6560e06d8422901a2b5609634b09ad88&amp;dn=Wade+Davis%3A+Cultures+at+the+far+edge+of+the+world&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1232746862,"description":"With stunning photos and stories, National Geographic Explorer Wade Davis celebrates the extraordinary diversity of the world's indigenous cultures, which are disappearing from the planet at an alarming rate.\n\nAnthropologist Wade Davis is perhaps the most articulate and influential western advocate for the world's indigenous cultures. His stunning photographs and evocative stories capture the viewer's imagination. As a speaker, he parlays that sense of wonder into passionate concern over the rate at which cultures and languages are disappearing -- 50 percent of the world's 6,000 languages, he says, are no longer taught to children. He argues, in the most beautiful terms, that language isn't just a collection of vocabulary and grammatical rules. In fact, &quot;Every language is an old-growth forest of the mind.&quot;\n\nDavis, a Harvard-educated ethnobotanist, believes humanity's greatest legacy is the &quot;ethnosphere,&quot; the cultural counterpart to the biosphere, and &quot;the sum total of all thoughts and dreams, myths, ideas, inspirations, intuitions brought into being by the human imagination since the dawn of consciousness.&quot; He beautifully articulates the intellectual, emotional and moral reasons why it's in everyone's best interest to preserve the world's cultures.\n\nTo this end, Davis serves on the councils of Ecotrust and other NGOs working to protect diversity. He also co-founded Cultures on the Edge, a quarterly online magazine designed to raise awareness of threatened communities. Perhaps his best-known work is The Serpent and the Rainbow, an international bestseller about zombification practices in Haiti. Wes Craven adapted the book into a 1988 film, which Davis denounced as a betrayal of the book's spirit. His latest book is The Clouded Leopard: A Book of Travels.\n\n    &quot;His work with indigenous cultures has given him a truly unique view of the world. He is able to slip off the map for awhile, to live with the voodoo priests in Haiti, the Penan in Borneo, or the Quechuen of Chinchero.&quot;\n\nCBC-TV\n___________________________________________________________________________________\nplease leave a comment if you want, this is just to show what is out there...\nAnd before you go and spam, dl it watch it and make up your own mind...\ncheers the_phyrexian\n\nAre you a British citizen? Click here! (Petition to stop Sharia Law)\n &lt;a href=&quot; http://petitions.number10.gov.uk/shariastop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://petitions.number10.gov.uk/shariastop&lt;/a&gt;\t\n\nthere is a reseed section, read it / use it...\n &lt;a href=&quot; http://suprbay.org/forumdisplay.php?f=35&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://suprbay.org/forumdisplay.php?f=35&lt;/a&gt;\n\nor visit my blog...\n &lt;a href=&quot; http://thephyrexian.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thephyrexian.tk&lt;/a&gt;","torrent":{"xt":"urn:btih:b4952ceb6560e06d8422901a2b5609634b09ad88","amp;dn":"Wade+Davis%3A+Cultures+at+the+far+edge+of+the+world","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4952ceb6560e06d8422901a2b5609634b09ad88","infoHashBuffer":{"type":"Buffer","data":[180,149,44,235,101,96,224,109,132,34,144,26,43,86,9,99,75,9,173,136]},"announce":[],"urlList":[]}}