{"title":"Jean M. Auel - The Land of Painted Caves (mobi, epub, lit)","uid":11159502,"size":3748429,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4f5a989c7f40bd6167cb8ea9d98879b86591ce4&amp;dn=Jean+M.+Auel+-+The+Land+of+Painted+Caves+%28mobi%2C+epub%2C+lit%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ausher8","files":3,"time":1412496295,"description":"#1 NEW YORK TIMES BESTSELLER In this, the extraordinary conclusion of the ice-age epic series, Earth's ChildrenÂ®, Ayla, Jondalar, and their infant daughter, Jonayla, are living with the Zelandonii in the Ninth Cave. Ayla has been chosen as an acolyte to a spiritual leader and begins arduous training tasks. Whatever obstacles she faces, Ayla finds inventive ways to lessen the difficulties of daily life, searching for wild edibles to make meals and experimenting with techniques to ease the long journeys the Zelandonii must take while honing her skills as a healer and a leader. And there are the Sacred Caves that Ayla's mentor takes her to see. They are filled with remarkable paintings of mammoths, lions, and bears, and their mystical aura at times overwhelms Ayla. But all the time Ayla has spent in training rituals has caused Jondalar to drift away from her. The rituals themselves bring her close to death, but through them Ayla gains A Gift of Knowledge so important that it will change her world. Sixth in the acclaimed Earth's ChildrenÂ® series","torrent":{"xt":"urn:btih:b4f5a989c7f40bd6167cb8ea9d98879b86591ce4","amp;dn":"Jean+M.+Auel+-+The+Land+of+Painted+Caves+%28mobi%2C+epub%2C+lit%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f5a989c7f40bd6167cb8ea9d98879b86591ce4","infoHashBuffer":{"type":"Buffer","data":[180,245,169,137,199,244,11,214,22,124,184,234,157,152,135,155,134,89,28,228]},"announce":[],"urlList":[]}}