{"title":"Up Your Ass 24 (Anabolic Video) 2006","uid":14603452,"size":1455362048,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b52d9819833aa7c9b9b53573a4d6fd11acb41a51&amp;dn=Up+Your+Ass+24+%28Anabolic+Video%29+2006&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"distinc","files":2,"time":1463068349,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4007543558\r\n \nhttp://imagedisco.net/?g=6130455737\r\n\r\n\r\nPlot:\r\n\r\nThe up your ass tradition continues... Heftily hung horny black men shove their super shlongs up some bodacious babes beautiful buttholes! Every girl takes it up the ass in this all anal, all interracial, Fuck fest! This movie may just be too hot to handle. Enjoy!\r\n\r\nBody of Review: The cover of Anabolic's Up Your Ass #24 states: &quot;The Up Your Ass tradition continues… Heftily Hung Horney Black Men shoe their super shlongs up some bodacious babes Beautiful Buttholes! Every girl takes it up the ass in this all anal, all interracial, Fuck Fest! Enjoy!&quot;. This sums up this DVD is a nutshell better than most three sentences descriptions. There are six girls on this DVD taking a cock (or two) up their tight asses. The inter-racial part is true as well, as all the male contestants are black. The cool thing is that there is also a black, Asian, Latina, and three white girls to give the viewer a nice selection of ethnicities to choose from.\r\n\r\nScene 1: Keeani Lei\r\nHot Asian cover girl, Keeani Lee is the first women to show off what she's got on this DVD. She's got a tight little body, very hot face and starts the scene off in a teeny tiny little silver thong bikini. She's paired with two giant cocked black men on a beach chair outside. She sucks on both cocks with avengence and looks phenomenal taking it doggy style while sucking cock, her cries of pleasure muffled by a dick down her throat. The cries increase when she starts getting her asshole plugged. Keeani also takes an energetic D.P. in cowgirl and doggy style position before both guys cum on her cute little face.\r\n\r\nScene 2: Mika Brown\r\nEbony cute Mike Brown is up next and has the same mission as the first scene: Satisfy two large black dicks by any means necessary. She lips and shaved pussy get a solid workout during this scene, as well as her little asshole. Mika is a freak in every sense of the world, loving cock no matter what hole it's presented to. She keeps her shirt on for the entire scene, which is a bit of a disappointment, but works hard fucking her way out of the situation. Her face gets covered by goo in the finale. Not a bad scene, but not nearly has hot as the first one\r\n\r\nScene 3: Kelly Wells\r\nTiny blonde gal, Kelly Wells is up next. She's a tight little white girl, with a very young look to her, and sports a shaved pussy to make sure her fans get to see every inch of her folds. She is a one on one romp a long-dicked black man, and fucks him every way from Tuesday, craving more dick than anyone has to offer. She's tastes her insides right off the dick of her gentleman caller straight from her pussy and ass. A semen shot to her cute little face is her reward.\r\n\r\nScene 4: Lexi Hawk\r\nLexi is a dark haired women with a little more fluff than Kelly, but great big doe eyes with a far wary look to them. She's up against a pair of deep hitting back men and starts off working them with her lips, standing up, bent over, so the guy not getting the oral can deep dick her snatch. This scene didn't do too much for me, as Lexi didn't really do it for me, and didn't look like she brought the energy to the table that she could have. I'll always enjoy a nice inter-racial anal themed roll in the proverbial hey, but this one could have been much better.\r\n\r\nScene 5: Jadelyn Santana\r\nJadelyn Santana is along haired Latina looking woman, wearing a full length body suit and a tight green little thong underneath. She's a hot little tamale, with a beautiful ethnic face, a couple well placed tattoos and a pierced tongue and two in her face. Super lot little lady. She's fucking a pair of black men in this scene as well, taking complete control of the scene, unlike the others, hopping from cock to cock, and working hard to get the guys off. Anal and Double penetrations aren't as hardcore, but still far from bad. This is a fantastic scene, with Jadelyn Santana being an absolute dynamo and a pleasure to watch in action.\r\n\r\nScene 6: Hillary Scott\r\nHillary Scott is a tiny little Caucasian with curly blonde hair and a passion for anything sexual. The scene starts with her immediately in the throws of oral sex, trying to get her little month around a great big dick. She's got acute little face and tight body, with small natural breasts. She shows off her talent of riding dick well and licking dick right out of her twat and once tight little snatch. It almost loots like a circus trick the way her ass just makes that big black cock disappear. The scene ends, with Hillary's knees by her neck and eyes, nose and mouth covered sperm. Hardcore scene!\r\n\r\nSummary: Anabolic's &quot;Up your Ass 24&quot; is a very strong release from Anabolic highlighted by the performances of Jadelyn Santana &amp; Keeani Lie. I would Recommend this DVD to anyone who loves hardcore interracial sex with lovely young women, Anabolic style.\r\n\r\nHillary Scott, Jack Napier, Jadelyn Santana, Kelly Wells, Lexi Hawk, Mika Brown","torrent":{"xt":"urn:btih:b52d9819833aa7c9b9b53573a4d6fd11acb41a51","amp;dn":"Up+Your+Ass+24+%28Anabolic+Video%29+2006","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b52d9819833aa7c9b9b53573a4d6fd11acb41a51","infoHashBuffer":{"type":"Buffer","data":[181,45,152,25,131,58,167,201,185,181,53,115,164,214,253,17,172,180,26,81]},"announce":[],"urlList":[]}}