{"title":"Tom Clancy's Splinter Cell Chaos Theory [Ntsc] Ps2","uid":4406449,"size":2806492333,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b5e7be44f960669647fc47305d4bf7821f8246b3&amp;dn=Tom+Clancy%5C%27s+Splinter+Cell+Chaos+Theory+%5BNtsc%5D+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Big_dude","files":-1,"time":1221982233,"description":"Splinter Cell Chaos Theory for Ps2.\t                             Rel. 03/28/2005\n\n\nFormat:\t      DVD5 NTSC-USA\nLang.:\t      English\nDiscs:         1\nOnline:        Yes &amp; No\nImage:         ISO\nBy:            Ubisoft, Inc.\nRequirements:  Modded/Chipped ps2, or Swap Magic disc method.\n\n\nCompressed with WinRar. Game was tested and works.\nTry 7Zip its free google it, if you don't have WinRar.\n\n\nSorry the dnas code wasn't patched for this. Didn't have the original disc\nfor this image so there was no way of getting the correct Disc ID to Patch\nthe Dnas Image, without the original disc ID this can't be done.\n\nYou can however test this on your own if you can get online from this game\nthen yes it was patched, but I doubt it is you can check it if you want.\n\nThe Pc version of this game was in my opinion much better than the ps2, \nbut still this game is pretty good.\n\nDidn't see the Ntsc version of this game for ps2 here on the pirate bay, So I thought I'd upload it. And this game happens to be one of my favorites in the splinter cell series.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n     &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n     &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Try Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden, burn at 8x if its a 16x max. You really can't use Maxell DVD+R for example or some other brand as it more than likely will not work.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Try Swap Magic to load the game.\n\n\n\nGame Description:\n\nTom Clancy's Splinter Cell Chaos Theory The year is 2008. Citywide blackouts... stock exchange sabotage... electronic hijacking of national defense systems... this is information warfare, which has become the most dangerous threat to global stability. To prevent these attacks, you must infiltrate deep into hostile territory and aggressively collect critical intelligence, closer than ever to enemy soldiers. You are Sam Fisher, the NSA's most elite black-ops agent. To achieve your mission you will operate undetected, kill at close-range, attack with your combat knife, shoot with the modular SC20K rifle, and use radical suppression techniques such as the inverted neck break. Work alone, or enjoy the thrill of cooperative multi-player infiltration missions, where teamwork is the ultimate weapon. \n\n(Note: Chaos theory for ps2 isn't exactly the same as the pc version, as the levels are a bit different and everything is a little scaled down.  I for one recommend the pc version over the ps2 one there's alot more depth to it. But still I'm filling a gap for the pirate bay, as their was only the pal versions for this and not Ntsc.)\n\n\nFeatures:\n\n* DEADLY AGILITY: Incredibly complete and fluid variety of moves including  \n  athletic moves, stealth moves, stealth kills. \n\n* REAL WEAPONS OF TOMORROW: The most complete arsenal of weapons and gadgets from \n  the knife to the experimental Land Warrior System. \n\n* AS GOOD AS REAL: Never see before graphics technology offers the best visuals \n  ever seen on any console yet. Advanced physics engine allowing rag doll physics, \n  particle effects and perfect interaction with the environment. \n\n* ULTIMATE CHALLENGE: Intelligent A.I with personal attributes, natural behavior \n  where NPCs are aware of there environment and remember past events. \n\n* AMAZING REPLAYABILITY: Totally open level design with multi-paths and optional \n  secondary objectives.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, or ImgBurn.\n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media\nisn't working.\n\nIf DVD+R Booktype to DVD-ROM.\n(Only if your Mod-chip or Ps2 doesn't support DVD+R's).\n\n\nPlease Seed This when your done.\n\n(I can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:b5e7be44f960669647fc47305d4bf7821f8246b3","amp;dn":"Tom+Clancy%5C%27s+Splinter+Cell+Chaos+Theory+%5BNtsc%5D+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e7be44f960669647fc47305d4bf7821f8246b3","infoHashBuffer":{"type":"Buffer","data":[181,231,190,68,249,96,102,150,71,252,71,48,93,75,247,130,31,130,70,179]},"announce":[],"urlList":[]}}