{"title":"Jeff Dunham - Spark of Insanity","uid":4564663,"size":732821484,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b62b10e500a1484974643083bf2ce69cab73e3eb&amp;dn=Jeff+Dunham+-+Spark+of+Insanity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starfyre98204","files":1,"time":1228781659,"description":"Ventriloquist Jeff Dunham&amp;#039;s second live-performance DVD, Spark of Insanity, is much funnier than his first, Arguing With Myself, perhaps because his new puppets allow him to cover more controversial territory beyond skits about family beefs and office humor. Though some puppets reappear, like the beloved Peanut, a purple monkey who loves wordplay, new characters emerge as the stars of this hour-long stand-up show. A tense laughter ripples through the audience, for example, when Dunham announces his wish to talk with a terrorist as he brings out Achmed the Dead Terrorist, a turban-sporting skeleton who&amp;#039;s refrain is &quot;I will kill you!&quot; Previous show star, Jose JalapeÃƒÂ±o, a Mexican chili pepper on a stick, returns for a discussion about whether the puppet has a green card. If his racial jokes rode a line slightly too Caucasian to clarify his point of view before, Dunham has achieved real satire in Spark of Insanity, showing his audience how ridiculous it is to create stereotypes of any sort. Additionally, Dunham mocks his own culture with Walter, a grumpy old white man whose parental chiding rings true for many. Moreover, Dunham impresses with his ventriloquism skills, and shows off some new vocalization techniques that will stun anyone interested in this fascinating art.","torrent":{"xt":"urn:btih:b62b10e500a1484974643083bf2ce69cab73e3eb","amp;dn":"Jeff+Dunham+-+Spark+of+Insanity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62b10e500a1484974643083bf2ce69cab73e3eb","infoHashBuffer":{"type":"Buffer","data":[182,43,16,229,0,161,72,73,116,100,48,131,191,44,230,156,171,115,227,235]},"announce":[],"urlList":[]}}