{"title":"Pete Atkin - Beware Of The Beautiful Stranger [1970][EAC/FLAC]","uid":10561231,"size":341999367,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6375c39eaa94b990c924d28194316fc8893ba55&amp;dn=Pete+Atkin+-+Beware+Of+The+Beautiful+Stranger+%5B1970%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"dickspic","files":-1,"time":1405458534,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: 2009 - Edsel / B001NOMONI / Remastered + Bonus Tracks\nCountry: UK\nYear: February 2, 2009\nGenre: folk\nFormat: CD,Album\n\n\n\n\n\n1. The Master Of The Revels \n2. Touch Has A Memory \n3. Have You Got A Biro I Can Borrow? \n4. Sunrise \n5. Frangipanni Was Her Flower \n6. The Rider To The World's End \n7. The Luck Of The Draw \n8. The Original Original Honky Tonk Night Train Blues \n9. Girl On The Train \n10. Tonight Your Love Is Over \n11. You Can't Expect To Be Remembered \n12. Laughing Boy \n13. Beware Of The Beautiful Stranger \n14. All I Ever Did\n\nBonus tracks: \n\n15. Be Careful When They Offer You The Moon \n16. A Man Who's Been Around\n\nBonus demos: \n\n17. Have You Got A Biro I Can Borrow? \n18. Touch Has A Memory \n19. Sunrise \n20. The Luck Of The Draw \n21. Girl On The Train \n22. You Can't Expect To Be Remembered \n23. Laughing Boy \n24. All I Ever Did\n\n\n\nThough it was intended only as a collection of demos designed to showcase Pete Atkin and Clive James' talents as a songwriting team, Beware of the Beautiful Stranger ended up launching Atkin's recording career after BBC Radio 1 DJ Kenny Everett started giving the opening track some heavy airplay. It proved a happy accident, for Atkin's deadpan and very English voice was the perfect vehicle for James' wryly melancholic musings, most of which focused here on an infinitely sensitive young aesthete's quest for eternal love and his endless capacity to screw it up when he found it. &quot;Girl on the Train&quot; finds &quot;the leading poetic hope of the whole Planet Earth&quot; alone in a railway carriage with a beautiful young woman whose spiritual depth is signaled by the fact that she's &quot;reading obsolete Monsieur Verlaine.&quot; The poetic hope, of course, says nothing and is left ruing another lost opportunity. &quot;Laughing Boy,&quot; too, laments the fact that the singer's friends -- especially the female ones -- are unable to discern the suffering artist behind the carapace of caustic wit. (James, it is worth remembering, was already established on British TV by now as a purveyor of corner-of-the-mouth putdowns in his capacity as a film reviewer.) Yet already, there are signs of the impatience with pop lyric conventions that would increasingly characterize his later work. There's the carnival-esque &quot;Master of the Revels,&quot; for instance, that so entranced Everett, and the title track, a beautifully constructed comedy sketch set to music in which a lovesick young man consults a dodgy soothsayer (&quot;I can't even get the Lone Ranger,&quot; she protests). Musically, the album finds Atkin still in an MOR no man's land between folk and tasteful acoustic pop, a little too eager to please and reluctant to offend. Yet there was enough vaunting ambition in the melody and arrangement of &quot;The Rider to the World's End&quot; to suggest that he had only just begun. His two attempts at lyrics, however -- the comical memory feat of &quot;The Original Honky Tonk Train Blues&quot; and the fragmentary &quot;All I Ever Did&quot; -- suggest he was right to hand over the literary side of the operation to James. [The original Fontana album included a track called &quot;Touch Has a Memory,&quot; replaced on the RCA reissue by &quot;Be Careful When They Offer You the Moon.&quot; The situation was reversed when the album was released on CD as a two-fer with Driving Through Mythical America.]","torrent":{"xt":"urn:btih:b6375c39eaa94b990c924d28194316fc8893ba55","amp;dn":"Pete+Atkin+-+Beware+Of+The+Beautiful+Stranger+%5B1970%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6375c39eaa94b990c924d28194316fc8893ba55","infoHashBuffer":{"type":"Buffer","data":[182,55,92,57,234,169,75,153,12,146,77,40,25,67,22,252,136,147,186,85]},"announce":[],"urlList":[]}}