{"title":"Opeth - 2001 - Blackwater Park [TQMP]","uid":6499260,"size":510488231,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6e6c96c2e320e104e0b4d25cff57cb40bd91712&amp;dn=Opeth+-+2001+-+Blackwater+Park+%5BTQMP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"quose","files":-1,"time":1309188536,"description":" ____________________________________________________________________________\n|                                                                            |\n|                       Opeth - 2001 - Blackwater Park                       |::\n|                                                                            |::\n|          Ripped w/EAC v1.0b2 (Secure) :: Encoded w/FLAC v1.2.1 -8          |::\n|____________________________________________________________________________|::\n  ::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n\n       +--------------+\n+------+ Pack / Files +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   No. of Files / Size _____ 22 files / 486.84MB (510,488,231 bytes)          |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------------+\n+------+ Audio Source +--------------------------------------------------------+\n|      +--------------+                                                        |\n|   Type / Quantity _________ CD (Compact Disc) (* 1)                          |\n|   Date Released ___________ 27th of February, 2001                           |\n|   Genre(s) ________________ Metal                                            |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +--------+\n+------+ Review +--------------------------------------------------------------+\n|      +--------+                                                              |\n|   After the release of &quot;Still Life&quot; in 1998, Opeth went into the studio to   |\n|   record the latest step in their musical evolution. Their career had        |\n|   taken them through many of the shapes of modern black metal up to this     |\n|   point. Their albums &quot;Orchid&quot; and &quot;Morningrise&quot; proved that they had        |\n|   mastered the art of melodic death metal, and from that point the band      |\n|   decided to go in a different direction with &quot;My Arms, Your Hearse.&quot; Some   |\n|   fans, however, regarding the direction taken on &quot;Morningrise&quot; to be        |\n|   excellent, balked at the decidedly more dissonant, heavier tone of the     |\n|   new album. Thus, on &quot;Still Life,&quot; Opeth married the progressive            |\n|   influences and the heavy influences in the way that &quot;Blackwater Park&quot;      |\n|   displays, with equal parts light and heavy, in addition to a whole lot     |\n|   more reverb and thickness, courtesy of new producer and Akerfeldt          |\n|   confidant Steven Wilson, of the British prog band Porcupine Tree.          |\n|                                                                              |\n|   &quot;Blackwater Park&quot; is, as said above, mostly a refinement on the sound of   |\n|   &quot;Still Life,&quot; with little new innovation or changes in direction. There    |\n|   are full-blast metal moments, moments of breathtaking beauty, and          |\n|   lighter, acoustic sections layered with Akerfeldt's ever-improving clean   |\n|   vocals: in short, everything one can currently expect from Opeth. In       |\n|   this case, this &quot;refinement&quot; proved so successful that it is thus far      |\n|   Opeth's highest-selling album, selling hundreds of thousands of copies     |\n|   in the States. Here's the album track by track.                            |\n|                                                                              |\n|   The Leper Affinity                                                         |\n|   &quot;Blackwater Park&quot; was my first Opeth album. I didn't know precisely what   |\n|   to expect. I had heard excellent things about them and I was, believe it   |\n|   or not, apprehensive. Would I like a marriage of a genre I despise(death   |\n|   metal) with a genre that I love(progressive rock)? With that attitude in   |\n|   mind, the opening to this song was terrifying. Just terrifying. A          |\n|   discordant piano chord fades slowly in, louder and louder, until it's      |\n|   really loud and you know the explosion is coming any moment, but it        |\n|   doesn't come it doesn't come and then it does, and the explosion is        |\n|   greater than you imagined. The riffs are fast, dissonant, and evil, and    |\n|   the aura this music gives off is of a castle where nothing except the      |\n|   most perverted rituals are performed. This barrage continues with          |\n|   Akerfeldt's reverbed, awesome death growls and never lets up. The          |\n|   assault gives way to the most perfect guitar solo I've heard Opeth         |\n|   perform(and I have nearly their entire discography), and then breaks       |\n|   through to one of their famed harmony breaks, with lead guitars singing    |\n|   over rubble-pounding chords. Sound melodramatic? This is simply the way    |\n|   my emotions were being manipulated on my first listen. It's not            |\n|   melodramatic: this was how Opeth's sound and fury being unleashed on a     |\n|   completely new listener felt. The acoustic sections and clean singing      |\n|   that follow are just gorgeous, and the song ends with a great prog-rock    |\n|   riff and an eerie, self-contained piano section. This was my first taste   |\n|   of Opeth, and I already knew I loved them.                                 |\n|                                                                              |\n|   Bleak                                                                      |\n|   Surpassed only by &quot;Black Rose Immortal&quot; and closely followed by &quot;The       |\n|   Moor,&quot; this song is my favorite Opeth song. It's groove is considerably    |\n|   slower and, if possible, even more eerie than the previous tune, and a     |\n|   highlight is the echoing E-bow lead floating above the dry-sounding        |\n|   acoustics and the distorted guitars. The rest of the song begins to        |\n|   follow a fairly standard structure until Akerfeldt's clean vocals make a   |\n|   return with some of the best singing of his career. It slowly quiets       |\n|   down until we reach an almost bluesy acoustic section, and I personally    |\n|   was amazed at how WELL the death metal section flowed into this part. It   |\n|   left me feeling like, &quot;How did I get from there to HERE?&quot; What follows     |\n|   is a great riff with a heavily distorted lead that itself goes back to     |\n|   the most gorgeous, instrumentally dense section Opeth ever put to tape.    |\n|   Listen to this with headphones and hear everything that's going on. It's   |\n|   breathtaking. The song ends with repeats from earlier and then the sound   |\n|   of a tape breaking. Awesome.                                               |\n|                                                                              |\n|   Harvest                                                                    |\n|   In the tradition of &quot;Benighted,&quot; we have a nearly all-acoustic song        |\n|   here, with no metal sections. My opinion is mixed. It's certainly very     |\n|   pretty, but since I wasn't used to Opeth's habitual use of dissonant       |\n|   chords in their acoustic sections, the middle section threw me for a       |\n|   while. I eventually got used to it, though, and realized that for Opeth,   |\n|   writing something standardly melodic would have been a cop-out. This       |\n|   isn't the best, but it's still very high-quality.                          |\n|                                                                              |\n|   The Drapery Falls                                                          |\n|   Okay, now, this song is interesting. It seems to be more &quot;mood music&quot;      |\n|   than anything else Opeth has made. The important thing, though, is that    |\n|   this song is next to impossible to categorize. It's so original and        |\n|   unique-sounding, combining so many various elements of a lot of            |\n|   different types of music, that I can't believe that four guys just came    |\n|   up with this stuff in a couple of weeks. The intro is really the prime     |\n|   example of that. Where, in any band anywhere, have you heard an intro      |\n|   so...impossible to pin down? The sections that follow are totally cool,    |\n|   with melancholy acoustic while(It's that E-Bow Again!) the slide guitars   |\n|   swim around the sea of reverb above them. The metal sections are fairly    |\n|   standard and to be honest, go on for way too long, but the short           |\n|   acoustic bits resolve back to the intro in a nice way.                     |\n|                                                                              |\n|   Dirge for November                                                         |\n|   This song is easily the most forgettable one on here. That said, the       |\n|   beginning and ending to this one are just great. The reverb-laden &quot;wall    |\n|   of sound&quot; breaks down to great effect with Mikael just sings and plays     |\n|   his guitar for a few seconds, and his voice isn't even tuned properly,     |\n|   which adds an interesting contrast. There's more beautiful music, but      |\n|   it's followed by music that I just can't get into. The metal music         |\n|   doesn't make me bang my head, it just makes me scratch it. This is         |\n|   followed by a way-too-long, but nice, clean section with eerie E-bow       |\n|   harmonies lurking in the mix. The weakest link in the album, but not       |\n|   THAT bad.                                                                  |\n|                                                                              |\n|   The Funeral Portrait                                                       |\n|   The 12-string that opens this sounds very good, but the riffs that         |\n|   follow almost sound like ones lifted from the middle of Dream Theater's    |\n|   &quot;Another Day!&quot; (&quot;Duuh-duh-duh-duh-da-dat-daa-da-da-dum..) Still, it's      |\n|   very cool. The acoustic sections are real evil on this, helped out by      |\n|   Lopez's nice fills. The long, multiple guitar solos that close the song    |\n|   are also pretty nice, as are the harmony vocals. A solid Opeth song.       |\n|                                                                              |\n|   Patterns in the Ivy                                                        |\n|   An instrumental acoustic/piano duet. This is a short, nice interlude       |\n|   piece. I don't really have much to say, 'cause it's only a minute long.    |\n|                                                                              |\n|   Blackwater Park                                                            |\n|   This song is chock full of the heaviest, most evil riffs Opeth ever        |\n|   recorded. The song also reverses the structure of &quot;The Leper Affinity&quot;     |\n|   by placing it's mellow interlude right near the beginning, which, unlike   |\n|   other such interludes, is not hampered by its length. Then, the metal      |\n|   assault which follows does not let up for a single moment for the rest     |\n|   of the song. Particularly awesome is Akerfeldt's &quot;death-metal harmony&quot;     |\n|   in which two screams of different levels of bowel-churning-ness are        |\n|   combined to make the most evil metal blast on the entire album. You must   |\n|   listen to this. It's amazing.                                              |\n|                                                                              |\n|   FINAL THOUGHTS:                                                            |\n|   I know this review was long and a lot to digest, but so is the album. It   |\n|   requires patience, and a keen musical ear: there's really no point in      |\n|   listening to Opeth if you're not going to really listen to them. The       |\n|   production is awesome, being really, really dense and bone-dry at the      |\n|   same time. It truly adds to the relentlessly bleak mood of the CD. The     |\n|   deluxe import has two bonus tracks, &quot;Still Day Beneath the Sun,&quot; an        |\n|   acoustic number that is quite nice, and &quot;Patterns in the Ivy II&quot; a rare    |\n|   &quot;sequel song&quot; that is very beautiful, and which is quite worthy of the     |\n|   title. The harmony solo at the end is particularly beautiful: I go out     |\n|   for walks at night listening to this and just close my eyes, thinking      |\n|   about stuff. All true lovers of rock music will like this CD. It is        |\n|   already a classic within the metal community and could easily turn into    |\n|   one of the most influential rock albums of any genre of the early part     |\n|   of the 21st century.                                                       |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +------------+\n+------+ Track List +----------------------------------------------------------+\n|      +------------+                                                          |\n|   No. | Title                                                  | Duration    |\n|   ----+--------------------------------------------------------+----------   |\n|   001 | The Leper Affinity ................................... | 00h10m23s   |\n|   002 | Bleak ................................................ | 00h09m16s   |\n|   003 | Harvest .............................................. | 00h06m01s   |\n|   004 | The Drapery Falls .................................... | 00h10m54s   |\n|   005 | Dirge for November ................................... | 00h07m54s   |\n|   006 | The Funeral Portrait ................................. | 00h08m45s   |\n|   007 | Patterns In the Ivy .................................. | 00h01m52s   |\n|   008 | Blackwater Park ...................................... | 00h12m08s   |\n|   ----+--------------------------------------------------------+----------   |\n|                                                                              |\n|   Total Length ____________ 01h07m13s                                        |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\n       +-----------+\n+------+ Audio Rip +-----------------------------------------------------------+\n|      +-----------+                                                           |\n|   Ripped with _____________ EAC v1.0b2 [http://www.exactaudiocopy.de]        |\n|   Encoded with ____________ FLAC v1.2.1 [http://flac.sourceforge.net]        |\n|   Encoding Stats __________ 1411kbps / 44.1kHz / CBR / 16-bit / Stereo       |\n|   Tag(s) __________________ Vorbis                                           |\n|   Includes Artwork? _______ Yes                                              |\n|   Includes Rip .LOG? ______ Yes                                              |\n|   Includes Rip .CUE? ______ Yes                                              |\n|   Includes Playlist? ______ Yes                                              |\n|                                                                              |\n+------------------------------------------------------------------------------+\n\nrainfo v0.2 [2011/06/27 @ 21:22:11]","torrent":{"xt":"urn:btih:b6e6c96c2e320e104e0b4d25cff57cb40bd91712","amp;dn":"Opeth+-+2001+-+Blackwater+Park+%5BTQMP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6e6c96c2e320e104e0b4d25cff57cb40bd91712","infoHashBuffer":{"type":"Buffer","data":[182,230,201,108,46,50,14,16,78,11,77,37,207,245,124,180,11,217,23,18]},"announce":[],"urlList":[]}}