{"title":"The Jimmy Rogers All Stars - Blues Blues Blues","uid":3509435,"size":67097319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b846c729acfcf982ec6605ecbd909e3c52f629f7&amp;dn=The+Jimmy+Rogers+All+Stars+-+Blues+Blues+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"hankc","files":13,"time":1154776573,"description":"\n1. Blow Wind Blow  \n2. Blues All Day Long  \n3. Trouble No More  \n4. Bright Lights Big City  \n5. Ev&amp;#039;ry Day I Have The Blues \n6. Sweet Home Chicago  \n7. Don&amp;#039;t Start Me To Talkin&amp;#039;  \n8. That&amp;#039;s All Right  \n9. Ludella  \n10. Goin&amp;#039; Away Baby  \n11. Worried Life Blues  \n12. Gonna Shoot You Right Down (Boom Boom)  \n\nJimmy Rogers was second guitarist in Muddy Waters&amp;#039; classic lineup, which also included harpist Little Walter and bassists Big Crawford or Willie Dixon. As a solo artist, Rogers used these musicians (minus Waters) to record his classic sides for Chess in the Fifties. If you don&amp;#039;t already own the two-disc The Complete Chess Recordings, that would be the logical place to start.\nBut as a tribute to one of Chicago&amp;#039;s greatest bluesmen (Rogers died in 1997 before this album&amp;#039;s release), Blues Blues Blues is a great collection of songs. The idea of coupling an aging blues musician with superstar guests is nothing new. Chess Did it with its London Sessions series in the early Seventies, and John Lee Hooker has made a career out of it since releasing The Healer back in 1989. While this type of recording tends to be something of a mixed bag, Blues Blues Blues is an overall success.\n\nRogers is still in fine voice even into his seventies. And guest artists are top-notch. Guest vocalists (who share lead vocals with Rogers on all tracks) include Robert Plant, Eric Clapton, Mick Jagger and Taj Mahal. Lead guitar is provided by Clapton, Keith Richards, Jimmy Page and Jeff Healey. Either Kim Wilson or Carey Bell plays harmonica on most tracks.\n\nWhether the band is performing Rogers&amp;#039; originals like &quot;That&amp;#039;s All Right&quot; and &quot;Luedella,&quot; or classic blues songs like Waters&amp;#039; &quot;Trouble No More&quot; or Jimmy Reed&amp;#039;s &quot;Bright Lights Big City,&quot; they play with authority and conviction.\n\nWhile the album was recorded as a celebration of Rogers&amp;#039; contribution to the blues, it serves as a fitting tribute. HIGHLY RECOMMENDED\n","torrent":{"xt":"urn:btih:b846c729acfcf982ec6605ecbd909e3c52f629f7","amp;dn":"The+Jimmy+Rogers+All+Stars+-+Blues+Blues+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b846c729acfcf982ec6605ecbd909e3c52f629f7","infoHashBuffer":{"type":"Buffer","data":[184,70,199,41,172,252,249,130,236,102,5,236,189,144,158,60,82,246,41,247]},"announce":[],"urlList":[]}}