{"title":"POtHS - Conspiracy - 049 - How WiFi and Cell Phones Cause Cancer","uid":10141119,"size":6054123093,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8b947e4f64b321c8c212e5c3f6237a86f2eb22e&amp;dn=POtHS+-+Conspiracy+-+049+-+How+WiFi+and+Cell+Phones+Cause+Cancer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":4,"uploader":"POtHS11","files":104,"time":1399998289,"description":"\nVote a &quot;LIKE&quot; for Little NEO here:\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/Neo-Counting-Stars-Havaiia-Family-Band-cover/EZlSiFTm9s?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\nand here\n &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band/neo-fireflies-live-cover/JesiFwtoWk?t=s&amp;u=tjjRiRO0C6&lt;/a&gt;\n\nHelp them Produce their New Album Here:\n &lt;a href=&quot;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.kickstarter.com/projects/havaiia/havaiia-family-bands-first-all-original-album-and&lt;/a&gt;\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Conspiracy - 049 - How WiFi and Cell Phones Cause Cancer\n\nDescription:\n\nHow Cell Phones Cause Cancer:\nFebruary 5 2014, Do you have a CELL PHONE?  This is a MUST SEE VIDEO that exposes many cancer, physical and mental health ailments associated to cell phone and wi-fi use.  This has become yet another tabacco science, like GMO's, which large corporations and government subject citizens to in the name of profits and convenience.  The main underlying question is that of agenda, is it really all about money or are there Agenda 21 / Sustainable Development motives?\n\nThe radiation from Microwave frequencies are proven to increase Brain Tumor Risk and many physical and mental health problems.  Brain tumors are often fatal and sufferers usually die within a year of diagnosis.  A study by Dr. Lennart Hardell of Orebro University in Sweden found a link between cell phones and tumors -- using a cell phone for an hour or more each day significantly increased the risk of tumors and tumors are most likely to develop on the side of the head where the cell phone is held.  It found tumors may also form in other areas such as the eyes, prostate and breast. http://www.ehow.com/list_7797560_dangers-microwaves-mobile-phones.html#ixzz2sSmKFYVW\n\nIn this video Brian Thiesen discusses Smart Meters, Cell Towers, Wireless devices and their effects on the Human Body.  This important information needs to be shared.  But the remaining question to be answered is why has the MSM avoided sharing these disturbing facts to the public and why have are government officials refused to legislate it?\n\nAdditional notes for research...\nJuly 2013 BC CENTRE FOR DISEASE CONTROL REPORT POINTS TO DAMAGING HEALTH EFFECTS FROM WIRELESS DEVICES recommendation that schools and homes return to safe wired technologies http://www.stopsmartmetersbc.ca/html/?p=6560\n\nFebruary 2013 USA residents Allow a Smart Meter in Your Home or Face Arrest http://www.anh-usa.org/allow-a-smart-meter-in-your-home-or-face-arrest/\n\nCNN Health News Cell phone use can increase possible cancer risk http://www.cnn.com/2011/HEALTH/05/31/who.cell.phones/index.html\n\nMicrowave health concerns http://www.stayonthetruth.com/kamloops-meeting-smart-meter-opponents-forum.php\n\nMultimedia Presentation on Wireless Health Hazard http://www.stayonthetruth.com/multimedia-presentation-on-wireless-health-hazards.php\n----------------------------------------------------------------------------------------------------------------\n\nPsychotronic Weapons and Behavior Modification:\nAntony Sutton has been persecuted but never prosecuted for his research and subsequent publishing of his findings. His mainstream career was shattered by his devotion towards uncovering the truth. In 1968, his Western Technology and Soviet Economic Development was published by The Hoover Institute at Stanford University. Sutton showed how the Soviet state's technological and manufacturing base, which was then engaged in supplying the North Vietnamese the armaments and supplies to kill and wound American soldiers, was built by US firms and mostly paid for by the US taxpayers. From their largest steel and iron plant, to automobile manufacturing equipment, to precision ball-bearings and computers, basically the majority of the Soviet's large industrial enterprises had been built with the United States help or technical assistance.\n\nProfessor Richard Pipes of Harvard said in his book, Survival Is Not Enough: Soviet Realities and America's Future (Simon &amp; Schuster;1984): &quot;In his three-volume detailed account of Soviet Purchases of Western Equipment and Technology . . . [Antony] Sutton comes to conclusions that are uncomfortable for many businessmen and economists. For this reason his work tends to be either dismissed out of hand as 'extreme' or, more often, simply ignored.&quot;\n\nThe report was too much and Sutton's career as a well-paid member of the academic establishment was under attack and he was told that he &quot;would not survive&quot;.\n\nHis work led him to more questions than answers. &quot;Why had the US built-up it's enemy? Why did the US build-up the Soviet Union, while we also transferred technology to Hitler's Germany? Why does Washington want to conceal these facts?&quot;\n\nSutton, following his leads, proceeded to research and write his three outstanding books on Wall Street, FDR, the Rise of Hitler, and The Bolshevik Revolution. Then, someone sent Antony a membership list of Skull and Bones and &quot;a picture jumped out&quot;. And what a picture! A multigenerational foreign-based secret society with fingers in all kinds of pies and roots going back to 'Illuminati' influences in 1830's Germany. &lt;a href=&quot;\nhttp://www.antonysutton.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.antonysutton.com/&lt;/a&gt;\n-----------------------------------------------------------------------------------------------------------------\n\nThe Dangers of Microwave Technology:\nAn Interview with Barrie Trower in November 13, 2010.\nBarrie Trower is a former Royal Navy microwave weapons expert and former cold-war captured spy debriefer for the UK Intelligence Services. Mr Trower is a conscionable whistle-blower who lectures around the world on hidden dangers from microwave weapons and every-day microwave technologies such as mobile-phones and WiFi. Mr Trower has also repeatedly assisted the UK Police Fedration in their struggle to protect police officers from Tetra/Air-Band radio-communications systems that are harmful to health.\n----------------------------------------------------------------------------------------------------------------\n\nWi-Fi Dangers:\nThe Government insists Wi-Fi is safe, but this BBC Panorama investigation reveals evidence that microwave radio frequency radiation levels in some schools are up to three times the level found in the main beam of intensity from mobile phone masts.\n\nThere have been no publicly released studies on the health effects of Wi-Fi equipment, but thousands on mobile phones and masts.  The radiation Wi-Fi emits is similar to that from mobile phone masts. It is an unavoidable by-product of going wireless but that doesn't mean the public should remain stupid about it.\n-----------------------------------------------------------------------------------------------------------------\n\nWiFi in schools proven dangerous:\nWiFi causes heart problems, headaches and other neurological disorders in children. Canadian Documentary exposes the truth. More info at http://www.magdahavas.com\n\nYou can't see it but it's everywhere. WiFi connects computers to the internet, no cords required. Now kids are using it in wireless classrooms across the country. But is it an invisible danger? Carolyn Jarvis investigates why some parents say WiFi in schools is making our kids sick.\n----------------------------------------------------------------------------------------------------------------\n\nAlso included in this download are various related conspiracy shorts video clips.\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n        :thankyou:    :thankyou:   Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:b8b947e4f64b321c8c212e5c3f6237a86f2eb22e","amp;dn":"POtHS+-+Conspiracy+-+049+-+How+WiFi+and+Cell+Phones+Cause+Cancer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8b947e4f64b321c8c212e5c3f6237a86f2eb22e","infoHashBuffer":{"type":"Buffer","data":[184,185,71,228,246,75,50,28,140,33,46,92,63,98,55,168,111,46,178,46]},"announce":[],"urlList":[]}}