{"title":"The McGuire Sisters","uid":8744131,"size":330412933,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b9293cbcd6b2cb8ff154a781a2bbb23a90eb6a13&amp;dn=The+McGuire+Sisters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"CodyMaverick","files":-1,"time":1374874324,"description":"The McGuire Sisters \n\nThe Anthology Disc 1 (MCA Records, 1999) 320 kbps, 1:06:11\n\n01. Miss You\n02. Tell Us Where The Good Times Are\n03. Goodnight, Sweetheart, Goodnight\n04. Muskrat Ramble\n05. Sincerely\n06. No More\n07. Melody Of Love\n08. It May Sound Silly\n09. Something&quot;s Gotta Give\n10. Heart\n11. Sweet Song Of India\n12. He\n13. &quot;S Wonderful\n14. Mississippi Mud\n15. Tip Toe Through The Tulips With Me\n16. All By Myself\n17. Do You Remember When?\n18. Ev&quot;ry Day Of My Life\n19. Weary Blues\n20. Delilah Jones\n21. Picnic\n22. Goodnight My Love (Pleasant Dreams)\n23. All I Do Is Dream Of You\n24. Love Is Here To Stay\n25. Tenderly\n\nThe Anthology Disc 2 (MCA Records, 1999) 320 kbps, 1:06:16\n\n01. Moonglow\n02. Don&quot;t Take Your Love From Me\n03. Around The World\n04. Sugartime\n05. Summer Dreams\n06. Ding Dong\n07. Volare (Nel Blu, Dipinto Di Blu)\n08. May You Always\n09. Red River Valley\n10. True Love\n11. Always\n12. Love And Marriage\n13. The Blue Room\n14. Makin&quot; Whoopee\n15. Just For Old Time&quot;s Sake\n16. Wouldnt&quot; It be Lovely\n17. Teach Me Tonight\n18. I Really Don&quot;t Want To Know\n19. Bye Bye Blackbird\n20. The Birth Of The Blues\n21. You&quot;re Driving Me Crazy (What Did I Do)\n22. Old Devil Moon\n23. I&quot;m Just Taking My Time\n24. Nevertheless (I&quot;m In Love With You)\n25. My Heart Cries For You\n\nRecorded between 1952 and 1965. Includes liner notes by Joseph F. Laredo. Digitally remastered by Theresa Malham (MCA Music Media, North Hollywood, California). All tracks on Disc 1 are mono. All tracks on Disc 2 are stereo except The first significant reissue of the McGuire Sisters' classic recordings features 50 songs, covering the years 1952-1965 (the latter from their final ABC-Paramount album), remastered in the late 1990s and, at times, very impressive.  ... Full Description Their music can be an acquired taste, evocative as it is of a pre-rock &amp; roll environment and, indeed, competing at the time with R&amp;B acts on the same songs, such as &quot;Goodnight My Love&quot; and &quot;Sincerely.&quot; On the other hand, their singing is so radiant, that it's hard to find fault with too much of it. Producer Bob Thiele, who was responsible for guiding most of the recordings contained here, was the founder of the Signature Jazz label, among other top-flight independent jazz imprints, and he didn't slouch on getting the McGuires the best players. So even on numbers like &quot;Heart,&quot; which is pure pop, the playing has an edge that, coupled with their harmonies, makes the work compelling. Additionally, the quality of the masters brings out the Andrews Sisters-based edge in their singing: the McGuires come off like three trumpets, exactly like the Andrews Sisters only &quot;played&quot; with a bit more restraint. The overall sound is '50s pop, but with lingering traces in spots of the bounce and swing of '40s big-band. There is absolutely pure pop here, to be sure, such as &quot;He,&quot; but the surrounding numbers add bite to the contents where none is expected. The notes are very thorough, and the illustrations, recreating publicity photos and magazine appearances, are also impressive. Disc one is all mono, and disc two, covering the later part of their career, is largely stereo. ~ Bruce Eder Additional personnel includes: Murray Kane (vocal arranger); Dick Jacobs, Neal Hefti, Gordon Jenkins, Skip Martin (arranger). tracks 1 through 4 which are mono. Producer: Bob Thiele. Compilation producer: Marty Wesker. Adapter: Buddy Kaye. Audio Remasterer: Theresa Malham. Liner Note Author: Joseph F. Laredo. Recording information: 12/15/1952-11/02/1965. Photographer: Harru Langdon. Arranger: Lou Knox. McGuire Sisters: Christine McGuire, Dorothy McGuire, Phyllis McGuire (vocals)","torrent":{"xt":"urn:btih:b9293cbcd6b2cb8ff154a781a2bbb23a90eb6a13","amp;dn":"The+McGuire+Sisters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9293cbcd6b2cb8ff154a781a2bbb23a90eb6a13","infoHashBuffer":{"type":"Buffer","data":[185,41,60,188,214,178,203,143,241,84,167,129,162,187,178,58,144,235,106,19]},"announce":[],"urlList":[]}}