{"title":"Genius Code","uid":4701124,"size":260663568,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b9469d8463110ae755f82ac5c50cf9203f77ed5a&amp;dn=Genius+Code&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Rek0nn","files":105,"time":1233724111,"description":"\n                                                                               What if you were brighter than you think?\nHave you ever told yourself that you cannot do, be, or have something? Why then can someone\nelse enjoy more of the abundance that life has to offer? Imagine the excitement of owning\nunlimited resources in a private storage area and the key to access them. Human development\nexperts including biologists, neurologists, and neurocognitive scientists have shown that you\npossess inner resources enough to soar through life and make profound contributions in the world.\nIf you have been conditioned to believe less of yourself, then you may have been missing one key\nfactor. Think of it as your access code.\nWe have teamed up to reveal the amazing but simple secrets for discovering your personal access\ncode. Use these secrets to activate your capacities for genius. Although these secrets have been\ndescribed in great writings throughout the ages, virtually no one has ever taught them in school.\nNow we are ready to show you how easy it can be to access your own Genius Code. This personal\nlearning course will help you gain new tools for genius. In the true fashion of some of the world's\ngreatest thinkers, such as Galelleo, Davinci, Tesla, Edison, and Einstein, you will learn how to use\nyour mind for your own creative problem solving. With these approaches you will learn to think\nbroader and deeper and face challenges with new skills for decision making.\nAll that you find here is predicated on the notion that you are much brighter than you may think.\nYou have an astounding neurological heritage within you and vast abilities that can be used to\nimprove the quality of life for you, your family, friends, and community. It is our sincere desire\nthat you &quot;crack the code&quot; on how to receive the gifts of your brain's genius. Start using your\ngreater resources today so that you can enjoy the immediate and far-ranging benefits. Stay in touch\nthrough our Discussion Forum on our website to let us know about your successes.","torrent":{"xt":"urn:btih:b9469d8463110ae755f82ac5c50cf9203f77ed5a","amp;dn":"Genius+Code","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9469d8463110ae755f82ac5c50cf9203f77ed5a","infoHashBuffer":{"type":"Buffer","data":[185,70,157,132,99,17,10,231,85,248,42,197,197,12,249,32,63,119,237,90]},"announce":[],"urlList":[]}}