{"title":"Boubacar TraorÃƒÂ©  Mali Denohu (world blues)(mp3@320)[rogercc]","uid":6392785,"size":141881598,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b95338efca2e077c80b49b9bfde138ef994337c6&amp;dn=Boubacar+Traor%C3%83%C2%A9++Mali+Denohu+%28world+blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rogercc1","files":12,"time":1305408333,"description":"BOUBACAR TRAORE MALI DENOHU\nRelease Date: 7 Feb, 2011\nLabel:Lusafrica\nFormat: Mp3@320\n\nBoubacar TraorÃƒÂ©, who is called  Kar Kar Blouson Noir (Leather Jacket), is a Malian guitarist with a cult following. From his powerful voice and suave guitar come a blues which echoes with timeless sorrow,  just like blues should.\nIn the sixties. The people of Mali awoke each morning to the sound of his melancholy voice on the radio which sang of independence. Kar Kar, he was called &quot;black jacket&quot; and every person in Mali of his generation remembers having danced to his hits &quot;Mali Twist&quot; and &quot;Kayeba&quot; in which he encouraged his compatriots to return and build the country.\nHe was the Chuck Berry, the Elvis Presley of Mali, but since his music was only diffused on the radio, he didn't have enough pocket money to buy cigarettes. He worked as a tailor, a salesman and an agricultural agent, while at the same time training orchestras in the evenings and singing for his close friends. \nIn 1987, when television finally invites him into the studio, the Malian people cannot believe their eyes, everyone thought he had disappeared. Two years later, he is dealt a blow, Pierrette, his beloved wife to whom he sings his sweetest songs, dies. Disoriented, with a heavy heart, he leaves for France to work. On weekends, he sings in people's homes. His career takes on a new life. London discovers him, and he records two albums there, &quot;Mariama&quot; and &quot;Kar Kar'. He gives concerts in England, Switzerland, Canada and the United States. Studio Bogolan in Bamako, at the &quot;Revue Noire&quot; Initiative, produces his third album, &quot;Les Enfants de Pierrette&quot; (&quot;Pierrette's Children&quot;), with the participation of the big names in Malian music like Ali Farka TourÃƒÂ©, Toumani DiabatÃƒÂ© and KÃƒÂ©lÃƒÂ¨tigui DiabatÃƒÂ©. \nBoubacar TraorÃƒÂ© is one of these solid men who reflect the history of a country, the hopes and the despairs of a people. Not a Mercedes or a villa with golden chandeliers for this Malian blues man, but a moped and a concession in the hills of Bamako where he lives with Pierrette's children and where, in the evenings, he takes out his guitar and sings about the world which surrounds him. [/color]\nNotes taken from www.mali-music.com\n\nTracklist:\n1.  M'Badeou 6:05\n2.  Dundobesse M'Bedouniato 5:00\n3.  Mondeou 3:56\n4.  Mali Denhou 4:49\n5.  Minuit 4:14\n6.  Farafina Lolo Lora 5:38\n7.  Djougouya Niagnin 6:07\n8.  N'Dianamogo 6:12\n9.  Fama 5:38\n10. Kankan Baro 4:21\n11. Mali Tchebaou 6:32\n\n\n\n","torrent":{"xt":"urn:btih:b95338efca2e077c80b49b9bfde138ef994337c6","amp;dn":"Boubacar+Traor%C3%83%C2%A9++Mali+Denohu+%28world+blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95338efca2e077c80b49b9bfde138ef994337c6","infoHashBuffer":{"type":"Buffer","data":[185,83,56,239,202,46,7,124,128,180,155,155,253,225,56,239,153,67,55,198]},"announce":[],"urlList":[]}}