{"title":"The Last HOPE Conference Videos (Hacking Convention)","uid":4727217,"size":14309972360,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b95560600b834dc766a9be5bdc51a02da340cd30&amp;dn=The+Last+HOPE+Conference+Videos+%28Hacking+Convention%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1234814313,"description":"To start off, for those who do not know, HOPE (Hackers of Planet Earth) is a hacking convention held every other year, where there is numerous presentations by a variety of computer experts.  Fortunately, a few of them were able to be filmed, which is where this torrent comes in.\n\nContained in here is every torrent on this tracker:\nhttp://hopetracker.donthax.me/\n\nI put this here so it would have more peers, and download speed would be faster.  If any members of HOPE find this torrent, feel free to post it wherever.\n\nThis torrent already made its rounds on Demonoid, and I was surprised not to see this on TPB.\n\nThere are some very interesting topics covered in these videos, such as social engineering, general hacking, and stuff along those lines.  Adam Savage, and Kevin Mitnick also are in these videos.\n\nThe mp4 file runs fine on the VLC Media Player, which I included in the torrent.  If you don't want this program, simply don't download it.\n\nEven if you don't understand everything that is being talked about, most of these videos are still quite entertaining to watch.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:b95560600b834dc766a9be5bdc51a02da340cd30","amp;dn":"The+Last+HOPE+Conference+Videos+%28Hacking+Convention%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95560600b834dc766a9be5bdc51a02da340cd30","infoHashBuffer":{"type":"Buffer","data":[185,85,96,96,11,131,77,199,102,169,190,91,220,81,160,45,163,64,205,48]},"announce":[],"urlList":[]}}