{"title":"Erica KTTFK amateur bondage bdsm 233 pictures","uid":4360400,"size":8739506,"categoryP":"porn","categoryS":"pictures","magnet":"?xt=urn:btih:b9773df9a9e4e5680713726ec7309e7c44c7f5e9&amp;dn=Erica+KTTFK+amateur+bondage+bdsm+233+pictures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kttfkpics","files":1,"time":1219617287,"description":"FOR ADULTS ONLY WHO ARE NOT OFFENDED BY BDSM\n\nErica - Innocence Lost\nAge 21 (in the first pics but older in the later ones)\n\nThis picture collection of BDSM scenes are done with her consent and (C)Copyright KTTFK. All images in this zip file are low resolution pictures with her face slightly smudged. The small jpegs are images from some videos made with a digital camera.  A collection of higher resolution pictures with a clear face and \nmovie clips are available for private sale by writing for more information to:\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;167d6262707d667f756556717b777f7a3875797b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nFeel free to share this zip file on P2P networks and/or porn hosting sites and spread these pictures as it is our hope that it will enable us to sell more pics and enable me to make more pictures with other models. The higher resolution pictures and videos are not to be shared.  \n\nErica is a once in a lifetime type of girl. She was the most innocent person I have ever met. She has never showed her body to anyone before. Everything she did with me was her first. First fuck, orgasm, bondage, torture, nude pictures, you name it. She would give herself to me and let me use her any way that I wanted. She found the bondage scenes quite interesting and even after suffering for me she still wanted to do it more. I would tie her up and she would become a damsel in distress. She would squirm, she would try to escape, and she would moan when she was tortured. Even if she didn&amp;#039;t like it while it was happening, afterwards she would be grateful she did it. Her strongest orgasms happened when she was tortured and fondled against her will. She wouldn&amp;#039;t have sex any other way. If I didn&amp;#039;t have sex in a while it was nice as I could just tie her up and fuck her to my satisfaction. She was always nervous and shy. She could let go by giving her will to someone else. She would become my sex toy and give me her body for me to use. After she would be tired as I often groped, pinched, squeezed, poked, tickled, humped, vibrated her, and played with her cunt and tits for long periods of time. She would be so sexy trying to escape and squirm as I played with her. She would moan both in pleasure and pain. She would often be tied up and left to rest for long periods at a time. Many of these times she would be completely secured, blindfolded, and have her ears plugged. She found the sensory deprivation relaxing and would often be left in this state both before and after fucking her over and over. She hopes these images pleases others and that people will find them good enough that people will want to buy better quality versions of them.  \n","torrent":{"xt":"urn:btih:b9773df9a9e4e5680713726ec7309e7c44c7f5e9","amp;dn":"Erica+KTTFK+amateur+bondage+bdsm+233+pictures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9773df9a9e4e5680713726ec7309e7c44c7f5e9","infoHashBuffer":{"type":"Buffer","data":[185,119,61,249,169,228,229,104,7,19,114,110,199,48,158,124,68,199,245,233]},"announce":[],"urlList":[]}}