{"title":"The Doors - Waiting For The Sun (Perception Remaster) [EAC-FLAC]","uid":4470198,"size":409443908,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba4de408bceef3ccafd44c34bce80c2131303d5f&amp;dn=The+Doors+-+Waiting+For+The+Sun+%28Perception+Remaster%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"repopo","files":-1,"time":1225093389,"description":"*******************************************************************************\n             The Doors - Waiting For The Sun (Perception Remaster)\n*******************************************************************************\n\nThe Doors - Waiting For The Sun (Perception Remaster)\n\n01.- Hello, I Love You  [02:16]\n02.- Love Street  [02:52]\n03.- Not To Touch The Earth  [03:55]\n04.- Summer's Almost Gone  [03:22]\n05.- Wintertime Love  [01:54]\n06.- The Unknown Soldier  [03:25]\n07.- Spanish Caravan  [02:59]\n08.- My Wild Love  [02:52]\n09.- We Could Be So Good Together  [02:24]\n10.- Yes, The River Knows  [02:37]\n11.- Five To One  [04:28]\n12.- Albinoni's Adagio In G Minor  **  [04:33]\n13.- Not To Touch The Earth (Dialogue)  **  [00:39]\n14.- Not To Touch The Earth (Take 1)  **  [04:03]\n15.- Not To Touch The Earth (Take 2)  **  [04:17]\n16.- Celebration Of The Lizard (An Experiment - Work In Progress)  **  [17:06\n\n** = Bonus tracks, exclusive for this release\n\nCD Ripped using Exact Audio Copy.  Converted to FLAC using dbPowerAmp.  This album is part of the &quot;Perception&quot; box set, which enclosed all six studio \nalbums from The Doors, with bonus DVDs and a enhanced audio, specifically remastered for this box.\n\n-------------------------------------------------------------------------------\nReview by Bruce Eder (allmusicguide)\n\nThe Doors' 1967 albums had raised expectations so high that their third effort was greeted as a major disappointment. With a few exceptions, the material was much mellower, and while this yielded some fine melodic ballad rock in &quot;Love Street,&quot; &quot;Wintertime Love,&quot; &quot;Summer's Almost Gone,&quot; and &quot;Yes, the River Knows,&quot; there was no denying that the songwriting was not as impressive as it had been on the first two records. On the other hand, there were first-rate tunes such as the spooky &quot;The Unknown Soldier,&quot; with antiwar lyrics as uncompromisingly forceful as anything the band did, and the compulsively riff-driven &quot;Hello, I Love You,&quot; which nonetheless bore an uncomfortably close resemblance to the Kinks' &quot;All Day and All of the Night.&quot; The flamenco guitar of &quot;Spanish Caravan,&quot; the all-out weirdness of &quot;Not to Touch the Earth&quot; (which was a snippet of a legendary abandoned opus, &quot;The Celebration of the Lizard&quot;), and the menacing closer &quot;Five to One&quot; were also interesting. In fact, time's been fairly kind to the record, which is quite enjoyable and diverse, just not as powerful a full-length statement as the group's best albums.\n\nOriginally released as part of the completed recorded works 2006 box set Perception, this deluxe edition of the Doors' 1968 third album, Waiting for the Sun, is a double-disc set containing one CD featuring a newly remastered version of the album with bonus tracks and a DVD with a 5.1 Surround mix, bonus video footage, and a photo gallery. Given that the Doors catalog was remastered just seven years before this box, the sonics of these 2006s remasters are noticeable but not radically different -- the kind of subtle remastering that is significant to audiophiles who know this music intimately. Of all the 2006 Doors reissues, this is one of the discs that contains the most bonus tracks: &quot;Albinoni's Adagio in G Minor,&quot; a stretch of dialogue before two takes of &quot;Not to Touch the Earth,&quot; then a 17-minute &quot;Celebration of the Lizard.&quot; The bonus videos contain a Hollywood Bowl performance of &quot;Spanish Caravan&quot; from 1968 and a Denmark performance of &quot;The Unknown Soldier&quot; from the same year. While there are no huge revelations here, apart from arguably &quot;Celebration of the Lizard,&quot; this deluxe edition nevertheless lives up to its title: this is the best-sounding, best-presented reissue of this album yet.\n\nAbout the album (from Wikipedia)\n\n-------------------------------------------------------------------------------\nHELLO, I LOVE YOU\n\nHello, I Love You was both the lead off track as well as the A-side of the Doors first single from Waiting For The Sun (1968). The reality, however, is that the song actually pre-dates the bands 1967 self-titled debut album. It was one of the half-dozen tunes that a pre- Robbie Krieger (guitar) band cut during a demo session at World Pacific studios in 1965. This primordial rendering can be found on the four-CD Doors Box Set (1997) as well as the honed down Essential Rarities (2000) compilation. The catchy opening riff -- which has been cited as being structurally similar to the Kinks All Day And All Of The Night -- is not only one of the most recognizable in the Doors cannon, but also in the entire classic rock sub-genre. By the time the band had re-recorded the track, the song had been fleshed out by a tighter arrangement -- highlighted by some tremendous ensemble work. This very pop-oriented tune also demonstrates the multiplicity of the Doors as both a definitive envelope-pushing and conscious-shattering psychedelic band and a straight-ahead 60s pop/rock combo. According to drummer John Densmore, Morrisons lyrical inspiration came from a real incident involving a rare bout of shyness. His inability to approach a girl that he wanted to get to know, ultimately became his muse for this lyric. Hello, I Love You was performed sporadically by the band with notable versions from the Hollywood Bowl on July 05, 1968 and Frankfurt, Germany on September 14, 1968 -- both of which are readily available amongst enthusiasts and tape traders.\n\nIn the liner notes to The Doors Box set, Robbie Krieger has denied the allegations that the song's musical structure was stolen from Ray Davies, where a riff similar to it is featured in the song &quot;All Day and All of the Night&quot;. Instead, he said the song's vibe was taken from Cream's song &quot;Sunshine of Your Love&quot;. Krieger's involvement in the song's writing process is debatable, much due to the fact the song was first recorded in mid-1965, prior to Krieger joining the band.\n\nThe last verse was written by Jim Morrison, three years prior to the album recordings, while he was observing an attractive African-American woman at Venice Beach.\n\n    &quot;Sidewalk crouches at her feet,\n    like a dog that begs for something sweet,\n    do you hope to make her see you, fool,\n    do you hope to pluck this dusky jewel&quot;\n\n\nLOVE STREET\n\nThis spry and melodic ballad was first included on the Waiting For The Sun (1968) LP. As is often the case with Doors compositions, Love Street embraces several different pop styles simultaneously. Jim Morrison derived inspiration for this fictitious location from the very real Rothdell Trail -- located near the Beverly Glen section of Los Angeles, in Laurel Canyon, California where Jim Morrison lived with his girlfriend Pamela Courson.\n\nLyrically, the song is fairly straightforward and with a bit of poetic license, depicts an idyllic setting for a budding romance. The she is Morrisons girlfriend/wife Pamela Courson, the house and garden are located in the 8000 block of the previously mentioned Rothdell Trail and the store where the creatures meet is actually called the Canyon Country Store (2108 Lauel Canyon Blvd.). Morrison also lobs a few incongruous lines -- such as his response I guess I like it fine  so far to a seemingly tacit inquiry.\n\nThe melody is lilting and suggests a Baroque Pop feel -- especially with Ray Manzareks intricate and melodic keyboard work during the bridges. The painfully understated and jazzy supporting fretwork from Robbie Krieger at times practically gets lost behind John Densmores steady drumming and Manzareks upfront leads and interjections.\n\nAs well as its inclusion on Waiting For The Sun, Love Street was also issued on the flip side of Hello I Love You. Additionally, there is practically no live performance history. The most widely circulating concert rendition is from the early show on September 20, 1968 at the Konserthuset in Stockholm, Sweden.\n\n\nNOT TO TOUCH THE EARTH\n\nIt stems from Jim Morrison's poem, &quot;Celebration of the Lizard&quot;. A recording of the complete poem was attempted at the sessions for the album, but only the musical passage Not to Touch the Earth was deemed fit for release. The poem was released on the album sleeve in written form. The complete poem was released in 2003 on the Legacy: The Absolute Best compilation, and the re-issue of Waiting for the Sun.\n\nThe song begins, &quot;Not to touch the earth, not to see the sun...&quot; These are subchapters of the 60th chapter of The Golden Bough by James Frazer. The chapter is called &quot;Between Heaven and Earth&quot;, with subchapter 1, &quot;Not to Touch the Earth&quot;, and subchapter 2, &quot;Not to See the Sun&quot;. These subchapters detail taboos against certain people (generally royalty or priests) walking upon the ground or having the sun shine directly upon them. Frazer had noted that these superstitions were recurring throughout many primitive cultures, and appeared to be related to traditions and taboos concerning menarche and the thereby following female initiation rites. Frazer's work was an influence on Morrison, according to the biography No One Here Gets Out Alive.\n\n\nSUMMER'S ALMOST GONE\n\nThe song was covered by pianist George Winston on his album Night Divides the Day - The Music of the Doors.\n\nThe song was also recorded on the 1965 World Pacific Demo, a six-track demo recorded on September 2, 1965, by Rick &amp; the Ravens. The arrangement on the earlier version is remarkedly different from the one published on this album.\n\n\nUNKNOWN SOLDIER\n\nOne of the Doors' most complex recordings, &quot;Unknown Soldier&quot; was one of the most literate anti-war statements of its era. Utilizing various recorded sections, the song is a mini-medley. It opens with an eerie organ intro before moving into a jazzy first verse, which describes the war being fed through the media to suburban America. A brilliant and dramatic middle section is actually a studio-recreated firing squad, complete with shots. The second verse is a slightly harder-rocking version of the first. The song then erupts into a climatic, extended coda, which is the audio re-creation of the celebration of either victory or the END of war. Quite a little cinematic drama, and rendered with style and sense of reality.\n\nIt was the first single from The Doors' 1968 album Waiting for the Sun, and was also the subject of one of the band's few, inventive music videos. The song was Jim Morrison's reaction to the Vietnam War and the way that conflict was portrayed in American media at the time. Lines such as, &quot;Breakfast where the news is read/Television children fed/ unknown living, living dead/bullets strike the helmet's head&quot;, concern the way news of the war was being presented in the living rooms of ordinary people.\n\nIn the middle of the song, the Doors produce the sounds of what appears to be an execution; in live performances Robby Krieger would point his guitar towards Morrison like a rifle, drummer John Densmore would emulate a gunshot by producing a loud rimshot, by hitting the side of the cymbal, therefore, breaking the sticks to the drum set, and Morrison would fall screaming to the ground. After this middle section, the verses return and the song ends with Morrison's ecstatic celebration of a war being over. In the studio version of the song, the sounds of crowds cheering, and bells tolling, can be heard.\n\nThe single for Unknown Soldier was a commercial disappointment as it reached only #39 in the US, possibly due to its controversial theme and downbeat atmosphere. However the second single from Waiting for the Sun, Hello, I Love You, went all the way to the top of the charts.\n\nSPANISH CARAVAN\n\nIts basic flamenco track is an established form of flamenco music known as Granadinas. This melodic contour and free flowing rhythm is from Granada city of the Alhambra. Its delicate and syncopated minors reveal its oriental Islamic heritage. This city and province was the last stronghold of the Moors in Southern Spain until 1492. Descended from the Fandango this beautiful flamenco rhythm is tinged with melancholy and resignation. Manitas de Plata, uncle of the Gypsy Kings and Paco Pena both play this form with great passion and feeling.\n\n\nWE COULD BE SO GOOD TOGETHER\n\nappearing as the ninth song on their 1968 album, Waiting for the Sun. The song has been described (fx in No One Here Gets Out Alive) as lead singer Jim Morrison's way of telling his audience what kind of world they would be able to create if they simply tried.\n\nA review in Slant Magazine described the song as &quot;categorically pre-fame Morrison&quot; (&quot;The time you wait subtracts from joy&quot; is the kind of hippie idealism he'd long given up on), thus implying that this is one of the songs that The Doors had written long before the recording sessions for their third album, and that it is among those pieces, which hadn't already been used on The Doors or Strange Days.\n\n\nFIVE TO ONE\n\nThe closing track to the Doors' Waiting for the Sun album came at a time when the band certainly knew that their audience was looking for messages from them, and they didn't fail to deliver. Whether or not this is what they wanted to hear is another thing. The song is, on the surface, a message for mass revolution. However, upon close listening, it puts down the flower generation for being weak and unable to organize their own individual heads. Musically, it has a menacing, proto-heavy metal guitar and organ riff. On top of that, John Densmore's relentless, almost march-rhythm drums take the song through various sections with a convincing power. \n\nThe title is rumored to be the approximate ratio of Viet Cong to American troops in Vietnam, whites to blacks, young to old, or non-pot smokers to pot smokers in the US in 1967, depending on whom you ask. A further urban legend has it as the ratio of Viet Cong to American troops in Vietnam. However, when asked, Jim Morrison said the lyrics were not political. He was so drunk when he recorded this song, he needed help from the studio staff on when to begin singing. If you listen closely, you can hear someone in the background say &quot;One more&quot; before Jim starts his first verse. The opening part (&quot;Yeah, c'mon - I love my girl. She lookin' good...&quot;) is some of Jim's nonsensical drunk rambling. Morrison got the idea for this while waiting in the audience before performing a concert in 1967. On bootlegs of live recordings, Morrison included the phrase &quot;fucked up&quot; in the spoken word section at the end. He frequently swore at live shows, but the studio albums were originally either curse-free or censored.\n\nThe song's most famous performance was at the 1969 Miami concert at the Dinner Key Auditorium. Towards the end of the performance, a drunken Morrison declared the audience &quot;idiots&quot; and &quot;slaves&quot;. The concert would end with Morrison being accused of &quot;attempting to incite a riot&quot; among the concert goers, resulting in his arrest, and later conviction, for indecent exposure. This performance can be heard on Disc 1 of The Doors: Box Set and is depicted in Oliver Stone's film 'The Doors'.\n\nRobbie Krieger recorded a version of this song with Marilyn Manson for the 2000 Doors tribute album Stoned Immaculate: The Music of the Doors. It did not end up on the album, but was featured on both Manson's singles: 'Disposable Teens' and 'The Fight Song' as a b-side.\n\nIn 2000, the surviving members of the Doors taped a VH1 Storytellers episode with guest vocalists filling in for Morrison. Scott Weiland from Stone Temple Pilots sang on this recording. Weiland stated the song is what inspired him to begin his rock career.\n\nJay-Z sampled &quot;Five to One&quot; on his 2001 diss track &quot;Takeover&quot;. The track was produced by Kanye West, a well known producer whose production often uses old rock or R&amp;B songs in hip-hop records. Mos Def also sampled the song on the track The Rape Over off his 2004 album The New Danger.\n\nA very drunk Jim Morrison after some extremely obscene verses (later entitled &quot;Uranus Rock&quot; which describes quite accurately the subject matter) groaned the last verse of this, during a blues Jam with Jimi Hendrix, Lester Chambers &amp; others at the Scene Club NY in 1968[citation needed]\n\nThe song has also been covered by Alien Sex Fiend\n\n\n-------------------------------------------------------------------------------\nInfo taken from allmusicguide and wikipedia\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:ba4de408bceef3ccafd44c34bce80c2131303d5f","amp;dn":"The+Doors+-+Waiting+For+The+Sun+%28Perception+Remaster%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba4de408bceef3ccafd44c34bce80c2131303d5f","infoHashBuffer":{"type":"Buffer","data":[186,77,228,8,188,238,243,204,175,212,76,52,188,232,12,33,49,48,61,95]},"announce":[],"urlList":[]}}