{"title":"Mighty Sam McClain - 2000 - Blues For The Soul FLAC","uid":10078407,"size":328460168,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba5ed901002203f0eab866bab08361136db4423b&amp;dn=Mighty+Sam+McClain+-+2000+-+Blues+For+The+Soul+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1398951911,"description":"Mighty Sam McClain - 2000 - Blues For The Soul\n\nVocalist Mighty Sam McClain is a specialist in Southern soul-blues, one of the original masters from the 1960s, when the music enjoyed its peak popularity. He carries on the tradition of vocalists like Bobby Bland, Solomon Burke, Otis Clay, James Carr, and Otis Redding. His excellent '90s recordings are now widely available, but that wasn't always the case. Like so many other soul-blues vocalists, McClain began singing gospel in his mother's choir when he was five. At 13, owing to disagreements with his stepfather, he left home and lived with grandparents for a while before hooking up with Little Melvin Underwood. He worked with Underwood first as a valet and later as a featured vocalist in his road show. His inspirations included Little Willie John, Clyde McPhatter of the Drifters, B.B. King, and Bobby &quot;Blue&quot; Bland. McClain recalled seeing Bland at the city auditorium in Monroe, Louisiana as a revelatory moment. Years later, McClain would open for Bland at Tipitina's, a blues club in New Orleans. To this day, he considers Bland's nod of approval a high point of his career.\nWhile working at the 506 Club in Pensacola, Florida in the mid-'60s, he was introduced to producer and DJ Don Schroeder. Working with Schroeder, he recorded Patsy Cline's hit &quot;Sweet Dreams.&quot; After this, several other visits to Muscle Shoals Studios in Alabama yielded singles like &quot;Fannie Mae&quot; and &quot;In the Same Old Way.&quot; McClain continued to create an ever-broadening audience for his singing via his engagements at the 506 Club and later at the Apollo Theater in Harlem. He recorded a single for Malaco and two singles for Atlantic in 1971 before falling off the music scene for a while.\nFor the next 15 years or so, McClain took menial day jobs, living in Nashville and New Orleans. The Neville Brothers and others from the Crescent City scene have been credited with helping him revive his career as a singer. McClain met Mason Ruffner's drummer Kerry Brown, and the two put a band together. Shortly after, they recorded a single for Carlo Ditta's Orleans label, and McClain's recording and performing career was rejuvenated. After recording with Hubert Sumlin on Hubert Sumlin's Blues Party for the BlackTop label in 1987, McClain began to re-establish his former reputation as a great soul-blues singer, touring with Sumlin and his entourage. By the late '80s, McClain had moved from Houston to Boston. For most of the years thereafter, he lived in Boston and southern New Hampshire.\nMcClain didn't record his first studio album under his own name until he was 50, through his Boston drummer Lorne Entress, who made a connection with the California-based Audioquest label. McClain's Audioquest albums include Give It Up to Love (1992), Keep on Moving (1995), and Sledgehammer Soul and Down Home Blues (1996), the last nominated for a W.C. Handy Award. All received rave reviews from the critics, and for the first time in his life, he was in control of his own song publishing rights. Most of the songs on all three albums utilized a full horn section, and on top of this rode McClain's deep, powerful vocals, oftentimes in self-penned songs.\nBlues for the Soul (2000) was issued on Sundazed, and Sweet Dreams followed on Telarc in 2001. Starting his own label, Mighty Music Records, McClain released One More Bridge to Cross on the new imprint in 2003, following it with Betcha Didn't Know in 2009. The Norwegian label Kirkelig Kulturverksted assisted in the release of 2010's Scent of Reunion: Love Duets Across Civilizations and the following year's One Drop Is Plenty.\n\nTrack list:\n01 - All We Need Is Love\n02 - Dark Side Of The Street\n03 - Love One Another\n04 - Going Back To New Orleans\n05 - No One Can Take Your Place\n06 - Jesus Got The Blues\n07 - Sweet Lady\n08 - Battlefield Of Love\n09 - Mighty's Prayer\n10 - Sing Me Some Blues\n11 - Can't Stand It\n12 - Not I\n\nPersonnel:\nJim Arnold, Drums\nKevin Belz, Guitar\nJoe Casano, Trumpet\nJoe Cassano, Trumpet\nTim Ingles, Bass\nBruce Katz, Organ (Hammond), Piano\nMighty Sam McClain, Composer, Performer, Primary Artist, Producer, Vocals\nWalter Platt, Composer, Horn Arrangements, Trumpet\nBarry Seelen, Organ (Hammond) \n\nEnjoy and share!","torrent":{"xt":"urn:btih:ba5ed901002203f0eab866bab08361136db4423b","amp;dn":"Mighty+Sam+McClain+-+2000+-+Blues+For+The+Soul+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba5ed901002203f0eab866bab08361136db4423b","infoHashBuffer":{"type":"Buffer","data":[186,94,217,1,0,34,3,240,234,184,102,186,176,131,97,19,109,180,66,59]},"announce":[],"urlList":[]}}