{"title":"Tree-Structure based Hybrid Computational Intelligence","uid":6535877,"size":3255170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb20dad929f4e0cad71a0a4fa028ce089d02de58&amp;dn=Tree-Structure+based+Hybrid+Computational+Intelligence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1310508139,"description":"Yuehui Chen, Ajith Abraham, &quot;Tree-Structure based Hybrid Computational Intelligence: Theoretical Foundations and Applications&quot; \n Sp,,,er | 2009 | ISBN: 3642047386 | 210 pages | PDF | 3.1 MB \n\n Research in computational intelligence is directed toward building thinking machines and improving our understanding of intelligence. As evident, the ultimate achievement in this field would be to mimic or exceed human cognitive capabilities including reasoning, recognition, creativity, emotions, understanding, learning and so on. In this book, the authors illustrate an hybrid computational intelligence framework and it applications for various problem solving tasks. Based on tree-structure based encoding and the specific function operators, the models can be flexibly constructed and evolved by using simple computational intelligence techniques. The main idea behind this model is the flexible neural tree, which is very adaptive, accurate and efficient. Based on the pre-defined instruction/operator sets, a flexible neural tree model can be created and evolved.\n\n This volume comprises of 6 chapters including an introductory chapter giving the fundamental definitions and the last Chapter provides some important research challenges. Academics, scientists as well as engineers engaged in research, development and application of computational intelligence techniques and data mining will find the comprehensive coverage of this book invaluable.","torrent":{"xt":"urn:btih:bb20dad929f4e0cad71a0a4fa028ce089d02de58","amp;dn":"Tree-Structure+based+Hybrid+Computational+Intelligence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb20dad929f4e0cad71a0a4fa028ce089d02de58","infoHashBuffer":{"type":"Buffer","data":[187,32,218,217,41,244,224,202,215,26,10,79,160,40,206,8,157,2,222,88]},"announce":[],"urlList":[]}}