{"title":"Ian Worthington - By the Spear [2014][A]","uid":10348214,"size":10982825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb73741a20510d967049495fa697e832ba86a4a0&amp;dn=Ian+Worthington+-+By+the+Spear+%5B2014%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1402635326,"description":"Description\nProduct Details\nBook Title: By the Spear: Philip II, Alexander the Great, and the Rise and Fall of the Macedonian Empire (Ancient Warfare and Civilization)\t\nBook Author: Ian Worthington (Author)\nSeries: Ancient Warfare and Civilization\nHardcover: 416 pages\nPublisher: Oxford University Press (June 2, 2014)\nLanguage: English\nISBN-10: 0199929866\nISBN-13: 978-0199929863\n\n===================================================================================\nBook Description\nPublication Date: June 2, 2014\nAlexander the Great, arguably the most exciting figure from antiquity, waged war as a Homeric hero and lived as one, conquering native peoples and territories on a superhuman scale. From the time he invaded Asia in 334 to his death in 323, he expanded the Macedonian empire from Greece in the west to Asia Minor, the Levant, Egypt, Central Asia and &quot;India&quot; (Pakistan and Kashmir) in the east. Although many other kings and generals forged empires, Alexander produced one that was without parallel, even if it was short-lived.\nAnd yet, Alexander could not have achieved what he did without the accomplishments of his father, Philip II (r. 359-336). It was Philip who truly changed the course of Macedonian history, transforming a weak, disunited, and economically backward kingdom into a military powerhouse. A warrior king par excellence, Philip left Alexander with the greatest army in the Greek world, a centralized monarchy, economic prosperity, and a plan to invade Asia.\nFor the first time, By the Spear offers an exhilarating military narrative of the reigns of these two larger-than-life figures in one volume. Ian Worthington gives full breadth to the careers of father and son, showing how Philip was the architect of the Macedonian empire, which reached its zenith under Alexander, only to disintegrate upon his death. By the Spear also explores the impact of Greek culture in the East, as Macedonian armies became avatars of social and cultural change in lands far removed from the traditional sphere of Greek influence. In addition, the book discusses the problems Alexander faced in dealing with a diverse subject population and the strategies he took to what might be called nation building, all of which shed light on contemporary events in culturally dissimilar regions of the world. The result is a gripping and unparalleled account of the role these kings played in creating a vast empire and the enduring legacy they left behind.\n\n===================================================================================\nReviews\n&quot;Most histories extolling Alexander the Great pay modest attention to his father, Philip II, but Worthington gives him equal billing in this admirable, scholarly dual biography.&quot; --Kirkus Reviews\n\n&quot;Ian Worthington is one of this generation's leading historians of ancient Greece and Macedonia. In this book he provides for the first time in a single volume a comparative perspective on Philip and Alexander's empire building, and he admirably succeeds in making this complex and convoluted story accessible to the uninitiated.&quot; --Joseph Roisman, author of Alexander's Veterans and the Early Wars of the Successors\n\n&quot;As Ian Worthington reminds us, without Philip II there would have been no Alexander the Great, and by considering together the accomplishments and foibles of both father and son, By the Spear raises a larger question: do great conquerors make great kings? Alexander inherited the legacy of Philip--an ascendant Macedonian empire--but what was the legacy of Alexander, and to whom was it left? By considering the larger picture, Worthington provides new insight into one of ancient history's most fascinating sagas.&quot; --Steven Saylor, author of Raiders of the Nile and Roma: A Novel of Ancient Rome\n\n&quot;The Macedonian empire that reshaped the Mediterranean world was the creation of two remarkable men. Worthington's provocative thesis is that Alexander was a conqueror whose legacy was chaos. Philip was a king who left Alexander the basis of empire. Was the father, then, greater than the son? By the Spear offers an unconventional answer in a narrative that is both persuasive and engaging.&quot; --Dennis Showalter, author of Armor and Blood: The Battle of Kursk\n\n&quot;What father-son duo is more mesmerizing than Philip and Alexander of Macedon? Too often historians have focused on one, marginalizing the other, thus Ian Worthington's even-handed treatment of both is to be celebrated. Concise yet clear, Worthington masterfully explores Philip's career and the dazzling, violent, and world-changing reign of his son.&quot; --Lawrence A. Tritle, author of A New History of the Peloponnesian War\n\n===================================================================================\nAbout the Author\nIan Worthington is Curators' Professor of History and Adjunct Professor of Classical Studies at the University of Missouri. He is the author of numerous books about ancient Greece, including, most recently, Demosthenes of Athens and the Fall of Classical Greece.\n===================================================================================","torrent":{"xt":"urn:btih:bb73741a20510d967049495fa697e832ba86a4a0","amp;dn":"Ian+Worthington+-+By+the+Spear+%5B2014%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb73741a20510d967049495fa697e832ba86a4a0","infoHashBuffer":{"type":"Buffer","data":[187,115,116,26,32,81,13,150,112,73,73,95,166,151,232,50,186,134,164,160]},"announce":[],"urlList":[]}}