{"title":"Leyla McCalla - Vari-Colored Songs [2014] [EAC/FLAC]","uid":10397136,"size":227778686,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bbbdb49713884bcda44d223b1fbd84c8f1cce7d4&amp;dn=Leyla+McCalla+-+Vari-Colored+Songs+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":-1,"time":1403279832,"description":"FLAC / Lossless / Log 100%/ Cue\nLabel/Cat#: Fat Possum / Music Maker #MMCD 142\nCountry: USA\nYear: February 4, 2014\nGenre: Folk,blues\nFormat: CD,Album\n\n\n\n\n\nHeart of Gold\nWhen I Can See the Valley\nMesi Bondye\nGirl\nKamen sa w fe ?\nToo Blue\nManman Mwen\nSong for a Dark Girl\nLove Again Blues\nRose Marie\nLatibonit\nSearch\nLonely House\nChanging Tide\n\n\n\n\nThe daughter of Haitian immigrant parents, Leyla McCalla, whether by design or synchronicity, moved to New Orleans in 2010 after studying cello performance and chamber music at New York University, and once there, while busking and playing on the street corners and in the bars and clubs, she fell in love with Louisiana Creole culture, and coupled with her further explorations of Haiti's traditional Creole folk music, she developed a strong and grounded musical vision, part old and traditional and part bohemian intellectual. As this debut solo album (she was featured on the Carolina Chocolate Drops' Leaving Eden album and has toured extensively with them) shows, it's a mix that McCalla balances well, with most of the tracks featuring her musical arrangements of various Langston Hughes poems, along with striking personal versions of a couple of traditional Haitian folk songs. If this sounds like things here will be a little stiff and academic, well, they're not, as McCalla makes the Hughes lyrics her own, and the sparse, haunting feel of these tracks is timeless, belonging to this century but feeling like they could have come from early in the century before, too, or even the one before that, a kind of musical hat trick that is pretty impressive, to say the least. McCalla's voice is warm and just slightly jazz-tinged, and she plays sparse tenor banjo and acoustic guitar on some of the cuts here, but it is her cello playing that gives the album its unique sound, all warm and round and ominous somehow, taking the stark arrangements to deep emotional places. The opener, &quot;Heart of Gold,&quot; sets the tone, spare and yet expansive, and tracks like the tenor banjo-led &quot;Mesi Bondye&quot; and the swinging acoustic guitar blues &quot;Too Blue&quot; give the set list some variety. McCalla's debut solo album is a fully realized and nuanced gem, and one can't help but be interested and curious about her next musical project.\n","torrent":{"xt":"urn:btih:bbbdb49713884bcda44d223b1fbd84c8f1cce7d4","amp;dn":"Leyla+McCalla+-+Vari-Colored+Songs+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbbdb49713884bcda44d223b1fbd84c8f1cce7d4","infoHashBuffer":{"type":"Buffer","data":[187,189,180,151,19,136,75,205,164,77,34,59,31,189,132,200,241,204,231,212]},"announce":[],"urlList":[]}}