{"title":"Footprints on the Moon - Apollo 11 (1969) x264 MP4","uid":9486791,"size":1167289052,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc21f0286f244f39a75a2046c28ea76c69f725cf&amp;dn=Footprints+on+the+Moon+-+Apollo+11+%281969%29+x264+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"KeepPortlandWeird","files":-1,"time":1389908878,"description":"Footprints on the Moon (full title: Footprints on the Moon: Apollo 11) is a 1969 documentary film covering the flight of Apollo 11 from vehicle rollout to splashdown and recovery. It was directed by Bill Gibson and produced by Barry Coe (neither of whom have any other credits listed on the IMDB, and is narrated by Wernher von Braun, with Pierre Jalbert doing additional voiceover as Jules Verne. It is largely assembled from a variety of NASA and other news footage, with montage scenes assembled from still images standing in where no motion picture footage exists. The score includes Philip Moody's Laguna Concerto, a short work for piano and orchestra.[3]\n\nAlthough Footprints on the Moon has the distinction of being the only contemporary theatrically released documentary of Apollo 11, it lay almost forgotten (except for an occasional showing on television) for decades, until it was finally released on DVD in early 2010,[4] missing the 40th anniversary of the Apollo 11 landing by less than a year.\n\nThe saga of Neil Armstrong, Col. Edwin Buzz Aldrin and col. Michael Collins and the events leading up to the historic week in July, 1969, is recreated in FOOTPRINTS ON THE MOON. This color film traces the space odyssey of Astronauts Armstrong, Aldrin and Collins from the tense preparation during the weeks before blastoff through the magnificent descent into the black shadow on the moon s surface, to final splashdown in the Pacific Ocean. Footprints on the Moon contains footage filmed by the astronauts themselves as well as the vast film crew assembled at Cape Kennedy and the Houston Space Center. Directed by William Gibson, the film also includes television transmissions from space, many of which have never been seen by the general public. The screenplay by aerospace writer and consultant Robert Scott compares the Apollo moonflight with man s age-old dreams of space travel. Particularly as envisioned by Jules Verne 145 years ago. From the prologue to the final fade-out, the text illuminates, in its compression of events, man s greatest journey of all time. Opening with the launch at Cape Kennedy, Footsteps on the Moon shows a never-before filmed separation of the stages of the Saturn rocket and the actual descent and landing on the moon. Exciting footage of the moonwalk and the spectacular docking with the command module is also included. Noted space architect Werner Von Braun served in a dual capacity as technical advisor and narrator of this historic film document.","torrent":{"xt":"urn:btih:bc21f0286f244f39a75a2046c28ea76c69f725cf","amp;dn":"Footprints+on+the+Moon+-+Apollo+11+%281969%29+x264+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc21f0286f244f39a75a2046c28ea76c69f725cf","infoHashBuffer":{"type":"Buffer","data":[188,33,240,40,111,36,79,57,167,90,32,70,194,142,167,108,105,247,37,207]},"announce":[],"urlList":[]}}