{"title":"Achtung.Panzer.Kharkov.1943-SKIDROW (No Rar)","uid":5391811,"size":1200517531,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bc3aa52dfbcffbfdfc6b6e169d9aa678c6753097&amp;dn=Achtung.Panzer.Kharkov.1943-SKIDROW+%28No+Rar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"thenoobish","files":3,"time":1267093426,"description":"Eboy\n\nS   K   i   D   R   O   W\n\n-  T H E   L E A D i N G   F O R C E   -\n\nproudly presents\nAchtung Panzer Kharkov 1943 / Paradox Interactive\n\nRELEASE DATE : 25-02-2010           PROTECTION : Nothing\nGAME TYPE    : Strategy             DISKS      : 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks.\nWere a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We dont earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties.\n\nIf you think you got something to offer, then dont hold back\non contacting us as soon as possible.\n\n\n\ntwice the fun   / double the trouble\n\n\nOn with the game release information:\n\nThe year is 1943. The Wehrmacht has begun Operation Hawk in an\nattempt to capture Kharkov with its steel claws. The SS\nDivision Totenkopf has moved forward to crush the Soviet tank\nforces, but the Red Army has held the line, digging in and\nputting up a fierce resistance. In response, German tank\narmies have renewed their offensive with Operation Panther,\nand Soviet tank crews are now finding themselves severely\noutnumbered.\n\nWant to step into the role of a commander in the very heart of\nKharkovs defense? Youll have everything the officers had\nback then: tanks, guns, and fearless soldiers. The success of\neach opposing force hangs in the balance every day. Your\ndecisions will determine who wins the Battle of Kharkov.\n\nHigh replayability and flexible AI: smart AI analyzes the\nplayers tactical movements and chooses the best strategy based\non behavior rather than a script. Scenarios can be replayed\nusing different tactics, as though playing against a human\nopponent\n\nPainstaking reconstruction of Kharko in scope and size\n\nDetailed recreation of weapons, artillery, and vehicles: all\nbattle characteristics, including missile trajectories and\ncrew numbers, have been modelled according to archived\nmilitary records and WW2 chronicles\n\nDynamic day, night and weather effects, all of which affect\ncombat through terrain traversability, battlefield visibility,\nhidden force capabilities, and more\n\nDestructible environment: nearly everything can be blasted and\ndestroyed, from ground terrain to houses and enemy defenses.\nAll traces of previous battles (shell holes, broken vehicles,\ncorpses, etc.) remain on the battlefield\n\nRealistic ballistics: bullets and projectiles follow accurate\ntrajectories. Proper shot longitude, number of frags, and\ntheir range are calculated\n\nComprehensive vehicle damage system: engine, suspension,\nweapons, and aiming mechanisms can all be damaged separately,\naffecting the combat capabilities of the vehicle\n\nReal soldier behavior: every soldier has several basic\nparameters, such as experience level, fatigue, and morale,\nwhich affect their behavior and effectiveness\n\nMilitary encyclopedia with 3D model viewer and detailed data\non all units, describing their historical and in-game\ncharacteristics\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Play the game\n\nSupport the companies, which software you actually enjoy!\n\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by [XXX]","torrent":{"xt":"urn:btih:bc3aa52dfbcffbfdfc6b6e169d9aa678c6753097","amp;dn":"Achtung.Panzer.Kharkov.1943-SKIDROW+%28No+Rar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc3aa52dfbcffbfdfc6b6e169d9aa678c6753097","infoHashBuffer":{"type":"Buffer","data":[188,58,165,45,251,207,251,253,252,107,110,22,157,154,166,120,198,117,48,151]},"announce":[],"urlList":[]}}