{"title":"SourceTec Software Sothink SWF Decompiler v7.4.5263 Multilangual","uid":8370871,"size":55352394,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bd6f40913d23d452efe74b030233e33adada4ec1&amp;dn=SourceTec+Software+Sothink+SWF+Decompiler+v7.4.5263+Multilangual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":9,"time":1365910554,"description":"Sothink SWF Decompiler \n\nIf you work with Flash movies on a daily basis, than you know what price to put on a tool that has the capability to decompile SWF files. A decent tool of this sort never comes for free, especially one that can also convert Flash files to FLA or HTML5 format.\n\nSothink SWF Decompiler is a popular and highly appreciated application that can do all that for a decent price. Deploying it on your system is a question of a few seconds, a minute tops. The interface is ribbon inspired and consists of five main tabs that encase all of its features. The main window is divided into several sections that include a file explorer to locate the Flash files, a preview of the elements contained by the SWF video and an area dedicated to exporting the files to FLA or HTML5 format.\n\nSothink SWF Decompiler strips Flash files to their very core and will list all the shapes, images, fonts, texts and frames that it may contain. You can choose individually which of these you want to export and the actual process takes only a couple of seconds. Sothink SWF Decompiler can also be used to extract all the resources to SWF, SWG or GLS format (used by Sothink SWF Easy).\n\nThe software also allows you to edit the current Flash file, by replacing the existing resources with items of your own choice. Another valuable feature is the EXE to SWF extractor, which converts executable files to Flash format .\n\nSothink SWF Decompiler was designed to enable users to explore even the tiniest detail in any Flash file. All the components are displayed in groups, allowing you to manually pick the ones to be exported to FLA format or HTML5 animations. It makes Flash processing easier and this is what recommends it as one of the most ferocious decompilers out there.\n\nSupported OS:\n\nWindows All\n\nHomepage: http://www.sothink.com/product/flashdecompiler/\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:bd6f40913d23d452efe74b030233e33adada4ec1","amp;dn":"SourceTec+Software+Sothink+SWF+Decompiler+v7.4.5263+Multilangual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd6f40913d23d452efe74b030233e33adada4ec1","infoHashBuffer":{"type":"Buffer","data":[189,111,64,145,61,35,212,82,239,231,75,3,2,51,227,58,218,218,78,193]},"announce":[],"urlList":[]}}