{"title":"Springer Handbook of Nanotechnology 2nd ed","uid":15005396,"size":97651912,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bdaa3c3458eecf060ef88f6059b49426301a115c&amp;dn=Springer+Handbook+of+Nanotechnology+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1466392963,"description":"Springer Handbook of Nanotechnology 2nd ed - Bharat Bhushan (Springer, 2007).pdf\r\n\r\nISBN 978-3-540-29855-7\r\n\r\nSince 2004 the Springer Handbook of Nanotechnology has established itself as the definitive reference in the nanoscience and nanotechnology area. It integrates the knowledge from nanofabrication, nanodevices, nanomechanics, Nanotribology, materials science, and reliability engineering in just one volume. Beside the presentation of nanostructures, micro/nanofabrication, and micro/nanodevices, special emphasis is on scanning probe microscopy, nanotribology and nanomechanics, molecularly thick films, industrial applications and microdevice reliability, and on social aspects. In its 2nd edition, the book grew from 6 to 8 parts and from 38 to 58 chapters. More information is added to such fields as bionanotechnology, nanorobotics, and MEMS/NEMS reliability. The book is organized by an experienced editor with a universal knowledge and written by an international team of over 150 distinguished experts. It addresses mechanical and electrical engineers, materials scientists, physicists and chemists who work either in the nano area or in a field that is or will be influenced by this new key technology. From the reviews of the first edition: &quot;The strong point is its focus on many of the practical aspects of nanotechnology... Anyone working in or learning about the field of nanotechnology would find this and excellent working handbook.&quot; IEEE Electrical Insulation Magazine &quot;Outstandingly succeeds in its aim… It really is a magnificent volume and every scientific library and nanotechnology group should have a copy.&quot; Materials World &quot;The integrity and authoritativeness… is guaranteed by an experienced editor and an international team of authors which have well summarized in their chapters information on fundamentals and applications.&quot; Polymer News","torrent":{"xt":"urn:btih:bdaa3c3458eecf060ef88f6059b49426301a115c","amp;dn":"Springer+Handbook+of+Nanotechnology+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdaa3c3458eecf060ef88f6059b49426301a115c","infoHashBuffer":{"type":"Buffer","data":[189,170,60,52,88,238,207,6,14,248,143,96,89,180,148,38,48,26,17,92]},"announce":[],"urlList":[]}}