{"title":"Intelligence Servizi e Segreti s01e02 [DivX - ITA - MP3] [Tntvil","uid":5158077,"size":1566259200,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bdc9136bdf70d48325a815c466a1f0fc7061ef1b&amp;dn=Intelligence+Servizi+e+Segreti+s01e02+%5BDivX+-+ITA+-+MP3%5D+%5BTntvil&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"darayava","files":1,"time":1257971562,"description":"- INTELLIGENCE -  \n\nVisit this link:\n\n\n - SERIE TV -  \n\nIspirato a pellicole come Bourne Ultimatum, gli ultimi James Bond e Missione Impossible, INTELLIGENCE - Servizi and Segreti ÃƒÂ¨ la prima serie dedicata allo spionaggio e ai servizi segreti prodotta dalla televisione italiana.\n\nAzione, colpi di scena, utilizzo delle piÃƒÂ¹ avanzate tecnologie, effetti speciali e grande suspense costituiscono gli elementi caratterizzanti di questa serie evento, che terra' lo spettatore con il fiato sospeso fino alla fine.\n\nIl protagonista della serie ÃƒÂ¨ Raoul Bova, che interpreta Marco Tancredi, un ex militare delle forza speciali dell'Esercito. Ritiratosi dal servizio in seguito a un grave incidente, il suo unico desiderio e' ora quello di vivere in pace, ma una tragedia personale lo costringe a tornare a combattere. Questa volta contro nemici molto piÃƒÂ¹ insidiosi di quelli che ha affrontato in passato, perchÃƒÂ© ai annidano nel mondo dei servizi segreti italiani e preparano un mostruoso piano per minacciare gli equilibri internazionali. Un piano che Tancredi dovrÃƒÂ  sventare, muovendosi in un mondo dove veritÃƒÂ  e menzogna spesso si confondono, e affrontando pericoli sempre diversi, come virus mortali creati in laboratorio e spietati gruppi terroristici.\n\n\n- Una produzione da 20.000.000 di euro\n\n- 36 settimane di riprese\n\n- 500 stuntman\n\n- 5000 comparse e partecipazioni speciali\n\n- 320 location distribuite tra l'Italia e diversi paesi esteri tra cui Tunisia, Deserto dello Yemen, Romania, Svizzera e Siria\n\n- 1000 tra automobili, moto e mezzi speciali\n\n- 30 elicotteri\n\nGrazie alla collaborazione dell'Esercito Italiano sono stati utilizzati mezzi ed equipaggiamenti di ultima generazione.\n\n\n - IL CAST ARTISTICO - \n\nRaoul Bova - Marco Tancredi\n\nAna Caterina Morariu - Giada Lunardi\n\nMassimo Venturiello - Carlo Fulgeri\n\nDino Abbrescia - Massimo Carlisi\n\nSalvatore Lazzaro - Antonio Mosca\n\nDaniela Virgilio - Katia\n\nSandra Franzo - Michele Dona'\n\nStefano Fresi - Brain\n\nFrancesco Foti - Giovanni Sgro'\n\nVincet Riotta - Licio Mariani\n\nIrene Ferri - Lidia Lenti\n\n\n - IL CAST TECNICO - \n\nSoggetto di serie: Pietro Vlasecchi\n\nStory Editors: Alfredo Arciero, Alessio Billi, Francesca Demichelis, Massimiliano Griner\n\nEditor TAODUE: Sandrone Dazieri\n\nSuono in presa diretta: Massimo Simonetti\n\nCostumi: Stefano Giovani\n\nScenografia: Lorenzo D'Ambrosio, Ettore Guerrieri\n\nDirettore della fotografia: Claudio Bellero\n\nMontaggio: Clelio Benevento\n\nCasting Director: Adriana Sabbatini\n\nAiuto Regia: Guido Foa\n\nOrganizzatore di produzione: Cristiano Di Meo\n\nMusiche: Luigi Seviroli\n\nRegia II Unita': Cristian De Mattheis\n\nOrganizzatore TAODUE: Emanuele Emiliani\n\nDelegato di produzione RTI: Monica Tommasi\n\nRealizzato da: TAODUE SRL per RTI -  Visit this link:\n\nProdotto da: Pietro Vlasecchi, Camilla Nesbitt\n\nRegia: Alexis Sweet\n\n\n - I PERSONAGGI - \n\nIL PROTAGONISTA\n\nRaoul Bova - MARCO TANCREDI\n\nMarco Tancredi, 40 anni, da tempo nei Corpi Speciali dell'esercito Italiano. Nel suo ultimo incarico ha ricoperto il ruolo di Capitano di una squadra di infiltrazione antiterrorismo in missione in Medio Oriente. Addestrato ai massimi livelli all'uso di armi di grosso calibro, al combattimento a mani nude, alle tecniche di infiltrazione, parla sei lingue, tra cui l'arabo.\nDurante la sua ultima missione all'estero, violenta e rischiosissima, Marco ha sperimentato sulla pelle le efferate conseguenze della guerra. L'intera squadra che comandava (escluso il suo amico Alberto) cade sotto il fuoco nemico.\nDopo questa devastante esperienza (i cui ricordi affioreranno qui e lÃƒÂ  all'interno della serie) Marco ha lasciato l'arma per scegliere la vita dell'uomo comune.\nDue anni difficili in cui ÃƒÂ¨ riuscito a regire fisicamente e mentalmente, grazie all'intervento di una psichiatra, Lidia, che ÃƒÂ¨ poi divenuta sua moglie.\nDeciso a chiudere con il passato, Marco si specializza come tecnico del suono, sfruttando le sue competenze in materia si sistemi informativi, nuove tecnologie e strumentazioni hd.\nLa storia si apre nella pura, gioiosa normalitÃƒÂ , ma il destino ÃƒÂ¨ dietro l'angolo, un destino amaro e terribile che stravolge in un attimo la serenitÃƒÂ  di Marco.\n\n\nMassimo Venturiello - CARLO FULGIERI\n\nSessanta anni, ex Colonnello, ÃƒÂ¨ a capo del DAT, Dipartimento Anti Terrorismo. In campo lavorativo ÃƒÂ¨ il leader buono e giusto, il capo che sa dosare umanitÃƒÂ  e piglio direttivo, che sa lodare e sedare i conflitti interni, ÃƒÂ¨ un postitivo, un motivatore, che trasmette fiducia, forza e determinazione ai suoi uomini. E' pero' anche un uomo, disposto a tutto per difendere lo Stato.\n\n\nAna Caterina Morariu - GIADA\n\nBella e all'apparenza delicata e fragile, ÃƒÂ¨ un'agente espertissima, scelta e addestrata personalmente da Fulgieri. Oltre che in attivitÃƒÂ  di monitoraggio e studio dati, Giada emerge nelle missioni fisiche per la sua altissima preparazione atletica. Sa scalare grattacieli, infilarsi negli antri piÃƒÂ¹ stretti, divincolarsi dai nemici, e' forte e ha i nervi e i muscoli d'acciaio. ÃƒË† una provetta contorsionista e sa annientare il nemico con grazia e velocitÃƒÂ . Pragmatica, efficiente, preparata, sempre aggiornata, soffre d'insonnia e spesso continua ad occuparsi di lavoro anche quando e' fuori servizio. ÃƒË† instancabile. Razionale e analitica, non lascia nulla al caso e prima di fare un'affermazione su una missione si documenta con solerzia per poi esporre il suo parere, nel pieno rispetto dell'operato e delle decisioni finali dei suoi superiori. Come tanti giovani, ÃƒÂ¨ istintiva, a volte collerica, facile ad entusiasmarsi e ad abbattersi, ma sempre pronta a reagire e a sprigionare l'energia necessaria a risollevarsi.\n\n\nIrene Ferri - LIDIA\n\nLa moglie di Marco ÃƒÂ¨ una donna giovane, affascinante, elegante e solare, sa muoversi con grazia in ogni situazione, sia familiare che lavorativa. Lidia e' una bravissima psichiatra, conosce molto bene il suo lavoro e i suoi meccanismi piÃƒÂ¹ subdoli, ÃƒÂ¨ dotata di una grande capacitÃƒÂ  di ascolto e di un magnetismo che impressiona chiunque. Conosce Marco dopo la traumatica esperienza della missione antiterrorismo e lo aiuta a ritrovare se stesso. Dopo il matrimonio tutto sembra procedere normalmente... ma sono tante le veritÃƒÂ  che ha nascosto e che piano piano si riveleranno.\n\n\n - SECONDA PUNTATA - \n\nMarco Tancredi, entrato a far parte del servizio di Intelligence a cui apparteneva la defunta moglie Lidia, continua privatamente le indagini sul suo omicidio. Studiando il DVD inviatogli dalla donna, che aveva previsto la propria morte, comprende che la moglie gli ha lasciato delle tracce per aiutarlo a risalire alla scottante indagine che stava conducendo. Tancredi, recatosi a Bucarest per ispezionare un appartamento usato da Lidia, rinviene, nascosta in un libro scritto da un ex agente segreto russo, Andrei Kuznecov, la chiave di un armadietto. Marco, sorpreso da agenti segreti rumeni, scappa grazie al provvidenziale arrivo di Giada, incaricata da Fulgeri di tenerlo sotto controllo. Marco e Giada corrono ad aprire l'armadietto, che ÃƒÂ¨ ubicato presso la stazione centrale, trovandolo perÃƒÂ² vuoto. Carlisi, ancora latitante, suggerisce a Tancredi di conttatare Andrei, che si trova in Italia per promuovere il suo libro. Ma Kuznecov, appena giunto a Roma viene avvicinato da un'avvenente connazionale, che lo seduce e poi lo avvelena con il polonio radioattivo. L'uomo, prima di morire, riesce a rivelare a Marco che Lidia si era rivolta a lui per avere notizie dell'operazione Fletcher, proprio l'ultima disastrosa missione in Yemen di Tancredi.\nGiunge dalla Russia l'agente Violica Pevelin, che collabora con la squadra di Marco per risolvere il caso, collegato ad altri due omicidi. L'Intelligence riesce a scoprire l'identitÃƒÂ  dell'assassina: si chiama Oksana, e sta vendicando la tragica morte della figlia. Marco riesce a fermarla prima che uccida ancora, ma la killer perde la vita.\nIntanto Violica rivela a Marco che Lidia era a conoscenza della sua relazione con l'agente italiano Brian. Tancredi intuisce che ÃƒÂ¨ stato quest'ultimo a vuotare l'armadietto di Bucarest e gliene chiede il contenuto: oltre al dossier su Brian, complilato da Lidia, ci sono degli MP3 di musica classica. Marco li analizza e scopre che vi sono nascoste le coordinate che conducono ad un rudere di campagna, dove Lidia e Marco si erano ripromessi di festeggiare il decimo anniversario di matrimonio. L'ex parÃƒÂ , recatosi al rudere insieme a Giada, trova una scheda di memoria. L'uomo la inserisce nel proprio palmare ma fa appena in tempo a leggere la scheda segnaletica di un coreano, Kim Gun, quando sente da fuori l'urlo di Giada. Marco esce con la pistola in pugno ma, colpito alle spalle, sviene. Nel frattempo qualcusno si appropria del palmare...\n\n\n\n[ Info sul file ]\n\nNome: [DivX-ITA] - Intelligence - Servizi e Segreti Ã‚Â - II Puntata Ã‚Â - 99 min - 2009 - (Raoul Bova) - DVDRip CRUSADERS.avi\nData: 30/10/2009 23:15:16\nDimensione: 1,566,259,200 bytes (1493.701 MB)\n\n[ Info generiche ]\n\nDurata: 01:39:31 (5970.92 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: MEDIA (608 x 320)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (3.340496)\nQualitÃƒÂ  deviazione standard: ALTA (0.797415)\nMedia pesata dev. std.: ALTA (0.637172)\n\n[ Traccia video ]\n\nFourCC: divx/DX50\nRisoluzione: 608 x 320\nFrame aspect ratio: 19:10 = 1.9\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 19:10 = 1.9\nFramerate: 25 fps\nFrames totali: 149273\nStream size: 1,415,715,398 bytes\nBitrate: 1896.813754 kbps\nQf: 0.389969\nKey frames: 3237 (0; 11; 123; 220; 296; ... 149186)\nNull frames: 0\nMin key int: 1\nMax key int: 200\nKey int medio: 46.114612\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 192 kbps CBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 149261\nStream size: 143,301,888 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b2816p\nPacked bitstream: SÃƒÂ¬\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 149273\nDrop/delay frames: 0\nFrames corrotti: 0\n\nI-VOPs: Ã‚Â  3237 ( Ã‚Â 2.169 %) # Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â \nP-VOPs: 129379 ( 86.673 %) ###################### Ã‚Â  \nB-VOPs: Ã‚Â 16657 ( 11.159 %) ### Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â \nS-VOPs: Ã‚Â  Ã‚Â  Ã‚Â 0 ( Ã‚Â 0.000 %) Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â \nN-VOPs: Ã‚Â  Ã‚Â  Ã‚Â 0 ( Ã‚Â 0.000 %) Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â \n\nMax consecutive B-VOPs: 1\n\n[ Analisi DRF ]\n\nDRF medio: 3.340496\nDeviazione standard: 0.797415\nDRF max: 19\n\nDRF9: Ã‚Â  Ã‚Â 56 ( Ã‚Â 0.038 %) Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â  Ã‚Â \n\nI-VOPs DRF medio: 2.971269\nI-VOPs deviazione std.: 0.971055\nI-VOPs DRF max: 11\n\nP-VOPs DRF medio: 3.183870\nP-VOPs deviazione std.: 0.581117\nP-VOPs DRF max: 13\n\nB-VOPs DRF medio: 4.628804\nB-VOPs deviazione std.: 1.007681\nB-VOPs DRF max: 19\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\nMin buffer fill: 65%\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:bdc9136bdf70d48325a815c466a1f0fc7061ef1b","amp;dn":"Intelligence+Servizi+e+Segreti+s01e02+%5BDivX+-+ITA+-+MP3%5D+%5BTntvil","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdc9136bdf70d48325a815c466a1f0fc7061ef1b","infoHashBuffer":{"type":"Buffer","data":[189,201,19,107,223,112,212,131,37,168,21,196,102,161,240,252,112,97,239,27]},"announce":[],"urlList":[]}}