{"title":"Green and Sustainable Medicinal Chemistry","uid":15297988,"size":9464573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be73e98d386a032a48950d12e149f6f7b4e419e6&amp;dn=Green+and+Sustainable+Medicinal+Chemistry&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1468460610,"description":"Green and Sustainable Medicinal Chemistry - Louise Summerton et al. (RSC, 2016).pdf\r\n\r\nISBN 978-1-78262-467-7\r\n\r\nPharmaceutical manufacturing was one of the first industries to recognize the importance of green chemistry, with pioneering work including green chemistry metrics and alternative solvents and reagents. Today, other topical factors also have to be taken into consideration, such as rapidly depleting resources, high energy costs and new legislation.\r\n\r\nThis book addresses current challenges in modern green chemical technologies and sustainability thinking. It encompasses a broad range of topics covered by the CHEM21 project – Europe’s largest public-private partnership project which aims to develop a toolbox of sustainable technologies for green chemical intermediate manufacture. Divided into two sections, the book first gives an overview of the key green chemistry tools, guidance and considerations aimed at developing greener processes, before moving on to look at cutting-edge synthetic methodologies.\r\n\r\nFeaturing innovative research, this book is an invaluable reference for chemists across academia and industry wanting to further their knowledge and understanding of this important topic","torrent":{"xt":"urn:btih:be73e98d386a032a48950d12e149f6f7b4e419e6","amp;dn":"Green+and+Sustainable+Medicinal+Chemistry","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be73e98d386a032a48950d12e149f6f7b4e419e6","infoHashBuffer":{"type":"Buffer","data":[190,115,233,141,56,106,3,42,72,149,13,18,225,73,246,247,180,228,25,230]},"announce":[],"urlList":[]}}