{"title":"wireshark-setup-1.0.0.exe","uid":4170678,"size":21713350,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bf7b436361b5784def33e6e970b7910b6ae435b5&amp;dn=wireshark-setup-1.0.0.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"funchords","files":1,"time":1209842896,"description":"Wireshark 1.0.0 for Windows Windows 2000/XP/2003/Vista Installer (.exe)\n\n--- see uploader&amp;#039;s comment below ---\n\nWireshark is the world&amp;#039;s foremost network protocol analyzer, and is the de facto (and often de jure) standard across many industries and educational institutions. \n\nWireshark has a rich feature set which includes the following:\n\n    * Deep inspection of hundreds of protocols, with more being added all the time\n    * Live capture and offline analysis\n    * Standard three-pane packet browser\n    * Multi-platform: Runs on Windows, Linux, OS X, Solaris, FreeBSD, NetBSD, and many others\n    * Captured network data can be browsed via a GUI, or via the TTY-mode TShark utility\n    * The most powerful display filters in the industry\n    * Rich VoIP analysis\n    * Read/write many different capture file formats: tcpdump (libpcap), Catapult DCT2000, Cisco Secure IDS iplog, Microsoft Network Monitor, Network General SnifferÃ‚Â® (compressed and uncompressed), SnifferÃ‚Â® Pro, and NetXrayÃ‚Â®, Network Instruments Observer, Novell LANalyzer, RADCOM WAN/LAN Analyzer, Shomiti/Finisar Surveyor, Tektronix K12xx, Visual Networks Visual UpTime, WildPackets EtherPeek/TokenPeek/AiroPeek, and many others\n    * Capture files compressed with gzip can be decompressed on the fly\n    * Live data can be read from Ethernet, IEEE 802.11, PPP/HDLC, ATM, Bluetooth, USB, Token Ring, Frame Relay, FDDI, and others (depending on your platfrom)\n    * Decryption support for many protocols, including IPsec, ISAKMP, Kerberos, SNMPv3, SSL/TLS, WEP, and WPA/WPA2\n    * Coloring rules can be applied to the packet list for quick, intuitive analysis\n    * Output can be exported to XML, PostScriptÃ‚Â®, CSV, or plain text \n\nAdditional details are available at http://www.wireshark.org/about.html\n\n --- uploaders comment follows ---\n\nThis is the tool I used to find Comcast&amp;#039;s interference with the P2P networks.  \n\nBy capturing TCP packets and viewing them as I was seeding, I was able to see that an RST was received just after the remote end of the connection asked for a block of data. On unencrypted BitTorrent, it sometimes occurred within the initial handshake right after my host sent a full BitTorrent bitfield (which indicates that I am a seeder).  As the RST in the middle of a conversation is a sign that the remote end crashed, seeing it happen all the time meant this had to be a fake.  \n\n1.0.0 is the latest version as of March 31, 2008.  It culminates many dedicated years of development and contributions on the Etheral and Wireshark projects.  Please support it with your upload bytes or by looking at Cace Technologies commercial products when you need other networking tools.\n\nWith sincere thanks to everyone who worked on Wireshark,\n\nRobb Topolski","torrent":{"xt":"urn:btih:bf7b436361b5784def33e6e970b7910b6ae435b5","amp;dn":"wireshark-setup-1.0.0.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7b436361b5784def33e6e970b7910b6ae435b5","infoHashBuffer":{"type":"Buffer","data":[191,123,67,99,97,181,120,77,239,51,230,233,112,183,145,11,106,228,53,181]},"announce":[],"urlList":[]}}