{"title":"Harrison Ford Mega Pack Collection","uid":4546769,"size":41079851316,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c058238e0d27668c2609949f81afbca0157b9b93&amp;dn=Harrison+Ford+Mega+Pack+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":5,"uploader":"circlensess","files":106,"time":1228156228,"description":"Harrison Ford Collection\n\nSEED THIS TORRENT AS LONG AS YOU CAN !\nFOR HIT &amp; RUN YOU CAN BE BANNED AND YOU CAN LOSE YOUR ACCOUNT!\nFOR RECOMMENDATIONS PLEASE LEAVE A COMMENT\n____________________________________________________________________\n\n\nAmerican Graffiti (1973)\n\nUser Rating: 7.6/10 (24,372 votes)\nDirector: George Lucas\nRelease Date: 11 August 1973\nGenre: Comedy | Drama | Romance\nPlot: A couple of high school grads spend one final night cruising the strip with their buddies before they go off to college.\nAwards: Nominated for 5 Oscars. Another 7 wins &amp; 5 nominations\nCast: Richard Dreyfuss, Ron Howard, Paul Le Mat, Charles Martin Smith, Cindy Williams, Candy Clark, Mackenzie Phillips, Wolfman Jack, Bo Hopkins, Manuel Padilla Jr., Beau Gentry, Harrison Ford, Jim Bohan, Jana Bellan, Deby Celiz\n\n\n\n\nStar Wars: Episode IV - A New Hope (1977)\n\nUser Rating: 8.8/10 (255,669 votes)\nDirector: George Lucas\nRelease Date: 26 April 1982\nGenre: Action | Adventure | Family | Fantasy | Sci-Fi\nPlot: Luke Skywalker leaves his home planet, teams up with other rebels, and tries to save Princess Leia from the evil clutches of Darth Vader.\nAwards: Won 6 Oscars. Another 29 wins &amp; 18 nominations\nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing, Alec Guinness, Anthony Daniels, Kenny Baker, Peter Mayhew, David Prowse, James Earl Jones, Phil Brown, Shelagh Fraser, Jack Purvis, Alex McCrindle, Eddie Byrne\n\n\n\n\nForce 10 from Navarone [1978]\n\nUser Rating: 6.0/10 (4,488 votes)\nDirector: Guy Hamilton\nRelease Date: 8 December 1978\nGenre: Action | Drama | War\nPlot: During World War II, several oddly assorted military experts are teamed in a mission to raid and destroy a bridge vital to enemy strategy.\nCast: Robert Shaw, Harrison Ford, Barbara Bach, Edward Fox, Franco Nero, Carl Weathers, Richard Kiel, Alan Badel, Michael Byrne, Philip Latham, Angus MacInnes, Michael Sheard, Petar Buntic, Leslie Schofield, Anthony Langdon\n\n\n\n\nApocalypse Now (1979)\n\nUser Rating: 8.6/10 (132,951 votes)\nDirector: Francis Ford Coppola\nRelease Date: 15 August 1979\nGenre: Action | Adventure | Drama | War\nPlot: During the on-going Vietnam War, Captain Willard is sent on a dangerous mission into Cambodia to assassinate a renegade Green Beret who has set himself up as a God among a local tribe.\nCast: Marlon Brando, Martin Sheen, Robert Duvall, Frederic Forrest, Sam Bottoms, Laurence Fishburne, Albert Hall, Harrison Ford, Dennis Hopper, G.D. Spradlin, Jerry Ziesmer, Scott Glenn, Bo Byers, James Keane, Kerry Rossall\n\n\n\n\nHanover Street (1979)\n\nUser Rating: 5.9/10 (1,358 votes)\nDirector: Peter Hyams\nRelease Date: 26 September 1979\nGenre: Action | Adventure | Drama | Romance | War\nPlot: Margaret is a nursein England during WW2, and married to a secret agent. Things get complicated when she falls for David, an American pilot.\nCast: Harrison Ford, Lesley-Anne Down, Christopher Plummer, Alec McCowen, Richard Masur, Michael Sacks, Patsy Kensit, Max Wall, Shane Rimmer, Keith Buckley, Sherrie Hewson, Cindy O'Callaghan, Di Trevis, Suzanne Bertish, Keith Alexander\n\n\n\n\nThe Frisco Kid (1979)\n\nUser Rating: 6.1/10 (2,758 votes)\nDirector: Robert Aldrich\nRelease Date: 13 July 1979\nGenre: Comedy | Western\nPlot: A Polish rabbi wanders through the Old West on his way to lead a synagogue in San Francisco. On the...\nCast: Gene Wilder, Harrison Ford, Ramon Bieri, Val Bisoglio, George DiCenzo, Leo Fuchs, Penny Peyser, William Smith, Jack Somack, Beege Barkette, Shay Duffin, Walter Janovitz, Joe Kapp, Clyde Kusatsu, Clifford A. Pellow\n\n\n\n\nStar Wars: Episode V - The Empire Strikes Back (1980)\n\nUser Rating: 8.8/10 (215,017 votes)\nDirector: Irvin Kershner\nRelease Date: 23 April 1984\nGenre: Action | Adventure | Fantasy | Sci-Fi | Thriller\nPlot: While Luke takes advanced Jedi training from Yoda, his friends are relentlessly pursued by Darth Vader as part of his plan to capture Luke.\nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, Peter Mayhew, Kenny Baker, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis, Jack Purvis, Des Webb, Clive Revill\n\n\n\n\nIndiana Jones and the Raiders of the Lost Ark (1981)\n\nUser Rating: 8.7/10 (192,182 votes)\nDirector: Steven Spielberg\nRelease Date: 12 June 1981\nGenre: Action | Adventure\nPlot: Archeologist and adventurer Indiana Jones is hired by the US government to find the Ark of the Covenant, before the Nazis...\nAwards: Won 4 Oscars. Another 24 wins &amp; 21 nominations\nCast: Harrison Ford, Karen Allen, Paul Freeman, Ronald Lacey, John Rhys-Davies, Denholm Elliott, Alfred Molina, Wolf Kahler, Anthony Higgins, Vic Tablian, Don Fellows, William Hootkins, Bill Reimbold, Fred Sorenson, Patrick Durkin\n\n\n\n\nBlade Runner (1982)\n\nUser Rating: 8.3/10 (143,098 votes)\nDirector: Ridley Scott\nRelease Date: 25 June 1982\nGenre: Action | Sci-Fi | Thriller\nPlot: Deckard, a blade runner, has to track down and terminate 4 replicants who hijacked a ship in space and have returned to earth seeking their maker...\nAwards: Nominated for 2 Oscars. Another 9 wins &amp; 14 nominations\nCast: Harrison Ford, Rutger Hauer, Sean Young, Edward James Olmos, M. Emmet Walsh, Daryl Hannah, William Sanderson, Brion James, Joe Turkel, Joanna Cassidy, James Hong, Morgan Paull, Kevin Thompson, John Edward Allen, Hy Pyke\n\n\n\n\nStar Wars: Episode VI - Return of the Jedi (1983)\n\nUser Rating: 8.3/10 (165,876 votes)\nDirector: Richard Marquand\nRelease Date: 1986\nGenre: Action | Adventure | Fantasy | Sci-Fi | Thriller\nPlot: After rescuing Han Solo from the palace of Jabba the Hutt, the Rebels attempt to destroy the Second Death Star, while Luke Skywalker tries to bring his father back to the Light Side of the Force.\nAwards: Nominated for 4 Oscars. Another 11 wins &amp; 11 nominations\nCast: Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, Peter Mayhew, Sebastian Shaw, Ian McDiarmid, Frank Oz, James Earl Jones, David Prowse, Alec Guinness, Kenny Baker, Michael Pennington, Kenneth Colley\n\n\n\n\nIndiana Jones and the Temple of Doom (1984)\n\nUser Rating: 7.4/10 (86,408 votes)\nDirector: Steven Spielberg\nRelease Date: 23 May 1984\nGenre: Action | Adventure\nPlot: After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees, and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.\nAwards: Won Oscar. Another 4 wins &amp; 17 nominations\nCast: Harrison Ford, Kate Capshaw, Jonathan Ke Quan, Amrish Puri, Roshan Seth, Philip Stone, Roy Chiao, David Yip, Ric Young, Chua Kah Joo, Rex Ngui, Philip Tan, Dan Aykroyd, Dr. Akio Mitamura, Michael Yama\n\n\n\n\nWitness (1985)\n\nUser Rating: 7.5/10 (24,520 votes)\nDirector: Peter Weir\nRelease Date: 8 February 1985\nGenre: Drama | Romance | Thriller\nPlot: A young Amish boy is sole witness to a murder; policeman John Book goes into hiding in Amish country to protect him until the trial.\nAwards: Won 2 Oscars. Another 10 wins &amp; 25 nominations\nCast:  Harrison Ford, Kelly McGillis, Josef Sommer, Lukas Haas, Jan Rubes, Alexander Godunov, Danny Glover, Brent Jennings, Patti LuPone, Angus MacInnes, Frederick Rolf, Viggo Mortensen, John Garson, Beverly May, Ed Crowley\n\n\n\n\nThe Mosquito Coast (1986)\n\nUser Rating: 6.5/10 (8,492 votes)\nDirector: Peter Weir\nRelease Date: 26 November 1986\nGenre: Adventure | Drama | Thriller\nPlot: An eccentric and dogmatic inventor sells his house and takes his family to Central America to build an ice factory in the middle of the jungle...\nAwards: Nominated for 2 Golden Globes. Another 1 win &amp; 1 nomination\nCast: Harrison Ford, Helen Mirren, River Phoenix, Conrad Roberts, Andre Gregory, Martha Plimpton, Dick O'Neill, Jadrien Steele, Michael Rogers, Hilary Gordon, Rebecca Gordon, Jason Alexander, Alice Sneed, Tiger Haynes, William Newman\n\n\n\n\nFrantic [1988]\n\nUser Rating: 6.7/10 (13,420 votes)\nDirector: Roman Polanski\nRelease Date: 26 February 1988\nGenre: Action | Crime | Drama | Mystery | Thriller\nPlot: A doctor and his wife go to Paris for a medical conference. While showering, his wife disappears. His lack of language...\nCast: Harrison Ford, Betty Buckley, Emmanuelle Seigner, Djiby Soumare, Dominique Virton, Gerard Klein, Stephane D'Audeville, Laurent Spielvogel, Alain Doutey, Jacques Ciron, Roch Leibovici, Louise Vincent, Patrice Melennec, Ella Jaroszewicz, Joelle Lagneau\n\n\n\n\nWorking Girl [1988]\n\nUser Rating: 6.5/10 (15,181 votes)\nDirector: Mike Nichols\nRelease Date: 21 December 1988\nGenre: Comedy | Romance | Drama\nPlot: When a secretary's idea is stolen by her boss, she seizes an opportunity to steal it back by pretending she has her boss's job.\nAwards: Won Oscar. Another 6 wins &amp; 13 nominations\nCast: Harrison Ford, Sigourney Weaver, Melanie Griffith, Alec Baldwin, Joan Cusack, Philip Bosco, Nora Dunn, Oliver Platt, James Lally, Kevin Spacey, Robert Easton, Olympia Dukakis, Amy Aquino, Jeffrey Nordling, Elizabeth Whitcraft\n\n\n\n\nIndiana Jones and the Last Crusade (1989)\n\nUser Rating: 8.3/10 (133,647 votes)\nDirector: Steven Spielberg\nRelease Date: 24 May 1989\nGenre: Action | Adventure\nPlot: When Dr. Henry Jones Sr. suddenly goes missing while pursuing the Holy Grail, eminent archaeologist Indiana Jones must follow in his father's footsteps and stop the Nazis.\nAwards: Won Oscar. Another 4 wins &amp; 17 nominations\nCast: Harrison Ford, Sean Connery, Denholm Elliott, Alison Doody, John Rhys-Davies, Julian Glover, River Phoenix, Michael Byrne, Kevork Malikyan, Robert Eddison, Richard Young, Alexei Sayle, Alex Hyde-White, Paul Maxwell, Isla Blair\n\n\n\n\nPresumed Innocent (1990)\n\nUser Rating: 6.8/10 (10,170 votes)\nDirector: Alan J. Pakula\nRelease Date: 27 July 1990\nGenre: Crime | Drama | Thriller\nPlot: When the woman deputy prosecutor R.K. Sabich had an affair with is murdered the prosecutor asks him to lead the investigation. When Sabich digs too deeply he finds himself framed for the murder.\nAwards: 1 win &amp; 1 nomination\nCast: Harrison Ford, Brian Dennehy, Raul Julia, Bonnie Bedelia, Paul Winfield, Greta Scacchi, John Spencer, Joe Grifasi, Tom Mardirosian, Anna Maria Horsford, Sab Shimono, Bradley Whitford, Christine Estabrook, Michael Tolan, Madison Arnold\n\n\n\n\nRegarding Henry (1991)\n\nUser Rating: 6.5/10 (10,460 votes)\nDirector: Mike Nichols\nRelease Date: 10 July 1991\nGenre: Drama\nPlot: Henry is a lawyer who survives a shooting only to find he cannot remember anything. If that weren't enough...\nAwards: 1 win &amp; 2 nominations\nCast: Harrison Ford, Annette Bening, Michael Haley, Stanley Swerdlow, Julie Follansbhee, Rebecca Miller, Bruce Altman, Elizabeth Wilson, Donald Moffat, Mikki Allen, Aida Linares, John MacKay, Mary Gilbert, Peter Appel, Harsh Nayyar\n\n\n\n\nPatriot Games (1992)\n\nUser Rating: 6.9/10 (23,572 votes)\nDirector: Phillip Noyce\nRelease Date: 5 June 1992\nGenre: Action | Crime | Thriller\nPlot: When CIA Analyst Jack Ryan interferes with an IRA assassination, a renegade faction targets him and his family for revenge.\nAwards: 1 win &amp; 2 nominations\nCast: Harrison Ford, Anne Archer, Patrick Bergin, Sean Bean, Thora Birch, James Fox, Samuel L. Jackson, Polly Walker, J.E. Freeman, James Earl Jones, Richard Harris, Alex Norton, Hugh Fraser, David Threlfall, Alun Armstrong\n\n\n\n\nThe Fugitive (1993)\n\nUser Rating: 7.8/10 (77,874 votes)\nDirector: Andrew Davis\nRelease Date: 6 August 1993\nGenre: Action | Crime | Drama | Thriller\nPlot: Dr. Richard Kimble, unjustly accused of killing his wife, must find the real one-armed killer while avoiding Marshal Sam Gerard.\nAwards: Won Oscar. Another 10 wins &amp; 19 nominations more\nCast: Harrison Ford, Tommy Lee Jones, Sela Ward, Julianne Moore, Joe Pantoliano, Andreas Katsulas, Jeroen Krabbe, Daniel Roebuck, L. Scott Caldwell, Tom Wood, Ron Dean, Joseph F. Kosala, Miguel Nino, John Drummond, Tony Fosco\n\n\n\n\nClear and Present Danger (1994)\n\nUser Rating: 6.8/10 (23,692 votes)\nDirector: Phillip Noyce\nRelease Date: 3 August 1994\nGenre: Action | Thriller\nPlot: CIA Analyst Jack Ryan is drawn into an illegal war fought by the US government against a Colombian drug cartel.\nAwards: Nominated for 2 Oscars. Another 3 wins &amp; 4 nominations\nCast: Harrison Ford, Willem Dafoe, Anne Archer, Joaquim de Almeida, Henry Czerny, Harris Yulin, Donald Moffat, Miguel Sandoval, Benjamin Bratt, Raymond Cruz, Dean Jones, Thora Birch, Ann Magnuson, Hope Lange, Tom Tammi\n\n\n\n\nSabrina (1995)\n\nUser Rating: 6.0/10 (12,749 votes)\nDirector: Sydney Pollack\nRelease Date: 15 December 1995\nGenre: Comedy | Romance | Drama\nPlot: An ugly duckling having undergone a remarkable change, still harbors feelings for her crush: a carefree playboy, but not before his business-focused brother has something to say about it.\nAwards: Nominated for 2 Oscars. Another 1 win &amp; 4 nominations\nCast: Harrison Ford, Julia Ormond, Greg Kinnear, Nancy Marchand, John Wood, Richard Crenna, Angie Dickinson, Lauren Holly, Dana Ivey, Miriam Colon, Elizabeth Franz, Fanny Ardant, Valerie Lemercier, Patrick Bruel, Becky Ann Baker\n\n\n\n\nAir Force One (1997)\n\nUser Rating: 6.2/10 (48,664 votes)\nDirector: Wolfgang Petersen\nRelease Date: 25 July 1997\nGenre: Action | Thriller | Drama\nPlot: Hijackers seize the plane carrying the President of the United States and his family, but he (an ex-soldier) works from hiding to defeat them.\nAwards: Nominated for 2 Oscars. Another 6 wins &amp; 9 nominations\nCast: Harrison Ford, Gary Oldman, Glenn Close, Wendy Crewson, Liesel Matthews, Paul Guilfoyle, Xander Berkeley, William H. Macy, Dean Stockwell, Tom Everett, Jurgen Prochnow, Donna Bullock, Michael Ray Miller, Carl Weintraub, Elester Latham\n\n\n\n\nThe Devil's Own (1997)\n\nUser Rating: 5.8/10 (16,478 votes)\nDirector: Alan J. Pakula\nRelease Date: 4 April 1997\nGenre: Action | Drama | Thriller\nPlot: A police officer uncovers the real identity of his houseguest, an IRA terrorist in hiding.\nCast: Harrison Ford, Brad Pitt, Margaret Colin, Ruben Blades, Treat Williams, George Hearn, Mitch Ryan, Natascha McElhone, Paul Ronan, Simon Jones, Julia Stiles, Ashley Carin, Kelly Singer, David O'Hara, David Wilmot\n\n\n\n\nSix Days Seven Nights [1998]\n\nUser Rating: 5.5/10 (20,832 votes)\nDirector: Ivan Reitman\nRelease Date: 12 June 1998\nGenre: Action | Adventure | Romance\nPlot: Robin Monroe, a New York magazine editor, and the gruff pilot Quinn Harris must put aside their mutual dislike if they are to survive after crash landing on a deserted South Seas island.\nAwards: 2 wins &amp; 3 nominations\nCast: Harrison Ford, Anne Heche, David Schwimmer, Jacqueline Obradors, Temuera Morrison, Allison Janney, Douglas Weston, Cliff Curtis, Danny Trejo, Ben Bode, Derek Basco, Amy Sedaris, Long Nguyen, Jake Feagai, John Koyama\n\n\n\n\nRandom Hearts (1999)\n\nUser Rating: 4.7/10 (9,516 votes)\nDirector: Sydney Pollack\nRelease Date: 8 October 1999\nGenre: Drama | Mystery | Romance\nPlot: After the death of their loved ones in a tragic plane crash 'Harrison Ford' and Kristin Scott Thomas find...\nCast: Harrison Ford, Kristin Scott Thomas, Charles S. Dutton, Bonnie Hunt, Dennis Haysbert, Sydney Pollack, Richard Jenkins, Paul Guilfoyle, Susanna Thompson, Peter Coyote, Dylan Baker, Lynne Thigpen, Susan Floyd, Bill Cobbs, Kate Mara\n\n\n\n\nWhat Lies Beneath (2000)\n\nUser Rating: 6.5/10 (37,089 votes)\nDirector: Robert Zemeckis\nRelease Date: 21 July 2000\nGenre: Horror | Mystery | Thriller\nPlot: The wife of a university research scientist believes that her lakeside Vermont home is haunted by a ghost -- or that she's losing her mind.\nAwards: 4 wins &amp; 5 nominations\nCast: Harrison Ford, Michelle Pfeiffer, Diana Scarwid, Joe Morton, James Remar, Miranda Otto, Amber Valletta, Katharine Towne, Victoria Bidewell, Eliott Goretsky, Ray Baker, Wendy Crewson, Sloane Shelton, Tom Dahlgren, Micole Mercurio\n\n\n\n\nK-19: The Widowmaker (2002)\n\nUser Rating: 6.5/10 (17,008 votes)\nDirector: Kathryn Bigelow\nRelease Date: 22 November 2002\nGenre: Drama | History | Thriller\nPlot: When Russia's first nuclear submarine malfunctions on its maiden voyage, the crew must race to save the ship and prevent a nuclear disaster.\nAwards: 2 nominations\nCast: Harrison Ford, Sam Spruell, Peter Stebbings, Christian Camargo, Roman Podhora, Sam Redford, Steve Nicolson, Liam Neeson, Ravil Isyanov, Tim Woodward, Lex Shrapnel, Shaun Benson, Kristen Holden-Ried, Dmitry Chepovetsky, Christopher Redman, Tygh Runyan\n\n\n\n\nHollywood Homicide (2003)\n\nUser Rating: 5.2/10 (12,515 votes)\nDirector: Ron Shelton\nRelease Date: 13 June 2003\nGenre: Action | Comedy | Crime | Thriller\nPlot: Two LAPD detectives who moonlight in other fields investigate the murder of an up-and-coming rap group.\nCast: Harrison Ford, Josh Hartnett, Lena Olin, Bruce Greenwood, Isaiah Washington, Lolita Davidovich, Keith David, Master P, Gladys Knight, Lou Diamond Phillips, Meredith Scott Lynn, Tom Todoroff, James MacDonald, Kurupt, Andre Benjamin\n\n\n\n\nFirewall (2006)\n\nUser Rating: 5.8/10 (18,267 votes)\nDirector: Richard Loncraine\nRelease Date: 10 February 2006\nGenre: Crime | Drama | Thriller\nPlot: A security specialist is forced into robbing the bank that he's protecting, as a bid to pay off his family's ransom.\nAwards: 2 nominations more\nCast: Harrison Ford, Virginia Madsen, Carly Schroeder, Jimmy Bennett, Gail Ann Lewis, Mary Lynn Rajskub, Matthew Currie Holmes, Candus Churchill, David Lewis, Zahf Paroo, Robert Forster, Robert Patrick, Alan Arkin, Pat Jenkinson, Eric Keenleyside\n\n\n\n\nIndiana Jones and the Kingdom of the Crystal Skull [2008]\n\nUser Rating: 7.0/10 (83,486 votes)\nDirector: Steven Spielberg\nRelease Date: 23 May 2008\nGenre: Action | Adventure\nPlot: Famed archaeologist/adventurer Dr. Henry &quot;Indiana&quot; Jones is called back into action when he becomes entangled in a Soviet plot to uncover the secret behind mysterious artifacts known as the Crystal Skulls.\nAwards: 1 win &amp; 5 nominations\nCast: Harrison Ford, Cate Blanchett, Karen Allen, Shia LaBeouf, Ray Winstone, John Hurt, Jim Broadbent, Igor Jijikine, Dimitri Diatchenko, Ilia Volok, Emmanuel Todorov, Pavel Lychnikoff, Andrew Divoff, Venya Manzyuk, Alan Dale\n\t &lt;a href=&quot;\nhttp://www.imdb.com/name/nm0000148/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/name/nm0000148/&lt;/a&gt;","torrent":{"xt":"urn:btih:c058238e0d27668c2609949f81afbca0157b9b93","amp;dn":"Harrison+Ford+Mega+Pack+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c058238e0d27668c2609949f81afbca0157b9b93","infoHashBuffer":{"type":"Buffer","data":[192,88,35,142,13,39,102,140,38,9,148,159,129,175,188,160,21,123,155,147]},"announce":[],"urlList":[]}}