{"title":"A History of Scotland - Neil Oliver","uid":6604737,"size":3351525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c08430ac7fa5317e39b637cdfd134b5c3527e62a&amp;dn=A+History+of+Scotland+-+Neil+Oliver&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rosie1966","files":2,"time":1313349956,"description":"From the TV Series\n-------------------------\nDespite being hailed by BBC Scotland as &quot;one of its most ambitious projects ever&quot;, there have been claims, that the programme made some errors. Further, the 10-part series has come under fire over claims that it is too &quot;anglocentric&quot;. The failure to front it with a historian (Neil Oliver is an archaeologist) has also been attacked.\n\nFrom the Book\n-------------------\nScotland's history has been badly served over the years. Defined by its relationship to England, Scotland's popular history is full of near-mythical figures and tragic events, her past littered with defeat, failure and thwarted ambition. The martyrdom of William Wallace, the tragedy of Mary Queen of Scots and the forlorn cause of Bonnie Prince Charlie all give the impression of 'poor' Scotland; a victim of misfortune, leading to the country's inevitable submission to the Auld Enemy. After the Union in 1707, Scotland's increasing reliance on England culminated in a crisis of confidence and identity that tortures the country to this day. But how accurate is this version of events? Using the very latest in historical research and by placing Scotland's story in the wider context of British, European and global history, some of the myths that pervade the past will be exploded to reveal a Scotland which forged its own destiny, often with success.\n\nNeil Oliver is a Scottish archaeologist, historian and broadcaster best known for his distinctive voice and long black hair and as the charismatic presenter of the award-winning documentary series COAST.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c08430ac7fa5317e39b637cdfd134b5c3527e62a","amp;dn":"A+History+of+Scotland+-+Neil+Oliver","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08430ac7fa5317e39b637cdfd134b5c3527e62a","infoHashBuffer":{"type":"Buffer","data":[192,132,48,172,127,165,49,126,57,182,55,205,253,19,75,92,53,39,230,42]},"announce":[],"urlList":[]}}