{"title":"ANZAC Infantryman 1914-15: From New Guinea to Gallipoli","uid":11828669,"size":7731063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c08aa5824d08fb1043540fb591cae5125e43acf6&amp;dn=ANZAC+Infantryman+1914-15%3A+From+New+Guinea+to+Gallipoli&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429564502,"description":"This title explores the recruitment, training, and combat experiences of the famous ANZAC infantry in the opening years of World War I (1914-1918). Worried about the growing power of Japan and the German Far Eastern colonies, Australia and New Zealand had both introduced conscription in 1912. When war broke out in 1914, the men already in the system provided a small nucleus of trained soldiers, but at least half of those who went on to serve abroad had no previous military experience. Australians rushed to the colors even before their government had formally offered troops to Britain.\n\nSome initial training was undertaken in Australia, but most of the work had to be done when the AIF reached Egypt. Although the Anzacs were expecting to go on to France, little use was made of the experience of men who had already served on the Western Front. The decision to employ the Anzacs in the very different theatre of Gallipoli came as a complete surprise. The events at the Anzac and Suvla beach-heads have acquired an almost legendary status. In combat, the ANZACs responded with great discipline and a bravery that sometimes bordered on recklessness.\n\nThis book takes a close look at day-to-day life in the trenches of Gallipoli. The terrain was hard and stony, making the construction of trenches difficult. Water was constantly in short supply, and the rear areas remained well within the range of Turkish artillery. It also explores how the wounded were treated, the effects of disease in the crowded beach-head, and of weather-related complaints such as frostbite, which hospitalized many men. The experience of Gallipoli had a profound effect on those who survived, imbuing the ANZACs with an esprit de corps that characterized their superlative performance in France. Indeed it continues to mark the psyche of the two nations down to the present day","torrent":{"xt":"urn:btih:c08aa5824d08fb1043540fb591cae5125e43acf6","amp;dn":"ANZAC+Infantryman+1914-15%3A+From+New+Guinea+to+Gallipoli","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c08aa5824d08fb1043540fb591cae5125e43acf6","infoHashBuffer":{"type":"Buffer","data":[192,138,165,130,77,8,251,16,67,84,15,181,145,202,229,18,94,67,172,246]},"announce":[],"urlList":[]}}