{"title":"Born Entrepreneurs, Born Leaders: How Your Genes Affect","uid":8527555,"size":3574179,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0abfb498ee13ec7352f58d61e2f977cc234f141&amp;dn=Born+Entrepreneurs%2C+Born+Leaders%3A+How+Your+Genes+Affect&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1370059613,"description":"\nBorn Entrepreneurs, Born Leaders: How Your Genes Affect Your Work Life by Scott Shane\n2010 | ISBN: 0195373421 | English | 288 Pages | PDF | 3.40 MB\n\nIt's no secret that your genes have a subtle, but powerful impact on your job and career. But did you know that your DNA accounts for one third of the difference between you and your co-workers in many aspects of work life, from job satisfaction to income level? That's the revelation of this fascinating book--one that will change the way you think It's no secret that your genes have a subtle, but powerful impact on your job and career.\n\nDespite extensive evidence highlighting the influence of genetics in the business world, this critical connection has been glossed over by corporate leaders and management gurus. Now, for the first time, author Scott Shane explains why genes matter, and how an understanding of their relationship to behavior is of vital importance to employers, employees, and policy makers. This eye-opening resource begins with an incisive look at the basic function of genes and their effects on organizational behavior, providing a real-world analysis of how genes influence numerous aspects of our professional lives, from the jobs we choose, to how effectively we make decisions and manage people. Born Entrepreneurs, Born Leaders also delves into role that genetics plays in creativity and innovation, and focuses on how genes affect our tendency to start companies. Armed with these insights, you'll not only learn how to leverage your innate skills and personality, but you'll discover how to succeed by acting in ways contrary to your &quot;nature.&quot;\n","torrent":{"xt":"urn:btih:c0abfb498ee13ec7352f58d61e2f977cc234f141","amp;dn":"Born+Entrepreneurs%2C+Born+Leaders%3A+How+Your+Genes+Affect","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0abfb498ee13ec7352f58d61e2f977cc234f141","infoHashBuffer":{"type":"Buffer","data":[192,171,251,73,142,225,62,199,53,47,88,214,30,47,151,124,194,52,241,65]},"announce":[],"urlList":[]}}