{"title":"A Christmas Carol 2009 iTALiAN [ www.bt-italiatorrent.org ]","uid":5239738,"size":794442622,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c0ddefc033d4c79bba25e2916d9ccceef511818a&amp;dn=A+Christmas+Carol+2009+iTALiAN+%5B+www.bt-italiatorrent.org+%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"italiatraker","files":1,"time":1261698568,"description":"www.bt-italiatorrent.org  trovate giochi xbox dvd dvdrip e molto altro a velocita massima forza registratevi\n\n\n\n\n\n\n\n\n\nTitolo originale: Disney's A Christmas Carol\nNazione: USA\nAnno: 2009\nGenere: Fantastico\nDurata: 90'\nRegia: Robert Zemeckis\nCast: Jim Carrey, Colin Firth, Christopher Lloyd, Bob Hoskins, Daryl Sabara, Jacquie Barnbrook, Molly C. Quinn, Robin Wright Penn, Fay Masterson, Gary Oldman, Cary Elwes, Julian Holloway, Ron Bottitta, Lesley Manville\nSceneggiatura: Robert Zemeckis\nDistribuzione: Walt Disney Studios Motion Pictures Italia\nProduzione: ImageMovers, Walt Disney Pictures\nData di uscita: giovedÃƒÂ¬ 3 dicembre 2009 (cinema)\n\nTrama:\nIl vecchio e avaro strozzino Ebenezer Scrooge non ha alcuna intenzione di condividere le gioie del Natale. NÃƒÂ© con il nipote Fred nÃƒÂ© con il suo dipendente Bob, che riceve uno stipendio da fame e ha una famiglia numerosa, nÃƒÂ© tantomeno con chi gli chiede sottoscrizioni in favore dei piÃƒÂ¹ diseredati. Per lui il Natale ÃƒÂ¨ solo un giorno in cui deve pagare Bob che resterÃƒÂ  perÃƒÂ² a casa. La notte della vigilia compare perÃƒÂ², terrorizzandolo, il fantasma del suo socio in affari Marley, morto sette anni prima. Marley gli annuncia l'arrivo di tre Spiriti. Uno gli mostrerÃƒÂ  i suoi Natali passati, uno quello presente e l'ultimo quello futuro in cui lui sarÃƒÂ  morto e nessuno avrÃƒÂ  un buon ricordo della sua esistenza. La lezione gli servirÃƒÂ .\nDi &quot;Canto di Natale&quot; di Dickens il cinema si ÃƒÂ¨ impossessato sin dal 1914 e non ha smesso di occuparsene nel corso dei decenni a venire coinvolgendovi Paperone e soci, Bill Murray nei panni di un magnate televisivo e perfino i Muppets. Poteva mancare il 3D? Ovviamente no. Poteva Zemeckis, sperimentatore delle potenzialitÃƒÂ  del cinema da sempre, non tentare l'impresa? La risposta ÃƒÂ¨ ancora no. Al suo fianco trova il talento sempre piÃƒÂ¹ affinato e 'natalizio' (ÃƒÂ¨ stato Il Grinch ricordate?) di Jim Carrey che ÃƒÂ¨ pronto a quadruplicarsi (Scrooge e i tre spiriti) per questa storia 'morale' che resta valida oggi cosÃƒÂ¬ come nel 1843....","torrent":{"xt":"urn:btih:c0ddefc033d4c79bba25e2916d9ccceef511818a","amp;dn":"A+Christmas+Carol+2009+iTALiAN+%5B+www.bt-italiatorrent.org+%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0ddefc033d4c79bba25e2916d9ccceef511818a","infoHashBuffer":{"type":"Buffer","data":[192,221,239,192,51,212,199,155,186,37,226,145,109,156,204,238,245,17,129,138]},"announce":[],"urlList":[]}}