{"title":"Map Keyboard - Key Reassigner [Tuzito]","uid":15779506,"size":112632,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0e163ed1be86df63f9f411f11c96c13e8948073&amp;dn=Map+Keyboard+-+Key+Reassigner+%5BTuzito%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Tuzito","files":2,"time":1473275333,"description":"MapKeyboard is a program to remap your keyboard. so you can alter any key on your keyboard to any different one or altogether disable it as well.\r\n\r\nThe changes made are global for active user's account, across all applications &amp; games and best of all, MapKeyboard does not even need to be actively loaded in memory nor active at all.  \r\n\r\nMapKeyboard does not require installation. Just put the program on any folder of your choice and run it!. \r\n\r\nNote: MapKeyboard needs Microsoft .Net Framework 3.0  \r\n\r\nAfter launching the program, click any key on the window (with your mouse) and then set it another key by selecting an item from the list box at the bottom-left of the window. Repeat the same for as many keys as you need. If you need to disable the key, select &quot;Disabled&quot; from the list box. Note that keys which are mapped are shown in a green highlight. To remove a key remap, just select its original item in the listbox and the highlight should disappear.  After you are done with remapping the keys, click &quot;Save layout&quot; button on the bottom-right of the window to save your keyboard mapping. If you want to remove the whole keyboard mapping i.e. set the default layout, click &quot;Reset Keyboard Layout&quot;  That's it, just logout and log back into your windows user account to apply your mappings. Note that MapKeyboard does not need to be running for the changes to remain in effect. You only need to run it when you want to change the keys again on your keyboard or reset them.  Visit http://www.inchwest.com/mapkeyboard for latest updates and other information.\r\n\r\nUPLOPADER COMMENT:\r\nThis little marvel is a must-have. 73.5 kb sized, its the solution for reassing damaged keyboard keys (special for laptops). And the &quot;use once and forget&quot; make this tool to stand alone compared with all other alternatives on this category","torrent":{"xt":"urn:btih:c0e163ed1be86df63f9f411f11c96c13e8948073","amp;dn":"Map+Keyboard+-+Key+Reassigner+%5BTuzito%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e163ed1be86df63f9f411f11c96c13e8948073","infoHashBuffer":{"type":"Buffer","data":[192,225,99,237,27,232,109,246,63,159,65,31,17,201,108,19,232,148,128,115]},"announce":[],"urlList":[]}}