{"title":"The Very World Of Milton Jones - S01 to 03 - Audio Comedy - MP3 ","uid":5423823,"size":480306795,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c0fb6c5bd735deab7555c7f0a7523c4cd8e30e98&amp;dn=The+Very+World+Of+Milton+Jones+-+S01+to+03+-+Audio+Comedy+-+MP3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_Slimoo_","files":18,"time":1268174647,"description":"The Very World of Milton Jones - Series 01 to 03 - Audio Comedy - BBC 7 via DVB-T\n18 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo \n\n\n\n\nEach programme would begin with Jones facing certain death in some bizarre circumstance, such as being put before a firing squad in Mexico, or being faced with a cobra in the jungles of South America. At the moment before his death, a guardian angel would appear and freeze time, then spend the rest of the show reviewing and interpreting the events which had led up to his impending demise. \n\n\nMilton Jones\nAlexander Armstrong \nMelanie Hudson \nDave Lamb\nAlistair McGowan\nJoanna Scanlan \nSally Grace.\n\n\nThe Very World Of Milton Jones - S01 - E01 - Falling Through The Air Without A Parachute\nThe Very World Of Milton Jones - S01 - E02 - Chased By A Bull\nThe Very World Of Milton Jones - S01 - E03 - Bitten By A Cobra\nThe Very World Of Milton Jones - S01 - E04 - Shot In The Head by Gangsters\nThe Very World Of Milton Jones - S01 - E05 - Choking The Death On A Fun Sized Chocolate Bar\nThe Very World Of Milton Jones - S01 - E06 - Tied To A Railway Line In Deepest Wales\n\nThe Very World Of Milton Jones - S02 - E01 - Shot By A Firing Squad\nThe Very World Of Milton Jones - S02 - E02 - Struck By Lightning\nThe Very World Of Milton Jones - S02 - E03 - Freezing To Death In The Arctic\nThe Very World Of Milton Jones - S02 - E04 - Hit By A Car\nThe Very World Of Milton Jones - S02 - E05 - Crushed By A Newspaper Printing Press\nThe Very World Of Milton Jones - S02 - E06 - Attacked By A Shark\n\nThe Very World Of Milton Jones - S03 - E01 - Leaking Spacesuit\nThe Very World Of Milton Jones - S03 - E02 - Boiled To Death In Sharksfin Soup\nThe Very World Of Milton Jones - S03 - E03 - Falling From A Skyscraper\nThe Very World Of Milton Jones - S03 - E04 - Out On The Town In New Alexandria\nThe Very World Of Milton Jones - S03 - E05 - Heat Exhaustion\nThe Very World Of Milton Jones - S03 - E06 - Falling Off A Cliff\n\n\n.\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:c0fb6c5bd735deab7555c7f0a7523c4cd8e30e98","amp;dn":"The+Very+World+Of+Milton+Jones+-+S01+to+03+-+Audio+Comedy+-+MP3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0fb6c5bd735deab7555c7f0a7523c4cd8e30e98","infoHashBuffer":{"type":"Buffer","data":[192,251,108,91,215,53,222,171,117,85,199,240,167,82,60,76,216,227,14,152]},"announce":[],"urlList":[]}}