{"title":"Anthocyanins: Biosynthesis, Functions, and Applications","uid":7793353,"size":4044608,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c27108e3eccdb3f62b24755f02dcb409cf5e6a7b&amp;dn=Anthocyanins%3A+Biosynthesis%2C+Functions%2C+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352078128,"description":"Hardcover: 348 pages\nPublisher: Springer; 1 edition (October 8, 2008)\nLanguage: English\nISBN-10: 0387773347\nISBN-13: 978-0387773346\n\nIn recent years there has been an unprecedented expansion of knowledge about anthocyanins pigments. Indeed, the molecular genetic control of anthocyanins biosynthesis is now one of the best understood of all secondary metabolic pathways. There have also been substantial improvements in analytical technology that have led to the discovery of novel anthocyanin compounds. Armed with this knowledge and the tools for genetic engineering, plant breeders are now introducing vibrant new colors into horticultural crops. The food industry has also benefited from the resurgence of interest in anthocyanins. A greater understanding of the chemistry of these pigments has led to improved methods for stabilizing the color of anthocyanins extracts, so that they are more useful as food colorings. Methods for the bulk production of anthocyanins from cell cultures have been optimized for this purpose. Possible benefits to human health from the ingestion of anthocyanin-rich foods have also been a major feature of the recent scientific literature. Anthocyanins are remarkably potent antioxidants, and their ingestion has been postulated to stave off the effects of oxidative stress. These pigments, especially in conjunction with other flavonoids, have been associated with reductions in the incidence and severity of many other non-infectious diseases, including diabetes, cardiovascular disease and certain cancers. An industry is developing around anthocyanins as nutritional supplements. Finally, there has been significant progress in our understanding of the benefits of anthocyanins to plants themselves. Originally considered an extravagance without a purpose, anthocyanins are now implicated in multifarious vital functions. These include the attraction of pollinators and frugivores, aposematic defense from herbivores, and protection from environmental stressors such as strong light, UVB, drought, and free radical attacks. Anthocyanins are evidently highly versatile, and enormously useful to plants. This book covers all aspects of the biosynthesis and function of anthocyanins (and related compounds such as proanthocyanidins) in plants, and their applications in agriculture, food products, and human health. Featured areas include their relevance to: * Plant stress * Flower and fruit color * Human health * Wine quality and health attributes * Food colorants and ingredients * Cell culture production systems * The pastoral sector","torrent":{"xt":"urn:btih:c27108e3eccdb3f62b24755f02dcb409cf5e6a7b","amp;dn":"Anthocyanins%3A+Biosynthesis%2C+Functions%2C+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c27108e3eccdb3f62b24755f02dcb409cf5e6a7b","infoHashBuffer":{"type":"Buffer","data":[194,113,8,227,236,205,179,246,43,36,117,95,2,220,180,9,207,94,106,123]},"announce":[],"urlList":[]}}