{"title":"[John_Lent]Comic Books and Comic Strips in the United States thr","uid":11003847,"size":5823502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c29cc11ebc2f0eb1f6d75cbd11a497cf76fa6b74&amp;dn=%5BJohn_Lent%5DComic+Books+and+Comic+Strips+in+the+United+States+thr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":3,"time":1410191738,"description":"This final work in John Lent's series of bibliographies on comic art gathers together an astounding array of citations on American comic books and comic strips. Included in this volume are citations regarding anthologies and reprints; criticism and reviews; exhibitions, festivals, and awards; scholarship and theory; and the business, artistic, cultural, legal, technical, and technological aspects of American comics. Author John Lent has used all manner of methods to gather the citations, searching library and online databases, contacting scholars and other professionals, attending conferences and festivals, and scanning hundreds of periodicals. He has gone to great length to categorize the citations in an easy-to-use, scholarly fashion, and in the process, has helped to establish the field of comic art as an important part of social science and humanities research.\n\nThe ten volumes in this series, covering all regions of the world, constitute the largest printed bibliography of comic art in the world, and serve as the beacon guiding the burgeoning fields of animation, comics, and cartooning. They are the definitive works on comic art research, and are exhaustive in their inclusiveness, covering all types of publications (academic, trade, popular, fan, etc.) from all over the world. Also included in these books are citations to systematically-researched academic exercises, as well as more ephemeral sources such as fanzines, press articles, and fugitive materials (conference papers, unpublished documents, etc.), attesting to Lent's belief that all pieces of information are vital in a new field of study such as comic art.","torrent":{"xt":"urn:btih:c29cc11ebc2f0eb1f6d75cbd11a497cf76fa6b74","amp;dn":"%5BJohn_Lent%5DComic+Books+and+Comic+Strips+in+the+United+States+thr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c29cc11ebc2f0eb1f6d75cbd11a497cf76fa6b74","infoHashBuffer":{"type":"Buffer","data":[194,156,193,30,188,47,14,177,246,215,92,189,17,164,151,207,118,250,107,116]},"announce":[],"urlList":[]}}