{"title":"Lil Kim feat. T-Pain &amp; Charlie Wilson - Download","uid":4989384,"size":136425476,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c2ac3a3a236d644ef8910b607cd28ee2fc1d92ca&amp;dn=Lil+Kim+feat.+T-Pain+%26+Charlie+Wilson+-+Download&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"2nafish","files":-1,"time":1246953214,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Download&quot; is a hip hop song performed by rapper Lil' Kim, featuring R&amp;B singers T-Pain and Charlie Wilson. It was written by Lil Kim and T-Pain and produced by The Trackmasters. The song samples &quot;Computer Love&quot; by Zapp. It has so far peaked at number 21 on the Billboard Hot R&amp;B/Hip-Hop Songs chart. It eventually made it to the top 10 US Urban Radio airplay and climbed to #10 with 2171 hits.\n\nThe video was shot on March 27, 2009, but T-Pain was unable to attend due to being in a golf cart accident that same day. The video was released on May 3, 2009 via Kim's MySpace and features Charlie Wilson and an animated version of T-Pain. Lil Kim's Dancing With The Stars partner, Derek Hough, is featured in the video. Also, Actress Lisa Raye &amp; Lil B (For The Love of Ray J) makes a cameo. The music video made its television premiere on MTV2 during Sucker Free on June 10, 2009.\n\nKimberly Denise Jones (born July 11, 1975), better known by her stage name Lil' Kim, is an American rapper and singer who was part of the group Junior M.A.F.I.A.\n\nJones was born and raised in Brooklyn and lived much of her adolescent life on the streets after being expelled from home. From the influence of fellow rapper The Notorious B.I.G., she began her music career in 1994 with the group Junior M.A.F.I.A., whose debut album Conspiracy generated three hit singles. In late 1996, her solo debut album Hard Core was released. Hard Core was certified double platinum and spawned chart-topping hits &quot;No Time&quot; and &quot;Crush on You&quot;. Her following albums, The Notorious K.I.M. (2000) and La Bella Mafia (2003), were also largely successful.\n\nIn 2005, Lil' Kim served a yearlong prison sentence for lying to a jury about her friends' involvement in a shooting four years earlier. During her incarceration, her fourth album The Naked Truth was released to poor sales and modestly charting singles. Lil' Kim returned to the public spotlight in 2009 with an appearance on Dancing with the Stars.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c2ac3a3a236d644ef8910b607cd28ee2fc1d92ca","amp;dn":"Lil+Kim+feat.+T-Pain+%26+Charlie+Wilson+-+Download","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ac3a3a236d644ef8910b607cd28ee2fc1d92ca","infoHashBuffer":{"type":"Buffer","data":[194,172,58,58,35,109,100,78,248,145,11,96,124,210,142,226,252,29,146,202]},"announce":[],"urlList":[]}}