{"title":"Induction Music for Out-of-Body Travel with William Buhlman FLAC","uid":11880894,"size":622215861,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c2eba3f0507d17dfbe29e87d0e1fe0b5460c5034&amp;dn=Induction+Music+for+Out-of-Body+Travel+with+William+Buhlman+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"elessedilgirl","files":4,"time":1430685783,"description":"This 2-CD set combines hypnotic ancient rhythms with the latest psycho-acoustic mind technologies. This music will help to transport the listener from the beta to delta brain state. Please avoid using this 2-CD set while operating a vehicle or anything that requires external concentration. For maximum effectiveness, headphones should be used in conjunction with your favorite out-of-body induction technique.\n\n&quot;Waves of Light&quot; is an exhilarating yet profoundly peaceful musical journey into the mind, body and beyond. By combining the ancient knowledge of harmonics and recent discoveries in brain research, &quot;Waves of Light&quot; produces specific frequencies (for alpha, then theta) to create whole-brain consciousness and tunes the body to the natural harmonics of the earth and sun. A relaxing ride to Nirvana.\n\n&quot;The Power of 7&quot; is a magical sound sculpture (tuned to the color green) which energizes and balances the heart chakra (thymus) by resonating the subtle energy levels of the listener. Combining hypnotic ancient rhythms with the latest psycho-acoustic mind technologies, this music will transport the listener from the beta to delta brain state. &quot;The Power of Seven&quot; is used professionally for healing, inducing altered states of consciousness and out-of-body travel. William Buhlman has trained out-of-body travelers in his workshops for more than a decade, teaching people how to project their consciousness outside the limits of their physical bodies and to explore dimensions and worlds beyond everyday life.\n\nreference libFLAC 1.3.1 20141125\n\nSecure rips and AccurateRip verified. Logs included","torrent":{"xt":"urn:btih:c2eba3f0507d17dfbe29e87d0e1fe0b5460c5034","amp;dn":"Induction+Music+for+Out-of-Body+Travel+with+William+Buhlman+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2eba3f0507d17dfbe29e87d0e1fe0b5460c5034","infoHashBuffer":{"type":"Buffer","data":[194,235,163,240,80,125,23,223,190,41,232,125,14,31,224,181,70,12,80,52]},"announce":[],"urlList":[]}}