{"title":"Travesty: The Trial of Slobodan Milosevic and the Corruption Of ","uid":6499264,"size":1556808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3cf402d715eb787cb98e038b0b711b1d7e8de67&amp;dn=Travesty%3A+The+Trial+of+Slobodan+Milosevic+and+the+Corruption+Of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Djofullinn","files":1,"time":1309188693,"description":"Travesty: The Trial of Slobodan Milosevic and the Corruption Of International Justice\n\nProduct Description\n\nIn 2006, Slobodan Milosevic died in prison in the Hague during a four-year marathon trial for war crimes. John Laughland was one of the last Western journalists to meet with him. Laughland had followed the trial from its beginning and wrote extensively on it in the Guardian and the Spectator, challenging the legitimacy of the Yugoslav Tribunal and the hypocrisy of &quot;international justice.&quot;\n\nIn this short book, Laughland gives a full account of the trial---the longest trial in history---from the moment the indictment was issued at the height of NATO's attack on Yugoslavia to the day of Milosevic's mysterious death in custody. &quot;International justice&quot; is supposed to hold war criminals to account, but---as the trials of both Milosevic and Saddam Hussein show---the indictments are politically motivated and the judicial procedures are irredeemably corrupt. Laughland argues that international justice is an impossible dream and that such show trials are little more than propaganda exercises designed to distract attention from the war crimes committed by Western states.\nAbout the Author\nJohn Laughland is the author of three previous books: The Death of Politics (1994), The Tainted Source (1997) and Le tribunal penal international (2003). He is currently working on A History of Political Trials from Charles I to Saddam Hussein and on a book about the 19th century German philosopher, Schelling, while his Israel on Israel (co-edited with Michel Korinman) is due out this autumn. He is a regular contributor to the Spectator, the Guardian and the Mail on Sunday.\n &lt;a href=&quot;\nhttp://www.amazon.com/Travesty-Trial-Slobodan-Milosevic-Corruption/dp/0745326358/ref=sr_1_1?ie=UTF8&amp;qid=1309169733&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Travesty-Trial-Slobodan-Milosevic-Corruption/dp/0745326358/ref=sr_1_1?ie=UTF8&amp;qid=1309169733&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:c3cf402d715eb787cb98e038b0b711b1d7e8de67","amp;dn":"Travesty%3A+The+Trial+of+Slobodan+Milosevic+and+the+Corruption+Of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3cf402d715eb787cb98e038b0b711b1d7e8de67","infoHashBuffer":{"type":"Buffer","data":[195,207,64,45,113,94,183,135,203,152,224,56,176,183,17,177,215,232,222,103]},"announce":[],"urlList":[]}}