{"title":"Dead Line - Stella Rimington.epub","uid":8943046,"size":329725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c407bfb3937261f023669a3003db8e0244587683&amp;dn=Dead+Line+-+Stella+Rimington.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379712125,"description":"MI5 Intelligence Officer Liz Carlyle is summoned to a meeting with her boss Charles Wetherby, head of the Service's Counter-Espionage Branch. His counterpart over at MI6 has received alarming intelligence from a high-placed Syrian source. A Middle East peace conference is planned to take place at Gleneagles in Scotland and several heads of state will attend. The Syrians have learned that two individuals are mounting an operation to disrupt the peace conference in a way designed to be spectacular, laying the blame at Syria's door.The source claims that Syrian Intelligence will act against the pair, presumably by killing them. No one knows who they are or what they are planning to do. Are they working together? Who is controlling them? Or is the whole story a carefully laid trail of misinformation? It is Liz's job to find out. But, as she discovers, the threat is far greater than she or anyone else could have imagined. The future of the whole of the Middle East is at stake and the conference deadline is drawing ever closer.","torrent":{"xt":"urn:btih:c407bfb3937261f023669a3003db8e0244587683","amp;dn":"Dead+Line+-+Stella+Rimington.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c407bfb3937261f023669a3003db8e0244587683","infoHashBuffer":{"type":"Buffer","data":[196,7,191,179,147,114,97,240,35,102,154,48,3,219,142,2,68,88,118,131]},"announce":[],"urlList":[]}}