{"title":"Grammar of the Shot (2nd Edition)","uid":6553265,"size":2142657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c463d7e7ef07fd532ee8bc41b9f943ea05c4b224&amp;dn=Grammar+of+the+Shot+%282nd+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"_F1_","files":-1,"time":1311183468,"description":"Roy Thompson, Christopher J. Bowen &quot;Grammar of the Shot, Second Edition&quot;\nF .ocal P .ress | 2009-02-20 | ISBN: 0240521218 | 232 pages | PDF | 2.04 MB\n\n Learn how to use the basic &quot;grammar&quot; of making films and videos in Grammar of the Shot! This book shows you in no uncertain terms what you absolutely need to know to put together your own film or video, shot by shot. Whether you are just learning how to frame a shot or if you just need a refresher, this book gives you a basic toolkit of how to build a successful visual story that flows smoothly. \n Grammar of the Shot begins with an explanation of the essential visual language of filmmaking-the book takes you from the basic shape of a shot, to different types to shots, to composition of visual elements within each frame. You will be given the basic building blocks essential for successful shot lighting, screen direction, 3D elements, camera movement, and many general practices that make for a richer, multi-layered visual presentation. Most importantly, you will be given crucial background information to expand your visual vocabulary and help jumpstart your career in film and video.\n\n Designed as an easy-to-use reference, each topic is covered succinctly and is accompanied by clear photographs and diagrams that illustrate the key concepts presented in the book. Simple, elegant, and easy to use, Grammar of the Shot is a staple of any filmmaker's library.\n\n * A simple and clear overview of the principles of shooting...timeless information that will improve your work\n * Designed as a quick reference: each topic covered in a two-page spread\n * Together with its companion volume Grammar of the Edit, these little books are all the beginning filmmaker needs","torrent":{"xt":"urn:btih:c463d7e7ef07fd532ee8bc41b9f943ea05c4b224","amp;dn":"Grammar+of+the+Shot+%282nd+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c463d7e7ef07fd532ee8bc41b9f943ea05c4b224","infoHashBuffer":{"type":"Buffer","data":[196,99,215,231,239,7,253,83,46,232,188,65,185,249,67,234,5,196,178,36]},"announce":[],"urlList":[]}}