{"title":"TED Xvid cam GLOBE","uid":7423920,"size":1171187864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c470910b4465caf0f572483e317ae6db8dfdce75&amp;dn=TED+Xvid+cam+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"globeplus","files":-1,"time":1341707222,"description":"* XVID CAM  * 01H35M19S    * + 1500 Bitrate    * Worked with the Dub plugins\n\n\n* FILE INFO :\n\n\n- Black borders at the top and the bottom in full screen corrected\n\n- particles on the picture background reduced to the minimum\n\n- colours improved\n\n\n\n* Plot :\n\nIn 1985, near Boston, John Bennett is a lonely child who dearly wished for his new Christmas gift, a large teddy bear named Ted, to come to life to be his friend. That wish coincided with a falling star and Ted (voiced by Seth MacFarlane) became a fully mobile sentient being. After John's parents (Alex Borstein and Ralph Garman) got over the shock, word of the miracle spread and Ted was briefly a celebrity.\n\nIn 2012, John (Mark Wahlberg) and Ted (voiced and motion captured by Seth MacFarlane) are still staunch, if immature, companions enjoying a hedonistic life even while John is pursuing a 4 year-long relationship with a level-headed office worker, Lori Collins (Mila Kunis). As the fourth anniversary of their relationship approaches, Lori hopes to marry John, but she feels he can't move ahead with his life with Ted around, who has become a vulgar, obnoxious wastrel. John is resistant to making his lifelong companion leave, but he is finally persuaded that night to act when the couple discover Ted at home with four prostitutes, one of whom had defecated on the floor during a game of truth or dare.\n\n\n\n\n\n\n\n* enjoy ...\n\n\n\n\n\n\n\n\n\n\n* GLOBE FILES 2012\n","torrent":{"xt":"urn:btih:c470910b4465caf0f572483e317ae6db8dfdce75","amp;dn":"TED+Xvid+cam+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c470910b4465caf0f572483e317ae6db8dfdce75","infoHashBuffer":{"type":"Buffer","data":[196,112,145,11,68,101,202,240,245,114,72,62,49,122,230,219,141,253,206,117]},"announce":[],"urlList":[]}}