{"title":"Jerry Mander - Four Arguments for the Elimination of TV (pdf)","uid":8942286,"size":3406560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c485a49df8e496c32944c2103f361ec85c984d7c&amp;dn=Jerry+Mander+-+Four+Arguments+for+the+Elimination+of+TV+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1379692709,"description":"Jerry Mander - Four Arguments for the Elimination of Television (Quill, 1977). 371 pages.\n\nPdf file converted from djvu; searchable (clearscan), with accurate pagination and contents in booksmarks.\n\n\nThis is not the same file and doesn't have the same contents as the torrent uploaded earlier today with this title. This torrent is the complete book.\n\n\nIn fairness to Jerry Mander, I think we have to keep in mind he never had a chance to see Breaking Bad. In fact this book was written before there was even a glimmer of hope (i.e., Hill Street Blues) in the wasteland that was 1970s television. It's hard to imagine anyone making an argument like this today, but it's fascinating even so.\n\n\npublisher description:\n\nA total departure from previous writing about television, this book is the first ever to advocate that the medium is not reformable. Its problems are inherent in the technology itself and are so dangerous -- to personal health and sanity, to the environment, and to democratic processes -- that TV ought to be eliminated forever.\n\nWeaving personal experiences through meticulous research, the author ranges widely over aspects of television that have rarely been examined and never before joined together, allowing an entirely new, frightening image to emerge. The idea that all technologies are &quot;neutral,&quot; benign instruments that can be used well or badly, is thrown open to profound doubt. Speaking of TV reform is, in the words of the author, &quot;as absurd as speaking of the reform of a technology such as guns.&quot;","torrent":{"xt":"urn:btih:c485a49df8e496c32944c2103f361ec85c984d7c","amp;dn":"Jerry+Mander+-+Four+Arguments+for+the+Elimination+of+TV+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c485a49df8e496c32944c2103f361ec85c984d7c","infoHashBuffer":{"type":"Buffer","data":[196,133,164,157,248,228,150,195,41,68,194,16,63,54,30,200,92,152,77,124]},"announce":[],"urlList":[]}}