{"title":"The Bite of the Mango - Mariatu Kamara.epub","uid":8999353,"size":601833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c51fc8965cb9cef963bd972b6539566ba22f26cf&amp;dn=The+Bite+of+the+Mango+-+Mariatu+Kamara.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1380927141,"description":"&quot;The astounding story of one girl's journey from war victim to UNICEF Special Representative.&quot;\n\nAs a child in a small rural village in Sierra Leone, Mariatu Kamara lived peacefully surrounded by family and friends. Rumors of rebel attacks were no more than a distant worry.\n\nBut when 12-year-old Mariatu set out for a neighboring village, she never arrived. Heavily armed rebel soldiers, many no older than children themselves, attacked and tortured Mariatu. During this brutal act of senseless violence they cut off both her hands.\n\nStumbling through the countryside, Mariatu miraculously survived. The sweet taste of a mango, her first food after the attack, reaffirmed her desire to live, but the challenge of clutching the fruit in her bloodied arms reinforced the grim new reality that stood before her. With no parents or living adult to support her and living in a refugee camp, she turned to begging in the streets of Freetown.\n\nIn this gripping and heartbreaking true story, Mariatu shares with readers the details of the brutal attack, its aftermath and her eventual arrival in Toronto. There she began to pull together the pieces of her broken life with courage, astonishing resilience and hope.","torrent":{"xt":"urn:btih:c51fc8965cb9cef963bd972b6539566ba22f26cf","amp;dn":"The+Bite+of+the+Mango+-+Mariatu+Kamara.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c51fc8965cb9cef963bd972b6539566ba22f26cf","infoHashBuffer":{"type":"Buffer","data":[197,31,200,150,92,185,206,249,99,189,151,43,101,57,86,107,162,47,38,207]},"announce":[],"urlList":[]}}