{"title":"N.T. Wright - Revelation for Everyone (pdf)","uid":8269235,"size":2355751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c59892cb9109bce02a83df6399432699e5541a57&amp;dn=N.T.+Wright+-+Revelation+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"pharmakate","files":-1,"time":1363568078,"description":"N. T. Wright - Revelation for Everyone (Westminster John Knox Press, 2011). 227 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nEighteenth and final book in the series New Testament for Everyone; click my username to find other volumes in the series. The whole series is now available on tpb.\n\nBrief commentary on the book of Revelation.\n\nN. T. Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion, with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nAbout the Author\n\nN. T. Wright is the Bishop of Durham in the Church of England. He is a prolific author and noted New Testament scholar and was named by Christianity Today as one of the world's top five theologians. He has written over thirty books, both at the scholarly level and for a popular audience.","torrent":{"xt":"urn:btih:c59892cb9109bce02a83df6399432699e5541a57","amp;dn":"N.T.+Wright+-+Revelation+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59892cb9109bce02a83df6399432699e5541a57","infoHashBuffer":{"type":"Buffer","data":[197,152,146,203,145,9,188,224,42,131,223,99,153,67,38,153,229,84,26,87]},"announce":[],"urlList":[]}}