{"title":"Carbon Nanotubes - Quantum Cylinders of Graphene","uid":15348942,"size":9800903,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6af6e0787cba3bcc8f3390576289f194ed1a2db&amp;dn=Carbon+Nanotubes+-+Quantum+Cylinders+of+Graphene&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"clouderone","files":1,"time":1468910828,"description":"Carbon Nanotubes - Quantum Cylinders of Graphene - S. Saito, A. Zettl (Elsevier, 2008).pdf\r\n\r\nISBN 978-0-444-53276-3\r\n\r\nThis volume is devoted to mostly to nanotubes, unique synthetic nanoscale quantum systems whose physical properties are often singular (i.e. record-setting). Nanotubes can be formed from a myriad of atomic or molecular species, the only requirement apparently being that the host material or “wall fabric be configurable as a layered or sheet-like structure. Nanotubes with sp2-bonded atoms such as carbon, or boron together with nitrogen, are the champions of extreme mechanical strength, electrical response (either highly conducting or highly insulating), and thermal conductance. Carbon nanotubes can be easily produced by a variety of synthesis techniques, and for this reason they are the most studied nanotubes, both experimentally and theoretically. Boron nitride nanotubes are much more difficult to produce and only limited experimental characterization data exist. Indeed, for boron nitride nanotubes, theory is well ahead of experiment. For these reasons this volume deals largely with carbon nanotubes. Conceptually, the &quot;building block&quot; for a carbon nanotube is a single sheet of graphite, called graphene. Recently, it has become possible to experimentally isolate such single sheets (either on a substrate or suspended). This capability has in turn fueled many new theoretical and experimental studies of graphene itself. It is therefore fitting that this volume contains also a chapter devoted to graphene","torrent":{"xt":"urn:btih:c6af6e0787cba3bcc8f3390576289f194ed1a2db","amp;dn":"Carbon+Nanotubes+-+Quantum+Cylinders+of+Graphene","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6af6e0787cba3bcc8f3390576289f194ed1a2db","infoHashBuffer":{"type":"Buffer","data":[198,175,110,7,135,203,163,188,200,243,57,5,118,40,159,25,78,209,162,219]},"announce":[],"urlList":[]}}