{"title":"Wolverine Le Origini Serie Completa - Tutti i Torrent [Albi  ITA","uid":6181553,"size":23983,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6bd56e45b1e61abea3fd0dd73d934ed409dbb31&amp;dn=Wolverine+Le+Origini+Serie+Completa+-+Tutti+i+Torrent+%5BAlbi++ITA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"l.diliberto","files":6,"time":1297972065,"description":"Wolverine Le Origini Serie Completa - Tutti i Torrent [Albi  ITA CBR] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=240626&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=240626&lt;/a&gt;\n\n.: Trama :.\n\nProtagonista narrante di questa vicenda ÃƒÂ¨ Rose, ragazzina appena dodicenne che avendo perduto i genitori decide di trasferirsi in collina alla magione della famiglia Howlett, per poter servire il padroncino James, figlio secondogenito, ma unico rimasto, di John Howlett.\nL'impatto con la casa ÃƒÂ¨ dei migliori, la piccola Rose diventa subito amica di James e di Dog, altro ragazzino che vive alle dipendenze della famiglia e passano una delle estati migliori.\nCome sempre, qualcosa deve accadere e dopo qualche spiacevole incidente in cui vengono coinvolti Dog e James, il padrone, su &quot;costrizione&quot; del nonno decide di riprendere il ragazzino e lo affida alle cure del padre. Dog cosÃƒÂ¬ comincia a chiudersi in se stesso e viene spesso maltrattato dal padre, finchÃƒÂ¨ un giorno non raggiunge l'apice: Dog litiga con James e sgozza il suo piccolo cucciolo di cane appena regalato per Natale. Da lÃƒÂ¬ in poi ÃƒÂ¨ un susseguirsi di eventi drammatici: Dog e il padre vengono allontanati dalla magione, Rose ÃƒÂ¨ costretta a vivere nella paura di essere nuovamente assalita dall'ormai ex amico e il piccolo James, divorato dalle sue malattie ed allergie, si chiude ulteriormente.\nCosÃƒÂ¬ che il signor Kenneth (padre di Dog), giunto ormai all'esasperazione, decide di vendicarsi della famiglia Howlett e prepara un'incursione armata nella villa. Attimi di disperazione, splendidamente disegnati, sono quelli che danno il via al cambiamento di James: il sig. Kenneth uccide sotto gli occhi di tutti il padrone John e al tempo stesso avviene la trasformazione.\nDalle mani di James escono degli artigli e in preda ad un raptus di follia assale l'aggressore del padre togliendogli la vita e ferisce in maniera grave il giovane Dog.\nFu cosÃƒÂ¬ che nacque il personaggio di Wolverine, in poche pagine avviene il cambiamento, ma da quanto viene lasciato trasparire anche il fratello, precedentemente morto, aveva avuto problemi similari a James.\nLa madre, giÃƒÂ  sconvolta di suo, dopo gli ultimi avvenimenti della tragica notte decide di allontanare il figlio, ormai tramutatosi in qualcosa a metÃƒÂ  tra un animale e un essere umano, un mostro indecifrabile. Fuggendo insieme alla giovane Rose, su cui cadono tutti i sospetti dei delitti alla magione, i due raggiungono un posto in Canada dove intraprendono una nuova vita.\nMa qualcosa ÃƒÂ¨ cambiato: per preservarlo e proteggerlo Rose afferma che il nome del taciturno James ÃƒÂ¨ Logan, vale a dire il nome di Dog che tante disgrazie hanno portato nella sua vita. Oltre al nome, Logan cambia radicalmente nel suo carattere. Diviene cupo e introverso, finchÃƒÂ¨ non riesce a padroneggiare gli artigli che escono dalle sue mani.\nLa storia procede poi verso un finale abbastanza insolito per questo genere di storia, con un ritorno di Dog e dei particolari incontri.\nPassando ai punti di forza di questo volume da oltre 130 pagine, possiamo elencare soprattutto la splendida caratterizzazione dei personaggi. Partendo da Rose, il cui personaggio, a volte, puÃƒÂ² risultare stucchevole per l'eccessiva bontÃƒÂ , ma per l'estrema verosimiglianza con una persona vera. Passando per il protagonista della storia: Wolverine, di cui si comprende anche la vera natura e il nome, tutti i motivi che lo hanno portato al formare di quel carattere cosÃƒÂ¬ grezzo, rude, ma al tempo stesso indomitamente buono. Il cambiamento che aleggia nelle pagine, risulta perÃƒÂ² leggermente troppo veloce e forse spiegato in maniera troppo implicita e questo secondo me ÃƒÂ¨ un fattore leggermente negativo che mi ha convinto a dare quattro stelle invece che cinque come valutazione.\nLogan cambia, si chiude, ma c'ÃƒÂ¨ una leggera incoerenza nel finale, poichÃƒÂ© lui si chiude a riccio come se gli avvenimenti della villa fossero impressi nella sua memoria, ma alla fine ÃƒÂ¨ lo stesso Dog che deve ricordargli cosa ÃƒÂ¨ successo in quella tragica notte. Probabilmente l'idea degli autori era quella per cui Wolverine dovesse rimuovere dalla sua memoria quegli avvenimenti fino a un nuovo shock come poteva essere il nuovo incontro con Dog. Ma siccome non vi ÃƒÂ¨ certezza nella buona fede del super staff, preferisco lasciare uno spazietto di delusione in questo albo.\nIl suo amore per Rose, il suo futuro amore per Jean Grey sembrano ricalcare parte del suo cambiamento e dare un senso alla sua vita. Non ÃƒÂ¨ solo amicizia d'infanzia quella che lega i personaggi, ma sentimenti ben piÃƒÂ¹ forti che traspariranno pian piano dalle pagine.\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img232.imageshack.us/img232/8440/coversite6yk9ngvi6.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img232.imageshack.us/img232/8440/coversite6yk9ngvi6.gif&lt;/a&gt;\n\n.: Crediti :.\n\nAutore: PAUL JENKINS, BILL JEMAS, JOE QUESADA\nTitolo: WOLVERINE LE ORIGINI\nAnno: 2002\nNazionalitÃƒÂ : USA\nGenere: Supereroi","torrent":{"xt":"urn:btih:c6bd56e45b1e61abea3fd0dd73d934ed409dbb31","amp;dn":"Wolverine+Le+Origini+Serie+Completa+-+Tutti+i+Torrent+%5BAlbi++ITA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6bd56e45b1e61abea3fd0dd73d934ed409dbb31","infoHashBuffer":{"type":"Buffer","data":[198,189,86,228,91,30,97,171,234,63,208,221,115,217,52,237,64,157,187,49]},"announce":[],"urlList":[]}}