{"title":"Chris Whitley - Dirt Floor - 24/96 FLAC TQMP","uid":5498311,"size":585943838,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c6f9385fe1afd9198ba0719d513d33c9231766f9&amp;dn=Chris+Whitley+-+Dirt+Floor+-+24%2F96+FLAC+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"johnnywellas","files":17,"time":1271398732,"description":"Hey there.\n\nI finally took the time and converted this beauty to FLAC, preserving its 24\nbit/96 khz integrity. Not sure, but I think that these days, even onboard audio is\ncapable of playing the files without having to downsample, thus not degrading\nsound quality on playback. If unsure, check out your soundcard's tech specs.\n\nRipped the tracks using a win app called DVD Audio Extractor or something,\ncouldn't find any linux app that could decode 24/96 LPCM from the DVD.\n\nIf you must, for some unexplainable reason, get this into an Audio CD, I'd advise\nyou to search around for a FLAC rip of the original CD version. You could try and\n&quot;remaster&quot; it by yourself, but the odds of disaster are great. Your call though.\nI listened to the ripped files as I tagged them and wrote this down, but if you do\nnotice any weird stuff going on with the audio, please let me know. Thank you.\n\n-----------------\n\nA little inside info on the album, by the producer, Craig Street:\n(quoted from http://mixonline.com/mag/audio_craig_street_studio/ : )\n\n&quot;What kind of approach did you take to recording Chris Whitley's Dirt Floor?\nWe were going to record it in his apartment, and at the last minute me and Chris\nand this wonderful engineer named Danny Kadar got in a truck and decided to go up\nto his dad's place in Vermont. We did the record in a workshop, where there's a\nwood-burning stove and a lot of old motorcyle parts. It's where Chris does a lot\nof his writing. He was real comfortable in there. We just hung the mic up by some\nwire because Chris stomps his foot a lot. Well, also because we forgot the\nmicrophone stand, but it was a blessing in disguise. I used two mic pre's that\nwere designed specifically for a ribbon mic, prototypes made by Tim DeParavicini.\n\nWe used a pair of those and ran a Speiden into that. We recorded to an old Ampex\n440 that the engineer had, and did backup on a little Studer CD-R that I use\ninstead of a DAT for backup and rough mixes. I carried up the ProAcs, and an Audio\nResearch preamp that I use in my work space to monitor with, and we used that as a\n2-track select. We set up everything in the kitchen and ran wires back to the\nshed, and that was it. Chris sat down and played, and we did all the songs in a\nday. The next morning we got up and made a master reel. Greg Calbi mastered it for\nus. I love the contrast between that experience and the grander experience of\nworking with Patti Scialfa with T-Bone [Burnett] where it's huge production, tons\nof musicians, lots of edits.&quot;\n\nThis is a roundtable meeting/lecture about sound quality, where Craig also\ndiscusses the Dirt Floor's production; the link will hop directly to the time mark\nwhere this matter comes up:\n\n-------------------------\n\nHope you enjoy it. I'll be seeding for a while, but please do the same, so that\nothers can enjoy it too. Thank you.\n","torrent":{"xt":"urn:btih:c6f9385fe1afd9198ba0719d513d33c9231766f9","amp;dn":"Chris+Whitley+-+Dirt+Floor+-+24%2F96+FLAC+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6f9385fe1afd9198ba0719d513d33c9231766f9","infoHashBuffer":{"type":"Buffer","data":[198,249,56,95,225,175,217,25,139,160,113,157,81,61,51,201,35,23,102,249]},"announce":[],"urlList":[]}}