{"title":"Jump Desktop (RDP &amp; VNC) v7.0 APK (Android) [HTD]","uid":14259382,"size":15385909,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c7460988a5fc5e1626300f0292d53e83c7e447a6&amp;dn=Jump+Desktop+%28RDP+%26amp%3B+VNC%29+v7.0+APK+%28Android%29+%5BHTD%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pahly","files":1,"time":1460236615,"description":"Jump Desktop is a remote desktop application that lets you control your computer from your phone or tablet. Compatible with both RDP and VNC, Jump Desktop is secure, reliable and very easy to set up. The streamlined user interface gives you the best possible remote desktop experience on any of your mobile and tablet devices.\r\n\r\nEasy setup and reliable:\r\nJump Desktop is very easy to configure; anyone can do it! Just visit:http://jumpdesktop.com/go on your PC or Mac and follow step-by-step instructions. You’ll be up and running in no time.\r\n\r\nSecure and built on open standards:\r\nJump Desktop is a true RDP and VNC client with built-in support for encryption. It lets you connect to your computer using an IP address or hostname, if you already have RDP or VNC configured on it.\r\n\r\nPowerful features:\r\nUnleash the full power of your phone or tablet while connected to your computer. Multitouch ready - pinch-to-zoom and two finger scrolling make controlling your computer easy and productive. Jump's multi-threaded rendering engine has been fine tuned for Android. Jump's VNC and RDP decoding is one of the fastest you'll find on Android.\r\n\r\n\r\nFeatures:\r\nMulti-protocol: supports RDP and VNC\r\nMulti-touch ready: Pinch-zoom, two finger scrolling, mouse dragging all supported. Even three finger taps are supported to quickly show and hide the keyboard.\r\nEasy and secure setup: Automatically configure your PC or Mac for remote access using Wi-Fi and 3G without worrying about your router settings. Set up as many computers as you like and manage them all using your Google account (optional)\r\nSSH Tunnel support (new!)\r\nThe best external keyboard and mouse support on Android: Supports all external keyboard keys and shortcuts. Right mouse clicks supported too with external mice - all natural, PC like!\r\nUniversal application: Works on tablets and phones - buy it only once and use it on all your Android devices\r\nFull support for multitasking: Switch to other apps without disconnecting\r\nSupports large custom screen resolution\r\nFull mouse support: left and right clicks, dragging, scrolling, precision pointer movement\r\nRDP features:\r\nTested on: Windows 2000, XP, Vista, Windows 7, Server 2003, Server 2008, Server 2008 R2, SBS Server\r\nSecure: 40/56/128bit RDP, TLS/SSL, FIPS and NLA authentication support\r\nSupports 8, 16 and 24-bit colors and all RDP performance options\r\nMultiple monitor support on Windows 7 and above\r\nConsole sessions\r\nAudio streaming\r\nVNC features:\r\nTested with Mac OS X, TightVNC, RealVNC, UltraVNC, Linux (Ubuntu Remote Desktop)\r\nSecure: Supports SSL encryption when used with Jump's automatic setup \r\n8 and 16-bit color\r\nOS X Screen Sharing support\r\nMultiple monitor support\r\nSupported encodings: copyrect, zrle, tight, (zlib)hextile, zlib, rre, raw, desktop-resize\r\nWhat's in this version : (Updated : 23 March 2016)\r\nNo recent changes\r\nRequired Android O/S : 2.2+","torrent":{"xt":"urn:btih:c7460988a5fc5e1626300f0292d53e83c7e447a6","amp;dn":"Jump+Desktop+%28RDP+%26amp%3B+VNC%29+v7.0+APK+%28Android%29+%5BHTD%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7460988a5fc5e1626300f0292d53e83c7e447a6","infoHashBuffer":{"type":"Buffer","data":[199,70,9,136,165,252,94,22,38,48,15,2,146,213,62,131,199,228,71,166]},"announce":[],"urlList":[]}}