{"title":"Nightmare Creatures","uid":7500239,"size":688672320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c767a99f8efe861f5275ec06bafbe616eb29f45e&amp;dn=Nightmare+Creatures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"esharoth","files":-1,"time":1344000439,"description":"Title: Nightmare Creatures\nGenre: action / horror / 3rd-person\nReleased: 30th October 1997\nDeveloper: Kalisto Entertainment\nPublisher: Activision\nDescription:\nThe year is 1834. Adam Crowley, the leader of the Brotherhood of Hecate, has found and deciphered a book written by Samuel Pepys, which has granted him the power to create a race of demonic creatures for use in taking over the world. It is now up to the player to stop the evil Crowley and silence the Brotherhood's ambitions forever by assuming the role of either Father Ignatius Blackward or Nadia Ignatius. Each character has his or her own unique attack methods and combinations, all of which will be useful throughout the 16 levels of third-person perspective gameplay. While most of the time is spent in London, the player will travel through city streets, dark sewers, waterways and docks. Along the way, Crowley's minions must be dealt with. They come in the form of ravenous zombies, werewolves, flying reptilian demons, dockers, insects, and faceless men who are rumored to be former members of the Brotherhood.\n\nHow to play:\n1) Burn NC_PC.cue to a disc or mount it on a virtual drive;\n2) Start SETUP.EXE and install the game (it will open automatically if you have autorun enabled);\n3) Navigate to where you installed the game, run NCSETUP.EXE and turn on 3D Hardware acceleration, ZBuffer and Animations;\n4) Copy NC_V12.EXE to where you installed the game (this is the updated game executable);\n5) Create a shortcut of NC_V12.EXE, open shortcut properties window and add -D3D at the end of the Target field (eg. if you installed the game at the default location, the modified Target field will look like this: &quot;C:Program FilesActivisionNightmare CreaturesNC_V12.EXE&quot; -D3D);\n6) Start the game using the created shortcut and play it with the disc inserted.\n\n! Notice\nTested and working fine on Windows 7 x64.","torrent":{"xt":"urn:btih:c767a99f8efe861f5275ec06bafbe616eb29f45e","amp;dn":"Nightmare+Creatures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c767a99f8efe861f5275ec06bafbe616eb29f45e","infoHashBuffer":{"type":"Buffer","data":[199,103,169,159,142,254,134,31,82,117,236,6,186,251,230,22,235,41,244,94]},"announce":[],"urlList":[]}}