{"title":"Jethro Tull 24 Bit Vinyl Pack","uid":8627157,"size":6861758787,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c790222252a33000d86c1a79f2f895f87f5d9dd8&amp;dn=Jethro+Tull+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"politux","files":-1,"time":1372537672,"description":"\n  Jethro Tull 24 Bit Vinyl Pack\n\n  * Genre: Pop/Rock\n  * Styles: Album Rock, Art Rock, Blues-Rock, Hard Rock, Arena Rock\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums\n\n  * 1968 This Was\n  * 1969 Stand Up (UK) (PBTHAL)\n  * 1970 Benefit \n  * 1971 Aqualung\n  * 1971 Aqualung (40th Anniversary LP)\n  * 1972 Thick as a Brick\n  * 1978 Burstin Out: Jethro Tull Live\n\n  Artist Bio\n\n  * Jethro Tull was a unique phenomenon in popular music history. Their mix of hard rock; folk melodies; blues licks; surreal, impossibly dense lyrics; and overall profundity defied easy analysis, but that didn't dissuade fans from giving them 11 gold and five platinum albums. At the same time, critics rarely took them seriously, and they were off the cutting edge of popular music since the end of the 1970s. But no record store in the country would want to be without multiple copies of each of their most popular albums (Benefit, Aqualung, Thick as a Brick, Living in the Past), or their various best-of compilations, and few would knowingly ignore their newest releases. Of their contemporaries, only Yes could claim a similar degree of success, and Yes endured several major shifts in sound and membership in reaching the 1990s, while Tull remained remarkably stable over the same period. As co-founded and led by wildman-flautist-guitarist-singer-songwriter Ian Anderson, the group carved a place all its own in popular music.\n\n  * Tull had its roots in the British blues boom of the late '60s. Anderson (b. Aug. 10, 1947, Edinburgh, Scotland) had moved to Blackpool when he was 12. His first band was called the Blades, named after James Bond's club, with Michael Stephens on guitar, Jeffrey Hammond-Hammond (b. July 30, 1946) on bass and John Evans (b. Mar. 28, 1948) on drums, playing a mix of jazzy blues and soulful dance music on the northern club circuit. In 1965, they changed their name to the John Evan Band (Evan having dropped the &quot;s&quot; in his name at Hammond's suggestion) and later the John Evan Smash. By the end of 1967, Glenn Cornick (b. Apr. 24, 1947, Barrow-in-Furness, Cumbria, England) had replaced Hammond-Hammond on bass. The group moved to Luton in order to be closer to London, the center of the British blues boom, and the band began to fall apart, when Anderson and Cornick met guitarist/singer Mick Abrahams (b. Apr. 7, 1943, Luton, Bedfordshire, England) and drummer Clive Bunker (b. Dec. 12, 1946), who had previously played together in the Toggery Five and were now members of a local blues band called McGregor's Engine.\n\n  * In December of 1967, the four of them agreed to form a new group. They began playing two shows a week, trying out different names, including Navy Blue and Bag of Blues. One of the names that they used, Jethro Tull, borrowed from an 18th-century farmer/inventor, proved popular and memorable, and it stuck. In January of 1968, they cut a rather derivative pop-folk single called &quot;Sunshine Day,&quot; released by MGM Records (under the misprinted name Jethro Toe) the following month. The single went nowhere, but the group managed to land a residency at the Marquee Club in London, where they became very popular.","torrent":{"xt":"urn:btih:c790222252a33000d86c1a79f2f895f87f5d9dd8","amp;dn":"Jethro+Tull+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c790222252a33000d86c1a79f2f895f87f5d9dd8","infoHashBuffer":{"type":"Buffer","data":[199,144,34,34,82,163,48,0,216,108,26,121,242,248,149,248,127,93,157,216]},"announce":[],"urlList":[]}}