{"title":"Helge Lien - 2012 - Kattenslager FLAC","uid":11255474,"size":215206301,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c8e6ec93597b94eae37ce2083cd8b6d60922ab98&amp;dn=Helge+Lien+-+2012+-+Kattenslager+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"eika256","files":-1,"time":1413850509,"description":"Helge Lien - 2012 - Kattenslager\n\nThe title of Helge Lien's official debut as a solo artist is as eccentric as the music contained on it. While listening to a Danish jazz song from the 60s, Norwegian Lien misheard the lyrics as saying &quot;Kattenslager&quot;. In fact, they were referring to a &quot;Plattenslager&quot; (&quot;Pop Record&quot;), but the non-existing term would prove to be perfect for the album's equally subtle, mysterious and disturbing piano sounds. Fans of Lien's lyrical trio work certainly won't be disappointed. And yet this time, his performance is no longer restricted by any preconceived melodic motives. Instead, ideas flow from his fingers with complete ease and unbound by limiting concepts, resulting in a record of remarkable freedom, immediacy and unpredictability.\nIn creative terms, &quot;Kattenslager&quot; marks another important step forward for Helge Lien. Already his six releases with his internationally renowned trio showed him to be one of the leading Norwegian pianists of his generation, translating the sound of fjords and trolls into utterly unconventional, irresistible and highly addictive compositions. &quot;Kattenslager&quot; now sees him pursuing an even more explorative and experimental direction and constantly gauging the limits of tonality - walking the tightrope between fluxus and flexibility, jazz and classical, between traditional arrangement and the avantgarde.\nWithin this personal sonic maelstrom, the laws of physic no longer seem to apply. Through more than a decade of touring and performing, Lien has built a dazzling virtuosity and on &quot;Kattenslager&quot;, he is channeling his technique into eleven tracks of free-flowing improvisation. Although still clearly revealing his roots in jazz and classical music, Lien is drawing from a far wider stylistic spectrum, displaying a wealth of idiosyncratic musical ideas and arranging them according to the moods and feelings of the moment. On opener &quot;Grusveivandrer&quot;, the result are garish, dark and yet playful sonic spaces deliberately deconstructing the conventional timbres of the piano. Extending far beyond the soft touch of piano keys, Lien is penetrating the core of his instrument, turning it into a mirror of his soul.\nConsciously avoiding predictable approaches and forms, each track on the album is an expression of individuality: Nordic-folk influenced &quot;Furulokk&quot; is riding a wave of expressive (dis)harmonies created by the continuous oscillation between dark and light notes. &quot;Ur&quot; slows the pace of the music down to a deep, medita\ntive breath. And on &quot;Babbel&quot;, gently floating waves accompanied by a fearful subsonic roar flow into cool free-jazz phrasings, momentarily taking the listener back into familiar territory,.\nIn some cases, as on &quot;Stille By&quot;, the result is even born from complete silence and universal emptiness. And yet, as a whole, &quot;Kattenslager&quot; is all about quirkiness and sheer delight in playing. This may sound like a contradiction in terms to many of his colleagues. And yet, to Helge Lien, chaos is order and contemplation - and from the outward disorder of some of his pieces grows a strange sense of peace. (OzellaMusic)\n\nTrack list:\n01 - Grusveivandrer\n02 - Furulokk\n03 - Ur\n04 - Babbel\n05 - Stille By\n06 - Kattenslager\n07 - Knyt Og Kann\n08 - Uro\n09 - Oy\n\nEnjoy and share!","torrent":{"xt":"urn:btih:c8e6ec93597b94eae37ce2083cd8b6d60922ab98","amp;dn":"Helge+Lien+-+2012+-+Kattenslager+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8e6ec93597b94eae37ce2083cd8b6d60922ab98","infoHashBuffer":{"type":"Buffer","data":[200,230,236,147,89,123,148,234,227,124,226,8,60,216,182,214,9,34,171,152]},"announce":[],"urlList":[]}}