{"title":"The New Evolution Diet","uid":8074162,"size":243030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c906c6a7add97e034efcdaa78be1478ca9eff812&amp;dn=The+New+Evolution+Diet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1359343045,"description":"The New Evolution Diet: What Our Paleolithic Ancestors Can Teach Us about Weight Loss, Fitness, and Aging by Arthur De Vany\n2011 | ISBN: 0091929571, 1609613767 | English | 256 Pages | EPUB \n\nThis title presents a simple way to lose weight, look younger and feel healthier - without restricting calories or excessive exercising. &quot;The New Evolution Diet&quot; is Professor Arthur De Vany's astonishing lifestyle programme. Based on his decades-long study of weight, diet and health, it looks to our ancestors' lifestyle of eating a lot and moving a little. With fascinating insight and research, De Vany overturns our current guilt-ridden approach to diet and exercise, proving that we can lose pounds, look younger, beat diabetes and prevent heart disease simply by living on meat, fruit and vegetables, and embarking on only brief, intense periods of exercise. He then offers a clear plan, complete with menu ideas and exercise suggestions, so that you too can: shed pounds in a matter of weeks; say goodbye to endless exercise; feel more energized; give up command-and-control diets for good; look younger and prevent premature ageing; increase your sex drive; and, achieve optimum health. ","torrent":{"xt":"urn:btih:c906c6a7add97e034efcdaa78be1478ca9eff812","amp;dn":"The+New+Evolution+Diet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c906c6a7add97e034efcdaa78be1478ca9eff812","infoHashBuffer":{"type":"Buffer","data":[201,6,198,167,173,217,126,3,78,252,218,167,139,225,71,140,169,239,248,18]},"announce":[],"urlList":[]}}