{"title":"2Pac-Pacs_Life-(Explicit)-2006-RAGEMP3","uid":3559347,"size":86584325,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9aaa2803061b35b8463f2975c0ca4a06ee7c6ac&amp;dn=2Pac-Pacs_Life-%28Explicit%29-2006-RAGEMP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kopimi","files":21,"time":1163779148,"description":"2Pac - Pac&amp;#039;s Life (Explicit)\n\nartist:      2Pac\ntitle:       Pac&amp;#039;s Life (Explicit)\nlabel:       Amura Ent. / Interscope Records\ntype:        Album\ngenre:       Rap\nsource:      CDDA\ngrabber:     EAC\nencoder:     Lame-3.90.3\nyear:        2006\ntracks:      13\ntime:        55:08\nsize:        81,6 MB\nbitrate:     VBRkbps\nmode:        Joint-Stereo\nurl:         www.tasf.com   www.2paclegacy.com\nrip date:    15-Nov-2006\nstreet date: 21-Nov-2006\nlocation:    USA, Westside\n\n01.  Untouchable (Swizz Beatz Remix) (Ft. Bone Thugs-n-Harmony)        04:16\n02.  Pac&amp;#039;s Life (Ft. T.I., Ashanti)                                    03:37\n03.  Dumpin&amp;#039; (Ft. Hussein Fatal, Papoose, Carl Thomas)                 04:28\n04.  Playa Cardz Right (Female) (Ft. Keyshia Cole)                     04:33\n05.  Whatz Next (Ft. A3, Jay Rock)                                     04:18\n06.  Sleep (Ft. Young Buck, Chamillionaire)                            04:10\n07.  International (Ft. Nipsey Hussle, Young Dre The Truth)            04:03\n08.  Don&amp;#039;t Sleep (Ft. Lil Scrappy, Nutso, Yaki Kadafi, Stormy)         03:36\n09.  Soon As I Get Home (Ft. Yaki Kadafi)                              03:40\n10.  Playa Cardz Right (Male) (Ft. Ludacris, Keon Bryce)               04:54\n11.  Don&amp;#039;t Stop (Ft. Big Syke, Yaki Kadafi, Hussein Fatal, EDI, Young  05:25\n12.  Pac&amp;#039;s Life Remix (Ft. Snoop Dogg, T.I., Chris Starr)              03:38\n13.  Untouchable (Ft. Yaki Kadafi, Hussein Fatal, Gravy)               04:30\n\n\nFREE SET-YEEN &amp; AH-YIEN!!!- KNVT-\n\n2Pac&amp;#039;s legendary work ethic and constant drive often found him laying down vocals in two or three rooms of a recording studio simultaneously, and\nthen heading straight to a film set, video shoot, or concert, only to begin again the next morning, sleeping during travel from one location to\nthe next. Since his tragic death, his spirit has been kept alive thanks to the extraordinary legacy of unfinished recordings he left behind, and\nthe commitment his mother Afeni Shakur has made to continue to get his complete body of work released; work considered even more astonishing\ngiven that his first album came out in 1991 and he was murdered in September 1996 at age 25. Now some of the recordings from this tremendously\nprolific period are brought to light for the first time on Pac&amp;#039;s Life (Amaru/Interscope Records), released November 21, 2006. Other than one\nverse fans will recognize from an earlier album, all of the recordings on the album are previously unheard. Contributing to Pac&amp;#039;s Life are\nLudacris, Snoop Dogg, Keyshia Cole, T.I., Ashanti, Young Buck, Lil Scrappy, Carl Thomas, Outlawz, Bone Thugs-N-Harmony, Big Syke, Papoose, with\nproductions from LT Hutton, Sha Money XL, Swizz Beatz and more. The artists and producers involved range from his close friends and colleagues to\nthose who grew up on his music and were inspired and motivated by it. The passion and the fire inside him makes it possible, 10 years and 11\nposthumous albums later to create yet another album of unreleased material.\n&quot;I say it every time, that Tupac left us the blueprints to follow, and without the amazing contributions made by everyone of these artists,\nproducers, musicians, everyone, I do not know how I would get this great task accomplished,&quot; says Afeni Shakur, his mother, the album&amp;#039;s executive\nproducer (along with Tom Whalley) and founder of the Tupac Amaru Shakur Foundation, &quot; I believe whole-heartedly that Tupac sends the people he\nwants to these projects.&quot;\n\n2Pac&amp;#039;s relevance is attested to by the success of his post-1996 albums. His most recent studio album, 2004&amp;#039;s Loyal To The Game, charted #1 Pop\nand #1 R&amp;B/Hip-Hop and was certified platinum. The soundtrack to Tupac: Resurrection that same year hit #2 Pop and #3 R&amp;B/Hip-Hop and was also\nplatinum. 2002&amp;#039;s Better Dayz, #5 Pop and #1 R&amp;B/Hip-Hop, earned double platinum while the previous year&amp;#039;s Until The End Of Time, #1 Pop and #1\nR&amp;B/Hip-Hop, reached the triple platinum plateau. In 2000, Still I Rise scored #6 Pop and #1 R&amp;B/Hip-Hop positions while racking up a platinum\naward. 1998&amp;#039;s Greatest Hits, #3 Pop and #1 R&amp;B/Hip-Hop, is currently nine times platinum. The Tupac Amaru Shakur Foundation (TASF) was founded by\nAfeni Shakur to provide training and support to artists who aspire to enhance their creative talents. TASF fosters an environment that encourages\nfreedom of expression, serves as a resource for the arts, and empowers through education. To date, more than 500 students have benefited from the\nprogram with a broad range of training available via the Annual Performing Arts Day Camp held at the Tupac Amaru Shakur Center for the Arts (home\nof the Foundation in Stone Mountain, Georgia). Students are able to study creative writing, vocal technique, acting, stage set design, dance,\npoetry, spoken word, and conflict resolution.\n","torrent":{"xt":"urn:btih:c9aaa2803061b35b8463f2975c0ca4a06ee7c6ac","amp;dn":"2Pac-Pacs_Life-%28Explicit%29-2006-RAGEMP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9aaa2803061b35b8463f2975c0ca4a06ee7c6ac","infoHashBuffer":{"type":"Buffer","data":[201,170,162,128,48,97,179,91,132,99,242,151,92,12,164,160,110,231,198,172]},"announce":[],"urlList":[]}}