{"title":"The Hidden History Of The English Scriptures - Gail Riplinger","uid":11773639,"size":873031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9b6a501b06b35f459c0b882910a2c4884cadc00&amp;dn=The+Hidden+History+Of+The+English+Scriptures+-+Gail+Riplinger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427179028,"description":"WHAT ONE needs to know is distilled into this one book. Having been asked every question imaginable, Dr. Riplinger arms you with the answers. The most important facts and solid-gold historic quotes are packed rock-solid in this dynamite seventy-two page volume.\n\nYOUR ENGLISH BIBLE is traced from Acts 2 to you. This book is not made up of the typical yawn-drawing liberal fables. It distils the cream from the history sections of In Awe of Thy Word and adds newly found quotes that are sure to encourage any Bible believer.\n\nFor example, you won t read these three facts in the time-fogged fiction set forth in seminary textbooks:\n1.) IN THE 1500s John Foxe, author of Foxes Book of Martyrs, records a statement from what he called a certain old treatise, found in a certain ancient English book. This ancient book says, Also the four evangelists wrote the gospels in divers languages, as Matthew in Judea, Mark in Italy, Luke in Achaia, and John in Asia. And all these wrote in the languages of the same countries...since Christ commanded his apostles to preach his gospel unto all the world, and excepted no people or language (John Foxe, The Acts and Monuments, 1583, Stephen Cattley, ed., republished at London: R.B. Seeley and W. Burnside, 8 volumes, 1837, vol. 4, pp. 671, 675).\n\n2.) THE PROLOGUE before the book of Matthew in an edition of the Bishops Bible (1500s) said,\nMatthew, who also was called Leui, being of a Publican made an Apostle, did first in Iurie [Jewry] write the Gospel of Christ in the Hebrew tongue for their sakes which beleeued of the circumcision. It is uncertaine who afterwards did translate it into the Greeke tongue. Howbeit the copy of the Hebrew is kept vnto this day in the library of Cesarea, which library one Pamphilus Martyr did gather together most diligently. And the Nazarenes, which in Berea a city of Syria, did vse the same booke, gaue vs leaue to copie it out (J.R. Dore, Old Bibles: An Account of the Early Versions of the English Bible, Eyre and Spottiswoode, 1888, 2nd edition, p. 285).\n\n3.) PAUL'S LETTER to the Galatians, who spoke Celtic, and to the Romans, who spoke Latin, would of necessity be written by him in those languages also. History professor Kenneth W. Harl (Yale Ph.D.) reminds us that it was not a Greek-speaking world when the New Testament was written, as some pseudo-intellectual seminary professors pretend. The Roman Empire had carried their Latin language across the empire.\n\nThe bookis great as a quick read for those who are time-pressed or who have read In Awe of Thy Word entirely and wish someone would condense its history for their friends.\n\nIt is a definitive textbook for homeschool, Christian high schools and colleges.\n\nAbout the author:\nGail Anne Riplinger (born 1947) is an American writer and speaker known for her support of the inerrancy of the King James Bible. Gail has BA., M .A., and M .F.A. degrees and has done additional postgraduate study at Harvard and Cornell Universities. As a university professor, the author taught seventeen different courses, authored six college textbooks and was selected for the Honor Society?s teaching award and membership in a national Education Honorary. The seventh textbook, New Age Bible Versions, was an international best seller and for it the author was honored with a Doctorate from the College of the nation?s largest church. The author is in several editions of Who's Who and was invited to be a member of President Reagan?s Citizens Ambassador Program","torrent":{"xt":"urn:btih:c9b6a501b06b35f459c0b882910a2c4884cadc00","amp;dn":"The+Hidden+History+Of+The+English+Scriptures+-+Gail+Riplinger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b6a501b06b35f459c0b882910a2c4884cadc00","infoHashBuffer":{"type":"Buffer","data":[201,182,165,1,176,107,53,244,89,192,184,130,145,10,44,72,132,202,220,0]},"announce":[],"urlList":[]}}