{"title":"Infernal Restraints--Chained and Tamed  Dixon Mason  PD  Jack Ha","uid":9647054,"size":1376068784,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c9f93628f5b05cb1376f7662fb42ca15ae92ddba&amp;dn=Infernal+Restraints--Chained+and+Tamed++Dixon+Mason++PD++Jack+Ha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"merzedes","files":1,"time":1393022505,"description":"Chained &amp; Tamed | Dixon Mason | PD | Jack Hammer\n\nFebruary 21, 2014\n\n\nMP4 only.\n\n\nDixon Mason sums up the allure of device bondage perfectly. With rope there is wiggle room, there is a chance to writhe and escape, but with iron there is no hope. It is cold and unyielding, the perfect counter point to the sensuality of rope. \n\nShe starts off bound with tape. It isn't the way she thought this was going to start, but quickly it begins to turn into something else. A metal collar around her neck attaches her by a chain to the ceiling. It keeps her in place in a way she did not expect. She can't relax her legs or even slouch without the metal pulling against her throat. Worse, she can't move far from where she is. PD knows it and takes full advantage, whipping her ass mercilessly. \n\nWhen the iron is around her wrists and ankles she moves down to the floor. The bar that keeps her legs apart exposes her pussy to a brutal caning. Her tits are tied off to make them more sensitive for their own abuse. She talked about it earlier, the effect bondage and discipline has on her body. The bruises haven't even started to form but her pussy is dripping wet. She isn't quite able to cum from the pain but the Hitachi on her clit will get her the rest of the way there.\n\nDixon's a bit tired after her orgasms, but PD's friend Jack Hammer is here and he hasn't had his turn with her yet. Now the metal bars and shackles have her on her back with her legs spread up into the air. The iron box on her head blocks out all of the light but amplifies every sound around her. The sounds of foot steps, the cane coming down on her legs, even her own screams are made louder as they echo in the tiny prison. She is going to cum again, harder this time, and as the waves of orgasms take her body she will get the exact feeling she wants, bucking against the relentless bondage.  \n\nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/02_21dmason8/InfernalRestraints-Dixon-Mason-PD-Jack-Hammer-Chained--Tamed.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/02_21dmason8/InfernalRestraints-Dixon-Mason-PD-Jack-Hammer-Chained--Tamed.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:c9f93628f5b05cb1376f7662fb42ca15ae92ddba","amp;dn":"Infernal+Restraints--Chained+and+Tamed++Dixon+Mason++PD++Jack+Ha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f93628f5b05cb1376f7662fb42ca15ae92ddba","infoHashBuffer":{"type":"Buffer","data":[201,249,54,40,245,176,92,177,55,111,118,98,251,66,202,21,174,146,221,186]},"announce":[],"urlList":[]}}