{"title":"Among the Lowest of the Dead - (Malestrom)","uid":4693692,"size":34399288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca8ae49144bd2c53f49d9e1170653d6d97d7513e&amp;dn=Among+the+Lowest+of+the+Dead+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1233484209,"description":" &lt;a href=&quot;http://www.image-upload.net/images/q40ynd8yj9mvyy20igvq.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/q40ynd8yj9mvyy20igvq.jpeg&lt;/a&gt;\n\nAmong the Lowest of the Dead: The Culture of Capital Punishment\nPublisher:University of Michigan Press | Pages:496 | 2006-06-26 | ISBN:0472031236 | PDF \n\n\nThorough and unbiased, Among the Lowest of the Dead is a gripping narrative that provides an unprecedented journalistic look into the actual workings of the capital punishment system.\n\n&quot;Has all the tension of the best true crime stories . . . This is journalism at its best.&quot;\n--Library Journal\n\n&quot;A compelling argument against capital punishment. . . . Examining politicians, judges (including Supreme Court Justices), prosecutors, defense attorneys and the condemned themselves, the author makes an effective case that, despite new laws, execution is no less a lottery than it has always been.&quot;\n--Publishers Weekly\n\n&quot;In a fine and important book, Von Drehle writes elegantly and powerfully. . . . Anyone certain of their opinion about the death penalty ought to read this book.&quot;\n-- Booklist\n\n&quot;An extremely well-informed and richly insightful book of great value to students of the death penalty as well as intelligent general readers with a serious interest in the subject, Among the Lowest of the Dead is also exciting reading. The book is an ideal guide for new generations of readers who want to form knowledgeable judgments in the continuing--and recently accelerating--controversies about capital punishment.&quot;\n--Anthony Amsterdam, New York University\n\n&quot;Among the Lowest of the Dead is a powerfully written and meticulously researched book that makes an invaluable contribution to the growing public dialogue about capital punishment in America. It's one of those rare books that bridges the gap between mass audiences and scholarly disciplines, the latter including sociology, political science, criminology and journalism. The book is required reading in my Investigative Journalism classes--and my students love it!&quot;\n--David Protess, Northwestern University\n\n&quot;Among The Lowest of the Dead deserves a permanent place in the literature as literature, and is most relevant to today's death penalty debate as we moderate advocates and abolitionists search for common ground.&quot;\n--Robert Blecker, New York Law School\n\nDavid Von Drehle is Senior Writer, The Washington Post and author of Triangle: The Fire that Changed America","torrent":{"xt":"urn:btih:ca8ae49144bd2c53f49d9e1170653d6d97d7513e","amp;dn":"Among+the+Lowest+of+the+Dead+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8ae49144bd2c53f49d9e1170653d6d97d7513e","infoHashBuffer":{"type":"Buffer","data":[202,138,228,145,68,189,44,83,244,157,158,17,112,101,61,109,151,215,81,62]},"announce":[],"urlList":[]}}