{"title":"FSX/P3D StrikeFlanker ver1.0","uid":10073268,"size":198202234,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cd31341b54b17065dfb5b54a62fab41f4e1739c8&amp;dn=FSX%2FP3D+StrikeFlanker+ver1.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"kandoit","files":-1,"time":1398880727,"description":"This is not mine found else ware works fine on my system p3d\n\nSystem Requirements / FS Compatibility\n\nMICROSOFT FLIGHT SIMULATOR X (ESP/Prepar 3D)\nWindows - Windows XP or Win7/Vista\nProcessor - 2.8 GHz\nVideo Card - 256 Mb\nMemory - 2 Gb RAM\nHard Drive - 400 Mb\n\nMICROSOFT FLIGHT SIMULATOR 2004\nWindows - Windows XP or Win7/Vista\nProcessor - 2.8 GHz\nVideo Card - 256 Mb\nMemory - 2 Gb RAM\nHard Drive - 200 Mb\n\nThe Sukhoi Su-30 is a twin-engine, two-seat fighter aircraft developed by Russia's Sukhoi Aviation Corporation. It is a multirole fighter for all-weather, air-to-air and air-to-surface deep interdiction missions. It is a fighter with both air superiority and attack capabilities, generally similar to the U.S.F-15E.\n\nThe Su-30 has two distinct version branches, manufactured by KnAAPO and the Irkut Corporation, both of which come under the Sukhoi group's umbrella. KnAAPO manufactures the Su-30MKK and the Su-30MK2, The Chinese chose an older but lighter radar so the canards could be omitted in return for increased payload.\n\nIrkut offered the multirole Su-30MK/MKI for India Air Force, Along with its ground-attack capabilities, the series adds features for the air-superiority role, such as canards, thrust-vectoring, and a long-range phase-array radar. The Russian Air force operates several Su-30s and has ordered the Su-30SM version.\n\nThe Su-30 Flanker C from Bear Studios is an accurate and in-depth simulation product for Microsoft Flight Simulator FSX (ESP/Prepar 3D) and FS2004. In this product, we make complex systems and operating procedures simulating reference from a real combat aircraft.\n\nNote: For flight simulator versions differences and limitations, not all animations and/or features may function during solo or multiplayer flight.\n\nFS2004 have few models and textures, under animation limits, FS2004 version model have no weapon payload, so we highly recommend fly our flanker product FSX version \t","torrent":{"xt":"urn:btih:cd31341b54b17065dfb5b54a62fab41f4e1739c8","amp;dn":"FSX%2FP3D+StrikeFlanker+ver1.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd31341b54b17065dfb5b54a62fab41f4e1739c8","infoHashBuffer":{"type":"Buffer","data":[205,49,52,27,84,177,112,101,223,181,181,74,98,250,180,31,78,23,57,200]},"announce":[],"urlList":[]}}