{"title":"Applied Evolutionary Anthropology: Darwinian Approaches to Conte","uid":10778060,"size":5746028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdb138e6a554b718ac91b701a45925b5484325a5&amp;dn=Applied+Evolutionary+Anthropology%3A+Darwinian+Approaches+to+Conte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Sunghabib","files":-1,"time":1408135940,"description":"Book Description:\n\nAs a species, we are currently experiencing dramatic shifts in our lifestyle, family structure, health, and global contact. Evolutionary Anthropology provides a powerful theoretical framework to study such changes, revealing how current environments and legacies of past selection shape human diversity. This book is the first major review of the emerging field of Applied Evolutionary Anthropology bringing together the work of an international group of evolutionary scientists, addressing many of the major public health and social issues of this century. Through a series of case studies that span both rural and urban situations in Africa, Asia, Europe and South America, each chapter addresses topics such as natural resource management, health service delivery, population growth and the emergence of new family structures, dietary, and co-operative behaviours. The research presented identifies the great, largely untapped, potential that Applied Evolutionary Anthropology holds to guide the design, implementation and evaluation of effective social and public health policy. This book will be of interest to policy-makers and applied researchers, along with academics and students across the biological and social sciences.\n\nProduct Details:\n\nSeries: Advances in the Evolutionary Analysis of Human Behaviour (Book 1)\nHardcover: 299 pages\nPublisher: Springer; 2014 edition (March 11, 2014)\nLanguage: English\nISBN-10: 1493902792\nISBN-13: 978-1493902798\n\n\n\n-------\nSeed - Share - Enjoy - Give me Thumbs Up\n-------","torrent":{"xt":"urn:btih:cdb138e6a554b718ac91b701a45925b5484325a5","amp;dn":"Applied+Evolutionary+Anthropology%3A+Darwinian+Approaches+to+Conte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdb138e6a554b718ac91b701a45925b5484325a5","infoHashBuffer":{"type":"Buffer","data":[205,177,56,230,165,84,183,24,172,145,183,1,164,89,37,181,72,67,37,165]},"announce":[],"urlList":[]}}