{"title":"The Hobbit An Unexpected Journey Re-cut (from Blu-Ray)","uid":9603515,"size":6058885137,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:cdd5d0c86dec03732d1ec1bc91bd613a867fb987&amp;dn=The+Hobbit+An+Unexpected+Journey+Re-cut+%28from+Blu-Ray%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"meierfilm","files":1,"time":1392168907,"description":"This is not a quick hack and slash of the original film. Using the Hobbit: UEJ Extended Cut Edition, I have carefully removed what many have considered to be superfluous scenes, removed some expository dialogue and trimmed countless frames here and there to create a new cut that keeps the story intact and, with very few exceptions, plays as seamless as the original version. Only extremely discerning viewers will notice the differences, even though I have brought the original Extended Edition runtime of 3:02 down to a far tighter 1:48 (credits excluded). In places I have patched over jarring music cuts with samples from the original score to create as seamless an experience as possible.\n\nIMPORTANT: This is in no way meant to be viewed as an &quot;improved&quot; or &quot;superior&quot; version! What Peter Jackson and his team created is a terrific cinematic experience and only an arrogant person would imply that he/she could do &quot;better&quot;. This cut was only an experiment - to see if the story and heart of the film could be retained by judiciously trimming what many viewers perceived to be a slightly long-winded account of the story. No disrespect intended for Wingnut Films!!!\n\nAlso please kept in mind I have kept the file quite large as to not tarnish the experience with poor quality footage.\n\nBTW this is the first torrent I've ever uploaded, so apologies if I've not included all pertinent information.\n\nTRT:       1:38:33\nSize:      6.06 GB\nVideo:      .mp4 (1920 x 800)\nLanguage:   English\n\nEnjoy, and please share!\n","torrent":{"xt":"urn:btih:cdd5d0c86dec03732d1ec1bc91bd613a867fb987","amp;dn":"The+Hobbit+An+Unexpected+Journey+Re-cut+%28from+Blu-Ray%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd5d0c86dec03732d1ec1bc91bd613a867fb987","infoHashBuffer":{"type":"Buffer","data":[205,213,208,200,109,236,3,115,45,30,193,188,145,189,97,58,134,127,185,135]},"announce":[],"urlList":[]}}