{"title":"NuruMassage - Lea Lexis (Accidental Mother Fucker) NEW 26 Februa","uid":13681590,"size":443759796,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:cdde4484e828c6089ca59048a4f0ba61c7e19df0&amp;dn=NuruMassage+-+Lea+Lexis+%28Accidental+Mother+Fucker%29+NEW+26+Februa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1456478771,"description":"Eric Masterson and son Seth Gamble wait with anticipation for Lea Lexis, Eric's new mail order bride at the Nuru Massage. Eric receives a business phone call and asks Seth to wait there until Lea shows up and begs him to be nice to her. Lea walks into the waiting room, thrilled to meet her new 'husband' and gives him a fat kiss on the lips! Seth is confused but realizes she thinks he's his father and of course the little pervert plays along since she is so adamant to show him what she does! Lea starts taking off her clothes, exhibiting her plump and supple boobs, which Seth can't wait to touch as her supposed 'husband'. Lea chaperones Seth into the shower lathering up his massive, hard cock and stroking it with her hungry hands and mouth caressing his huge erection. Lea continues her treatment in the bathtub, squeezing her boobs together for Seth's cock to fuck. Then, straddling his rough and hard cock with her tight pussy, promising him she will please him over and over again. They fuck each other in outstanding positions until Seth spurts his dripping load all over her plump chest!\r\nTags: Oil, Kissing, Big Tits, Brunette, MILF, Shower, Blowjob, Titty Fuck, Masturbation, Natural Tits, Body Sliding, Massage, Bath, Ass, Big Dick, Nuru Gel, Shaved, Cum on Pussy, Stepmom, Family Roleplay\r\n \nhttp://imgdone.com/viewer.php?file=60702097225725782788.jpg\r\n \nhttp://imgdone.com/viewer.php?file=44212370412875902164.jpg","torrent":{"xt":"urn:btih:cdde4484e828c6089ca59048a4f0ba61c7e19df0","amp;dn":"NuruMassage+-+Lea+Lexis+%28Accidental+Mother+Fucker%29+NEW+26+Februa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdde4484e828c6089ca59048a4f0ba61c7e19df0","infoHashBuffer":{"type":"Buffer","data":[205,222,68,132,232,40,198,8,156,165,144,72,164,240,186,97,199,225,157,240]},"announce":[],"urlList":[]}}