{"title":"David T. Courtwright - Dark Paradise. A History of Opiate Addict","uid":10426546,"size":1648568,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce1c67248203525cde5877c2ca3794a54a125c2d&amp;dn=David+T.+Courtwright+-+Dark+Paradise.+A+History+of+Opiate+Addict&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403712119,"description":"Description\nProduct Details\nBook Title: Dark Paradise: A History of Opiate Addiction in America\t\nBook Author: David T. Courtwright (Author)\nPaperback: 352 pages\nPublisher: Harvard University Press; Enlarged edition (June 30, 2001)\nLanguage: English\nISBN-10: 0674005856\nISBN-13: 978-0674005853\n\n===================================================================================\nBook Description\nRelease date: June 30, 2001 | ISBN-10: 0674005856 | ISBN-13: 978-0674005853 | Edition: Enlarged\nIn a newly enlarged edition of this eye-opening book, David T. Courtwright offers an original interpretation of a puzzling chapter in American social and medical history: the dramatic change in the pattern of opiate addiction--from respectable upper-class matrons to lower-class urban males, often with a criminal record. Challenging the prevailing view that the shift resulted from harsh new laws, Courtwright shows that the crucial role was played by the medical rather than the legal profession.\nDark Paradise tells the story not only from the standpoint of legal and medical sources, but also from the perspective of addicts themselves. With the addition of a new introduction and two new chapters on heroin addiction and treatment since 1940, Courtwright has updated this compelling work of social history for the present crisis of the Drug War.\n\n===================================================================================\nReviews\n[An] impeccably literate and acute analysis...One of the major themes of this book is that 'what we think about addiction very much depends on who is addicted.' This view is convincingly supported in a historical review that is both absorbing to read and extremely relevant to a general understanding of the social forces connected with opiate use. (Martin Plant, British Medical Journal)\n\nDark Paradise...is an interesting account of the history of the use of opiates in the United States, which is relevant to any western country. Although this book would be of most interest to those in the drug and alcohol treatment and policy areas, it is important reading for anyone with an interest in the political, legal and treatment aspects of drug dependence. It shows clearly how politics play a crucial role in the sanctioning of drug use and the social effects of different approaches to addressing drug dependence...Dark Paradise is recommended reading for anyone interested in the history of opiate dependence. It is presented in a factual format, but with a human focus. Courtwright illustrates beautifully the impact of social and legislative changes on the individual with an opiate addiction while managing to avoid an emotive or &quot;one-sided&quot; account of events. (Sandra Sunjic Drug and Alcohol Review 2002-12-01)\n\n===================================================================================\nAbout the Author\nDavid T. Courtwright is John A. Delaney Presidential Professor at the University of North Florida.\n===================================================================================","torrent":{"xt":"urn:btih:ce1c67248203525cde5877c2ca3794a54a125c2d","amp;dn":"David+T.+Courtwright+-+Dark+Paradise.+A+History+of+Opiate+Addict","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce1c67248203525cde5877c2ca3794a54a125c2d","infoHashBuffer":{"type":"Buffer","data":[206,28,103,36,130,3,82,92,222,88,119,194,202,55,148,165,74,18,92,45]},"announce":[],"urlList":[]}}