{"title":"BG Thomas - MM Romance - 3 titles","uid":11462839,"size":536880591,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce3588e31ff36030c75cb90a9fb1d8674b39b272&amp;dn=BG+Thomas+-+MM+Romance+-+3+titles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"katelynor","files":4,"time":1416008870,"description":"Not my favorite author in the MM romance genre, but some fun stuff.  Worth a listen.\n\nGrumble Monkey and the Department Store Elf\nWritten by: B.G. Thomas\nNarrated by: Donald Tursman\nLength: 2 hrs and 19 mins \nUnabridged Audiobook \n\nKit Jefferies, a part-time department store Christmas elf, is an artist who loves life and his family. Unfortunately, his car dies at a rest stop in the middle of nowhere as he is heading home for Christmas. Enter Nick St. George.\n\nNick is a very unhappy man - he's achieved his professional goals only to find the rest of his life bleak and empty. Deciding there was only one way to make everything right, he is on his way to San Francisco on a dark mission, and even the horrible sleet storm that blocked his path won't deter him. That's when he found Kit.\n\nAt first, Nick is pretty sure rescuing Kit was a big mistake. Kit's personality is just too, well, effervescent. But as the miles go by, Kit begins to bring light to his dark heart. It might even be bright enough to illuminate a Christmas miracle.\n\nA story from the Dreamspinner Press 2013 Advent Calendar package &quot;Heartwarming&quot;. \n\nThe Boy Who Came in from the Cold (love Charlie David - worth it for his voice)\n\nWritten by: B. G. Thomas\nNarrated by: Charlie David\nLength: 7 hrs and 57 mins \nUnabridged Audiobook \n\nTodd Burton has had enough of small-town Buckman. His abusive stepfather calls him a fag; his friend Austin makes him realize he may be gay, but Todd doesn't want to admit his stepfather is right; and he dreams of being a chef. Three good reasons to flee his hometown and pursue greener pastures. But when Todd reaches the big city, his luck runs dry. Soon he can't pay his rent and gets evicted. In the middle of a snowstorm.\n\nGabe Richards is a wealthy businessman with enough wounds of his own to make him afraid of ever being intimate again. But when he sees Todd outside his building, freezing to death, he takes pity on him and takes him in from the cold.\n\nTo their mutual surprise, Todd and Gabe find themselves drawn to each other. &quot;One night&quot; turns into a week. Maybe letting a man in from the cold can melt the ice around Gabe's heart - and maybe getting evicted will turn Todd's luck around.\n\nHound Dog &amp; Bean\n\n    Written by: B.G. Thomas\n    Narrated by: Charlie David\n    Length: 8 hrs and 23 mins \n    Unabridged Audiobook \n\nThere's been little love in H.D. &quot;Hound Dog&quot; Fisher's life since the death of his beloved mom when he was a boy. Bounced around the foster care system, he ran away as soon as he could... and took the foster dog with him. As far as he's concerned, only dogs have no ulterior motive, never hold a grudge, and offer unconditional love. Now he helps run a no-kill shelter and leaves relationships where they belong: in the back room.\n\n&quot;Bean&quot; Alexander settled in Kansas City to open his coffee shop after years of traveling. He never expected to open his heart too. When a man with a grudge takes a swing at H.D. while in line at Bean's shop, Bean jumps to intervene.\n\nSo taking a hit for H.D. gets Bean noticed, and H.D. feels obligated to pay a debt. But then the unexpected happens. A series of misadventures causes H.D. to open up - but falling in love makes him turn tail and run. Trust is a tough road to travel. Will good friends, a dog named Sarah Jane, and a bit of folk magic be enough to bring Hound Dog and Bean a happy ending?","torrent":{"xt":"urn:btih:ce3588e31ff36030c75cb90a9fb1d8674b39b272","amp;dn":"BG+Thomas+-+MM+Romance+-+3+titles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3588e31ff36030c75cb90a9fb1d8674b39b272","infoHashBuffer":{"type":"Buffer","data":[206,53,136,227,31,243,96,48,199,92,185,10,159,177,216,103,75,57,178,114]},"announce":[],"urlList":[]}}