{"title":"Feiern - der Film (2006) Dont forget to go home","uid":4178900,"size":732569312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce3b1ae5f01fadb32ebe3d5652fa9a5246dbbcc9&amp;dn=Feiern+-+der+Film+%282006%29+Dont+forget+to+go+home&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"inkorrupt","files":1,"time":1210290596,"description":"Der Dokumentarfilm Feiern zeigt Menschen deren Naechte 72 Stunden dauern.\n\nIhre Geschichten handeln von Zartheit, Exzess und Zerstoerung. Vom nie wieder heim und schlafen wollen, weil man dann ja wieder alleine ist. Das Portraet in 19 Gespraechen, 56 Naechten und 13 Tracks.\n\nBerlin 2005: Techno ist zurueck im Untergrund - exzessiver als je zuvor. Und Berlin ist erneut zum Sehnsuchtsort all derer geworden, die es ernsthaft wissen wollen. Feiern zeigt sie dabei, verschwitzt, verstoert und uebergluecklich.\n\nFeiern laesst die Menschen erzaehlen, die ihr Leben der Musik, den Clubs und den Drogen widmen. Zugezogene aus Chile oder England, die erst die endlose Abfahrt fanden und dann eine Wohnung in Mitte. Tuersteher, Barleute und Taenzer. Berliner DJÃ‚Â´s, die ihr erstes Speed auf dem Schulhof kauften um gerÃƒÂ¼stetu sein fÃƒÂ¼r eine Nacht im Bunker, dem  hardest club on earth. Es sind kaputte Geschichten und Geschichten voller Zaertlichkeit. Alle erzaehlen von der Suche nach Glueck - dem Moment kollektiver Ekstase, der richtigen Platte zur richtigen Zeit, dem 8-Stunden-GesprÃƒÂ¤ch mit einem Unbekannten, der ueber Nacht zum besten Freund wird, dem Gefuehl im Darkroom eines Clubs nichts anderes zu sein als ein Stueck Fleisch das benutzt und benutzt wird.\nGespraech fuer GesprÃƒÂ¤ch wird Feiern zum Familienportraet, zur melancholischen Hommage an eine Subkultur, die solange feiert, bis der Husten zur Lungenentzuendung und der Blackout zur Psychose wird.\n\nIn Berlin, so der Londoner DJ und Produzent Ewan Pearson, koenne man mit einem Loeffel auf einen Kochtopf schlagen; solange es im Rhythmus waere, wuerde niemand nach Hause gehen. Laechelnd gibt er seinen Freunden einen Ratschlag mit auf den Weg: Dont forget to go home! Wenn sie nicht gegangen sind, so feiern sie noch heute.\n\nQuelle: www.feiern-film.de\n\nYouTube:\n\nTrailer: watch?v=lwG2wBwJgLc\n\nInofficial Soundtrack:  watch?v=6AftGZmcKrQ","torrent":{"xt":"urn:btih:ce3b1ae5f01fadb32ebe3d5652fa9a5246dbbcc9","amp;dn":"Feiern+-+der+Film+%282006%29+Dont+forget+to+go+home","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce3b1ae5f01fadb32ebe3d5652fa9a5246dbbcc9","infoHashBuffer":{"type":"Buffer","data":[206,59,26,229,240,31,173,179,46,190,61,86,82,250,154,82,70,219,188,201]},"announce":[],"urlList":[]}}