{"title":"Photography-Bryan_Peterson-Understanding_Close-Up_PhotographyPDF","uid":5384888,"size":39970473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cfd9a1dfccf3bd8d784604c2a956d70d4a1e7aba&amp;dn=Photography-Bryan_Peterson-Understanding_Close-Up_PhotographyPDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"das_wookie","files":-1,"time":1266858109,"description":"Bryan Peterson - Understanding Close-up Photography: Creative Close Encounters with or without a Macro Lens\n\nBryan Peterson is probably my most influential teacher whom I've learned tons from via his books and video.  His teaching style and ability to easily communicate new knowledge in an easily approachable method are key to learning the craft.  Whenever I start working with a new photog, the FIRST set of books and video I point them to are ALWAYS from Bryan!\n\nMy recommendation is to use all of his offerings:\nThe Perfect Picture                - &lt;a href=&quot; http://thepiratebay.se/torrent/5333457&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5333457&lt;/a&gt; \nLearning to See Creatively         - &lt;a href=&quot; http://thepiratebay.se/torrent/5383729&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5383729&lt;/a&gt; \nUnderstanding Exposure             - &lt;a href=&quot; http://thepiratebay.se/torrent/3899818&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/3899818&lt;/a&gt; \nUnderstanding Shutter Speed        - &lt;a href=&quot; http://thepiratebay.se/torrent/5383482&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5383482&lt;/a&gt; \nUnderstanding Close Up Photography - &lt;a href=&quot; http://thepiratebay.se/torrent/5384888&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/5384888&lt;/a&gt; \n\nand you will be well on your way to being a photographer!  :)\n\n-------------------------------------------------------------------\n\nBryan_Peterson/Bryan_Peterson-Understanding_Close-Up_Photography.pdf [39970473]\n\n-------------------------------------------------------------------\n\nProduct Description:\n# Paperback: 160 pages\n# Publisher: Amphoto Books; illustrated edition edition (March 31, 2009)\n# Language: English\n# ISBN-10: 0817427198\n# ISBN-13: 978-0817427191\n\nIn Understanding Close-up Photography Bryan Peterson turns his attention to a topic that is an ongoing favorite with photographers. But where most macro photography books focus on capuring subjects in nature, Peterson promises to go beyond, teaching you to photograph a range of subjects from animals and plants from the garden, beach, or mountains to objects found in the kitchen, supermarket, even the junkyard. In addition to information on equipment, exposure, light, and composition, his book will feature elements of technique that go beyond the norm, teaching you to shoot not just what is generally considered close-up, but to go even closer to the point of abstraction. He will also show you how to produce the intimacy of a close-up within a larger shot--how to capture the look in your subject's eyes without compromising the clarity of the surrounding scene. And as always, Peterson offers his signature touch with his personal terminology: in what he likes to call &quot;Pop Junk&quot; he shows how combining creativity with the right digital technology can turn close-up photos of the most ordinary objects into surprising pieces of art.\n\n-------------------------------------------------------------------\n\nAbout the Author\nBryan Peterson, a professional photographer, is the author of Understanding Exposure, Beyond Portraiture, Learning to See Creatively, and Understanding Digital Photography. A well-known instructor, he is the founder of the online school The Perfect Picture School of Photography (www.ppsop.com).  He is also the best-selling author of Understanding Exposure, Learning to See Creatively, Understanding Shutter Speed, Understanding Close-Up Photography, Understanding Digital Photography, Beyond Portraiture, and, most recently, Bryan Peterson's Understanding Photography Field Guide. His easy-to-understand writing and teaching style breaks down the complex and often confusing aspects of photography, translating them into what his students routinely describe as &quot;aha&quot; moments. In addition, he has been a commercial photographer for over 30 years, shooting annual reports for many Fortune 500 companies, and his trademark use of color and strong, graphic composition have garnered him many photographic awards, including the New York Art Director's Gold Award and honors from Communication Arts and Print magazine. He currently splits his time between Chicago and France.\n\n-------------------------------------------------------------------\n\nPersonal addition:  He has also managed to marry one totally SMOKING hot wife, whom I can only guess he met while on a photo assignment...  or at least, that's what it would imply as while he's a terrific instructor/author, and a FABULOUS photographer, he's certainly not what one would call &quot;classically handsome&quot; so if you want to meet a model and have them be impressed with your work and set yourself apart from the GWC (Guy With Camera) gaggle, take a hint from Bryan and become the kind of photographer that stands out apart from the rest and learn all you can from his books and video.  Then, I would recommend practice practice practice for 6-12 months, and then see about signing up for his online School with a solid foundation in the fundamentals and see where he might take you to the next level!  Who knows, before you know it, you just might one day find yourself also in the category of &quot;How in the world did a guy like THAT, manage to get himself a gal like a HER?!?!?!&quot; :)\n\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:cfd9a1dfccf3bd8d784604c2a956d70d4a1e7aba","amp;dn":"Photography-Bryan_Peterson-Understanding_Close-Up_PhotographyPDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd9a1dfccf3bd8d784604c2a956d70d4a1e7aba","infoHashBuffer":{"type":"Buffer","data":[207,217,161,223,204,243,189,141,120,70,4,194,169,86,215,13,74,30,122,186]},"announce":[],"urlList":[]}}