{"title":"Tomorrow-Land: The 1964-65 World's... (2014) Joseph Tirella (mul","uid":9549237,"size":9767611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d085d0a803610710bd806508706221c9552f45d2&amp;dn=Tomorrow-Land%3A+The+1964-65+World%27s...+%282014%29+Joseph+Tirella+%28mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"7","files":-1,"time":1391204963,"description":"Tomorrow-Land: The 1964-65 World's Fair and the Transformation of America (2014) Joseph Tirella (multi)\n\n\nTomorrow-Land: The 1964-65 World's Fair and the Transformation of America by Joseph Tirella\n\n\nFormat: mobi/epub/azw3\nLength: 360 pages\nGenre: Non-Fiction/History\nDate: 7 January 2014\n\nAs much a history of mid-Sixties America as it is a history of the World's Fair in Queens, New York, Joseph Tirella's entertaining and impeccably researched Tomorrow-Land brings the forces and players of that turbulent era crackling to life.\n\nMotivated by potentially turning Flushing Meadows, literally a land of refuse, into his greatest public park, Robert Moses brought the World's Fair to the Big Apple for 1964 and '65. The 1964-65 World's Fair was a Sixties flashpoint in areas from politics to pop culture, technology to urban planning, and civil rights to violent crime.\n\nIn an epic narrative, Tomorrow-Land shows the astonishing pivots taken by New York City, America, and the world during the Fair. It fetched Disney's empire from California and Michelangelo's La Pieta from Europe; and displayed flickers of innovation from Ford, GM, and NASA--from undersea and outerspace colonies to personal computers. It housed the controversial work of Warhol (until Governor Rockefeller had it removed); and lured Ken Kesey and the Merry Pranksters.\n\nMeanwhile, the Fair--and its house band, Guy Lombardo and his Royal Canadians--sat in the musical shadows of the Beatles and Bob Dylan, who changed rock-and-roll right there in Queens. And as Southern civil rights efforts turned deadly, and violent protests also occurred in and around the Fair, Harlem-based Malcolm X predicted a frightening future of inner-city racial conflict.\n\nAuthor:\n\nJoseph Tirella wrote about Queens for The New York Times's much missed City Section, and penned pieces for the paper's Metro and Business Sections. A former Senior Editor at Fortune Small Business, his work has also appeared in Rolling Stone, Vibe, Esquire, Reader?s Digest, the New York Post, the Daily News, Portfolio.com, and MSN.com.\n","torrent":{"xt":"urn:btih:d085d0a803610710bd806508706221c9552f45d2","amp;dn":"Tomorrow-Land%3A+The+1964-65+World%27s...+%282014%29+Joseph+Tirella+%28mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d085d0a803610710bd806508706221c9552f45d2","infoHashBuffer":{"type":"Buffer","data":[208,133,208,168,3,97,7,16,189,128,101,8,112,98,33,201,85,47,69,210]},"announce":[],"urlList":[]}}