{"title":"5,742 Days - A Mother's Journey Through Loss - Anne-Marie Cockbu","uid":10448075,"size":6868721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d08cde488be3c37f8ea2945ac11151b506b29626&amp;dn=5%2C742+Days+-+A+Mother%27s+Journey+Through+Loss+-+Anne-Marie+Cockbu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1403983632,"description":"On 20th July 2013 15-year-old Oxford schoolgirl Martha Fernback died suddenly after swallowing half a gram of Mdma powder, more widely known as ecstasy. Within hours her mother, Anne-Marie Cockburn, began to write down her feelings as a way to channel her shock and try to make sense of the tragic loss of her only child.From an early age Anne-Marie has used writing to try to make sense of her life. This recent tragedy propelled her out of the shadows and gave her the confidence to share her writing with the world. In this book we join her in real time on her shocking and agonising journey, as she deals with the impractical demands placed upon a grieving single parent, begins to cope with the realities of life on her own and faces up to a future she could never have predicted. From the moment Martha died, Anne-Marie recognised that she still had a future, a life to live. This revealing, emotional and, ultimately, uplifting book shows how she used the art of writing, combined with determined self-belief, to guide her during this terrible time.","torrent":{"xt":"urn:btih:d08cde488be3c37f8ea2945ac11151b506b29626","amp;dn":"5%2C742+Days+-+A+Mother%27s+Journey+Through+Loss+-+Anne-Marie+Cockbu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d08cde488be3c37f8ea2945ac11151b506b29626","infoHashBuffer":{"type":"Buffer","data":[208,140,222,72,139,227,195,127,142,162,148,90,193,17,81,181,6,178,150,38]},"announce":[],"urlList":[]}}