{"title":"Wilbur Smith - Płonący Brzeg [PL]","uid":14174141,"size":486917315,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d30601a3054605fe1dae3878697f06bf1112a970&amp;dn=Wilbur+Smith+-+P%C5%82on%C4%85cy+Brzeg+%5BPL%5D+MP3%4048&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"everdarksoul","files":51,"time":1459789284,"description":"Audiobook PL - 48 części /   \r\nrozmiar: 464 MB / czas: 22:31:33\r\nczyta: Leszek Teleszyński\r\n\r\nTrwa I wojna światowa. Michael Courtney - nieślubny syn Seana Courtneya - dokonuje we Francji bohaterskich wyczynów jako pilot, walcząc w szeregach Brytyjczyków. Poznaje tam piękną dziewczynę - Centaine de Thiry. Wspólne plany zakochanych przerywa tragiczna śmierć Michaela - w dniu planowanego ślubu... Straciwszy wszystkich bliskich, Centaine decyduje się wyruszyć do Afryki, gdzie mieszka Garrick Courtney - przybrany ojciec niedoszłego męża. Jej statek nie dociera jednak do celu podróży - trafiony niemiecką torpedą, idzie na dno. Pozbawiona wody i żywności, krańcowo wyczerpana, Centaine zostaje wyrzucona na piaszczysty brzeg Afryki Zachodniej - najbardziej nieprzyjaznej i wyludnionej pustyni na całym kontynencie...\r\nTylko niezwykła wola przetrwania w imię nienarodzonego dziecka i dwoje starych Buszmenów, niedobitków afrykańskiego plemienia, ratują ją od pewnej śmierci. Tymczasem tropem zaginionej dziewczyny wyrusza pewien bardzo niebezpieczny człowiek, wynajęty przez Garricka...\r\n\r\nNa motywach dwóch części Sagi Countrneyów - tej, oraz Prawo Miecza - w 1991 roku powstał ośmiomio-odcinkowy, francusko/niemiecko/włoski serial telewizyjny (Burning Shore/Mountain of Diamonds), który cieszył się sporą popularnością. W rolach głównych wystąpili: Isabelle Gelinas, Jason Connery, John Savage, Valerie Perrine, Marina Vlady, Jean-Pierre Cassel oraz Jennifer Youngs.\r\nSerial wydany został jako 4-płytowe DVD, i emitowany był również w Polsce - a chętni wciąż mogą znaleźć w necie jego ripy do pobrania, lub obejrzeć go on-line (z lektorem pl) na niektórych serwisach internetowych","torrent":{"xt":"urn:btih:d30601a3054605fe1dae3878697f06bf1112a970","amp;dn":"Wilbur+Smith+-+P%C5%82on%C4%85cy+Brzeg+%5BPL%5D+MP3%4048","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d30601a3054605fe1dae3878697f06bf1112a970","infoHashBuffer":{"type":"Buffer","data":[211,6,1,163,5,70,5,254,29,174,56,120,105,127,6,191,17,18,169,112]},"announce":[],"urlList":[]}}