{"title":"Hellogoodbye - Everything Is Debatable [2013] [FLAC] [VINYL]","uid":9155007,"size":896119568,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d312def54a4eccd60af65cf3b7b0af532bb5b12e&amp;dn=Hellogoodbye+-+Everything+Is+Debatable+%5B2013%5D+%5BFLAC%5D+%5BVINYL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SmashAndGrab","files":-1,"time":1383760806,"description":"Hellogoodbye - Everything Is Debatable [2013] [FLAC] [VINYL]\n\nReleased ................ 2013\nSource .................. VINYL\nGenre ................... Pop/Rock\nStyle ................... Indie Rock\nCodec ................... FLAC\nBit Depth ............... 16 bits\nSampling Rate ........... 44.1 KHz\n\n01 - And Everything Becomes a Blur\n02 - (Everything Is) Debatable\n03 - The Magic House Is Now\n04 - Swear You're In Love\n05 - Summer Of The Lily Pond\n06 - Just Don't Let Go, Just Don't\n07 - I Don't Worry (As Much As I Should)\n08 - How Wrong I Can Be\n09 - An External Force\n10 - Die Young, Die Dumb_ Not Soon\n11 - A Near Death Experience\n\nAfter ripping up the electro emo-pop playbook they perfected on songs like &quot;Here (In Your Arms),&quot; and starting again with a classic Kinks- and Zombies-influenced pop sound on their second album, Would It Kill You?, Hellogoodbye's third album, Everything Is Debatable, doesn't make any changes quite so drastic, but there are some upgrades and alterations worth mentioning. It's still the Forrest Kline show, as he plays everything but the drums and the occasional horn and string parts, and working with producer Joe Chiccarelli, he aims for a sound that wraps up the various elements found in previous Hellogoodbye incarnations, then adds some new '80s influences to the mix. There are songs that hark back to the tinny, electro pop the band was known for (&quot;And Everything Becomes a Blur&quot;), tracks that have full chamber pop arrangements (&quot;Summer of the Lily Pond&quot;), and plenty of songs that could have been inserted into an '80s radio playlist with no problem (the disco punk &quot;Just Don't Let Go Just Don't&quot;). There are even a couple that lead you to wonder if Kline's been brushing up on his disco-era Roxy Music (&quot;How Wrong Can I Be&quot;), or itching to write an epic, end-title ballad (&quot;A Near Death Experience&quot;). It's a really nice amalgamation of styles and sounds that comes together over the course of the album and makes for an impressively rich listen that's held together by the strong core of Kline's smartly evocative lyrics and his warmly inviting voice. Plus, his songwriting just keeps getting better. He shows an unerring knack for crafting melodies that seep into your brain and take up permanent residence, adding hooks so sharp that they leave a mark, and making the rhythm tracks so propulsive that they impel your feet to get moving. When all these factors get together, like on the title track or the ripping, handclap-filled rocker &quot;Die Young, Die Dumb; Not Soon,&quot; it's like getting a sharp smack to the back of your head that leaves you dizzy and dazed, only in a good way. That happens an awful lot on this album. Hellogoodbye may have been pegged a novelty band at one point thanks to &quot;Here (In Your Arms),&quot; but the high level of craft and emotion on display here (and on Would It Kill You?) are the work of someone aiming higher than that. Everything Is Debatable hits the target time and again, and in the end, becomes the group's second instant classic modern pop album in a row.\n &lt;a href=&quot;\nhttp://i.imgur.com/51jrIcV.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/51jrIcV.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d312def54a4eccd60af65cf3b7b0af532bb5b12e","amp;dn":"Hellogoodbye+-+Everything+Is+Debatable+%5B2013%5D+%5BFLAC%5D+%5BVINYL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d312def54a4eccd60af65cf3b7b0af532bb5b12e","infoHashBuffer":{"type":"Buffer","data":[211,18,222,245,74,78,204,214,10,246,92,243,183,176,175,83,43,181,177,46]},"announce":[],"urlList":[]}}