{"title":"Stossel.2013.10.17.[17000000000000 Problems].Fox Business.CF.avi","uid":9073585,"size":333821232,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d3793762c924da87c44511e14697c1f271bf4ab5&amp;dn=Stossel.2013.10.17.%5B17000000000000+Problems%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1382244379,"description":"----------\n\nSTOSSEL - [17000000000000 Problems] - Fox Business Network\n2013, October 17, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThe debt limit was raised again, but this doesn't address America's real problem: unsustainable government spending.\n\nTHE PROBLEM: Dan Mitchell, a senior fellow at CATO, and Abby McCloskey, program director of economic policy at AEI, spend their work days analyzing the budget. Both will discuss how government &quot;solutions&quot; are the real problem.\n\nDANGEROUS DEBT: It's hard to wrap one's brain around almost $17 trillion of debt. Movie producer Seth Meier and actor Brian Stepanek made a video that does a great job explaining the government's debt problem. They compare Congress to a man going to a bank to ask for a loan. On YouTube, it's been watched more than two million times.\n\nGENERATIONAL THEFT: The biggest reason our debt is such a threat to America's future is that people my age refuse to die, and we demand the &quot;entitlements&quot; we were promised. National Review Senior Editor Ramesh Ponnuru talks about what this debt will do to younger generations.\n\nSPENDING PROBLEM: Bob Beckel, co-host of &quot;The Five,&quot; will try to help me understand why many Democrats say America &quot;does not have a spending problem.&quot;\n\nDEFAULT: Most Americans hardly noticed the partial shutdown. But we're told default-not paying our bondholders in full, or delaying payment-would be a catastrophe. Would it? I'm skeptical. It would be best if government cut spending, but assuming they won't, all the options are bad:\n\n1.Don't pay Medicare and Social Security.\n\n2.Inflate the currency.\n\n3.Stiff (or give a haircut to) the bondholders.\n\nI hope we never default, but I'd think it would be the least evil of the options. Russia defaulted. Argentina defaulted. Both recovered relatively quickly. I think we'd recover. But Garett Jones, an economist at George Mason University, argues that default would be terrible.\n\nMY TAKE: Now we've almost $17 trillion in debt, and when my age group retires, the debt will grow by more than a trillion dollars every year. That's a disaster. There is so much we could cut, and should cut. When I interviewed people outside of our studio, many agreed that government should cut spending. But when I asked them, &quot;cut what, exactly?&quot;, most had no clue. But there's plenty to cut. I'd begin cutting tonight, and there's much more here: www.downsizinggovernment.org","torrent":{"xt":"urn:btih:d3793762c924da87c44511e14697c1f271bf4ab5","amp;dn":"Stossel.2013.10.17.%5B17000000000000+Problems%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3793762c924da87c44511e14697c1f271bf4ab5","infoHashBuffer":{"type":"Buffer","data":[211,121,55,98,201,36,218,135,196,69,17,225,70,151,193,242,113,191,74,181]},"announce":[],"urlList":[]}}