{"title":"Best Practices Are Stupid: 40 Ways to Out-Innovate the Competiti","uid":7059666,"size":1489649,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d46ed0ef4e30ca1a9fbfed3eacfbcd3efae99e1f&amp;dn=Best+Practices+Are+Stupid%3A+40+Ways+to+Out-Innovate+the+Competiti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"MANTESH","files":5,"time":1330302547,"description":"[img]http://i29.fastpic.ru/big/2012/0226/2c/b13fea319d8d837318910c4a503f412c.jpg[/img]\n\n[b][quote][color=Green]\n\nBest Practices Are Stupid: 40 Ways to Out-Innovate the Competition \n\n\nPORT FOLIO / PENGUIN\nStephen M. Shapiro\n2011\nEnglish\nISBN: 1591843855 \nPDF ,EPUB ,MOBI \n64 pages \n1.41 MB\n\n\nWhat if almost everything you know about creating a culture of innovation is wrong? What if the way you are measuring innovation is choking it? What if your market research is asking all of the wrong questions?\nIt's time to innovate the way you innovate.\n\nStephen Shapiro is one of America's foremost innovation advisrrs, whose methods have helped organizations like Staples, GE, Telefonica, NASA, the U.S. Air Force, and USAA. He teaches his clients that innovation isn't just about generating occasional new ideas; it's about staying consistently one step ahead of the competition.\n\nHire people you don't like. Bring in the right mix of people to unleash your team's full potential.\nAsking for ideas is a bad idea. Define challenges more clearly. If you ask better questions, you will get better answers.\nDon't think outside the box; find a better box. Instead of giving your employees a blank slate, provide them with well-defined parameters that will increase their creative output.\nFailure is always an option. Looking at innovation as a series of experiments allows you to redefine failure and learn from your results.\n\nShapiro shows that nonstop innovation is attainable and vital to building a high-performing team, improving the bottom line, and staying ahead of the pack.\n\n[/color][/quote][/b]\n\n\n[img]http://torrent-stats.info/ed3e/19ae51bbc.png[/img]","torrent":{"xt":"urn:btih:d46ed0ef4e30ca1a9fbfed3eacfbcd3efae99e1f","amp;dn":"Best+Practices+Are+Stupid%3A+40+Ways+to+Out-Innovate+the+Competiti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d46ed0ef4e30ca1a9fbfed3eacfbcd3efae99e1f","infoHashBuffer":{"type":"Buffer","data":[212,110,208,239,78,48,202,26,159,191,237,62,172,251,205,62,250,233,158,31]},"announce":[],"urlList":[]}}