{"title":"In Pursuit of Beauty - Americans and the Aesthetic Movement (Art","uid":9537202,"size":97967978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4ebe81157ca4ecb2a89805e34efcc0dece960ab&amp;dn=In+Pursuit+of+Beauty+-+Americans+and+the+Aesthetic+Movement+%28Art&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"STBGD","files":-1,"time":1390955250,"description":"Burke, Doreen Bolger, et al., &quot;In Pursuit of Beauty: Americans and the Aesthetic Movement&quot;\nMetropolitan/Rizzoli | 1986 | ISBN: 0870994670/0847807681 | English | PDF | 511 pages | 93.43 Mb\n\nEnjoying its heydey from the mid-1870s to the mid-1880s, the American esthetic movement put forth &quot;art for art's sake&quot; as a counterbalance to materialism. The experimental spirit that set Whistler's nocturnes ablaze also spurred Louis Tiffany's abstract patterning of colors and shapes in domestic interiors. Embroiderers who wielded their needles much as painters did their brushes created ambitious wall hangings and crazy quilts. In architecture, the search for a vernacular led to a colonial revival. Some designers turned to exotic influences, for example, landscape painter Frederic Church, whose summer home, Olana, juxtaposed Moorish, Romanesque and Buddhist elements. Heated debates raged about what constituted artful surface ornament in textiles, carpets and wallpaper. The esthetic movement was eclipsed by art nouveau and the arts-and-crafts movement, yet its influence can be felt down to Frank Lloyd Wright. This catalogue of an exhibition at New York's Metropolitan Museum of Art reproduces hundreds of stunning works of art, from stained glass windows to paintings by Ryder, Homer and LaFarge.\nFrom Library Journal","torrent":{"xt":"urn:btih:d4ebe81157ca4ecb2a89805e34efcc0dece960ab","amp;dn":"In+Pursuit+of+Beauty+-+Americans+and+the+Aesthetic+Movement+%28Art","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ebe81157ca4ecb2a89805e34efcc0dece960ab","infoHashBuffer":{"type":"Buffer","data":[212,235,232,17,87,202,78,203,42,137,128,94,52,239,204,13,236,233,96,171]},"announce":[],"urlList":[]}}