{"title":"PMDG MD-11 Boxed DVD ","uid":6681030,"size":3636554161,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d587c39e1712912010df3bbe5caf4fd5bed65d81&amp;dn=PMDG+MD-11+Boxed+DVD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"alef1995","files":7,"time":1316193976,"description":"PMDG MD-11 FSX Boxed Edition \n\n\nNo Crack nedd! serial included !!!!!\n\nInludes UPDATE All Livreries In DVD !!!!!!!!!!!!!!!!!!! \n\n\nProduct Description\n\nPMDG continues our lineage of fine airliner simulations with another popular heavy airliner, the PMDG MD-11! Born out of airline requirements for a &quot;modern new DC-10&quot; the MD-11 is a superb example of aircraft engineering from the era when modern computer processing power was beginning to bring truly new ideas, safety and capability to the cockpit of transport airplanes. Highly automated and employing innovative new approaches to the pilot/airplane interface, the MD-11 took the McDonnell Douglas widebody line into the future with fully automated flight modes, aircraft system status pages, failure consequence displays and clearly thought out pilot controls. One of the most advanced airplanes ever produced by Douglas, the MD-11 has been largely missing from desktop simulation... Until Now \n\nCurrently in the fourth year of development, PMDG's award winning development team is faithfully capturing the nuance, feel and character of this great airliner to a degree of detail never before seen in desktop simulation. Employing a highly skilled team of Technical Advisors from the aviation field, our development team has daily input from MD-11 Captains, First Officers, Field Technicians, Training Managers and even engineers involved in the design/build of the airplane at Douglas nearly twenty years ago. During each step of the development process, every facet of the PMDG MD-11 is validated in the training simulator to ensure it has been modeled correctly, right down to the finest detail. All of this technical expertise means that our development team has the very best source of information to ensure the PMDG MD-11 precisely matches it's majestic real world counterpart! \n\nIn traditional PMDG style, no effort is being spared during this extensive development process and we are certain the PMDG MD-11 will quickly become &quot;another&quot; favorite of PMDG simulation customers! \n\n\n**********************************Alef1995***************************************** \n\n\n\n\n","torrent":{"xt":"urn:btih:d587c39e1712912010df3bbe5caf4fd5bed65d81","amp;dn":"PMDG+MD-11+Boxed+DVD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d587c39e1712912010df3bbe5caf4fd5bed65d81","infoHashBuffer":{"type":"Buffer","data":[213,135,195,158,23,18,145,32,16,223,59,190,92,175,79,213,190,214,93,129]},"announce":[],"urlList":[]}}