{"title":"Airport_Madness_4_v1.02(AnDrOid).apk","uid":9935797,"size":33888452,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:d5d3c5fae0ced3d46397e164352684e75d0f230e&amp;dn=Airport_Madness_4_v1.02%28AnDrOid%29.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Evil_Amdis","files":1,"time":1397156273,"description":"Airport Madness 4 v 1.02\nimage\n\nAirport Madness 4 is a fun, addictive air traffic control game. Control passenger jets and military aircraft into and out of busy airports. This app is loaded with complex airports and fun challenges. Handle a runway closure during a snow storm. Land fighter jets on aircraft carriers. Witness UFO activity in Area 51.\n\nIn Airport Madness 4 you are an air traffic controller, managing airplanes as they travel to and from major international airports. Move airplanes as quickly as possible while keeping the skies and runways safe from midair collisions. You are the last line of defense against disaster. Do you have what it takes to handle the world's most stressful job?\n\nAirport Madness 4 offers real pilot voices, bad weather, emergencies, and a radar scope. Helicopters, float planes and space shuttles are just a few of the new and interesting aircraft you will see. In addition, there are new control features such as 'vectoring' and runway changes. Airport Madness 4 is a must-have game for any aviation enthusiast. It's incredibly simple to learn, yet insanely addictive and challenging. Choose from six unique airports, including a dozen different airport challenges. Our revamped physics engine offers smoother motion and more realistic aircraft behavior. The addition of several new aircraft will challenge your ability to recognize performance differences between different aircraft types, such as the Boeing 747, Airbus A380 and even the Concorde!\n\nWhat's New\n- Fixed a bug that prevented the application from closing.\n\nSCREENSHOT","torrent":{"xt":"urn:btih:d5d3c5fae0ced3d46397e164352684e75d0f230e","amp;dn":"Airport_Madness_4_v1.02%28AnDrOid%29.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d3c5fae0ced3d46397e164352684e75d0f230e","infoHashBuffer":{"type":"Buffer","data":[213,211,197,250,224,206,211,212,99,151,225,100,53,38,132,231,93,15,35,14]},"announce":[],"urlList":[]}}