{"title":"The Beatles - I Need You [Help! soundtrack promo].VOB","uid":9693645,"size":57147392,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d65d1b458b96f404e73a5a4949896bfb281961cf&amp;dn=The+Beatles+-+I+Need+You+%5BHelp%21+soundtrack+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1393904614,"description":"The Beatles - I Need You [Help! soundtrack promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;I Need You&quot; is a song by the Beatles and appears on the album Help!. It is the second George Harrison song the band released after two albums without any songwriting contribution from Harrison. The song was performed in their second film, Help! and is the second video produced showing George Harrison singing lead vocal on a song (after &quot;I'm Happy Just To Dance With You&quot; from A Hard Day's Night).\n\nThe song, simple in arrangement, was recorded on 15 and 16 February 1965. It is often considered to address Harrison's relationship with Pattie Boyd, whom he had met in March 1964 while filming A Hard Day's Night (they married in January 1966).\n\nHelp! is the fifth British and tenth North American album by English rock group the Beatles, and the soundtrack from their film Help!. Produced by George Martin for EMI's Parlophone Records, it contains fourteen songs in its original British form, of which seven appeared in the film. These songs took up the first side of the vinyl album and included the singles &quot;Help!&quot; and &quot;Ticket to Ride&quot;. The second side contained seven other releases including the most-covered song ever written, &quot;Yesterday&quot;.\n\nGeorge Harrison contributed &quot;I Need You&quot; and &quot;You Like Me Too Much&quot;, his first compositions to be included on a Beatles album since &quot;Don't Bother Me&quot; on 1963's With the Beatles.\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/I_Need_You_(Beatles_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/I_Need_You_(Beatles_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/iakJCaafL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/iakJCaafL&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8300kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 224kbps\n   Duration: 00:02:28\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:d65d1b458b96f404e73a5a4949896bfb281961cf","amp;dn":"The+Beatles+-+I+Need+You+%5BHelp%21+soundtrack+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d65d1b458b96f404e73a5a4949896bfb281961cf","infoHashBuffer":{"type":"Buffer","data":[214,93,27,69,139,150,244,4,231,58,90,73,73,137,107,251,40,25,97,207]},"announce":[],"urlList":[]}}