{"title":"The Ramsey Lewis Trio - The In Crowd (1965)  [EAC-FLAC]","uid":8750793,"size":211260469,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d7426f07194b8fe59d936d912d98b312fb34a7b3&amp;dn=The+Ramsey+Lewis+Trio+-+The+In+Crowd+%281965%29++%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pucholoco","files":-1,"time":1375026670,"description":"               The Ramsey Lewis Trio - The In Crowd (1965) [EAC-FLAC]\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 201Mb \n                           Full Artwork @ 300 dpi (jpg)\n\n\nRamsey Lewis staked his claim to fame with The In Crowd, the instrumental version of Dobie Gray's Top 40 hit. He also was one of the first soul-jazz icons of the mid-'60s, based on the strength of the sales of this recording, done over three days during a club date at the Bohemian Caverns in Washington, DC. \nOver the years, the biggest question about this effort was why it was so short, clocking in at a mere thirty-three-minutes-and-forty-seconds, when the engagement was so much longer than that. A limited repertoire, flawed recordings, or the band just not hitting as well as the songs that were approved and released; all have been speculated over. Nonetheless, this is the moment where Lewis shined the brightest, the &quot;in crowd&quot; at the club was verbally into it, and the time for this music was right. What is not readily acknowledged over the years is that bassist Eldee Young is really the star of the show. He's the one who gets the crowd revved up with his vocalizing in tandem with the notes he is playing. It is on his &quot;I Got a Woman&quot; Ray Charles-like take on &quot;Tennessee Waltz&quot; and a similar treatment of Gale Garnett's minor pop hit &quot;You Been Talkin' 'Bout Me Baby&quot; that gets the patrons off. Of course the quintessential hip shakin' introductory title track gets the groove in motion, but it's Young that lights the fuse. His stellar work with drummer Redd Holt bolsters the style of Lewis, and takes it further for the upbeat bossa &quot;Felicidade.&quot; Of course, Lewis is the bluesy centerpiece on &quot;Since I Fell for You,&quot; another cover of a pop hit that at the time Lenny Welch did so well. The variant is the dramatic &quot;Theme from Spartacus,&quot; which has an up-and-down dynamic more suited for a concert hall than a smoky nightclub, unless it's after midnight. Always the best Lewis ever offered, it will forever be debated why complete -- or at the very least additional sessions -- were never released on CD.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n\n01. The ''In'' Crowd \n02. Since I Fell For You \n03. Tennessee Waltz - 5:02\n04. You Been Talkin' 'Bout Me Baby \n05. Love Theme From Spartacus\n06. Felicidade - Happiness \n07. Motherless Child \n08. Come Sunday \n09. The Party's Over \n\n\nPersonnel\n\n* Ramsey Lewis - piano\n* Eldee Young - bass, cello\n* Red Holt - drums\n\n\nOriginal Released: 1965\nReleased Date: 1990\nFormat: CD, Album\nLength: 39:17\n*MCA Records | CHD-9185 \n\n\n","torrent":{"xt":"urn:btih:d7426f07194b8fe59d936d912d98b312fb34a7b3","amp;dn":"The+Ramsey+Lewis+Trio+-+The+In+Crowd+%281965%29++%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7426f07194b8fe59d936d912d98b312fb34a7b3","infoHashBuffer":{"type":"Buffer","data":[215,66,111,7,25,75,143,229,157,147,109,145,45,152,179,18,251,52,167,179]},"announce":[],"urlList":[]}}