{"title":"My Bloody Valentine - Discography [FLAC] vtwin88cube","uid":8145099,"size":2206827861,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d74cab961be21d05ac3ee0210f77fa3e48947181&amp;dn=My+Bloody+Valentine+-+Discography+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1360897179,"description":"\n\n\nMy Bloody Valentine\n\n\n\n\n\nLike the Velvet Underground, Sonic Youth, and the Jesus and Mary Chain before them, My Bloody Valentine redefined what noise meant within the context of pop songwriting. Led by guitarist Kevin Shields, the group released several EPs in the mid-'80s before recording the era-defining Isn't Anything in 1988, a record that merged lilting, ethereal melodies of the Cocteau Twins with crushingly loud, shimmering distortion. Though My Bloody Valentine rejected rock &amp; roll conventions, they didn't subscribe to the precious tendencies of anti-rock art-pop bands. Instead, they rode crashing waves of white noise to unpredictable conclusions, particularly since their noise wasn't paralyzing like the typical avant-garde noise rock band: it was translucent, glimmering, and beautiful. Shields was a perfectionist, especially when it came to recording, as much of My Bloody Valentine's sound was conceived within the studio itself. Nevertheless, the band was known as a formidable live act, even though they rarely moved, or even looked at the audience, while they were on-stage. Their notorious lack of movement was branded &quot;shoegazing&quot; by the British music press, and soon there were legions of other shoegazers -- Ride, Lush, the Boo Radleys, Chapterhouse, Slowdive -- that, along with the rolling dance-influenced Madchester scene, dominated British indie rock of the late '80s and early '90s. As shoegazing reached its peak in 1991, My Bloody Valentine released Loveless, which broke new sonic ground and was hailed as a masterpiece. Though the band was poised for a popular breakthrough, it disappeared into the studio and didn't emerge over the next five years, leaving behind a legacy that proved profoundly influential in the direction of '90s alternative rock. \n\n\n\n\n\nAudio Quality:\t\tPerfect (Lossless)\nContains:\t\tAlbum Art &amp; ID Tags\n\n\n\n\nAudio-Info:\n\n\nEcstasy And Wine (1989) 99.90% CDDA\n\nThis Is Your Bloody Valentine [Reissue] (1990) 99.71% CDDA\n\nLoom (Live Vancouver, BC, Canada July '92) (1992) 100.00% CDDA\n\nThings Left Behind [Vinyl] (2009)\n\nLost Tracks And Rare Cuts (2010) 100.00% CDDA\n\nM B V [Not On Label] (2013) 100.00% CDDA\n\n\n\n\n\n\n\n\n\nThanks for seeding. Enjoy.","torrent":{"xt":"urn:btih:d74cab961be21d05ac3ee0210f77fa3e48947181","amp;dn":"My+Bloody+Valentine+-+Discography+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d74cab961be21d05ac3ee0210f77fa3e48947181","infoHashBuffer":{"type":"Buffer","data":[215,76,171,150,27,226,29,5,172,62,224,33,15,119,250,62,72,148,113,129]},"announce":[],"urlList":[]}}