{"title":"Documentary - Nato bombing of Serbia","uid":4689344,"size":2343596032,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d79be1e26f5fdd8b0402cb36504f50f530cef9ea&amp;dn=Documentary+-+Nato+bombing+of+Serbia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Vlajko62","files":-1,"time":1233341033,"description":"March 24, 2009 will be exactly 10 years since NATO launched it's air strikes on Serbia. Most of you had only watched the CNN, ABC, BBC and other media so you have no idea what it was all about and how it really looked like on the ground. Therefore I assembled couple divx videos but be warned - this is NOT something you can watch on Sunday afternoon with your kids.\n\nThe crimes that were performed by Albanians and NATO on Serbian civilians were brutal and so are the evidence you are about to see. Sorry about average quality, it was all originally recorded on VHS. These are all raw videos with original sound coded with divx4, 512x384 pixels.\n\nHere's a bit about the files included in this torrent:\n\nStrike 0 - In first half of this movie, you can see what it was like on Serbia-Albania border where Serbian police was capturing Albanians smuggling guns and ammunition across the border. The second part covers press conference held on several locations on Kosovo where mass graves of Serbian civilians killed by Albanians were found. This includes crematorium in Klechka where Albanian terrorists (UCK) burned dozens of bodies of Serbian men, women and children. This was recorded just before the NATO attacked Serbia.\n\nStrike 1, 2 &amp; 3 show the effects of NATO bombing. It is NOT like what you saw on TV. In reality it does NOT look like a video game. This was filmed right on the spot, sometimes just seconds after the bomb blasts. See for yourself. And seed, seed, seed ...\n\n\nEDIT: There are couple irritating comments down below so let me make it clear:\n\n- These are RAW VIDEOS, there are no comments and it is not a propaganda.\n- It has nothing to do with Bosnia and Croatia, it is about NATO bombing of Serbia.\n\nI have expected such comments and they are no surprise to me. But for those of you who are not familiar with this war, just a few simple facts which can be easily verified if do some digging on google:\n\n- Croatian war-minister of police recently testified on court and admitted that it was Croatia who attacked Serbs and Yugoslav Army. Sometime in 90's, over 250.000 Serbs were expelled from Croatia in the largest ethnic cleansing after World War II. Less then 5% of them returned after the war and yet, nobody knows about it.\n\n- The total number of bodies recovered in Srebrenica was less then 3.000 and not 8.000 as many people think. There were more civilian victims in Serbian city of Bratunac then in Srebrenica and yet, nobody knows about it. \n\nThis is not a conspiracy theory but simple facts covered up by Croatian and Bosnian propaganda.","torrent":{"xt":"urn:btih:d79be1e26f5fdd8b0402cb36504f50f530cef9ea","amp;dn":"Documentary+-+Nato+bombing+of+Serbia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d79be1e26f5fdd8b0402cb36504f50f530cef9ea","infoHashBuffer":{"type":"Buffer","data":[215,155,225,226,111,95,221,139,4,2,203,54,80,79,80,245,48,206,249,234]},"announce":[],"urlList":[]}}