{"title":"The Little Rascals - De kleinen Boefjes 3 dvds (NL SUBS) 2Lions-","uid":5606079,"size":8296950667,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d82b98b47f51dd3bbe34a6056290db417b37ecf6&amp;dn=The+Little+Rascals+-+De+kleinen+Boefjes+3+dvds+%28NL+SUBS%29+2Lions-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Pioen","files":39,"time":1275595420,"description":"The Little Rascals - De kleinen Boefjes - 3 dvds       \n \n \n  De kleinen Boefjes zwart/wit DVD \n\nDe eerste aflevering van De Boefjes werd in 1922 gemaakt, lang voordat er televisie was. De reeks was een idee van producent Hal Roach, bekend van Laurel &amp; Hardy, en was onder de titel Our Gang als voorprogramma in de bioscoop te zien. De serie sloeg direct aan, zeker toen er vanaf 1929 ook afleveringen met geluid werden gemaakt. \nAlle hoofdrollen worden gespeeld door kinderen die samen opgroeien. Ze zijn heel avontuurlijk ingesteld en doen vaak volwassenen na. Zo beginnen ze een taxibedrijf, houden een racewedstrijd en gaan als brandweermannen aan de slag. De kinderen kregen meestal geen scenario te zien - sommigen konden nog niet eens lezen - maar werd verteld wat ze moesten doen, zodat hun spel vaak heel natuurlijk overkwam. \n\nIn de loop der jaren werden kinderen die te oud werden vervangen door nieuwe acteurtjes. Na 220 korte en 1 lange aflevering kwam er in 1944 een einde aan de reeks. Hal Roach had de rechten al een paar jaar eerder verkocht, maar kocht ze begin jaren '50 terug, al mocht hij de naam Our Gang niet meer gebruiken. \nAfleveringen die tussen 1927 en 1938 waren gemaakt werden opnieuw gemonteerd en vanaf 1955 als The Little Rascals op televisie uitgezonden. Het waren vooral de afleveringen met de jongetjes Spanky, Buckwheat, Alfalfa en de hond Petey, herkenbaar aan de cirkel rond zijn oog, die bij het publiek aansloegen. \n\nNog eens 20 jaar later waren hun avonturen ook in Nederland te zien, en met succes, want de serie wordt nog regelmatig herhaald. In 2002 interviewden de makers van het VPRO-filmprogramma Stardust Junior ÃƒÂ©ÃƒÂ©n van de originele boefjes: Shirley Jean Rickert, toen 5 jaar, nu een hoogbejaarde dame. \nOver haar tijd als 'boefje' vertelde ze: &quot;Je voelde je net Alice in Wonderland. Je had een heleboel leuk speelgoed en ging op de set naar school. We moesten elke dag een uur lang ontspannen en lol maken. Je had drie uur school en bij elkaar vier uur voor de camera. Het is geweldig om op mijn leeftijd nog als kind beroemd te zijn. Ik heb mijn eigen website en krijg mail uit de hele wereld. Dat is echt heel erg leuk.&quot; \n\n\nEnglish\n\n\nThe Little Rascals  Black/white 3 dvd's\n\nTelevision syndication package of the classic 1929-1938 shorts from the &quot;Our Gang Comedies&quot; movie series. \n\n\n\n\n\nTaal: Engels!\nOndertiteling: Nederlands!\nCover : Yes\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nColor: Black/White\n \nOndertitels : Nederlands (Hardcoded)\n \nGenre : Familiefilm\nTV Shows/Series\nKinderfilm \n\nWeblink : &lt;a href=&quot; http://www.imdb.com/title/tt0278213/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0278213/&lt;/a&gt; \n \n******************************************\n\nBrought to you by\nPioen\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n \n \n\n\n \n \n \n","torrent":{"xt":"urn:btih:d82b98b47f51dd3bbe34a6056290db417b37ecf6","amp;dn":"The+Little+Rascals+-+De+kleinen+Boefjes+3+dvds+%28NL+SUBS%29+2Lions-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d82b98b47f51dd3bbe34a6056290db417b37ecf6","infoHashBuffer":{"type":"Buffer","data":[216,43,152,180,127,81,221,59,190,52,166,5,98,144,219,65,123,55,236,246]},"announce":[],"urlList":[]}}