{"title":"Porter Grainger 1923-1929 (Rst)","uid":7383495,"size":73226489,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d859eee91d14dbea4c3b81a9ac4d37e73ce210f1&amp;dn=Porter+Grainger+1923-1929+%28Rst%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"mudmashers","files":26,"time":1340566289,"description":"Porter Grainger 1923-29 [Rst] (CD128kb)\n\n01. Gladys Bryant w. Porter Grainger - Laughin' Cryin' Blues\n02. Gladys Bryant w. Porter Grainger - You've Got To See Mama Every Night (Or You Can't See Mama At All)\n03. Gladys Bryant w. Porter Grainger - The Dark Town Flappers Ball\n04. Gladys Bryant w. Porter Grainger - Triflin' Blues\n05. Ethel Finnie w. Porter Grainger - I Don't Love Nobody (So I Don't Have No Blues)\n06. Ethel Finnie w. Porter Grainger - Don't You Quit Me Daddy\n07. Ethel Finnie w. Porter Grainger - Don't Know And Don't Care Blues\n08. Ethel Finnie w. Porter Grainger - Hula Blues\n09. Harmony Hounds w. Porter Grainger - Done Got De Blues\n10. Harmony Hounds w. Porter Grainger - I've Got A Gal And She Ain't No Good\n11. Porter Grainger's Three Jazz Songsters - Where Did You Get That Hat\n12. Porter Grainger's Three Jazz Songsters - It Makes No Diff'rence To Me\n13. Porter Grainger's Three Jazz Songsters - Ground Hog Blues\n14. Buddy Christian's Four Cry-Babies - Jonah's Ridin' On His Mule\n15. Buddy Christian's Four Cry-Babies - Nina Lee\n16. Porter Grainger's Jubilee Singer - Wish I Had-A Died In Egypt Land\n17. Porter Grainger's Jubilee Singer - I'm On The Right Road Now\n18. Dolly Ross w. Porter Grainger - He Don't Know (And I Can't Make Him Understand)\n19. Dolly Ross w. Porter Grainger - Hootin' Owl Blues\n20. Clint Jones w. Porter Grainger - Ramona\n21. Clint Jones w. Porter Grainger - Right Or Wrong\n22. Clint Jones w. Porter Grainger - Mississippi Woman Blues\n23. Clint Jones w. Porter Grainger - Blue Valley Blues\n24. Ada Brown w. Porter Grainger - Down Home Dance\n25. Ada Brown w. Porter Grainger - Crazy 'bout My Lollypop","torrent":{"xt":"urn:btih:d859eee91d14dbea4c3b81a9ac4d37e73ce210f1","amp;dn":"Porter+Grainger+1923-1929+%28Rst%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d859eee91d14dbea4c3b81a9ac4d37e73ce210f1","infoHashBuffer":{"type":"Buffer","data":[216,89,238,233,29,20,219,234,76,59,129,169,172,77,55,231,60,226,16,241]},"announce":[],"urlList":[]}}