{"title":"David Garland - Peculiar Institution. America's Death Penalty in","uid":10099128,"size":1585630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8ccbb5d8cc0818d69fe5a6387c0db9d4ff1c16c&amp;dn=David+Garland+-+Peculiar+Institution.+America%27s+Death+Penalty+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anette14","files":-1,"time":1399357847,"description":"Description\nProduct Details\nBook Title: Peculiar Institution: America's Death Penalty in an Age of Abolition\t\nBook Author: David Garland (Author), Garland (Author)\nHardcover: 432 pages\nPublisher: Oxford University Press (September 1, 2010)\nLanguage: English\nISBN-10: 0199594996\nISBN-13: 978-0199594993\n\n===================================================================================\nBook Description\nFor many Europeans, the persistence of America's death penalty is a stark reminder of American otherness. The practice of state killing is an archaic relic, a hollow symbol that accomplishes nothing but reflects a puritanical, punitive culture - bloodthirsty in its pursuit of retribution. In debating capital punishment, the usual rhetoric points to America's deviance from the western norm: civilized abolition and barbaric retention; 'us' and 'them'. This remarkable new study by a leading social thinker sweeps aside the familiar story and offers a compelling interpretation of the culture of American punishment. It shows that the same forces that led to the death penalty's abolition in Europe once made America a pioneer of reform. That democracy and civilization are not the enemies of capital punishment, though liberalism and humanitarianism are. Making sense of today's differences requires a better understanding of American society and its punishments than the standard rhetoric allows. Taking us deep inside the world of capital punishment, the book offers a detailed picture of a peculiar institution - its cultural meaning and symbolic force for supporters and abolitionists, its place in the landscape of American politics and attitudes to crime, its constitutional status and the legal struggles that define it. Understanding the death penalty requires that we understand how American society is put together - the legacy of racial violence, the structures of social power, and the commitment to radical, local majority rule. Shattering current stereotypes, the book forces us to rethink our understanding of the politics of death and of punishment in.\n\n===================================================================================\nReviews\nGarland's readable book is nonetheless a major contribution to our understanding not only of capital punishment in America, but also of the relationship between punishment, state and society. Nicola Lacey, Times Literary Supplement\n\nSome of [Garland's] eminently readable prose reminds me of Alexis de Tocqueville's nineteenth-century narrative about his visit to America; it has the objective, thought-provoking quality of an astute observer rather than that of an interested participant in American politics...I commend [Garland's comprehensive analysis] to participants in the political process. John Paul Stevens, The New York Review of Books\n\nThis is one of the most readable and enlightening works of sociology we've come across of late and certainly worth adding to your library as the world continues to move towards eventual international abolition across the world. Philip Taylor MBE, Richmond Green Chambers\n\n===================================================================================\nAbout the Author\nDavid Garland is Professor of Sociology at New York University. He is one of the leading sociologists writing on punishment and crime control, his major works including Punishment and Modern Society, and The Culture of Control.\n===================================================================================","torrent":{"xt":"urn:btih:d8ccbb5d8cc0818d69fe5a6387c0db9d4ff1c16c","amp;dn":"David+Garland+-+Peculiar+Institution.+America%27s+Death+Penalty+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8ccbb5d8cc0818d69fe5a6387c0db9d4ff1c16c","infoHashBuffer":{"type":"Buffer","data":[216,204,187,93,140,192,129,141,105,254,90,99,135,192,219,157,79,241,193,108]},"announce":[],"urlList":[]}}