{"title":"Harnessing the Power of Intuition with Judith Orloff [MP3]","uid":11888848,"size":113744284,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d9d24631c1d60be2bdb4253e7c2a14cd12a6db90&amp;dn=Harnessing+the+Power+of+Intuition+with+Judith+Orloff+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"elessedilgirl","files":5,"time":1430928136,"description":"How would you like to recapture, nurture and affirm your intuitive ability and use it in your everyday life? With humor and compassion, Judith Orloff, M.D. explains that by listening to your inner voice and connecting with your body's natural powers of healing, you can live a more satisfying and joyful life. &quot;Intuition is about balance. It's a form of passion for me, a way of enjoying life. It's listening in a fresh way, every single moment, wherever I am.&quot;\n\nPsychic Medicine 54.12\n\nDr. Judith Orloff, a practicing psychiatrist takes you on a fascinating autobiographical journey, from her early struggles to understanding the powers of intuition to the eventual integration of intuition into her psychiatric practice. She tells you how unlocking your own intuitive powers can influence every aspect of your life and deepen your sense of spiritual connection. A pioneer in the sweeping changes that are taking place in medicine and psychiatry today, she believes that &quot;traditional medicine will die unless spirituality and intuitive awareness is integrated into its realm.&quot; Constantly stressing the need for &quot;a sense of reverence and focus&quot; when cultivating intuitive abilities, Dr. Orloff teaches simple ways we can all develop intuitively.\n\nThe Spirit Of Intuition 54.14\n\nCan a psychiatrist use intuitive and spiritual tools to enhance patient care? Dr. Judith Orloff can and does. And she is busy teaching her peers at UCLA how to do just that--in the first program of it's kind in the United States. A courageous pioneer who risked ridicule and rejection in order to better serve patients, Dr. Orloff has made incredible breakthroughs in the field of psychiatric care. Her powerful advice is for both doctors and patients, with fresh new concepts that apply to all areas of life, not just your health. From what to watch for in choosing a doctor to simple ways you can promote self-healing, Dr. Orloff delivers advice that you can use today, tomorrow and in years to come.\n\nUsing Intuition To Heal 56.48\n\nHow would you like to recapture, nurture and affirm your intuitive ability and use it in your everyday life? With humor and compassion, Judith Orloff, M.D. explains that by listening to your inner voice and connecting with your body's natural powers of healing, you can live a more satisfying and joyful life. &quot;Intuition is about balance. It's a form of passion for me, a way of enjoying life. It's listening in a fresh way, every single moment, wherever I am.&quot; Dr. Orloff talks about five practical steps she uses in her own life and teaches to patients which illustrate how to harness the power of intuition for physical, emotional and sexual well-being. She also offers wisdom in dealing with the passing of a loved one, &quot;If you do not trust yourself around the death bed it can be chaos. Overcoming our own fear of death can enable us to live a more joyous life and help our loved ones move on with love, light, and joy as they make their passage.&quot;\n\nCreating And Sustaining Positive Energy 45.49\n\n&quot;In order not to be tired, or live a life you're constantly recovering from, you have to learn how to build your positive energy every single day, and to realize immediately when it gets drained,&quot; Dr. Judith Orloff. With her characteristic conviction and no-nonsense approach, Dr. Orloff affirms our sense that positive or negative energy can affect how we feel physically and emotionally; it can even affect our behavior. She explains how our thoughts, our experiences, the people we meet and the places we go can renew our energy and make us feel great, or deplete it and make us feel exhausted or worse. Dr. Orloff draws from her personal experience and her years of clinical practice in energy psychiatry to provide practical suggestions that enable even the most sensitive among us to protect ourselves from the negativity we encounter each day, and sustain our positive energy field in the midst of a hectic and uncertain world.\n\nMP3 - 64 / 80 kbps - CBR\n\nSource: WebRip","torrent":{"xt":"urn:btih:d9d24631c1d60be2bdb4253e7c2a14cd12a6db90","amp;dn":"Harnessing+the+Power+of+Intuition+with+Judith+Orloff+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9d24631c1d60be2bdb4253e7c2a14cd12a6db90","infoHashBuffer":{"type":"Buffer","data":[217,210,70,49,193,214,11,226,189,180,37,62,124,42,20,205,18,166,219,144]},"announce":[],"urlList":[]}}