{"title":"Marissa Mayer and the Fight to Save Yahoo","uid":11673813,"size":2345757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9e18048eefdcd86963e9392844d3ea5b44ff56b&amp;dn=Marissa+Mayer+and+the+Fight+to+Save+Yahoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"WinterGale","files":1,"time":1422759005,"description":"A page-turning, warts-and-all narrative about Marissa Mayer's efforts to remake Yahoo as well as her own rise from Stanford University undergrad to CEO of a $30 billion corporation by the age of 38.\n\nWhen Yahoo hired star Google executive Mayer to be its CEO in 2012 employees rejoiced. They put posters on the walls throughout Yahoo's California headquarters. On them there was Mayer's face and one word: HOPE. But one year later, Mayer sat in front of those same employees in a huge cafeteria on Yahoo's campus and took the beating of her life. Her hair wet and her tone defensive, Mayer read and answered a series of employee-posed questions challenging the basic elements of her plan. There was anger in the room and, behind it, a question: Was Mayer actually going to be able to do this thing?\n\nMARISSA MAYER AND THE FIGHT TO SAVE YAHOO! is the inside story of how Yahoo got into such awful shape in the first place, Marissa Mayer's controversial rise at Google, and her desperate fight to save an Internet icon.\n\nIn August 2011 hedge fund billionaire Daniel Loeb took a long look at Yahoo and decided to go to war with its management and board of directors. Loeb then bought a 5% stake and began a shareholder activist campaign that would cost the jobs of three CEOs before he finally settled on Google's golden girl Mayer to unlock the value lurking in the company. As Mayer began to remake Yahoo from a content company to a tech company, an internal civil war erupted.\n\nIn author Nicholas Carlson's capable hands, this riveting book captures Mayer's rise and Yahoo's missteps as a dramatic illustration of what it takes to grab the brass ring in Silicon Valley. And it reveals whether it is possible for a big lumbering tech company to stay relevant in today's rapidly changing business landscape.\n\n===================================================================================\n\nePub format","torrent":{"xt":"urn:btih:d9e18048eefdcd86963e9392844d3ea5b44ff56b","amp;dn":"Marissa+Mayer+and+the+Fight+to+Save+Yahoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e18048eefdcd86963e9392844d3ea5b44ff56b","infoHashBuffer":{"type":"Buffer","data":[217,225,128,72,238,253,205,134,150,62,147,146,132,77,62,165,180,79,245,107]},"announce":[],"urlList":[]}}