{"title":"Dire Straits and Mark Knopfler.(Discografia).","uid":4501944,"size":2713162415,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da462a2cce8426390ea4469afe51545ac1e9b037&amp;dn=Dire+Straits+and+Mark+Knopfler.%28Discografia%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"cholo24","files":458,"time":1226431993,"description":"Dire Straits\n\n\nTodo comenzÃƒÂ³ en Londres, donde tres amigos compartÃƒÂ­an piso. Se trataba de los hermanos Mark y David Knopfler, junto a John Illsley. Mark trabajaba como maestro de escuela, David era asistente social y John trabajaba en una tienda de discos. Su situaciÃƒÂ³n econÃƒÂ³mica no les permitÃƒÂ­a demasiadas alegrÃƒÂ­as\n\nA ellos se solÃƒÂ­a unir su amigo Pick Whiters, quien era el ÃƒÂºnico que estaba introducido en el mundo de la mÃƒÂºsica. PoseÃƒÂ­a experiencia como mÃƒÂºsico, tras haber participado en algunos grupos.\n\nEn 1977 Pick y Mark deciden crear un grupo. Pick sugiere el nombre: &amp;#039;Dire Straits&amp;#039;, algo asÃƒÂ­ como &amp;#039;situaciÃƒÂ³n lÃƒÂ­mite&amp;#039;.\n\nJuntos, los cuatro componentes del grupo consiguen reunir el dinero para grabar una maqueta. En ella, cuatro temas: &amp;#039;Wild West End&amp;#039;, &amp;#039;Water Of Love&amp;#039;, &amp;#039;Sacred Loving&amp;#039; y &amp;#039;Sultans Of Swing&amp;#039;.\n\nCuando un conocido disc-jockey de una emisora de radio en Londres pinchÃƒÂ³ la maqueta en su emisora, la reacciÃƒÂ³n de la audiencia fue muy favorable, lo que oblogÃƒÂ³ al pinchadiscos a seguir emitiendo la mÃƒÂºsica de los Knopfler y compaÃƒÂ±ÃƒÂ­a.\n\nEntre los oyentes de la emisora se encontraba un conocido mÃƒÂ¡nager de Fonogram, a la bÃƒÂºsqueda de nuevos talentos, quien no cesa hasta que consigue que dos Dire firmen un contrato con su compaÃƒÂ±ÃƒÂ­a. El mismo representante de Fonogram les presenta a una representante para sus conciertos.\n\nLos Dire Straits actÃƒÂºan como teloneros del grupo norteamericano &amp;#039;Talking Heads&amp;#039;, en su gira por Gran BretaÃƒÂ±a, lo que les permite coger experiencia y darse a conocer. Entre todas las notas del grupo destacan las de la guitarra de Mark Knopfler, quien nos obsequia con sonidos extraordinarios entre el blues yel rock.\n\nEn marzo de 1978 Dire Straits publican su primer ÃƒÂ¡lbum, &amp;#039;Dire Straits&amp;#039;. Poco despuÃƒÂ©s comienzan a hacer conciertos en solitario, incluso fuera del Reino Unido. Por desgracia, las ventas del disco no son demasiado elevadas.\n\nUn aÃƒÂ±o despuÃƒÂ©s graban &amp;#039;CommuniquÃƒÂ©&amp;#039;, su segundo ÃƒÂ¡lbum y el menos vendido del grupo. Para compensar, sacan &amp;#039;Making Movies&amp;#039;, una vuelta al rock clÃƒÂ¡sico, con temas mÃƒÂ¡s fuertes.\n\nCon &amp;#039;Lover Over Gold&amp;#039; dan un nuevo giro a su estilo, mÃƒÂ¡s al aire que a Mark le gusta seguir. Un disco con sonidos casi orquestales, aunque sobre la base del rock.\n\nEn 1984 sale a la luz &amp;#039;Alchemy&amp;#039;, una selecciÃƒÂ³n de diez canciones recogidas de los conciertos en directo del grupo en la gira del aÃƒÂ±o anterior.\n\nA finales de 1984 los Dire Straits se encierran para preparar su nuevo disco. La grabaciÃƒÂ³n de este nuevo ÃƒÂ¡lbum les llevarÃƒÂ¡ varios meses y con ellos colaborar artistas de la talla de Sting. El nuevo ÃƒÂ¡lbum se titula &amp;#039;Brothers In Arms&amp;#039; y serÃƒÂ¡ su disco mÃƒÂ¡s vendido en todo el mundo, con canciones como &amp;#039;So Far Away&amp;#039;, &amp;#039;Money For Nothing&amp;#039;, &amp;#039;Walk Of Life&amp;#039;, etc.\n\nLa gira del disco &amp;#039;Brothers In Arms&amp;#039; supuso repetir el ÃƒÂ©xite cosechado por el disco. DurÃƒÂ³ dos aÃƒÂ±os y ofrecieron 250 conciertos en todo el mundo.\n\nLo siguiente fue una recopilaciÃƒÂ³n de sus mejores canciones y &amp;#039;Money For Nothing&amp;#039; fue el tÃƒÂ­tulo escogido.\n\nEn 1991 Dire Straits publicaron &amp;#039;On Every Street&amp;#039;, que no cubriÃƒÂ³ las espectativas generadas por los anteriores tÃƒÂ­tulos y que ha sido, hasta la fecha, el ÃƒÂºltimo de los Dire Straits. Aunque no han anunciado definitivamente su separaciÃƒÂ³n, la verdad es que realizan trabajos independientes. Por ejemplo, Mark Knopfler ha editado varios discos en compaÃƒÂ±ÃƒÂ­a de su guitarra, varios de ellos como bandas sonoras para pelÃƒÂ­culas.\n","torrent":{"xt":"urn:btih:da462a2cce8426390ea4469afe51545ac1e9b037","amp;dn":"Dire+Straits+and+Mark+Knopfler.%28Discografia%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da462a2cce8426390ea4469afe51545ac1e9b037","infoHashBuffer":{"type":"Buffer","data":[218,70,42,44,206,132,38,57,14,164,70,154,254,81,84,90,193,233,176,55]},"announce":[],"urlList":[]}}