{"title":"Janine Loves Jenna  (2007,xvid) -  Jenna Jameson in HELL feature","uid":4657872,"size":1465399296,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:daeb65adc2f2cd417c2c04e6ad88af8eb3123c7e&amp;dn=Janine+Loves+Jenna++%282007%2Cxvid%29+-++Jenna+Jameson+in+HELL+feature&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"pure_screens","files":2,"time":1232275523,"description":"Janine Loves Jenna  (2007, DVD.xvid)\n\n\n\n\n\n\nscreens CD1 + CD2 ( + large DVD-covers):\n &lt;a href=&quot;\nhttp://puur.blogbugs.org/5236196/Janine-Loves-Jenna---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://puur.blogbugs.org/5236196/Janine-Loves-Jenna---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nHell hath no fury like 2 women scorned!\nFrom the first name in Adult Entertainment comes the last rites of primal seduction!\n\nClub Jenna's biggest budget masterpiece collapses the boundaries of heaven and hell and explores the merits of vice over virtue. \n\n\nJenna commits suicide in a hotel then is forced to journey through the underworld to effect her release. Along the way she encounters one depraved act after another meeting Janine as well as the King of Hades.\n\nThe sets were wild...like nothing I've ever seen before.This isn't heaven versus hell. This is pure purgatory...a dark, lush sexual dreamscape where any desire can produce both bittersweet pain as well as unimaginable ecstasy...where no desire, no matter how thoroughly pursued, is every fully quenched to satisfaction.\n\n\n\nActresses\n\n    * Cherokee [NonSex]\n    * Dominica Leoni [Anal Facial]\n    * Janine [Facial]\n    * Jenna Jameson [Facial]\n    * Justine Joli [LezOnly]\n    * Katja Kassin [Anal Facial A2M]\n    * Naudia Nyce (as Naudia Nice) [NonSex]\n    * Nicole Brazzle [NonSex]\n    * Sativa Rose [NonSex]\n    * Veronica Lynn [NonSex]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Janine, Jenna Jameson, Justine Joli\n    * Scene 2. Dominica Leoni, Jerry, Reno\n    * Scene 3. Janine, Jenna Jameson, Justin Sterling, Manuel Ferrara\n    * Scene 4. Katja Kassin, Tommy Gunn, Vincent Vega\n    * Scene 5. Janine, Jenna Jameson, Julian, Justin Sterling\n    * Scene 6. Janine, Jenna Jameson\n\n\n\n\nCategory:       Feature, Plot Based, Couples, Star-Power, 2008 AVN Award Winner\nDirector: \tJustin Sterling\nStudio: \tClub Jenna\nRelease Date: \tMay 02, 2007\nFormat:         Xvid\nLanguage:       English\n\n\n\nSex stuff:\n\n1&gt; Janine &amp; Jenna &amp; Justine.                                                \n     In dark foggy room. Sexy outfits. Touching. Nude. Eating.              \n     Kissing. Fingering. 4 fingers for Justine. Eating. Anal                \n     fingering Janine. Strap-on dildo DP for Janine.                    9.00\n2&gt; Dominica &amp; Jerry &amp; Reno.                                                 \n     In foogy room. Funky outfits. BJ for each. Safe screwing &amp;             \n     BJ. Safe anal &amp; clit solo. Open mouth facials.                     9.00\n3&gt; Janine &amp; Jenna &amp; Justin Sterling &amp; Manuel Ferrara.                       \n     In dark foggy room. BJ. Safe screwing. Guys wearing hoods.             \n     Open mouth facials.                                                8.80\n4&gt; Katja &amp; Tommy Gunn &amp; Vincent Vega.                                       \n     In dark restuarant. Sexy red outfit. Kiss. BJ for each.                \n     Screwing &amp; BJ. Anal. A2M. Safe anal &amp; BJ. Open mouth facials.      8.90\n5&gt; Janine &amp; Jenna &amp; Julian &amp; Justin Sterling.                               \n     In foggy room. Sexy outfits. BJ. Safe screwing Janine. Jenna           \n     goes bareback with Justin. Clit solo. Open mouth facials.          8.90\n6&gt; Janine &amp; Jenna.                                                          \n     In bathroom. Nude. In tub. Kissing. Eating. Kissing. Eating.           \n     4 fingers for Janine. Solo. In dark room. 69 Janine on top.            \n     Anal solo with lighted candles. Dildo anal for Janine.             9.00\n\n\n\n\nREVIEW:\n\nScene One: \nJenna Jameson, the lead hotty on the right hand side of the cover, and Janine, her counterpart seen on the left hand side of the cover, were up first in hell with Justine Joli in a lesbian scene. The music was perfect for the subject matter and the trio seemed to relish eating each other out with the numerous demons watching them. There were a lot of fades and slow motion effects here but as much as I tend to hate stylish porn like this; I found the scene to be a cut above the usual fare from Club Jenna. Keeping in mind that the movie was made almost three years ago, Jenna was looking very healthy as was Janine and I don't think Justine ever looked better. I'm not saying I'd like this kind of special effects laden fuck flick as a regular thing but given the appeal of the trio, I sure didn't mind it. Janine and Justine are long time lesbian experts (IIRC, Janine had just started doing guys again around the time this was made) and Jenna has eaten at the Y scores of times in her career so unlike the multitude of lipstick lesbian movies on the market these days; this appeared to be the real deal. There were not a lot of toys but when they were employed, it was in the form of a technical DP that Janine seemed to enjoy receiving.\n\nScene Two: \nDominica Leoni, wearing a combination of battle dress and lingerie, was up next wearing extremely heavy make up as she took on Reno and Jerry. Dominica was slobbing their knobs back and forth, soon allowing the men to bone her pussy and ass in alternating positions. I was surprised there wasn't a DP here but they looked almost like gargoyles and the platform they were working on seemed like it belonged in a temple (though obviously a temple of hell). The scene ended when they splooged on her face, the gal seeming to enjoy the population pudding running down her head before the next segment.\n\nScene Three: \nJenna Jameson, and Janine, Manuel Ferrara, and Justin Sterling, were up next as the ladies encountered the men in a torrential downpour scripted by the director. Janine blew Manuel while Jenna stuck with Justin, looking like they were holding a contest of sorts to see who could do the best job. In this case, there was no clear cut winner but Janine seemed more into the aggressive oral than Jenna; the street setting fading into a building under construction for the screwing. Jenna's hip grinding style compared well to Janine's impaling on Manuel's cock and this was the kind of action I had long hoped to see from both of them when the movie was announced so long ago. In terms of the ending, Janine was the better of the two as she actively jerked Manuel off onto her face while Jenna let Justin rub out the load to her mouth (though providing some post coital sucking did make up some of the difference). Whew!\n\nScene Four: \nKatja Kassin, playing &quot;Lust&quot; in a diner, was up next as she teasingly played with the leading ladies but ended up with Tommy Gunn and Vincent Vega instead. Her oral was done very nicely here and as much of a fan of hers as I am, I have never really thought as much of her oral as her anal antics so that speaks volumes as to how well she blew them. They then took turns screwing her pussy but it was her award winning anal antics that really propelled the sex to the max thanks to her very aggressive riding style (getting them into her ass balls deep as the sweaty trio really worked it to the bone). There was no DP here either but that was fine as the camera loved her taking Tommy's cock anally (with the resulting ATM). By the end of the scene, they glazed her face and mouth, her post coital sucking showing some enthusiasm as she played her role to the hilt.\n\nScene Five: \nJenna Jameson, and Janine, Julian, and Justin Sterling, were up next in the icy part of hell by the devil's throne. Justin's campy devil was a less over the top than many others have played the role in the past (Tina Tyler's stands out, as does Jenna's, in comparison though, Justin's seemed more focused). Jenna blew the heavily made up Justin as Janine worked Julian; each of the ladies showing some chemistry with their chosen partner. Jenna really rode aggressively this time, pounding herself down on his cock while dressed in her fetish attire. Janine's role was far more passive this time, Jenna allowed to outshine her this time. Both gals took the facial well, Janine getting blasted in the eye before it was all over.\n\nScene Six: \nJenna Jameson and Janine, both in a bathtub after a bit of thematic trickery, enjoying the fruits of their plan with a lengthy lesbian scene as promised. They kissed seductively and rubbed all over each other in between the cunnilingus. There were some split screen shots and an interesting variation of a 69 that had Janine standing over Jenna who was on a bench in the next room. Thankfully, the shots were longer this time with a bit less of the rapid tempo editing that typically weakens efforts by the company. I was curious where the lit candle in the ass routine came from (the last time I saw it was when Janine was doing it to Jesse Jane in Pirates) but fans of fingering will find the scene especially appealing (a lot more than the large wooden table leg; which was also notable for how the second camera came into view of the shot that wasn't edited out).\n\n\n\nSummary: \nJanine Loves Jenna Jameson by director Justin Sterling for Club Jenna was a superior effort by all involved and I can see why Justin has been talking this one up for a very long time now (personally promising me on at least two occasions that I would find it to be awesome). There was a lot of fuck for the buck thanks to the scenes, the extras, and the fact that both Jenna and Janine are legends for a reason. I tried to avoid providing too many spoilers in the review but aside from the sometimes campy acting (which wasn't nearly as wooden as most porn tends to be), I found Janine Loves Jenna Jameson: Special Edition to be a rare bird indeed, earning a rating of DVD Talk Collector Series in the process. I'll admit to being a big fan of the leading ladies here, Janine having retired again (for now) and Jenna pretty much sticking to other aspects of the business these days, but in terms of big projects that appeal on multiple levels, JLJ was truly a special release worthy of your time, money, and seed. Check it out and I think you'll find it to be the best the company has ever offered as advertised. \n\n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:daeb65adc2f2cd417c2c04e6ad88af8eb3123c7e","amp;dn":"Janine+Loves+Jenna++%282007%2Cxvid%29+-++Jenna+Jameson+in+HELL+feature","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daeb65adc2f2cd417c2c04e6ad88af8eb3123c7e","infoHashBuffer":{"type":"Buffer","data":[218,235,101,173,194,242,205,65,124,44,4,230,173,136,175,142,179,18,60,126]},"announce":[],"urlList":[]}}