{"title":"Fighting the devil in Dixie","uid":11805377,"size":4489921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbb4d4cdc735a0f9f0dd244c1d9d620831539a8a&amp;dn=Fighting+the+devil+in+Dixie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"zombie_rox","files":1,"time":1428557408,"description":"A thrilling tale of the rise of the KKK following the birth of the civil rights movement, and how civil rights activists fought and defeated the powerful engines of white supremacy Shortly after the success of the Montgomery bus boycott, the Ku Klux Klan (KKK)-determined to keep segregation as the way of life in Alabama-staged a resurgence, and the strong-armed leadership of Governor George C. Wallace, who defied the new civil rights laws, empowered the Klan's most violent members. Although Wallace's power grew, not everyone accepted his unjust policies, and leaders such as Martin Luther King Jr., J. L. Chestnut, and Bernard LaFayette began fighting back in the courthouses and schoolhouses. So did young southern lawyers such as Charles &quot;Chuck&quot; Morgan, who became the American Civil Liberty Union's southern director; Morris Dees, who cofounded the Southern Poverty Law Center; and Bill Baxley, Alabama attorney general, who successfully prosecuted the bomber of Birmingham's 16th Street Baptist Church and legally halted some of Governor Wallace's agencies designed to slow down integration. All along, journalist Wayne Greenhaw was interviewing Klan members, detectives, victims, civil rights leaders, and politicians of all stripes. In Fighting the Devil in Dixie, he tells this dramatic story-from the Klan's kidnappings, bombings, and murders of the 1950s to Wallace's run for a fourth term as governor in the early 1980s, in which he asked for forgiveness and won with the black vote. This stirring work is an essential document for understanding 20th-century racial strife in the South and the struggle to end it.\n\nProduct Description\nAbout the Author\nWayne Greenhaw is the critically acclaimed author of 17 books, including Beyond the Night, My Heart Is in the Earth, and The Spider's Web. His work has appeared in The Miami Herald, The New York Times, and Reader's Digest. They both live in Montgomery, Alabama.\n\nPublisher: Zephyr Press (1 January 2011)\nLanguage: English\nISBN-10: 1569763453\nISBN-13: 978-1569763452\n\nimage","torrent":{"xt":"urn:btih:dbb4d4cdc735a0f9f0dd244c1d9d620831539a8a","amp;dn":"Fighting+the+devil+in+Dixie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbb4d4cdc735a0f9f0dd244c1d9d620831539a8a","infoHashBuffer":{"type":"Buffer","data":[219,180,212,205,199,53,160,249,240,221,36,76,29,157,98,8,49,83,154,138]},"announce":[],"urlList":[]}}