{"title":"The Monster: How a Gang of Predatory Lenders and Wall Street Ban","uid":6906052,"size":8313023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc788fb7f6e451763c3f9deb23cddab607fc2316&amp;dn=The+Monster%3A+How+a+Gang+of+Predatory+Lenders+and+Wall+Street+Ban&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Djofullinn","files":1,"time":1324587837,"description":"Who killed the economy?\n\nA page-turning, true-crime exposÃƒÂ© of the subprime salesmen and Wall Street alchemists who produced the biggest financial scandal in American history\n\n&quot;It's hard to have a guilty conscience if you don't have a conscience. Anything that benefited production - that benefited me and benefited my wallet - I'd do it.&quot;\n\nThe sales force at Ameriquest Mortgage took this philosophy to heart. They watched the Hollywood white-collar-crime flick &quot;Boiler Room&quot; as a training tape, studying how to pitch overpriced deals to unsuspecting home owners. They learned how to forge signatures on mortgage paperwork and create fake documents in &quot;cut-and-paste&quot; operations they dubbed &quot;The Lab&quot; or &quot;The Art Department.&quot;\n\nIn this stunning narrative, award-winning reporter Michael W. Hudson reveals the story of the rise and fall of the subprime mortgage business by chronicling the rise and fall of two corporate empires: Ameriquest and Lehman Brothers. As the biggest subprime lender and Wall Street's biggest patron of subprime, Ameriquest and Lehman did more than any other institutions to create the feeding frenzy that emboldened mortgage pros to flood the nation with high-risk, high-profit home loans.\n\nIt's a tale populated by a remarkable cast of the characters: a shadowy billionaire who created the subprime industry out of the ashes of the 1980s S&amp;L scandal; Wall Street executives with an insatiable desire for product; struggling home owners ensnared in the most ingenious of traps; lawyers and investigators who tried to expose the fraud; politicians and bureaucrats who turned a blind eye; and, most of all, the drug-snorting, high-living salesman who tell all about the money they made, the lies they told, the deals they closed.\n\nProvocative and gripping, The Monster is a searing exposÃƒÂ© of the bottom-feeding fraud and top-down greed that fueled the financial \n &lt;a href=&quot;\nhttp://www.amazon.com/Monster-Predatory-Lenders-Bankers-America--/dp/B005OHT61S/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1324584918&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Monster-Predatory-Lenders-Bankers-America--/dp/B005OHT61S/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1324584918&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:dc788fb7f6e451763c3f9deb23cddab607fc2316","amp;dn":"The+Monster%3A+How+a+Gang+of+Predatory+Lenders+and+Wall+Street+Ban","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc788fb7f6e451763c3f9deb23cddab607fc2316","infoHashBuffer":{"type":"Buffer","data":[220,120,143,183,246,228,81,118,60,63,157,235,35,205,218,182,7,252,35,22]},"announce":[],"urlList":[]}}