{"title":"Civilian Warriors (2013) Erik Prince (multi)","uid":9422020,"size":16488970,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd2194f2d5e99aff273f4d2f3d2124f360933a05&amp;dn=Civilian+Warriors+%282013%29+Erik+Prince+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"7","files":-1,"time":1388607367,"description":"Civilian Warriors: The Inside Story of Blackwater and the Unsung Heroes of the War on Terror by Erik Prince\n\n\nFormat: mobi/epub/azw3\nLength: 417 pages\nGenre: Non-Fiction/Military\nDate: 18 November 2013\n\nForget everything you think you know about Blackwater. And get ready for a thrilling, true story that will make you rethink who the good guys and bad guys have been since 9/11.\n\nNo company in our time has been as mysterious or as controversial as Blackwater. Founded by former Navy SEAL Erik Prince in 1997, it recruited special forces veterans and others with the skills and courage to take on the riskiest security jobs in the world. As its reputation grew, government demand for its services escalated, and Blackwater's men eventually completed nearly one hundred thousand missions in Iraq and Afghanistan. Both the Bush and Obama administrations found the company indispensible.\n\nAbove all, Prince debunks myths about Blackwater that spread while he was forced to remain silent?myths that tarnished the memory of men who gave their lives for their country but never got the recognition they deserved. He reveals new information about some of the biggest controversies of the War on Terror, including:\n\n* The true story of the Nisour Square massacre in Baghdad.\n* The actual details of Blackwater's so-called impunity in Iraq.\n* The events leading up to the televised deaths of Blackwater contractors in Fallujah.\n\nPrince doesn't pretend to be perfect, and he doesn't hide the sometimes painful details of his private life. But he has done a great public service by setting the record straight. His book reads like a thriller but is too improbable to be fiction.\n\nAuthor:\n\nErik Prince, a former Navy SEAL, founded Blackwater in 1997. He served as its CEO until 2009 and its Chairman until 2010, when the company was sold. A native of Michigan, he now lives in Abu Dhabi, where he pursues a variety of business ventures. ","torrent":{"xt":"urn:btih:dd2194f2d5e99aff273f4d2f3d2124f360933a05","amp;dn":"Civilian+Warriors+%282013%29+Erik+Prince+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd2194f2d5e99aff273f4d2f3d2124f360933a05","infoHashBuffer":{"type":"Buffer","data":[221,33,148,242,213,233,154,255,39,63,77,47,61,33,36,243,96,147,58,5]},"announce":[],"urlList":[]}}