{"title":"Code of Princess","uid":14339760,"size":1266857882,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd34319bd518cc117e1e39f44cd20dc36c0ef8d3&amp;dn=Code+of+Princess&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dauphong","files":1,"time":1460747429,"description":"Fans of action will savor the game’s combat, which is loaded with satisfying chain attacks, a variety of moves, and a three-plane battlefield that the player can move between tactically. Fans of RPGs will relish the ability to level and improve their characters, converting their gained experience into boosts for the stats that best suit their play-style and tactics. This amalgamation of game mechanics is wrapped in a beautiful package, boasting lovingly rendered and animated characters and eye-catching flurries of punches and kicks. Drawing upon its esteemed pedigree, Code of Princess has something for virtually every kind of gamer.\r\nFeatures:\r\n\r\n    Unlock 4 characters to battle your way through Campaign mode and even more characters to use in additional modes!\r\n    RPG stats let you decide how your characters will develop and collectible and equippable items let you improvise!\r\n    Float like a butterfly with fighting combos and the Plane system and sting like a bee with the damage doubling Lock-on and Burst systems!\r\n    Online cooperative play for when you’re feeling friendly and Online versus play for when you’re not!\r\n    Developed by industry veterans and illustrated by Kinu Nishimura of Capcom fame!","torrent":{"xt":"urn:btih:dd34319bd518cc117e1e39f44cd20dc36c0ef8d3","amp;dn":"Code+of+Princess","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd34319bd518cc117e1e39f44cd20dc36c0ef8d3","infoHashBuffer":{"type":"Buffer","data":[221,52,49,155,213,24,204,17,126,30,57,244,76,210,13,195,108,14,248,211]},"announce":[],"urlList":[]}}