{"title":"Irish Music","uid":5684676,"size":1554667816,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:dd980c76579d7ae9f8a86651798cbb7a56430609&amp;dn=Irish+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"IrishMusic","files":302,"time":1278901089,"description":"This is a standard Mp3 File compressed with winrar and once extracted plays on wmp,vlc etc.\n\n\nIrish Music, Rockey road to Dublin, Luke Kelly, The Dubliners, Christy Moore, Thin Lizzy, The Pouges, Planxty etc.\n\nThis is all the best of Irish Music from the best of Irish Artists.\n\nI have downloaded at least 50GB of Irish Music From Various torrent sites and there is so much crap and ive deleted at least 45GB from my laptop as its got every version of most good Irish songs, Scottish stuff and American stuff.\n\nWell If you like Irish Music then this is the torrent for you. \n\nIm Irish and Irish Music is my life. I have heard every version of every song and I know which version is the best. I also know what is good and what is crap.\n\nThis torrent is all my personal favourites complete with my seperate favourites playlist that has all the best songs from the torrent.\n\nI could not get the 1976 version of Luke Kelly-Rocky road to Dublin \nso The Dubliners version shall have to do.\n\nThis is my First Torrent and TBH Ive only opened this PB account to help people save time downloading Irish Music. \n\nThis torrent is all the Irish Music you will ever need trust me.\n\nLet me know what you guys think of the best playlist folder as its the best songs.\n\nAlso Seed when your Finished Please Keep Ratio of at least 1:1 \n\nIts important to share as this music should never be forgotten\n\n\nRIP Luke Kelly and Ronnie Drew. The world has lost 2 of its finest.\n\n\n \n\n","torrent":{"xt":"urn:btih:dd980c76579d7ae9f8a86651798cbb7a56430609","amp;dn":"Irish+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd980c76579d7ae9f8a86651798cbb7a56430609","infoHashBuffer":{"type":"Buffer","data":[221,152,12,118,87,157,122,233,248,168,102,81,121,140,187,122,86,67,6,9]},"announce":[],"urlList":[]}}