{"title":"Sunken Pyramid - Archer, Alex","uid":9234629,"size":878239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddb4052674162aac100719af1d27873ecf9c8a2d&amp;dn=Sunken+Pyramid+-+Archer%2C+Alex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":4,"time":1385147378,"description":"At the bottom of a lake lies an ancient cache worth killing for... The note from her friend and colleague had read &quot;I have quite the monster for you to chase, dear Annja.&quot; And then before she could speak to him, he'd been found dead in the hotel's stairwell. It didn't seemed possible. Annja Creed had been looking forward to three days of geeking out at the archaeology conference in Madison, Wisconsin, and then this tragedy strikes. And his is only the first death over the long weekend. Determined to investigate her friend's death-and find out why another colleague she trusts is arrested as the prime suspect-Annja starts gathering the pieces of a cryptic puzzle. A small collection of Mayan gold medallions. The death of a potter. The violent appearance of a teenaged girl with a strange green knife. And at the center of the puzzle, an ancient mound pyramid purportedly hidden at the bottom of a Wisconsin lake. That's a discovery that could completely rewrite Mesoamerican history. With each puzzle piece Annja Creed discovers, the mystery grows more dangerous. And what she knows can-and probably will-kill her.\n","torrent":{"xt":"urn:btih:ddb4052674162aac100719af1d27873ecf9c8a2d","amp;dn":"Sunken+Pyramid+-+Archer%2C+Alex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb4052674162aac100719af1d27873ecf9c8a2d","infoHashBuffer":{"type":"Buffer","data":[221,180,5,38,116,22,42,172,16,7,25,175,29,39,135,62,207,156,138,45]},"announce":[],"urlList":[]}}