{"title":"Kingdom Hearts 2 Final Mix [ENGLISH PATCH ONLY] [Jul 2011]","uid":8172984,"size":4845665,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:dde6a3867f1ef3edf25e0f0a8df1a22236829b4b&amp;dn=Kingdom+Hearts+2+Final+Mix+%5BENGLISH+PATCH+ONLY%5D+%5BJul+2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"locks04","files":4,"time":1361463522,"description":"This is the most current/best version of an English patch out there (as of writing this (FEB 2013)), though it's been a few years so I'm not sure it will be updated again anyway. This method only works for Windows, as it uses an EXE file to install the patch. It may be able to be done through Wine or something similar though I'm sure there is a simpler way for Mac/OSX users.\n\n:: Installing the English Patch for Kingdom Hearts II Final Mix ::\n\nAgain, torrent ONLY includes the patch, no game here.\nYou can download the game here, if you don't already have it: \n\n:: WHAT YOU NEED ::\n~The patch itself\nWhich you should already have or at least be about to get if your reading this xD\n~IMGBURN or DVD Dycrypter/A standard 4.7GB DVD-R (Verbatim 16x recommended) \nUnless your loading off a hard drive or flash memory, obviously.\n~An ISO format image of KH2FM. \nIf you have it in a different format, you'll need to find a way to convert it in order to use the patcher!\n~A method for playing it.\nBe it a modded console, SwapMagic, an emulator, ect. This is up to you!\n\nIf you own a physical copy of KH2FM, start IMGBURN or DvD Decrypter and create an image of the disc in ISO format.\n\nI highly recommend you also back up your ISO so if for whatever reason it doesn't work right, you don't need to redownload or remake your image, though, it worked for me the first time with no issues. It's always a good idea to think ahead when it comes to patching anything.\n\n\n:: INSTRUCTIONS ::\n-Open the downloaded folder\n-Drag ALL the files of the patch into the same folder as your KH2FM ISO (or vice verca, the important thing here is that everything is in the same folder)\n-Drag english_rev5.kh2patch into KH2PatcherRev4.exe (which should open the EXE up)\n-It will load up in CMD and prompt you for the iso name. You need to type in the EXACT filename. For example, mines Kingdom Hearts II Final Mix.iso\n-Press enter/return\n-It should finish quickly and show you a message saying it worked correctly.\n-Burn your edited image with IMGBURN or DVD Dycrypter at x2 (preferred) or as little as your burner is capable of, otherwise you may have issues with your disc.\n-Play it!\n\nThanks for downloading, please return the favor and seed this for as long as you can!","torrent":{"xt":"urn:btih:dde6a3867f1ef3edf25e0f0a8df1a22236829b4b","amp;dn":"Kingdom+Hearts+2+Final+Mix+%5BENGLISH+PATCH+ONLY%5D+%5BJul+2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dde6a3867f1ef3edf25e0f0a8df1a22236829b4b","infoHashBuffer":{"type":"Buffer","data":[221,230,163,134,127,30,243,237,242,94,15,10,141,241,162,34,54,130,155,75]},"announce":[],"urlList":[]}}