{"title":"Devin Townsend - The Retinal Circus T0lk","uid":10751942,"size":1927838315,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:ddef8ddc9fd6897def40b2252087c7652f8a0177&amp;dn=Devin+Townsend+-+The+Retinal+Circus+T0lk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tolkheim","files":1,"time":1407880147,"description":"In November 2011, after performing a series of special Devin Townsend Project shows, Devin Townsend revealed his plan to perform a one-off concert in London, England, that would cover his musical career from mid-1990s up to that point.[3] Townsend stated that he wanted to create a &quot;more than musical&quot; show which included a storyline, multiple performers and special effects.[3] Later he said that the concert would be recorded for future release.[4]\n\nThe concert lasted approximately three hours, and it was divided into two parts, with an intermission in between.[5] The band consisted of the same personnel as the recent years' Devin Townsend Project line-up, and the special guests were Anneke van Giersbergen and Jed Simon, with Steve Vai hosting the show via pre-recorded video projected onto screens. The setlist was focused heavily on material from Epicloud and a few other albums from Townsend's catalogue; the setlist included no songs from Terria, Accelerated Evolution, Ki and Ghost. Townsend also performed, against his current principles,[6] two Strapping Young Lad songs. He later stated that this was because of the career-spanning nature of the concert, and playing those two songs was a &quot;closure for him and Strapping Young Lad&quot;.[7] He also wanted to &quot;respect the legacy of the band&quot; and to reconnect and perform again with Jed Simon.[8]\n\nThe concert was one of the most prepared Devin Townsend shows ever, with over a year of pre-production, and it was recorded in high definition with a higher budget and a more professional approach to production than the previous live release, By a Thread.[3] 5000 people saw the sold out performance, and the concert was also streamed live through Livemusicstage.com.[9]\n\n1280x720 resolution\ntook a blueray copy and compressed it.\nlet me know what you think!\n- T0lk","torrent":{"xt":"urn:btih:ddef8ddc9fd6897def40b2252087c7652f8a0177","amp;dn":"Devin+Townsend+-+The+Retinal+Circus+T0lk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddef8ddc9fd6897def40b2252087c7652f8a0177","infoHashBuffer":{"type":"Buffer","data":[221,239,141,220,159,214,137,125,239,64,178,37,32,135,199,101,47,138,1,119]},"announce":[],"urlList":[]}}