{"title":"NIV Live Complete Audio Bible 2013","uid":9248961,"size":6064868186,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:de34ce9b2de4a3aed59e3ecab793f505807a56ca&amp;dn=NIV+Live+Complete+Audio+Bible+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"carmelbeachboy","files":1189,"time":1385431636,"description":"Multisensory. Cinematic. 3D enhanced sound. The NIV Live... A Bible Experience, audio Bible CD set is a digital masterpiece that presents the entire Bible (Genesis through Revelation) in an engaging and entertaining format, lets you listen to and experience the entire New International Version of the Bible from cover to cover, and allows you to enjoy God's eternal story whenever and wherever you desire. NIV Live features an ensemble cast of actors, musicians, and notable personalities, including Oscar, Emmy and Grammy Award nominees and winners, leading pastors, teachers, members of the clergy, and evangelists, that breathe life into the words and teachings of the Bible.Two-time Emmy Award-winning actress and producer Patricia Heaton (Mary Magdalene), Jesse Corti (Abraham), Kris Polaha (David), Mick Wingert (Saul), Tony Award-nominated actor Norm Lewis (Solomon), Christopher Gorham (Jesus), Pastor Erwin McManus (Psalms), Carlos Santos (Luke), Grammy Award-nominated singer and songwriter Martha Munizzi (Abigail), Pastor Craig Groeschel (Amos), Christine Lakin (Jezebel), Alex Dessert (Joshua), Phil Crowley (Moses), Tatyana Ali (Tamar), Emmy Award winning producer Pastor Miles McPherson (Angel), nine-time Grammy Award-winning singer and producer Kirk Franklin (Peter), along with many others. NIV Live uses the Bible text from the New International Version, the world's most popular modern-English Bible, with all 368 biblical characters represented by a unique voice. Dramatic performances, 3D theatrical sound, and a beautiful, inspired score by the Prague Philharmonic Orchestra make this an unforgettable listening experience. The NIV Live audio Bible delivers a truly spiritual, heart-pounding and authentic event that will become one of the most engaging and emotional experiences of your life.","torrent":{"xt":"urn:btih:de34ce9b2de4a3aed59e3ecab793f505807a56ca","amp;dn":"NIV+Live+Complete+Audio+Bible+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de34ce9b2de4a3aed59e3ecab793f505807a56ca","infoHashBuffer":{"type":"Buffer","data":[222,52,206,155,45,228,163,174,213,158,62,202,183,147,245,5,128,122,86,202]},"announce":[],"urlList":[]}}