{"title":"Girls Gone Wild - The Best of Extreme [DVDRip]","uid":8051390,"size":664339904,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:de9ca8bb649d7c3b6c3f632506e9d872369d3b9a&amp;dn=Girls+Gone+Wild+-+The+Best+of+Extreme+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":3,"uploader":"chkm8te","files":1,"time":1358866726,"description":"Girls Gone Wild - The Best of Extreme [DVDRip]\n\nGirls Gone Wild s cameras are always on hand to capture America s sexiest coeds as they lose their inhibitions, their clothes and their minds in pursuit of pure sexual pleasure. Now all the wildest, horniest action has been put together for Girls Gone Wild: Best of Extreme Sex! Ashley and Alexandra are a couple of coeds from Louisiana like it nice and spicy. First they lose their tops for a nice nipple to nipple cuddle and then challenge each other to a boob bouncing naked race around the nightclub! Sweet Amber from Michigan is definitely the shy, quiet type, which makes it that much more arousing when she reveals that she likes and then shows off a truly amazing pair of breasts. Sweet 19 year old Jessica still wears braces, but her smokin young body is ready for pleasure as she gets totally naked and brings herself to a climax in full view of the Las Vegas Strip. Next, meet 20 year old Angel, a brunette who is a little nervous when she first climbs aboard the Girls Gone Wild bus, but soon she s totally naked and streaking down the highway, where the sight of her perfect breasts nearly causes a pileup! Meet a pair of cute young BFFs from Wilkes Barre, Pennsylvania who seal their friendship for us with a long, hot, tongue sucking kiss. 19 year old Miranda is a 5 3 spinner who loves sex and can t keep her hands off her amazing boobs. She strips off her cutoffs but leaves her cowboy boots as she demonstrates just how wet a coed can get! Finally, meet Tanner a pretty blonde who reveals some shocking sexual secrets, then treats us to a nice long solo session in bed and in the shower with a sex toy you have to see to believe. It s wild, it s crazy, it s sexy and it s insanely hot. Girls Gone Wild: Best of Extreme Sex!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=g160i1eg1vm36z6of1ug.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=g160i1eg1vm36z6of1ug.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qr1qduuq8erdyqpfpmc6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qr1qduuq8erdyqpfpmc6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:de9ca8bb649d7c3b6c3f632506e9d872369d3b9a","amp;dn":"Girls+Gone+Wild+-+The+Best+of+Extreme+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de9ca8bb649d7c3b6c3f632506e9d872369d3b9a","infoHashBuffer":{"type":"Buffer","data":[222,156,168,187,100,157,124,59,108,63,99,37,6,233,216,114,54,157,59,154]},"announce":[],"urlList":[]}}