{"title":"Dicked Traci (1989) XXX Classic VHSRip","uid":11826375,"size":1252948897,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:decd3cf0f749da9d2bd5f969c7a6276084f3ff82&amp;dn=Dicked+Traci+%281989%29+XXX+Classic+VHSRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"B01010000","files":4,"time":1429511215,"description":"        ...::TORRENT NAME::...\nDicked Traci (1989) XXX Classic VHSRip\n\n    ...::POSTER &amp; SCREENSHOTS::... &lt;a href=&quot;\nhttp://imgclover.com/image/Hx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/Hx&lt;/a&gt; &lt;a href=&quot;\nhttp://imgclover.com/image/HR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgclover.com/image/HR&lt;/a&gt;\n\n        ...::DESCRIPTION::...\n(Scene one) Not sure on actor's names, but a hot blonde with a large talon necklace gets fucked by some dude on the floor. Nice hot scene with cunnilingus, cowgirl, 69, doggy, missionary, scissor, and cumshot on stomach.\n\n(Scene two) Short scene with Francois Pappilon and Samantha Strong where they fuck on a couch. Starts wit nice de-robbing and some cunnilingus. Then goes to spoon fucking and cum on pussy (in slow-mo)\n\n(Scene three) Super quick scene with some dude and mullet chick. Starts off in missionary, then quickly goes to doggy to finish on lower back.\n\n(Scene four) Another quick, but hot scene with Lois Ayers and Hershel Savage. Starts of with some dialogue, then they fuck in bed in front of a roaring fire. Start off in missionary (Lois on top), then she quickly goes down to finish him off with a handy. Nice shot right between the eyes! Then spoon afterwards with finishing dialogue.\n\n(Scene five) Erica Boyer and a Blonde start off in bed making out, kissing and stripping. Will cut back after Scene 6.\n(Scene fiveb) The two chicks do some nice pussy eating, fingering, boob to pussy fucking, and rimjob.\n\n(Scene six) Randy West and Stacy Donavan fuck on a couch. Starts off with a nice blowjob, then cut back to Scene 5\n(Scene sixb) More blowjob, but he's above her now. Then some missionary fucking, flip to her on top, then doggy, then back to missionary for the finish on her stomach.\n\n(Scene seven) Good threesome scene with a dude, Erica Boyer and Stacy Donavan. Starts off with a double BJ, then to cowgirl and cunnilingus. Good move with both of the chicks mounting him, facing each other. Then Stacy dismounts to play with herself next to the fucking couple. Then she gets underneath so she can get a close-up of the doggy action. He then pulls out and finished on their hip and tits.\n\n\nVHS Rip:\n\nQuality: Very Good/Great - Typical VHS blurry, with some minor tracking lines here and there. Overall great color and sound.\nFile Format: AVI\nVideo Codec: MPEG4 (DivX/Xvid compatible)\nFile Size: 1.16 GB\nFrame Size: 720 x 540\nData Bitrate: 2509 kbps\n\nFrame Rate: 29.97 fps\nAudio Codec: MP3\nSample Rate: 48000Hz 16 bit\nBitrate: 320 kps\n\nTotal Bitrate: 2838 kps","torrent":{"xt":"urn:btih:decd3cf0f749da9d2bd5f969c7a6276084f3ff82","amp;dn":"Dicked+Traci+%281989%29+XXX+Classic+VHSRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"decd3cf0f749da9d2bd5f969c7a6276084f3ff82","infoHashBuffer":{"type":"Buffer","data":[222,205,60,240,247,73,218,157,43,213,249,105,199,166,39,96,132,243,255,130]},"announce":[],"urlList":[]}}