{"title":"Pro Gamer Manager v0.165b","uid":12579766,"size":333549350,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dfde3ad3333945350d0b585049d327007a4d4b05&amp;dn=Pro+Gamer+Manager+v0.165b&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Kappel.Eyal","files":1,"time":1444939262,"description":"Title: Pro Gamer Manager \r\nGenre: Casual, Indie, Simulation, Sports, Early Access \r\nPublisher: Millenway Studios\t\r\nRelease Date: 16 Oct, 2015 \r\nLanguage: English \r\n\r\nSystem Requirements: \r\nMinimum: \r\nOS: Windows XP, Vista or 7 \r\nProcessor: 1.2 GHz \r\nMemory: 2 GB RAM \r\nGraphics: DirectX® 9 Compatible Graphics Card \r\nDirectX: Version 9.0a \r\nHard Drive: 1 GB available space \r\n \r\nAbout This Game \r\nBuild and manage your own progaming team \r\nWork your way up as an amateur gamer to founding an professional esport organisation from scratch. Build your team piece by piece, and reach for the big leagues. \r\n\r\nBecome the leader of an esport organisation and gain worldwide fans. It's your choice, but in the end only one thing matters: Carry hard or get rekt both in term of recruitment, staff management, finances, contracts and sponsors, training programs, leave nothing to chance. You are in the hot-seat, where every decision will be crucial in your bid for victory! \r\n\r\nBuild your own career \r\nStart from nothing, choose your role as Support, Jungler, ADC, Mid or Toplane. Shape your own playstyle. Choose between hundreds of different ways to improve. Keep that KDA as high as possible. Become an international star. \r\n\r\nBuild your team \r\nOnce you proven yourself you can move into larger gaming facilties, recruit a team and train them and unlock new options as you progress. Shape the future for your own esport team. \r\n\r\nAim for the big leagues \r\nGain cash and fans to unlock upgrades and opportunitys. Participate in a range of competitions ranging from Local Amateur Leagues to Pro Leagues. \r\n\r\nMake hard choices \r\nAs your esport team grow more wealthy and prosperous you can use resources to improve your own skill or your teammates, can you carry hard enough or you want to depend others? \r\n\r\nPractice your own skill, use esportpoints to focus improvements on a particular area \r\nGain new insights every day and make strategic choices in all aspects \r\nMove to bigger facilites and help your team adapt to new enviroments \r\nRecruit and train new team members, choose strategies and tactics. \r\nAttend tournaments for fame and glory and prizemoney. \r\nKeep an eye open for those new upcomers that will wreck the ladders, make sure they join your team","torrent":{"xt":"urn:btih:dfde3ad3333945350d0b585049d327007a4d4b05","amp;dn":"Pro+Gamer+Manager+v0.165b","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfde3ad3333945350d0b585049d327007a4d4b05","infoHashBuffer":{"type":"Buffer","data":[223,222,58,211,51,57,69,53,13,11,88,80,73,211,39,0,122,77,75,5]},"announce":[],"urlList":[]}}