{"title":"Agnes Carlsson - Discography","uid":6415036,"size":251818949,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e01c97a2c4560596e6240177081d9035a289ba94&amp;dn=Agnes+Carlsson+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"piratetorrent1989","files":31,"time":1306142984,"description":"Agnes Emilia Carlsson, also known mononymously as Agnes (born on March 6, 1988, in VÃƒÂ¤nersborg, Sweden), is a Swedish recording artist. She rose to fame as the winner of Idol 2005, the second season of the Swedish Idol series. She was then signed to Sony Music, through which she released her self titled debut album Agnes and follow-up Stronger, both of which topped the Swedish Top 60 Albums Chart. In early 2008, it was announced that Agnes had parted ways with her record label, and was now signed to small independent label Roxy Recordings. Released on October 28, 2008, her third album, Dance Love Pop, reached number five in Sweden, seventy in Austria, thirty-eight in France, forty-five in Switzerland and 13 in the United Kingdom. Its first two singles, &quot;On and On&quot; and &quot;Release Me&quot; became international hits, reaching the top-ten in charts worldwide. &quot;Release Me&quot; topped the Billboard Hot Dance Club Songs and peaked at three in the United Kingdom, selling over 900,000 copies worldwide.\n\nAgnes has cited the soul-singer Stevie Wonder as her inspiration and has often mentioned Whitney Houston and Janet Jackson as her inspiration in music.\n\nAlbums:\n\n2005: Agnes\n2006: Stronger\n2008: Dance Love Pop\n","torrent":{"xt":"urn:btih:e01c97a2c4560596e6240177081d9035a289ba94","amp;dn":"Agnes+Carlsson+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e01c97a2c4560596e6240177081d9035a289ba94","infoHashBuffer":{"type":"Buffer","data":[224,28,151,162,196,86,5,150,230,36,1,119,8,29,144,53,162,137,186,148]},"announce":[],"urlList":[]}}