{"title":"Teach Yourself VISUALLY Photoshop CS5 (7Summits)","uid":5668784,"size":96129534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0530485bbdb404a3ffacc326b8d0621a5a5f1a4&amp;dn=Teach+Yourself+VISUALLY+Photoshop+CS5+%287Summits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"7_summits","files":-1,"time":1278251272,"description":"Publisher: Visual, 2010 | ISBN: 0470612630 | 356pages | PDF | 91.6MB\n\n\nGets visual learners up to speed quickly on the newest Photoshop release\n\nPhotoshop is the gold standard for image-editing programs and is used by professional photographers, graphic designers, and Web designers as well as hobbyists. Designed for those who learn best visually, this full-color guide has been completely updated to cover the newest release of Photoshop. Previous editions have sold more than 150,000 copies.\n\n   * Photoshop is the industry standard for image-editing software used in both print and digital media, with more than four million users worldwide; the latest version includes new functionality and enhanced tools  \n   * People who learn more easily when they can see how something is done will quickly grasp essential Photoshop concepts and procedures in this visual, step-by-step format\n   * Covers importing photos from digital cameras and scanners, retouching and repairing, enhancing digital images, adding custom 3D effects, editing images for the Web, creating a Web photo gallery, incorporating graphics into desktop publishing programs, color management, using layers and filters, compositing, and more\n\nWith step-by-step instructions and full-color screen shots to demonstrate each task, Teach Yourself VISUALLY Photoshop makes learning easy.\n\nNote: CD-ROM/DVD and other supplementary materials are not included as part of eBook file.","torrent":{"xt":"urn:btih:e0530485bbdb404a3ffacc326b8d0621a5a5f1a4","amp;dn":"Teach+Yourself+VISUALLY+Photoshop+CS5+%287Summits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0530485bbdb404a3ffacc326b8d0621a5a5f1a4","infoHashBuffer":{"type":"Buffer","data":[224,83,4,133,187,219,64,74,63,250,204,50,107,141,6,33,165,165,241,164]},"announce":[],"urlList":[]}}