{"title":"POtHS - SIN-ister Secrets - 101 - Monopoly Medicine","uid":7866054,"size":2879219801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e09d75aad27720164cf1219f491f7b232bbcb10f&amp;dn=POtHS+-+SIN-ister+Secrets+-+101+-+Monopoly+Medicine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"POtHS11","files":82,"time":1354064896,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - SIN-ister Secrets - 101 - Monopoly Medicine\n\n\n\n\nPOtHS Comment: For Xmas gifts please burn just 7 DVD's with POtHS Info and Give them to Seven Friends that will watch and Pass on The DVD's. Forget about socks, ties and Aftershave!!! Educate your friends for Christmas with POtHS.\n\nDescription:\n\nThe Enemy Within - A Global Conspiracy:\n\nMonopoly Medicine - Mike Adams:\nHow Big Pharma takes your money and makes you sick Mike Adams interviewed by G. Edward Griffin Mike Adams, known as the Health Ranger to his fans, is the author of numerous books on natural health and editor of the popular internet site called News Target. Although self-taught, his knowledge of natural medicine is nothing short of phenomenal, as you will see from this interview. Be prepared for an enlightenment that could change your life. DVD, 107 minutes. TOPICS * How Mike cured himself when doctors failed. * Aspartame: The sweetest poison money can buy. * How Big Pharma controls the FDA. * Inventing mental disease to sell pharmaceuticals. * Modern medicine is riddled with junk science. * The cancer industry: A medical con game. * The best medicine contains freedom of choice. * The criminalization of vitamins by the United Nations. * The health crisis that looms ahead. * What you can do on your own to help. * Sidestep restrictions by growing your own medicine. * The importance of pH balance to optimum health. * The importance of sunlight to optimum health\n-----------------------------------------------------------\n\nGlaxoSmithKline whistleblower speaks out about bribery of doctors, off-label marketing of drugs:\n\nThe Real Death Panel:\nRecently a noted physician charged that national health care services were already euthanizing tens of thousands of senior citizens. What should Americans, and especially senior citizens, fear about the new national healthcare plan of President Obama? Larry Spargimino and Dr. Keith Smith continue discussing how nationalizing health care in other countries has always leads to rationing of drugs for diseases like cancer, poorer health care services from doctors and hospitals, and an increase in the deaths of those countries' citizens. For genocide to happen, there must be certain preconditions. \n-----------------------------------------------------------\nNebuchadnezzar Loses His Mind by Voddie Baucham:\n\n\nMay Yahweh Bless You as He has me. Seed Long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the tRUtH.\n\n","torrent":{"xt":"urn:btih:e09d75aad27720164cf1219f491f7b232bbcb10f","amp;dn":"POtHS+-+SIN-ister+Secrets+-+101+-+Monopoly+Medicine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e09d75aad27720164cf1219f491f7b232bbcb10f","infoHashBuffer":{"type":"Buffer","data":[224,157,117,170,210,119,32,22,76,241,33,159,73,31,123,35,43,188,177,15]},"announce":[],"urlList":[]}}