{"title":"The Modern Creation Trilogy - Dr. Henry M. Morris","uid":10386639,"size":2253770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e12a185b526aaf1df61300c180f62de65d154c8d&amp;dn=The+Modern+Creation+Trilogy+-+Dr.+Henry+M.+Morris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1403139345,"description":"Utterly fascinating, The Modern Creation Trilogy is the definitive work on the subject, and a must for anyone interested in the study or origins. Read about the easy capitulation by theologians confronted with Charles Darwin and lsquo;s evolutionary theories, or the mysterious Babylonian creation story, Enuma Elish. Find out what the Bible says about dinosaurs, Noah and flood, and Christ and firm acknowledgement of the importance of Genesis. This project covers all the bases, and as a beautifully bound set, makes the perfect gift for believers and even unbelievers.\n\n-Volume One: Scripture and Creation - 232 pages - Evidences found throughout the Bible for special creation.\n-Volume Two: Science and Creation - 343 pages - Examines only the scientific facts.\n-Volume Three: Society and Creation - 208 pages - The effects on society of a pervasive evolutionary philosophy.\n\nAbout the authors:\nHenry Morris, Ph.D., (deceased) earned the title, &quot;The Father of Modern Creationism,&quot; through with his numerous writings about the creation/evolution debate. Dr. Henry M. Morris truly was a man of science and a staunch man of God. He was even said to have set the terms of debate about evolution for the second half of the 20th century by one Pulitzer Prize-winning academician. Dr. Morris began his serious study of the Bible in the 1930s and authoring books in the 1940s, but it was his landmark work, co-authored with Dr. John Whitcomb, titled The Genesis Flood in 1961 that influenced generations to begin discovering the fallacies of evolution and the biblical truth of creation.He was the founder of the Institute for Creation Research in California.\n\nJohn Morris, Ph.D. , is president of the Institute for Creation Research in El Cajon, California and has a Ph.D. in geology from the University of Oklahoma. He is a popular speaker and author and in addition to his writing and research, has searched Turkey's Mt. Ararat several times for Noah's ark.","torrent":{"xt":"urn:btih:e12a185b526aaf1df61300c180f62de65d154c8d","amp;dn":"The+Modern+Creation+Trilogy+-+Dr.+Henry+M.+Morris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e12a185b526aaf1df61300c180f62de65d154c8d","infoHashBuffer":{"type":"Buffer","data":[225,42,24,91,82,106,175,29,246,19,0,193,128,246,45,230,93,21,76,141]},"announce":[],"urlList":[]}}