{"title":"Sublime - Date Rape [alternate promo].VOB","uid":9012163,"size":253360128,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e1f7618ac40752e1c74ce4dbb3d8ce1d388fe4cb&amp;dn=Sublime+-+Date+Rape+%5Balternate+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1381120627,"description":"Sublime - Date Rape [alternate promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Date Rape&quot; is a song by the band Sublime originally recorded for their 1992 debut album, 40 Oz. to Freedom. It was first released as a single in 1991, but did not become a hit until four years later, when the Los Angeles radio station KROQ began adding it into their playlists and it quickly became one of their most requested songs.\n\nBradley Nowell explained,\n\n\nI've never raped anyone at least as far as I can remember. We were at a party a long time ago and we were all talking about how much date rape sucked. This guy was like, &quot;Date rape isn't so bad; if it wasn't for date rape I'd never get laid.&quot; Everyone at the party was bummed out about it, but I was cracking up and I wrote a funny song about it.\n\nHumorous in tone, the song ends with the victimizer being sent to prison and being humiliatingly anally raped by a larger inmate.\n\nAlthough &quot;Date Rape&quot; is one of Sublime's most popular songs, it barely made it on their first CD. Nowell and the other members of the band thought of it as one of their worst songs. They were often reluctant to play it during live shows when fans screamed out requests for it.\n\nSublime was an American ska punk and reggae rock band from Long Beach, California, formed in 1988. The band's line-up, unchanged until their breakup, consisted of Bradley Nowell (vocals and guitar), Eric Wilson (bass) and Bud Gaugh (drums). Lou Dog, Nowell's dalmatian, was the mascot of the band. Michael 'Miguel' Happoldt and Marshall 'Field' Goodman contributed on a few Sublime songs. Nowell died of a heroin overdose in 1996. In 1997, posthumous songs such as &quot;Santeria&quot;, &quot;The Wrong Way&quot;, &quot;Doin' Time&quot;, and &quot;April 29, 1992 (Miami)&quot; were released to U.S. radio\n\nSublime released three studio albums, one live album, five compilation albums (one of which also contains never-before released material), three EPs and one box set. Although their first two albums  40oz. to Freedom (1992) and Robbin' the Hood (1994)  were quite popular in the United States, Sublime did not experience major commercial success until 1996 with their self-titled third album, released two months after Nowell's death, which peaked at number 13 on the Billboard 200, and spawned the single &quot;What I Got&quot;, which remains the band's only number one hit single (on the Billboard Alternative Songs chart) in their musical career. As of 2009, the band has sold over 17 million albums worldwide, including about 10 million in the U.S. alone.\n(video does not have any logos)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Date_Rape_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Date_Rape_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/GAAbeaAfj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/GAAbeaAfj&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 29.97fps 9000kbps\n   Audio: MPEG Digital Audio 48000Hz stereo 160kbps\n   Duration: 00:03:41\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.0\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e1f7618ac40752e1c74ce4dbb3d8ce1d388fe4cb","amp;dn":"Sublime+-+Date+Rape+%5Balternate+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1f7618ac40752e1c74ce4dbb3d8ce1d388fe4cb","infoHashBuffer":{"type":"Buffer","data":[225,247,97,138,196,7,82,225,199,76,228,219,179,216,206,29,56,143,228,203]},"announce":[],"urlList":[]}}