{"title":"Voetbal Vrouwen - (Seizoen 1 - Disk 1) - 2Lions-Team","uid":5430476,"size":4681813908,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e30780347df5399b3fa250d528583bf94d99b08e&amp;dn=Voetbal+Vrouwen+-+%28Seizoen+1+-+Disk+1%29+-+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SAIMOR","files":-1,"time":1268352674,"description":"Nederland\n3 Dvd`s / 420:00 minuten \n\nDisk 1 / Aflevering 1 t/m Aflevering 4\n\nRegisseur: Hans Scheepmaker \n\nmet Leontine Ruiters, Lone van Roosendaal, Sophie van Oers, Mike Weerts, Bas Muijs, Nicolette van Dam, Dyllan Debord \n \nBeschrijving: \n\nRenske Veldman is de mooie vriendin van godenzoon Danny Doornbos, de nieuwe spits van Heros. \nRenske en Danny komen uit Brabant en moeten behoorlijk wennen aan hun nieuwe, flitsende leventje. \nAan de pers die het mooie en succesvolle stel voordurend op de hielen zit. Aan de hordes fans van Danny. \nEn niet in het minst aan hun nieuwe huis, waar een jaar geleden een voetbalvrouw is vermoord. \nIs Renske hier nog wel veilig? Daarnaast spelen de verhalen van drie andere voetbalvrouwen een belangrijke rol.\nZo is daar de op publiciteit beluste Melanie die koste wat kost in de picture wil blijven en wanhopige pogingen doet haar man Jeffrey aan het voetballen te houden. \nLiz, de vrouw van de coach, die schoon genoeg heeft van voetbal en haar man nu eindelijk eens voor zichzelf wil. \nEn Solange, die alles pikt van haar Italiaanse driftkikker Italo. Totdat ze merkt dat ze hem eigenlijk helemaal niet nodig heeft om succesvol te zijn.\n\nBeeld: 16:9\nGeluid:Dolby Digital 2.0\nTaal:  Nederlands \n\n****************************************************************************\nNetherlands \n3 DVD `s / 420:00 minutes \n\nDisk 1 / Episode 1 t/m Episode 4\n\nDirector: Hans Scheepmaker \n\nwith Leontine Ruiters, Lone van Roosendaal, Sophie van Oers, Mike Weerts, Bas Muijs, Nicolette van Dam, Dyllan Debord \n  \nDescription: \n\nRenske Veldman is the beautiful girlfriend of son of gods Danny Doornbos, the new vanguard of Heros. \nRenske and Danny come from Brabant and should properly adjust to their new, flashy life. \nAt the press that the beautiful and successful set constantly on their tail. The hordes fans of Danny. \nAnd not least to their new home, where one years ago a football wife is murdered. \nRenske is still safe? Also play the football stories of three other women a major role. \nThus there is the publicity-hungry Melanie that at all costs to remain in the picture and her husband Jeffrey desperate attempts to keep playing football. \nLiz, the wife of the coach, who has had enough of football and her husband once and for self. \nAnd Solange, who picks up all of its Italian Italo drift frog. Until she realizes that she really did not need to be successful. \n\nImage:   16:9 \nSound:   Dolby Digital 2.0 \nLanguage:Dutch\n\n*****************************************************************************\nBrought to you by \nROMIAS\n2Lions Team \n\nmeer zien?? \nKom dan eens kijken op ons forum \n    &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n****************************************************************************** \nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding.\n\n******************************************************************************\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n*******************************************************************************\t\n \n \n \n","torrent":{"xt":"urn:btih:e30780347df5399b3fa250d528583bf94d99b08e","amp;dn":"Voetbal+Vrouwen+-+%28Seizoen+1+-+Disk+1%29+-+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e30780347df5399b3fa250d528583bf94d99b08e","infoHashBuffer":{"type":"Buffer","data":[227,7,128,52,125,245,57,155,63,162,80,213,40,88,59,249,77,153,176,142]},"announce":[],"urlList":[]}}