{"title":"Moana 2009 Prima Parte iTALiAN HDTV XviD-SiD [IN]","uid":5192634,"size":735265534,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:e32b29f2086fa842d4dcba4a09b1486596b9d215&amp;dn=Moana+2009+Prima+Parte+iTALiAN+HDTV+XviD-SiD+%5BIN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Broken_Promises","files":-1,"time":1259777983,"description":"Per altre news vieni a trovarci su www.italia-news.org\n\nSi consiglia l'utilizzo di VLC come riproduttore multimediale.\n\nDATI\n\nTitolo: Moana\nGenere: Drammatico\nEpisodi: 2\nDurata Episodi: 1:38 circa \t \nRegia: Alfredo Peyretti\nProduttore: Sky\nSceneggiatura: Cristiano Bortone,Leonardo Breccia.  \n\nTRAMA\n\nSono passati quindici anni dalla sua morte, ma il mito di Moana ÃƒÂ¨ ancora vivo e vegeto nell'immaginario degli italiani. Lo dimostra anche il coraggio di Sky che decide, in un paese puritano e bigotto come il nostro ma oggi come allora 'movimentato' da scandali sessuali, di confezionare e dedicare una minifiction proprio a lei, a Moana Pozzi, la donna che a cavallo tra gli anni '80 e '90 ha portato per la prima volta il porno nelle case degli italiani e che voleva piacere anche alle donne, una che ha saputo essere estrema e lanciare un messaggio importante di libertÃƒÂ .\nNella minifiction prodotta da Polivideo per Sky Cinema, in onda martedÃƒÂ¬ 1 e mercoledÃƒÂ¬ 2 dicembre in prima serata su Sky Cinema 1, si ripercorre la vita di Moana - interpretata da una strabiliante Violante Placido - da quando era un'adolescente, giÃƒÂ  bella e desiderabile e per questo additata come una provocatrice. Osteggiata da una famiglia bigotta e molto religiosa decide di lasciare tutti e di trasferirsi a Roma appena maggiorenne, dopo qualche lavoro saltuario come modella e come comparsa in tanti e famosi film si accorge che il porno era la strada che l'avrebbe portata verso la notorietÃƒÂ  assai piÃƒÂ¹ in fretta. Tutto inizia quando incontra un giovane attore australiano e se ne innamora; lui la convince a girare un film hard insieme, Valentina - Ragazza in calore, garantendole che non sarebbe mai stato rilasciato in Italia, cosa che invece succede puntualmente di lÃƒÂ¬ a poco rovinando i suoi rapporti con la tv di Stato e, per sempre, quelli con la famiglia. Sul set conosce l'allora fotografo di scena Riccardo Schicchi con il quale gira la prima pellicola a luci rosse del circuito di serie A col suo vero nome, intitolata Fantastica Moana. Violante Placido e Giorgia Wurth in una immagine di Moana. Entrata nell'entourage di Diva Futura, l'agenzia del talentscout Schicchi, Moana conosce Ilona Staller in arte Cicciolina e tra le due nasce un'amicizia, ma anche una grande rivalitÃƒÂ .\nPoi gli spettacoli live nei teatri la lanciano definitivamente nel mondo del porno e le danno anche una notevole pubblicitÃƒÂ  sulla stampa per via dello scandalo giudiziario in cui rimane coinvolta: nel film si raccontano infatti le numerose irruzioni della polizia nella sede di Diva Futura e durante gli spettacoli, ma anche la sofferenza per il rifiuto della famiglia che la abbandona al suo destino senza mai piÃƒÂ¹ rivolgerle la parola, il rapporto di grande affetto e amicizia con l'amico Mario, suo truccatore personale nonchÃƒÂ¨ coinquilino per tanti anni, un libro pubblicato a sue spese in cui raccontava della sua vita e dei suoi amanti 'celebri', e il dietro le quinte dei suoi film piÃƒÂ¹ famosi.\nMoana non ÃƒÂ¨ stata solo scandalosa ma anche propositiva, fondando insieme alla collega Cicciolina il Partito dell'Amore, che conquistÃƒÂ² tantissimi voti, e facendosi conoscere dal grande pubblico con le partecipazioni televisive nei salotti di Pippo Baudo e di Fabio Fazio, e gli incontri con Indro Montanelli, Enzo Biagi e Federico Fellini. Apparizioni che le hanno permesso di mostrare doti intellettuali per l'epoca insospettabili per un personaggio del porno.\nPresentata oggi a Roma la miniserie in due puntate sulla vita e sulla tragica fine della celebre pornostar Moana Pozzi interpretata con una somiglianza impressionante da una bravissima e voluttuosa Violante Placido.\nTradita, giudicata, spudorata, esibizionista, trasgressiva, immorale e immortale. Questa era Moana Pozzi, pornodiva dotata di una classe e di una sensualitÃƒÂ  fuori dal comune, una donna bisognosa di amare e ...\nTutto questo in un affresco pop che non intende minimamente svelare i misteri sulla vita e sulla morte di Moana, ma di raccontare in chiave moderna l'evoluzione tempestosa di una ragazza che ha voluto fortemente la sua libertÃƒÂ , assoluta e indissolubile, fino ad una tragica morte, prematura ed inattesa, ancora oggi avvolta da molti dubbi. Le tinte forti della prima parte fanno il paio con una seconda parte piÃƒÂ¹ cupa, in cui cambiano i toni, cambia la musica perchÃƒÂ¨ a cambiare ÃƒÂ¨ la sua visione del mondo che circonda lei e le sue ambizioni.\nViolante Placido ÃƒÂ¨ una splendida Moana Pozzi e nei panni della celebre pornostar che ha fatto epoca, vestita, truccata e pettinata come lei, ha reso in maniera impeccabile la figura di una donna mitizzata e sregolata, forte e affettuosa, intelligente come poche altre. Ha saputo racchiudere nella sua interpretazione - forse la migliore della sua carriera - la carnalitÃƒÂ , la dolcezza e la fragilitÃƒÂ  di una donna ambiziosa e innamorata della vita, che la malasorte ha strappato alla vita troppo precocemente.\nFatti realmente raccontati da Moana nei suoi diari e nei suoi scritti si alternano a momenti di fiction funzionali, anche se talvolta prolissi, al racconto di un'esistenza ricca di incontri e di momenti anche molto difficili. Tanti gli uomini misteriosi, belli e ricchi, potenti e malviventi che hanno amato Moana e che lei ha amato nella sua vita; una donna sentimentale e romantica che amava farsi guardare e vedere sÃƒÂ¨ stessa attraverso gli occhi degli altri, ma anche amante del potere e del denaro. Quello che si fa di Moana Pozzi in Moana non ÃƒÂ¨ un ritratto che la santifica, che la giustifica o che la mitizza, non ÃƒÂ¨ neanche una docu-fiction quanto piÃƒÂ¹ una favola hard(rock) che si allontana dalla realtÃƒÂ  mimetica per raccontare un'epoca di grandi cambiamenti per l'Italia.\nAd accompagnare il racconto della vita della celebre pornostar, la piÃƒÂ¹ famosa e rivoluzionaria d'Italia, il rock punk anni '80 dei Sex Pistols e degli Specials, anarchico e di rottura nei confronti del sistema, che regala al film una musicalitÃƒÂ  intensa e, nelle scene clou, avvolge lo spettatore nella voluttÃƒÂ  sfacciata di Moana.\nViolante Placido ÃƒÂ¨ una Venere kitsch nella biopic Moana (2009) Regista di fiction di successo come la prima stagione di Gente di mare e Joe Petrosino con Beppe Fiorello, Alfredo Peyretti confeziona una favola pulp con protagonista la regina del porno italiano ricostruendo intorno a Violante Placido il mondo glamour e ovattato di Moana, le sue case elegantissime e costosissime, gli oggetti di arredamento, l'intimo, il suo inconfondibile cappotto rosso, il vestito di paillettes, l'acconciatura abboccolata, il rossetto rosso fuoco, la sua vasca da bagno piena di latte, insomma capricci e bizzarrie di una donna sfrontata ma con eleganza, bella e trasgressiva ma dotata di una rara classe. Intense le scene d'amore, forte il linguaggio usato, ma chi deciderÃƒÂ  di entrare nel mondo di Moana Pozzi attraverso la visione di Moana non si scandalizzerÃƒÂ  di certo per questo.\n\nSCREENSHOTS\n &lt;a href=&quot;\nhttp://www.uptiki.com/images/kznx79jyeg6n3nenttwb.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.uptiki.com/images/kznx79jyeg6n3nenttwb.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.uptiki.com/images/ugobuto1hc397b4dixj.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.uptiki.com/images/ugobuto1hc397b4dixj.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.uptiki.com/images/7a2fxrs1i01x72cen8s.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.uptiki.com/images/7a2fxrs1i01x72cen8s.png&lt;/a&gt;\n\nANALISI\n\n\n[ Info sul file ]\n\nNome: Moana.2009.Prima.Parte.iTALiAN.HDTV.XviD-SiD.avi\nData: 2/12/2009 15:39:22\nDimensione: 735,256,576 bytes (701.195 MB)\n\n[ Info generiche ]\n\nDurata: 01:38:21 (5900.6 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: 624 x 352\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 624 x 352\nFrame aspect ratio: 39:22 = 1.772727 (~16:9)\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 39:22 = 1.772727 (~16:9)\nFramerate: 25 fps\nFrames totali: 147515\nStream size: 604,246,658 bytes\nBitrate: 819.234190 kbps\nQf: 0.149190\nKey frames: 1682 (0; 300; 600; 900; 1200; ... 147473)\nNull frames: 0\nMin key int: 1\nMax key int: 300\nKey int medio: 87.702140\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 164.744 kbps VBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 245858\nStream size: 121,509,624 bytes\nPreload: 504 ms\nMax A/V diff: 520 ms\nTipo: MPEG-1 Layer III\nEncoder: LAME3.90. (Made with BeSweet v1.5b30)\nChunk-aligned: SÃƒÂ¬\nEmphasis: none\nMode: joint stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b1393p\nUser data: XviD0050\nPacked bitstream: SÃƒÂ¬ (*)\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\nAvvertenza: Se vuoi un rapporto piÃƒÂ¹ completo e preciso clicca su &quot;Analisi DRF&quot;\n\nRapporto generato da AVInaptic (18-11-2007) in data  2 dic 2009, h 16:59:50\n\n\n\nPer altre news vieni a trovarci su www.italia-news.org\n","torrent":{"xt":"urn:btih:e32b29f2086fa842d4dcba4a09b1486596b9d215","amp;dn":"Moana+2009+Prima+Parte+iTALiAN+HDTV+XviD-SiD+%5BIN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32b29f2086fa842d4dcba4a09b1486596b9d215","infoHashBuffer":{"type":"Buffer","data":[227,43,41,242,8,111,168,66,212,220,186,74,9,177,72,101,150,185,210,21]},"announce":[],"urlList":[]}}