{"title":"National Lampoon 1964 High School Yearbook Parody","uid":7738068,"size":224463599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e45c0b53bd1b81da74361c25839266a8d1a31ed9&amp;dn=National+Lampoon+1964+High+School+Yearbook+Parody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1350537319,"description":"National Lampoon 1964 High School Yearbook Parody is an American humor book that was first published in 1973.  It was a spin-off from National Lampoon magazine.  The book was a parody of a high school yearbook from the early 1960s.  It was edited by P. J. O'Rourke and Doug Kenney and art directed by David Kaestle. Much of the writing was by P. J. O'Rourke and Doug Kenney.  The &quot;literary magazine&quot; was written by Sean Kelly, the sports page was by Christopher Cerf and the Principal's Letter and the &quot;In Memorium&quot; piece were both by Ed Subitzky.\n\nThe parody is closely based on the Devilbiss High School (Toledo, OH) yearbook - the Pot 'o Gold.  O'Rourke attended DHS for a couple of years in the early 60s.  The swim team photo caption contains the names of a number of O'Rourke's friends from Devilbiss.  Like many great parodies, the Lampoon yearbook is only a degree or two from the original.\n\nThe publication also included a copy of the school newspaper, a basketball program, a report card, a diploma, detention slips and a fake ID.  According to apparent inscriptions, the book belonged to &quot;Larry Kroger&quot;, class of '64.  The character Larry Kroger went on to become the college freshman protagonist of the comedy movie National Lampoon's Animal House, released in 1978.  The character &quot;Mandy Pepperidge&quot; also makes her first appearance in the Yearbook and reappears in the film.\n\nThe book, as it was originally published, appeared to be a genuine yearbook from &quot;C. Estes Kefauver High School&quot; in &quot;Dacron, Ohio&quot; (a reference to the city Akron, Ohio, and to the cheap polyester fabric Dacron.)\n\nFive years after the Newspaper parody, in 1978, the National Lampoon published the National Lampoon Sunday Newspaper Parody, a fake Sunday newspaper which also claimed to originate in &quot;Dacron, Ohio&quot; but was contemporary, being dated Sunday February 12, 1978.  If anyone sees this online somewheres, please let me know.\n\nEnjoy, and please seed.\n\n","torrent":{"xt":"urn:btih:e45c0b53bd1b81da74361c25839266a8d1a31ed9","amp;dn":"National+Lampoon+1964+High+School+Yearbook+Parody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e45c0b53bd1b81da74361c25839266a8d1a31ed9","infoHashBuffer":{"type":"Buffer","data":[228,92,11,83,189,27,129,218,116,54,28,37,131,146,102,168,209,163,30,217]},"announce":[],"urlList":[]}}