{"title":"Polio Wars Sister Kenny and the Golden Age of American Medicine ","uid":9388729,"size":3728754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4612adf6090c831b1c170b3dfe800e6152cd208&amp;dn=Polio+Wars+Sister+Kenny+and+the+Golden+Age+of+American+Medicine+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"420weedman","files":6,"time":1387844371,"description":"During World War II, polio epidemics in the United States were viewed as the country's &quot;other war at home&quot;: they could be neither predicted nor contained, and paralyzed patients faced disability in a world unfriendly to the disabled. These realities were exacerbated by the medical community's enforced orthodoxy in treating the disease, treatments that generally consisted of ineffective therapies. \nThe Kenny method, initially dismissed by the US medical establishment, gained overwhelming support over the ensuing decade, including the endorsement of the National Foundation for Infantile Paralysis (today's March of Dimes), America's largest disease philanthropy. By 1952, a Gallup Poll identified Sister Kenny as most admired woman in America, and she went on to serve as an expert witness at Congressional hearings on scientific research, a foundation director, and the subject of a Hollywood film. Kenny breached professional and social mores, crafting a public persona that blended Florence Nightingale and Marie Curie. \nBy the 1980s, following the discovery of the Salk and Sabin vaccines and the March of Dimes' withdrawal from polio research, most Americans had forgotten polio, its therapies, and Sister Kenny. In examining this historical arc and the public's process of forgetting, Naomi Rogers presents Kenny as someone worth remembering. Polio Wars recalls both the passion and the practices of clinical care and explores them in their own terms.","torrent":{"xt":"urn:btih:e4612adf6090c831b1c170b3dfe800e6152cd208","amp;dn":"Polio+Wars+Sister+Kenny+and+the+Golden+Age+of+American+Medicine+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4612adf6090c831b1c170b3dfe800e6152cd208","infoHashBuffer":{"type":"Buffer","data":[228,97,42,223,96,144,200,49,177,193,112,179,223,232,0,230,21,44,210,8]},"announce":[],"urlList":[]}}