{"title":"Faces - Five Guys Walk Into A Bar [320k MP3]","uid":7302595,"size":736714241,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4918244f602bfefe1ddb663ad37a144ea4d684e&amp;dn=Faces+-+Five+Guys+Walk+Into+A+Bar+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"smbdownload","files":-1,"time":1338078463,"description":"Five Guys Walk into a Bar... is a four-disc retrospective of the British rock group Faces released in 2004, collecting sixty-seven tracks from among the group's four studio albums, assorted single A- and B-sides, BBC sessions, rehearsal tapes and one track from a promotional flexi-disc, &quot;Dishevelment Blues,&quot; which was never actually intended for release.\n\nEight of ten tracks from 1973's Ooh La La appear, as do eight of nine from 1971's A Nod Is as Good as a Wink...To a Blind Horse, five of nine from 1971's Long Player (with an additional two in alternate versions) and three of ten from 1970's First Step (Small Faces) (with one extra track appearing in a- and/or B-side that had never appeared before on compact disc appeared on the set, such as the single version of their take on Paul McCartney's &quot;Maybe I'm Amazed&quot; and the dobro-driven B-side &quot;Skewiff (Mend the Fuse).&quot;\n\nMany tracks from BBC sessions appear throughout, including takes on Rod Stewart's own &quot;Maggie May&quot; and &quot;Gasoline Alley,&quot; the latter as part of a medley including Faces' own &quot;Around the Plynth.&quot; From rehearsal tapes come Faces' earliest recordings from the summer of 1969, including covers of Big Bill Broonzy's &quot;I Feel So Good&quot; (featuring Stewart on guitar) and Howlin' Wolf's &quot;Evil.&quot;\n\nThe set was compiled by the group's keyboardist, Ian McLagan, who had previously compiled 1999's Good Boys... When They're Asleep.\n\nFive Guys Walk into a Bar... has received a largely positive response from critics since its release. Stephen Thomas Erlewine of Allmusic praised the box set as the best of its type: &quot;There has never been a better box set than the Faces' Five Guys Walk into a Bar.... There has never been a box that captures an artist so perfectly, nor has a box set taken greater advantage of unreleased and rare material, to the point where it seems as essential and vital as the released recordings.\n\nTrack Listing [320k MP3]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Five_Guys_Walk_into_a_Bar...&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Five_Guys_Walk_into_a_Bar...&lt;/a&gt;","torrent":{"xt":"urn:btih:e4918244f602bfefe1ddb663ad37a144ea4d684e","amp;dn":"Faces+-+Five+Guys+Walk+Into+A+Bar+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4918244f602bfefe1ddb663ad37a144ea4d684e","infoHashBuffer":{"type":"Buffer","data":[228,145,130,68,246,2,191,239,225,221,182,99,173,55,161,68,234,77,104,78]},"announce":[],"urlList":[]}}