{"title":"Dont Starve v1 88179-TE","uid":9093562,"size":214176532,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e52c244dd99be356340e984ab3f639e4f9cad557&amp;dn=Dont+Starve+v1+88179-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382644257,"description":"TE 2013 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: Dont Starve v1.88179 (c) 2013 Klei Entertainment\nDate: 10/23/2013\n\nCracked By: Twisted EndZ\nRelease Type: Other: RETAIL/DRM-FREE\nRELEASE NOTES\n\nAn uncompromising wilderness survival game full of science and magic.\n\nPlay as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants if he ever hopes to escape and find his way back home. Enter a strange and unexplored world full of strange\ncreatures, dangers, and surprises. Gather resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land.\n\nWhats New in All's Well that Maxwell Build 88179?:\n\n\nADDITION:\n\nCharacters:\nMaxwell has his player power.\n\nCreatures:\nMosquito drops loot.\n\nItems:\nThe &quot;Totally Normal Tree&quot; now spawns in the world.\n\nScreens:\nA &quot;Top Mods&quot; section has been added to the mods screen. It doesn't function yet, but it will show the top 5 most popular mods of the day.\n\nTWEAKS/CHANGES:\n\nCreatures:\nDepths Worms attacks now ramp up over an increased time period.\nSpitter Spiders had their range and projectile speed decreased.\n\nItems:\nThe Miner Hat can be refueled.\nWickerbottom's books have descriptions.\nTooth Trap and Bee Mines are now &quot;deployable&quot; objects. They can no longer be packed too closely by dropping them.\n\nGeneral:\nRearranged some of the front end.\nAdded FX to mining animation.\nAdded FX to book reading animation.\nImproved feedback when taking damage over time.\nAdded some additional music to the ruins.\nMade some improvements to the text widget.\nImproved console screen focus.\nImproved controller controls and prompts for teleportato.\nAdded additional art to the credits screen.\n\nControls:\nAction button will now harvest farms, crockpots and drying racks.\n\nBUG FIXES:\n\nCreatures:\nBefriending music will now play for bunnymen and chess creatures.\nBatalisks have been given a strong stomach.\nThe Ancient Guardian will drop his horn again.\nShadow Hands will appear again.\nThe Pig King will no longer throw gold on top of himself and surrounding obelisks.\nChester no longer uses the old death effect.\nFixed a bug that was preventing pathfinding from working with walls.\nChess monsters will now retaliate when being attacked by other chess monsters that are following the player.\nMacTusk's icehounds will no longer respawn instantly under the right conditions.\nYou can no longer click-spam pigs to force feed them and gain extra poop.\nFix for bee/mosquito sounds so they don't accumulate at the world origin.\n\nItems:\nThe Lazy Forager's amulet will now also pick up any animals that are caught in a trap when the trap is collected.\nPumpkin lanterns no longer bounce when placed.\nSnurtle Shell Armour will provide protection again.\nPicking a mushroom as day phase changes will no longer cause the mushroom to regrow immediately.\nBreaking down a Cook Pot with a completed food item will cause the item to drop in the rubble.\nTents and Sleeping Rolls now properly restore body heat.\nThe Glow Berry is now tradeable.\nTree Stumps can now be burnt.\nCreatures can no longer walk through walls that have been destroyed and rebuilt.\nFixed some issues with save/load states on Light Plants.\nHeat Rocks now emit light if they are heated up outside your inventory.\nItems do not rot on death in caves.\nWalls no longer sleep - this should help with some caged animals escaping their pens.\nFixed some issues with the Forager Amulet duplicating traps.\nBoomerang now works against the Tentapillar.\n\nGeneral:\nLight effects on nightmare lights can now be clicked through.\nRearranged some items in set-pieces to allow for proper path finding.\nPlayers will now react to being hit by bees and mosquitoes.\nMusic will play during credits on the standalone version.\nFixed some issues with resurrecting.\nWater is no longer culled while still on screen.\nFixed some issues with the player appearing at the wrong location when changing cave levels.\nActions are now canceled when you change your tool mid-action.\nMaxwell's Shadow no longer lingers in the world during the intro.\nShadows now rotate correctly.\nCleaned up some TaskInTime calls to prevent memory growth.\nMade Cave Gen a bit more consistent in an effort to remove.\nMaxWorldGen crashes.\nThe book reading FX is now canceled if the action is.\nThe HUD will now hide during the tent's fade out.\nShift clicking now works properly between backpacks and player inventory.\nRemoved double-click sound when clicking build recipe.\nFixed beesplosion when trying to stuff bees into a full container.\nThe confirmation window will now close if you press &quot;no&quot; when entering Maxwell's door.\nFixed a crash that happened during the loading of some adventure levels.\nAdventure World (two worlds) will no longer crash on generation.\nFixed a bug where you could get stuck in a state by pressing the map button while trying to sleep.\n\nControls:\nYou can now add placeable items to a fire while using a controller.\nYou can now press and hold to hammer.\nYou can now navigate the controls screen with a controller.\nFix for issues with using keyboard controlled crafting and mouse walking.\nFixed items disappearing if you tap pickup very quickly.\n&quot;Useable&quot; items like the Telelocator Staff and Bush Hat can now be used when playing with a controller.\n\nCharacters:\nLucy the Axe will no longer continue to talk after finishing adventure mode with Woodie.\nFixed some layering issues on the final level of adventure mode.\nCamera doesn't shake when doing work as Woodie.\nWoodie the Werebeaver now uses seperate attack and action buttons.\nPlayer character will not emit frost breath when facing upwards.\nTuned locomotor to prevent jittering at higher player speeds.\n\nMODDING:\n\nMod System:\nMods which overwrite core game assets have usually crashed the game unless the game is restarted once.\nNow a mod can specify this to force the game to restart when the mod is loaded.\nMods can now specify an arbitrary save slot instead of using slots 1-4. This is useful for 'game mode' mods which don't sit nicely on top of an existing Don't Starve save.\n\nAssets:\nRoad textures can now be overwritten by a mod\n\nWorld Gen:\nCan now specify the range of background nodes to generate for each node in the level definition.\nTasks with blockers can now specify what their &quot;blank&quot; nodes are in case you don't want it to be ocean.\nTasks have a little more control over internal connectedness by specifying a custom cross-link factor for rooms, and whether or not the rooms are generated in a loop.\n\nDevelopment:\nAddGameDebugKey and AddGlobalDebugKey are now globalfunctions, so mods can utilise them for testing.\nBetter logging when animations and builds are missing Sublime Text, a great script editor, is now packaged with the mod tools in Steam! Use this when working with Lua files for syntax highlighting, multi-file search, and other handy\nediting tricks.\n\nSystem Requirements:\n\nOS: Windows XP/Vista/Windows 7/Windows 8\nProcessor: 1.7+ GHz or better\nMemory: 1+ gigs of RAM GB RAM\nGraphics: Radeon HD5450 or better; 256 MB or higher\nDirectX: 9.0c\nHard Drive: 500 MB HD space\nSound: 100% DirectX 9.0c compatible sound card and drivers\n\nFor More Info Visit:\n &lt;a href=&quot;\nhttp://www.dontstarvegame.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dontstarvegame.com/&lt;/a&gt;\n\n\n\nIMPORTANT NOTICE:\n\nAs of 09/14/2013 ALL TE RAR archives will now be using theRAR5\nstandard. Please make sure to update to the latest version of\nWinrar (at least Winrar v5.0) so you can extract the contents of\nthe *.001, *.002 etc... archives within the zip files. The\nupdate is free, there is no reason not to update\n\n\nINSTALLATION NOTES\n\nEXTRACT WITH WIN RAR 5\nInstall Setup.exe. No crack is needed, this is RETAIL and\nDRM-FREE with the latest update applied.\n\nIf upgrading from our previous versions, its recommended to uninstall the previous version before you install this one.\n\nRemember after enjoying this game to head over to www.dontstarvegame.com and buy yourself a copy.\n\nThats it! Enjoy\n\nT E 2 0 1 3\n\nascii\nby mx\n\nDon't Hate The Hacker, Hate The Code ","torrent":{"xt":"urn:btih:e52c244dd99be356340e984ab3f639e4f9cad557","amp;dn":"Dont+Starve+v1+88179-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e52c244dd99be356340e984ab3f639e4f9cad557","infoHashBuffer":{"type":"Buffer","data":[229,44,36,77,217,155,227,86,52,14,152,74,179,246,57,228,249,202,213,87]},"announce":[],"urlList":[]}}