{"title":"Batman v Superman 2016 FANEDIT No-Lex-Edit 1080p 6ch x265 HEVC","uid":15908274,"size":2264050444,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e5551100230ff81a18874a12a2f8eb3a55b8b4c1&amp;dn=Batman+v+Superman+2016+FANEDIT+No-Lex-Edit+1080p+6ch+x265+HEVC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"bsg4you","files":3,"time":1475072377,"description":"Batman.v.Superman.Dawn.Of.Justice.2016.FANEDIT.No-Lex-Edit.1080p.6ch.x265.HEVC.mkv\r\n\r\nPLEASE DO NOT DOWNLOAD WITHOUT READING THIS DESCRIPTION OR THE NFO\r\n\r\nTHIS IS NOT THE COMPLETE MOVIE\r\nTHIS IS A FANEDIT WITH MOST SHOTS AND DIALOG BY LEX LUTHOR REMOVED\r\nEVERY EDIT IS NOTED AS A CHAPTER AND THEY ARE LISTED IN THIS NFO\r\n\r\nTHIS IS THE X265-HEVC VIDEO ENCODE WITH HE-AAC 5.1 AUDIO\r\nTHERE IS ALSO AN X264-AVC/LC-AAC ENCODE AVAILABLE THAT IS 38% BIGGER\r\n\r\nBatman v Superman: Dawn of Justice (2016) FANEDIT No-Lex-Edit\r\nvideo: 1920x800 HEVC CRF=22.75 ~1647kbps preset=medium 8-bit\r\naudio: HE-AAC 5.1 256kbps surround sound\r\ncustom named chapters\r\nsource: Ultimate Edition Blu-Ray\r\nblu-ray: 3h02m33s\r\nfanedit: 2h38m23s - 24m10s REMOVED - 2,263,983,000bytes\r\n  http://www.imdb.com/title/tt2975590/  \r\n\r\nThis is a FANDIT of Batman v Superman: Dawn of Justice Ultimate Edition Blu-Ray with most shots and dialog from Lex Luthor removed. The goal is to experience BvS without the very different interpretation of Lex Luthor presented by Jesse Eisenberg, Zack Snyder, and the writing team of Chris Terrio and David S. Goyer. In this way, the story of Batman, Superman, and Wonder Woman meeting, fighting, and uniting can be viewed on their own.\r\n\r\nPlease note that this is a labor of love since I'm a huge fan of DC and Gotham comics in particular. While I was very familiar with Zach Snyder's directing style and had read about the many controversies regarding BvS, I was constantly taken out of the movie experience by this version of Lex Luthor. While watching BvS the first time, I kept thinking &quot;what would this movie be like without Lex?&quot; Thus, the No-Lex-Edit was born.\r\n\r\nThere were no named versions of the chapters from the Ultimate Edition Blu-Ray so custom named chapters were created for all the Blu-Ray chapter points. Also, chapters with descriptions were included for every edit that removed some material. A complete list of the chapters is included at the end of the nfo file. Note, some of the chapters overlap or occur very closely together.\r\n\r\nThe chapter format is as follows:\r\n* ChXY.0 - the .0 chapters are the original chapter points from the Blu-Ray\r\n* ChXY.Z - the .Z equals .1, .2, etc and is an edit point after that original Blu-Ray chapter ChXY.0\r\n* every .Z (.1, .2, etc) chapter has a description that starts with EDIT\r\n* please see the nfo for a chapter naming example and a complete list of the chapters\r\n\r\nBy using these EDIT chapters, you can jump to a time in the FANEDIT with the edits and see and hear how the edit flows. If you wonder what was removed, just look at the chapters in the nfo file or with MediaInfo or with your video player (e.g. PotPlayer, VLC, etc).\r\n\r\nPlease check out other DC Comics, Gotham (TV series), FANEDITS, documentaries, Rifftrax, MST3K, Battlestar Galactica, Star Trek, and more at:\r\n  https://thepiratebay.org/user/bsg4you/  \r\nand leave any corrections, criticism, comments and requests.\r\n\r\nThanks, bsg4you","torrent":{"xt":"urn:btih:e5551100230ff81a18874a12a2f8eb3a55b8b4c1","amp;dn":"Batman+v+Superman+2016+FANEDIT+No-Lex-Edit+1080p+6ch+x265+HEVC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5551100230ff81a18874a12a2f8eb3a55b8b4c1","infoHashBuffer":{"type":"Buffer","data":[229,85,17,0,35,15,248,26,24,135,74,18,162,248,235,58,85,184,180,193]},"announce":[],"urlList":[]}}