{"title":"Johnny Hodges - 1994 - Passion Flower FLAC","uid":8799922,"size":351326705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5802c78f7e73bf7aaac7df135554c225b424d3e&amp;dn=Johnny+Hodges+-+1994+-+Passion+Flower+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"eika256","files":-1,"time":1376173633,"description":"Johnny Hodges - 1994 - Passion Flower\n\nPossessor of the most beautiful tone ever heard in jazz, altoist Johnny Hodges formed his style early on and had little reason to change it through the decades. Although he could stomp with the best swing players and was masterful on the blues, Hodges' luscious playing on ballads has never been topped. He played drums and piano early on before switching to soprano sax when he was 14. Hodges was taught and inspired by Sidney Bechet, although he soon used alto as his main ax; he would regretfully drop soprano altogether after 1940. His early experiences included playing with Lloyd Scott, Chick Webb, Luckey Roberts, and Willie &quot;The Lion&quot; Smith (1924), and he also had the opportunity to work with Bechet. However, Johnny Hodges' real career began in 1928 when he joined Duke Ellington's orchestra. He quickly became one of the most important solo stars in the band and a real pacesetter on alto; Benny Carter was his only close competition in the 1930s. Hodges was featured on a countless number of performances with Ellington and also had many chances to lead recording dates with Ellington's sidemen. Whether it was &quot;Things Ain't What They Used to Be,&quot; &quot;Come Sunday,&quot; or &quot;Passion Flower,&quot; Hodges was an indispensable member of Ellington's orchestra in the 1930s and '40s. It was therefore a shock, in 1951, when he decided to leave Duke Ellington and lead a band of his own. Hodges had a quick hit in &quot;Castle Rock&quot; (which ironically showcased Al Sears' tenor and had no real contribution by the altoist), but his combo ended up struggling and breaking up in 1955. Hodges' return to Duke Ellington was a joyous occasion and he never really left again. In the 1960s, Hodges teamed up with organist Wild Bill Davis on some sessions, leading to Davis joining Ellington for a time in 1969. Johnny Hodges, whose unchanging style always managed to sound fresh, was still with Duke Ellington when he suddenly died in 1970. (AllMusic)\n\nTrack list:\n01 - Passion Flower (B Strayhorn)\n02 - St. Louis Blues (WC Handy)\n03 - Loveless Love (WC Handy)\n04 - Squeeze Me (Williams, Waller)\n05 - Theodora (Taylor)\n06 - Cambridge Blues (J Hodges)\n07 - Sweet Lorraine (Parish, Burwell)\n08 - Johnny Come Lately (B Strayhorn)\n09 - Warm Valley (D Ellington)\n10 - Segdoh (J Hodges)\n11 - Bouquet of Roses (J Hodges, M Ellington)\n12 - Beale Street Blues (WC Handy)\n13 - Snibor (B Strayhorn)\n14 - Brute's Roots (J Hodges)\n15 - Big Shoe (Hamilton)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:e5802c78f7e73bf7aaac7df135554c225b424d3e","amp;dn":"Johnny+Hodges+-+1994+-+Passion+Flower+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5802c78f7e73bf7aaac7df135554c225b424d3e","infoHashBuffer":{"type":"Buffer","data":[229,128,44,120,247,231,59,247,170,172,125,241,53,85,76,34,91,66,77,62]},"announce":[],"urlList":[]}}