{"title":"BUDDY GUY - Can't Quit The Blues - DVD - (Dec 2006)","uid":4175807,"size":7356452203,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e5e0347675cdf58fadb86bc7ccbf03ea8c0ff775&amp;dn=BUDDY+GUY+-+Can%5C%27t+Quit+The+Blues+-+DVD+-+%28Dec+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"xkm","files":66,"time":1210115966,"description":"&quot;Can&amp;#039;t Quit The Blues&quot; is the first-ever career-spanning box set of this electrifying Rock and Roll Hall Of Fame guitar pioneer. \n\nReleased in December 2006 in celebration of Buddy&amp;#039;s 70th birthday, this box set includes 3 CDs with 6 previously-unreleased tracks, covering the entirety of Buddy&amp;#039;s 50 years in music, as well as this DVD. \n\n(The 3 CDs in FLAC can be found here -) .\n\n\nThis DVD contains eleven performances from different stages of Guy&amp;#039;s career.\n \nThe first two are from Montreux in 1974 with Junior Wells, Pinetop Perkins and Bill Wyman on Bass. This is a must because this set is not longer available in the States. Junior also plays his chromatic harp, in the style of Little Walter, on &quot;Ten Years Ago&quot; and they also do a slow version of Junior&amp;#039;s &quot;Hoodoo Man Blues&quot;. It is fantastic. \n\n&quot;Messin&amp;#039; with the Kid&quot; and &quot;Come On This House&quot; are also gems from Montreux in 1978. It is great and features &quot;Fast Fingers&quot; Jimmy Dawkins on second Guitar (his only ever early video clip as far as I know!\n\n&quot;Sweet Little Angel&quot;, a Robert Nighthawk hit and B.B. King tune recorded many times (B.B.&amp;#039;s most famous version: &quot;Live At The Regal&quot;)has been done many times by Buddy too. This one is done at Montreux in 1992. I like his version on the &quot;Real Deal&quot; DVD with the SNL Band. This however, is also a strong version.\n\n&quot;Damn Right, I Got The Blues&quot; is from Buddy&amp;#039;s comeback period commencing in the early 1990s when there was a short Blues Revival period following the death of SRV. We are still at Montreux in 1998 and the band cooks for this performance. It is great.\n\n&quot;Drowning On Dry Land&quot;, &quot;Tramp&quot;,and &quot;Mustang Sally&quot; are from Montreux again in 2002. It is important to note that these are NOT the performances issued last year with the Carlos Santana package. These are good, but in all honesty, the band on the Santana set is much better, for one thing the keyboardist from Otis Rush&amp;#039;s band is magnificent. Buddy does the Buddy thing at the end and sings without a mike when it fails.\n\nThe final two performances are acoustic, something he has added to his shows since the middle 1990s. The performance of &quot;What I&amp;#039;d Say&quot;, since Ray Charles has died, is particularly interesting. The solo acoustic &quot;Louise McGhee&quot; from 2004 closes the set.\n\nThe 75 minute documentary with this DVD is also a must to see. OK, most of it we have heard many times over the years on other releases, about going to Chicago (he remembers the day in September), and meeting Muddy Waters who fed him and so on. This is all well done and presented and you can watch this many times. The snippets of performances are what really shines here. &quot;Red House&quot; with Joe Satriani is cool and the clips of him (I think it&amp;#039;s at Antones!!! In Dallas!) of &quot;The Things I Used to Do&quot; and others we wish they would release that whole set!!!!\nThe only complete song in the documentary is in the intro &quot;Mary had A Little Lamb&quot;, where Buddy shows off his one-handed guitar-playing skill !  It&amp;#039;s amazing, as always !\n\nInteresting final note: this DVD like so many Blues DVDs in the last 5 years or so (AFBF 3 Vols; Albert King in Sweden and more)was produced by Janie Hendrix and Experience Hendrix Productions. Janie Hendrix is not Jimi&amp;#039;s daughter, if you are interested. Jimi&amp;#039;s father Al remarried and Janie was his stepdaughter from his second marriage. \n\nAlso included is a 40-page color book with notes by Anthony DeCurtis, and rare photos of Buddy throughout his career.\n\nSee some reviews at Amazon - http://www.amazon.com/Cant-Quit-Blues-Buddy-Guy/dp/B000IU3YMS\n\nAnd visit Buddy&amp;#039;s website - http://www.buddyguy.net/\n\nEnjoy!  And please seed!\n\n","torrent":{"xt":"urn:btih:e5e0347675cdf58fadb86bc7ccbf03ea8c0ff775","amp;dn":"BUDDY+GUY+-+Can%5C%27t+Quit+The+Blues+-+DVD+-+%28Dec+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5e0347675cdf58fadb86bc7ccbf03ea8c0ff775","infoHashBuffer":{"type":"Buffer","data":[229,224,52,118,117,205,245,143,173,184,107,199,204,191,3,234,140,15,247,117]},"announce":[],"urlList":[]}}