{"title":"Batman: Year One (1987) (Digital) (TheHand-Empire)","uid":9876403,"size":156035392,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e6ff2894cb7f2d5430086faa17d8d5bfb0e4a923&amp;dn=Batman%3A+Year+One+%281987%29+%28Digital%29+%28TheHand-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1396482344,"description":"For more information on the story, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Batman:_Year_One&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Batman:_Year_One&lt;/a&gt;\n\nAfter Crisis on Infinite Earths, while DC was rebooting the continuity of many of their heroes, Frank Miller's The Dark Knight Returns set about revitalizing the comics industry while simultaneously turning it on its head. His next work, Batman: Year One, was equally as influential and as highly praised if not more so. This time, Miller told the tale of Batman's first year on the streets of Gotham, as well as the pivotal role played by a then-Lieutenant James Gordon in cleaning up the criminal elements of the city. The relationship between both men, along with Batman's trial-by-error and Gordon's fiery sense of honor, are beautifully expressed here in what still remains Miller's most elegant and accessible work. David Mazzuchelli's stunning art is also on display - his crisp, clear lines, astonishing facial work and economy of paneling and action make this a true tour de force. Together, both men combined to create a masterpiece that is absolutely required reading for any Bat-fan to this day (and often the best place to start reading Batman comics altogether).\n\nThis is the one-volume edition that combines all four original issues, and has not yet been torrented outside the hitlists. The separate issues were in a pack by gesserit along with Miller's other Batman works. This awesome digital edition is by TheHand-Empire and really shows off Mazzuchelli's tremendous artwork. Thanks to the scanners for their efforts, please seed and enjoy! :-)","torrent":{"xt":"urn:btih:e6ff2894cb7f2d5430086faa17d8d5bfb0e4a923","amp;dn":"Batman%3A+Year+One+%281987%29+%28Digital%29+%28TheHand-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6ff2894cb7f2d5430086faa17d8d5bfb0e4a923","infoHashBuffer":{"type":"Buffer","data":[230,255,40,148,203,127,45,84,48,8,111,170,23,216,213,191,176,228,169,35]},"announce":[],"urlList":[]}}