{"title":"De-Fenders - Drag Beat 1964 [instrumenal Surf Rock]","uid":4863432,"size":26783360,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e700bf8c60523c782181d7b7f04514538909f240&amp;dn=De-Fenders+-+Drag+Beat+1964+%5Binstrumenal+Surf+Rock%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Iron_Horse","files":14,"time":1240361378,"description":"De-Fenders - Drag Beat 1964 [instrumenal Surf Rock]\nLp To Mp3 128 mbit/s\nIncluded: LP Front Cover and this Info\n\nArmed with a solid cache of seminal West Coast studio musicians, Del-Fi Records owner Bob Keane issued the dozen selections on Drag Beat under the nom de plume of the De-Fenders. Coupling the music with copious drag racing effects, the ersatz band churn out a batch of originals and an apropos cover of &quot;Little Deuce Coupe.&quot; Although the melody is loosely based on the Beach Boys' classic, many of the same instrumentalists used in this project also worked on the backing track to the well-known hit version. The opener &quot;Deuces Wild&quot; grinds steadily boasting a full-bodied rousing drive around a tune similar to that of Dale Hawkins' slightly syncopated Crescent City groove &quot;Suzy Q.&quot; Jay Migliori (sax) and Plas Johnson (sax) provide sizable brass leads accompanying Michel Rubini's (keyboards) freewheelin' Hammond B-3 organ. A parody of Harry Belafonte's &quot;Day-O&quot; call-and-response introduction has been adapted to the mid-tempo &quot;Taco Wagon,&quot; bearing the unmistakable sound of Tommy Tedesco (guitar) supplying the swinging twang. The bluesy &quot;Movin' and Groovin'&quot; can be likened to Lightnin' Hopkins' &quot;Smokestack Lightning&quot; as either Migliori (sax) or Johnson (sax) trade impressive licks while Tedesco unleashes some clean soulful picking, while the influence of Chuck Berry can be heard all over &quot;Loose Nuts.&quot; Other interesting inclusions are the distinct R&amp;B vibe propelling &quot;Wheelin' Home&quot; and the edgy &quot;Road Runner,&quot; a song that shouldn't be confused with the Junior Walker &amp; the All-Stars or Bo Diddley numbers of the same name. ~ Lindsay Planer, All Music Guide\n\nTrack list;\n01-Deuces Wild\n02-Taco Wagon\n03-Movin' And Groovin'\n04-Skin Diver\n05-Loose Nuts\n06-Little Deuce Coupe\n07-Drag Beat\n08-Wheelin' Home\n09-Four Banger\n10-Tequila Joe","torrent":{"xt":"urn:btih:e700bf8c60523c782181d7b7f04514538909f240","amp;dn":"De-Fenders+-+Drag+Beat+1964+%5Binstrumenal+Surf+Rock%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e700bf8c60523c782181d7b7f04514538909f240","infoHashBuffer":{"type":"Buffer","data":[231,0,191,140,96,82,60,120,33,129,215,183,240,69,20,83,137,9,242,64]},"announce":[],"urlList":[]}}