{"title":"Sexually Broken--Hot half Asian MILF bound, skull fucked  CeCe S","uid":7678913,"size":1013684939,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e7029845f6a909c2bde86e65e0455f73c8ab66a5&amp;dn=Sexually+Broken--Hot+half+Asian+MILF+bound%2C+skull+fucked++CeCe+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"merzedes","files":-1,"time":1348770141,"description":"Hot half Asian MILF is bound against a beam, brutally skull fucked, made to cum! | CeCe Stone\n\nSeptember 26, 2012\n\n\nMP4 only.\n\n\nWelcome CeCe Stone to Sexually Broken. This half Asian hot MILF has a deep throat and very sensitive pussy. She loves being manhandled and controlled. \n\nWe quickly bind CeCe to the beam and waste no time making her cum. We make her cum in less then 30 seconds, and from that point on she is very easy to control. Her body surrendered immediately, her brain flashed with endorphines, CeCe is now physically and mentally helpless. \n\nWe put her into a &quot;catchers&quot; position with a nice neck rope holding her straight against the back of the beam. Her head has nowhere to go as we stick our cock all the way down her throat. Over and over we brutally attack CeCe's throat, deep and hard. Breath play at it's best, CeCe breathes when we want her to, the cock sucking sends her deeper into subspace. \n\nWe clamp CeCe's huge nipples and pull them out painfully. A vibrator is used and within seconds CeCe is cumming again. We make her cum over and over, she uses the neck rope to try and choke herself out but the body doesn't work like that, but she does manage to make her orgasms even stronger. She screams against the ropes, she strugglse to get free but we just keep on making her cum. In the end she can't even stand on her feet, she sinks to the ground sexually beaten and destroyed....\n\nMore new faces, more updates then any other bondage and sex site in the world. Join today and see why Sexually Broken is the fastest growing site of its kind on the net!\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_26cece/SexuallyBroken-CeCe-Stone-Matt-Williams-Hot-half-Asian-MILF-is-bound-against-a-beam-brutally-skull-fucked-made-to-cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/09_26cece/SexuallyBroken-CeCe-Stone-Matt-Williams-Hot-half-Asian-MILF-is-bound-against-a-beam-brutally-skull-fucked-made-to-cum.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:e7029845f6a909c2bde86e65e0455f73c8ab66a5","amp;dn":"Sexually+Broken--Hot+half+Asian+MILF+bound%2C+skull+fucked++CeCe+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7029845f6a909c2bde86e65e0455f73c8ab66a5","infoHashBuffer":{"type":"Buffer","data":[231,2,152,69,246,169,9,194,189,232,110,101,224,69,95,115,200,171,102,165]},"announce":[],"urlList":[]}}