{"title":"Answering the Call: The Doctor Who Made Africa His Life","uid":10100172,"size":118734899,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e73ee31c419061b00501b48e82b4e4fcb3b90c77&amp;dn=Answering+the+Call%3A+The+Doctor+Who+Made+Africa+His+Life&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidmal","files":-1,"time":1399383027,"description":"Answering the Call: The Doctor Who Made Africa His Life: The Remarkable Story of Albert Schweitzer (Audiobook) By Ken Gire, read by Jim Sanders\n Unabridged edition 2013 | 4 hours and 6 mins | ISBN: 1613753470 | MP3 64 kbps | 119 MB\n\nRevere life, and give yours away for the sake of serving others.\n\nAs a young man, Albert Schweitzer seemed destined for greatness. His immense talent and fortitude propelled him to a place as one of Europe's most renowned philosophers, theologians, and musicians in the early twentieth century. Yet Schweitzer shocked his contemporaries by forsaking worldly success and embarking on an epic journey into the wilds of French Equatorial Africa, vowing to serve as a lifelong physician to &quot;the least of these&quot; in a mysterious land rife with famine, sickness, and superstition.&quot;&quot; \n&quot;&quot;\n\nEnduring hardship, conflict, and personal struggles, he and his beloved wife, Helene, became French prisoners of war during WWI, and Helene later battled persistent illnesses. \nKen Gire's page-turning, novelesque narrative sheds new light on Schweitzer's faith-in-action ethic and his commitment to honor God by celebrating the sacredness of all life.\n\nThe legacy of this 1952 Nobel Prize honoree endures in the thriving African hospital community that began in a humble chicken coop, in the millions who have drawn inspiration from his example, and in the challenge that emanates from his life story into our day. Albert Schweitzer seemed destined for greatness--and he achieved it by making his life his greatest sermon to a world in desperate need of hope and healing.\n\n\n","torrent":{"xt":"urn:btih:e73ee31c419061b00501b48e82b4e4fcb3b90c77","amp;dn":"Answering+the+Call%3A+The+Doctor+Who+Made+Africa+His+Life","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e73ee31c419061b00501b48e82b4e4fcb3b90c77","infoHashBuffer":{"type":"Buffer","data":[231,62,227,28,65,144,97,176,5,1,180,142,130,180,228,252,179,185,12,119]},"announce":[],"urlList":[]}}