{"title":"The Anthony Cumia Show 2015-03-31 MP4 MP3 combo","uid":11790539,"size":303405624,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e83ced26f2d95b1b9b710d1f653f79e34df350f0&amp;dn=The+Anthony+Cumia+Show+2015-03-31+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427916238,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Taleeb Starkes\n\nEpisode 137 - Today begins with breaking news about the Germanwings flight and a SD card, we hear more news out of Indiana involving their attempt for a &quot;religious freedom law&quot;, Ant breaks down the meaning of that, and we watch a video of a Muslim KFC worker. Anthony gets into comedian Trevor Noah's new gig hosting at The Daily Show and people's &quot;outrage over his old ass tweets, we learn that Jamie Foxx is under fire for a joke he made, that &quot;transphobic&quot; is an actual word, talk about people's obsession with &quot;hashtagging&quot;, Bill Cosby's newest heckler, and Taleeb Starkes joins the show at the poker table. The guys discuss &quot;walkers&quot;, Taleeb's awesome attire, the state of the police, holding people to standards they don't hold themselves to, the lack of respect, self-accountability, and shifting blame on consequence. They also talk about Bill Cosby, Azalea Banks, privileges, outrage being exaggerated, and illusions losing their luster because of the media and social media. The guys then touch on &quot;hands up don't shoot&quot;, James Stuhlman, the martyring of thugs, &quot;making the cut&quot; in the community, addressing problems instead of doing away with consequences, and the importance of being well spoken.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:e83ced26f2d95b1b9b710d1f653f79e34df350f0","amp;dn":"The+Anthony+Cumia+Show+2015-03-31+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e83ced26f2d95b1b9b710d1f653f79e34df350f0","infoHashBuffer":{"type":"Buffer","data":[232,60,237,38,242,217,91,27,155,113,13,31,101,63,121,227,77,243,80,240]},"announce":[],"urlList":[]}}