{"title":"(PSX-PSP) Brigandine:The Legend of Forsena converted properly (K","uid":4873417,"size":457497299,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:e8fbc5a0ea5631bb9d502fc416614f2e6e558618&amp;dn=%28PSX-PSP%29+Brigandine%3AThe+Legend+of+Forsena+converted+properly+%28K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1240964451,"description":"BRIGANDINE - THE LEGEND OF FORSENA:\n\nA great war had been ravaging the villages for years when the Almekia Empire finally defeated its rival country, Norgard, in the year 214. A year later, however, Norgard's Admiral Zemeckis assassinated Almekia's beloved King Henguist, proclaiming himself the new Emperor and beginning a reign of terror. It's now up to you, as one of the five Knights of Rune, to battle the monsters and armies of Zemeckis and restore peace to a broken land. Each Knight was born with specific runic abilities, and each is designated to defend a specific piece of Forsena. Lance is a young prince whose duty is to protect New Almekia and Badostow; Lyonesse is the protector of her kingdom, Leonia; and the lord Vaynard teams up with his White Wolf warriors to defend the northlands. Once you choose your character, you'll organize your party members into attack forces and begin the battle. A deep and involving war simulation, the game's system is based largely on hit points, experience, and levels making it an effective role-playing title as well. You'll use rune assaults, magical spells, and attacks with various weapons to get the job done, but strategy and patience are the best allies you'll have. With outstanding graphics, a top-notch story, and action that takes more than a few tries to crack, BRIGANDINE: The Legend of Forsena is a real classic.\n\n\nTested and working on all CFW's 5.00 m33 and above using the 500 popsloader pack set on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:e8fbc5a0ea5631bb9d502fc416614f2e6e558618","amp;dn":"%28PSX-PSP%29+Brigandine%3AThe+Legend+of+Forsena+converted+properly+%28K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8fbc5a0ea5631bb9d502fc416614f2e6e558618","infoHashBuffer":{"type":"Buffer","data":[232,251,197,160,234,86,49,187,157,80,47,196,22,97,79,46,110,85,134,24]},"announce":[],"urlList":[]}}