{"title":"Yevgeny Zamyatin - We, Short Stories, and Essays (6 books)","uid":13725905,"size":24909734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9cc94f573a7d197bd514da20d7bf6e48a73400f&amp;dn=Yevgeny+Zamyatin+-+We%2C+Short+Stories%2C+and+Essays+%286+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"workerbee","files":13,"time":1456964808,"description":"\nYEVGENY IVANOVICH ZAMYATIN (1884-1937) was a Russian novelist, playwright, and satirist.  Despite having been a prominent Old Bolshevik, Zamyatin was deeply disturbed by the policies pursued by the CPSU following the October Revolution and his works became increasingly satirical and critical of the Party and its policies, particularly those regarding censorship of the arts.  &quot;True literature can only exist when it is created, not by diligent and reliable officials, but by madmen, hermits, heretics, dreamers, rebels and skeptics,&quot; he wrote in his 1921 essay &quot;I Am Afraid&quot; (included in A SOVIET HERETIC).\r\n\r\nHe is most famous for his novel WE (1921), a seminal work of dystopian fiction that foreshadowed the worst excesses of Soviet Russia.  It portrays life in the &quot;Single State,&quot; where workers live in glass houses, have numbers rather than names, wear identical uniforms, eat chemical foods, and enjoy rationed sex, and are ruled by a &quot;Benefactor&quot; who is unanimously and perpetually reelected.  Often classed as science fiction, WE is the literary ancestor of Aldous Huxley's &quot;Brave New World&quot; (1932) and George Orwell's &quot;Nineteen Eighty-four&quot; (1949).  It was the first work banned by the Soviet censorship board in 1921 and remained suppressed for many years (it first appeared in Russia only in 1988).  When Zamyatin arranged for the novel to be smuggled to the West for publication, the outrage sparked within the Party and the Union of Soviet Writers led directly to Zamyatin's successful request for exile from his homeland.\r\n\r\nIn addition to three English translations of WE, this collection also includes an early novella (A GODFORSAKEN HOLE), a selection of 15 short stories (THE DRAGON), and an important anthology of critical essays (A SOVIET HERETIC).\r\n\r\n\r\nThe following books are in PDF or ePUB format as indicated:\r\n\r\n* The Dragon: Fifteen Stories (Chicago UP, 1976).  Translated by Mirra Ginsburg. -- PDF\r\n\r\n* A Godforsaken Hole (Ardis, 1988).  Translated by Walker Foard. -- PDF\r\n\r\n* A Soviet Heretic: Essays (Chicago UP, 1970).  Translated by Mirra Ginsburg. -- PDF\r\n\r\n* We (Penguin Classics, 1993).  Translated by Clarence Brown. -- ePUB\r\n\r\n* We (Modern Library, 2006).  Translated by Natasha Randall. -- ePUB\r\n\r\n* We (Dutton, 1952 / Momentum, 2013).  Translated by Gregory Zilboorg. -- PDF + ePUB\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                     \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:e9cc94f573a7d197bd514da20d7bf6e48a73400f","amp;dn":"Yevgeny+Zamyatin+-+We%2C+Short+Stories%2C+and+Essays+%286+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9cc94f573a7d197bd514da20d7bf6e48a73400f","infoHashBuffer":{"type":"Buffer","data":[233,204,148,245,115,167,209,151,189,81,77,162,13,123,246,228,138,115,64,15]},"announce":[],"urlList":[]}}