{"title":"[ExploitedCollegeGirls] Ariana (19 Years Old) (05.29.2014)","uid":10258387,"size":906467422,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ea1ee5d9f4376f2dd81ae35d152f0acf4270f6c6&amp;dn=%5BExploitedCollegeGirls%5D+Ariana+%2819+Years+Old%29+%2805.29.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"chkm8te","files":1,"time":1401425654,"description":"[ExploitedCollegeGirls] Ariana (19 Years Old) (05.29.2014)\n\nMeet Ariana, a sexy, giggly 19 year old amateur whose interests include extremely quiet orgasms and eating cum. While she comes off as the most innocent model we've ever featured, don't be fooled. This girl is very sexual and turns out to be an undercover cumslut.\nAs Jay interviews her, Ari strips off her clothes and shows off a fine, nubile 19 year old body. She's got an amazing bod from her curvy little ass to hourglass hips to her perky little tits. Try not to laugh, though, when she points out that her 34B tits &quot;Are real!&quot; No, gents, these are not the world's smallest, jiggliest breast implants. When Ariana admits that she owns a Rabbit of her own, Jay knows that a vibrator orgasm is going to be a cinch. He gets Ari naked and spread and goes to work with his fingers and a vibrator. At this point you'll notice that Ariana is a true amateur and doesn't fake anything - so this is a quiet update. Totally safe to watch at work or in a library.\nAfter Ariana gives Jay a nice, wet mouth hug the real action begins. As soon as Jay applies the cock, despite her lack of noise, she really gets into it. Her pussy just gets gushy wet as Jay fucks her. He gets her off on her back, which you see in great detail with a nice bird's eye view cam. Then he flips her into The Sideshow which she really gets off on, as Jay is stroking, she's moaning to herself and biting her lips in the sexiest possible way.\nJay gets Ariana on her back for the big finish and lets fly with a huge facial that covers her lips and her tits. While she's surprised, she takes the whole load and giggles like a schoolgirl as Jay paints her pretty face. When when Jay asks if she likes cum and she agrees he feeds his load to her and she slurps it down. So, not innocent, not at all; and we approve.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=gjcvc41qki653vsi5uwn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=gjcvc41qki653vsi5uwn.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=i08vcrfmht7y2a8jz35h.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=i08vcrfmht7y2a8jz35h.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ea1ee5d9f4376f2dd81ae35d152f0acf4270f6c6","amp;dn":"%5BExploitedCollegeGirls%5D+Ariana+%2819+Years+Old%29+%2805.29.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea1ee5d9f4376f2dd81ae35d152f0acf4270f6c6","infoHashBuffer":{"type":"Buffer","data":[234,30,229,217,244,55,111,45,216,26,227,93,21,47,10,207,66,112,246,198]},"announce":[],"urlList":[]}}