{"title":"The Mighty Mighty Bosstones - Someday I Suppose [promo].VOB","uid":11918014,"size":249292800,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eb05c2aa65b9aebf703fa9e731ded8a695159634&amp;dn=The+Mighty+Mighty+Bosstones+-+Someday+I+Suppose+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"SgtRlee","files":1,"time":1431576782,"description":"The Mighty Mighty Bosstones - Someday I Suppose [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Someday I Suppose&quot; is a song from  Don't Know How to Party, the third full length album by The Mighty Mighty Bosstones, which was released in 1993. Don't Know How to Party was The Mighty Mighty Bosstones' major label debut on Mercury Records, their first venture away from their original label Taang! Records. The album reached #187 on the Billboard 200, and spawned several singles, including the Bosstones fan favorite &quot;Someday I Suppose&quot; (#19 Billboard Modern Rock Tracks). \n\n\nThe Mighty Mighty Bosstones (informally referred to as The Bosstones) are an American ska-core band from Boston, Massachusetts, formed in 1983. Since the band's inception, lead vocalist Dicky Barrett, bassist Joe Gittleman, tenor saxophonist Tim &quot;Johnny Vegas&quot; Burton and dancer (&quot;Bosstone&quot;) Ben Carr have remained constant members. The current line-up also includes drummer Joe Sirois, saxophonist Kevin Lenear, guitarist Lawrence Katz and trombonist Chris Rhodes.\n\nThe Bosstones are often credited as one of the progenitors of the genre of ska punk and the creators of its sub-genre ska-core, a form of music which mixes elements of ska with punk rock and hardcore. Since the release of their 1989 debut Devil's Night Out, the band toured and recorded extensively throughout the 1990s, becoming a key figure in the development of the American third wave ska scene and one of the first bands to popularize the genre in the musical mainstream, reaching their commercial peak with their platinum-selling 1997 album Let's Face It and its hit single &quot;The Impression That I Get&quot;. The band had released seven studio albums, three EPs and a live album by the time they announced a hiatus in December 2003. In 2007, the Bosstones reunited to resume recording and touring. \n\nIn August 2011, Chris Rhodes posted a Facebook update stating that The Mighty Mighty Bosstones had begun work on their next album. The album, titled The Magic of Youth, was released on December 6, 2011.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Don%27t_Know_How_to_Party&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Don%27t_Know_How_to_Party&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/lzst1pmup/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/lzst1pmup/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7948kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:03:26\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:eb05c2aa65b9aebf703fa9e731ded8a695159634","amp;dn":"The+Mighty+Mighty+Bosstones+-+Someday+I+Suppose+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb05c2aa65b9aebf703fa9e731ded8a695159634","infoHashBuffer":{"type":"Buffer","data":[235,5,194,170,101,185,174,191,112,63,169,231,49,222,216,166,149,21,150,52]},"announce":[],"urlList":[]}}