{"title":"The Biblical Age of the Earth - Paul Taylor","uid":11772876,"size":1415088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebd8c420a40bb453a701151eeb524b3031b08c9e&amp;dn=The+Biblical+Age+of+the+Earth+-+Paul+Taylor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"starxteel","files":1,"time":1427145673,"description":"\nEvolutionists employ dating methods which consistently date objects as millions and even billions of years old. Creationists, on the other hand, quite rightly spend a lot of time showing the inconsistencies and unprovable presuppositions that undergird such evolutionary dating methods. Why exactly is it that creationists teach that the Bible allows for only 6,000 years or so of history?\n\n\nAbout the author:\nPaul Taylor was born quite young in 1961 in Ashton-under-Lyne, which was then in Lancashire, England, though under county reorganization in the 1970s, it became part of Tameside, Greater Manchester. He grew up, eventually, but before he did, he was educated at Chetham?s School of Music, Manchester?originally hoping to become a concert pianist.\nIn 1979, he went up to Nottingham University to read Chemistry. he stayed on, after graduating, and also got his Post Graduate Certificate in Education and then became a schoolteacher.\nDuring his first teaching post?1983-1986 at Droylsden High School?he joined forces with four other teachers and they wrote a successful school musical called Secrets.\nHe became a Christian in 1977, and was baptized in 1982. He haa regularly preached and written on a variety of subjects, especially music in worship and creationism. He's the author of several books","torrent":{"xt":"urn:btih:ebd8c420a40bb453a701151eeb524b3031b08c9e","amp;dn":"The+Biblical+Age+of+the+Earth+-+Paul+Taylor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebd8c420a40bb453a701151eeb524b3031b08c9e","infoHashBuffer":{"type":"Buffer","data":[235,216,196,32,164,11,180,83,167,1,21,30,235,82,75,48,49,176,140,158]},"announce":[],"urlList":[]}}