{"title":"Lithium-ion Battery Materials and Engineering","uid":12744112,"size":6336064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecb379bd377ebc3e122b754008b154406d5b259d&amp;dn=Lithium-ion+Battery+Materials+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1447278140,"description":"Lithium-ion Battery Materials and Engineering - Current Topics and Problems from the Manufacturing Perspective (Springer, 2014).pdf\r\n\r\nISBN 9781447165477\r\n\r\nGaining public attention due, in part, to their potential application as energy storage devices in cars, Lithium-ion batteries have encountered widespread demand, however, the understanding of lithium-ion technology has often lagged behind production.\r\n\r\nThis book defines the most commonly encountered challenges from the perspective of a high-end lithium-ion manufacturer with two decades of experience with lithium-ion batteries and over six decades of experience with batteries of other chemistries.\r\n\r\nAuthors with years of experience in the applied science and engineering of lithium-ion batteries gather to share their view on where lithium-ion technology stands now, what are the main challenges, and their possible solutions. The book contains real-life examples of how a subtle change in cell components can have a considerable effect on cell’s performance. Examples are supported with approachable basic science commentaries.\r\n\r\nProviding a unique combination of practical know-how with an in-depth perspective, this book will appeal to graduate students, young faculty members, or others interested in the current research and development trends in lithium-ion technology","torrent":{"xt":"urn:btih:ecb379bd377ebc3e122b754008b154406d5b259d","amp;dn":"Lithium-ion+Battery+Materials+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecb379bd377ebc3e122b754008b154406d5b259d","infoHashBuffer":{"type":"Buffer","data":[236,179,121,189,55,126,188,62,18,43,117,64,8,177,84,64,109,91,37,157]},"announce":[],"urlList":[]}}