{"title":"Electromagnetic Pollution and Weaponry","uid":4174541,"size":865120366,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:eceedeae692da07cdc61a204c10cfc24090ce80c&amp;dn=Electromagnetic+Pollution+and+Weaponry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"newmy51","files":64,"time":1210046612,"description":"This is a work-in-progress collection of some of the most recent and relevent literature, research reports, articles, news interviews and informational videos with regard to electromagnetic pollution/weapons, human sensitivity and the resulting effects.  It\\&amp;#039;s something I tend to put a rather unhealthy amount of my free time in, ironic for the fact that so much time in front of a computer could have its own ill effects.  Let\\&amp;#039;s hope that the ends justify the potentially excessive means.  The highlights, in my opinion, are the Bioinitiative Report, the Amy Worthington articles and the Lopatin-Tsygankov book, the latter of which was previously only available in Russian until very recently, but everything included is worth a good read, listen or viewing.  This is admittedly small and incomplete.  I hope to release a more comprehensive collection when I\\&amp;#039;ve gathered more materials, materials which could become unavailable as sites are taken down and servers stop hosting their content, of which there is no shortage of examples.  Hope you find this as rivetting as I do.\n\nContents listed in folder screenshots.  All text files are .ODT OpenOffice format.  OpenOffice can be downloaded at http://www.openoffice.org/ for free.","torrent":{"xt":"urn:btih:eceedeae692da07cdc61a204c10cfc24090ce80c","amp;dn":"Electromagnetic+Pollution+and+Weaponry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eceedeae692da07cdc61a204c10cfc24090ce80c","infoHashBuffer":{"type":"Buffer","data":[236,238,222,174,105,45,160,124,220,97,162,4,193,12,252,36,9,12,232,12]},"announce":[],"urlList":[]}}