{"title":"The Best of James (sidthefish)","uid":3978685,"size":101056368,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed3ff7db7dd6e70dffe3d6e0f0868221b74ba209&amp;dn=The+Best+of+James+%28sidthefish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"sidthefish","files":18,"time":1200425928,"description":"Riding on the powerful wave of Manchester&amp;#039;s early 1990&amp;#039;s musical renaissance, James&amp;#039; intellectual and improvised approach complemented a dance heavy scene and catapulted the seven-piece in to the limelight. &quot;Come Home&quot; and &quot;Sit Down&quot;--James&amp;#039; most lucrative singles--commence this 18 song Best Of collection. Elsewhere, the equally commercial &quot;She&amp;#039;s A Star&quot; from 1997 and 1998&amp;#039;s satirical &quot;Destiny Calling&quot; prove that James have consistently carved out new territory for themselves and their listeners. Gradually drawing away from the brittle bones of their 1980s incarnation as a provocative but marginalised indie four-piece--as evinced on 1995&amp;#039;s &quot;Hymn From A Village&quot;--1991 saw a strengthened James refining their musical designs to the point of subtle perfection on the epic &quot;Sound&quot;. Writers of pop songs, devotees of producer Brian Eno&amp;#039;s spirit of adventure--and occasionally unwitting victims of singer and lyricist&amp;#039;s Tim Booth&amp;#039;s sanctimonious and heavy-handed manner--James are a true enigma. Their Best Of is an island of musical intrigue and possibility. --James Littlewood\n\nDescription\nJAMES: THE BEST OF is an excellent sampling of the late output of the band that was almost too happy for Manchester. Culled mostly from James&amp;#039;s albums from the 1990s, the 18 songshere include the smash hit &quot;Laid&quot;, and several other UK hits that were US sleepers, including &quot;Come Home&quot;, &quot;Sit Down&quot;, &quot;She&amp;#039;s a Star&quot;, and others.\nSadly, JAMES: THE BEST OF provides only one example of the band&amp;#039;s earlier work on FactoryRecords. Nevertheless, the compilation attests to the wonderful pop sensibility that characterised the James sound, as well as to the lyrical depth that helped the band develop the dedicated following that enabled its survival long after the Madchester scene had floundered. James&amp;#039;s phenomenal staying power is well documented on JAMES: THE BEST OF.","torrent":{"xt":"urn:btih:ed3ff7db7dd6e70dffe3d6e0f0868221b74ba209","amp;dn":"The+Best+of+James+%28sidthefish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed3ff7db7dd6e70dffe3d6e0f0868221b74ba209","infoHashBuffer":{"type":"Buffer","data":[237,63,247,219,125,214,231,13,255,227,214,224,240,134,130,33,183,75,162,9]},"announce":[],"urlList":[]}}