{"title":"GUI Bloopers 2.0","uid":5171412,"size":11633354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed817ab33f5633d618843dabdfca1324a2e39c67&amp;dn=GUI+Bloopers+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"transpar3nt","files":-1,"time":1258710343,"description":"GUI Bloopers 2.0: Common User Interface Design Don'ts and Dos\nMorgan Kaufmann\n\n2008\nEnglish\n433 Pages\n\nHighly recommended by developer/blogger: http://www.codinghorror.com/blog/archives/000020.html\n\nDescription...............................................\n\nIs your application or Web site ready for prime time?\n\nA major revision of a classic reference, GUI Bloopers 2.0 looks at user interface design bloopers from commercial software, Web sites, Web applications, and information appliances, explaining how intelligent, well-intentioned professionals make these mistakes--and how you can avoid them. While equipping you with the minimum of theory, GUI expert Jeff Johnson presents the reality of interface design in an entertaining, anecdotal, and instructive way.\n\n* Updated to reflect the bloopers that are common today, incorporating many comments and suggestions from first edition readers.\n\n* Takes a learn-by-example approach that teaches how to avoid common errors.\n\n* Covers bloopers in a wide range of categories: GUI controls, graphic design and layout, text messages, interaction strategies, Web site design -- including search, link, and navigation, responsiveness issues, and management decision-making.\n\n* Organized and formatted so information needed is quickly found, the new edition features call-outs for the examples and informative captions to enhance quick knowledge building.\n\n* Hundreds of illustrations: both the DOs and the DON'Ts for each topic covered, with checklists and additional bloopers on www.gui-bloopers.com.","torrent":{"xt":"urn:btih:ed817ab33f5633d618843dabdfca1324a2e39c67","amp;dn":"GUI+Bloopers+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed817ab33f5633d618843dabdfca1324a2e39c67","infoHashBuffer":{"type":"Buffer","data":[237,129,122,179,63,86,51,214,24,132,61,171,223,202,19,36,162,227,156,103]},"announce":[],"urlList":[]}}