{"title":"The.Lions.Mouth.Opens.2015.1080p.HBO.WEBRip.DD5.1.H.264-monkee","uid":15975629,"size":813069925,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:edda7b4fb24cb4bbc70c7493ea539e4b8beea94c&amp;dn=The.Lions.Mouth.Opens.2015.1080p.HBO.WEBRip.DD5.1.H.264-monkee&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Anon_up","files":1,"time":1475833467,"description":"THE LION'S MOUTH OPENS\r\n\r\nIn this Cinema Eye Best Short Doc award winner, a courageous young Scottish actress takes the boldest step imaginable to confront her risk of having inherited the fatal, incurable Huntington's Disease.\r\n\r\nShort Documentary Film\r\n28 min\r\nHBO\r\n\r\n\r\nSYNOPSIS\r\n\r\nThis verité documentary is about confronting life’s most daunting moments with purpose and grace, and about the impact of genetic bonds and genetic testing on the people we love and on how we face our destiny. Stunningly courageous young filmmaker-actress Marianna Palka gathers her friends around her as she finds out whether she has inherited Huntington’s Disease, an incurable degenerative disorder which took her father and now has a 50% chance of taking her body and her mind. Intimate, suspenseful, and emotional, with sensitive verité cinematography by Nick Higgins, and with a title taken from the Bob Dylan poem which Marianna recites about Woody Guthrie who died from Huntington’s Disease, The Lion’s Mouth Opens ultimately inspires us to find a new dream no matter what.\r\n\r\nAWARDS\r\npremiered at Sundance Film Festival 2014\r\nWinner Outstanding Achievement in Nonfiction Short Filmmaking, Cinema Eye Honors 2015\r\nGrand Jury Award nomination, Sundance Film Festival 2014\r\nBest Short Doc nomination, Sheffield Doc/Fest 2014\r\nSpecial Jury Mention for Best Short Documentary, Aspen ShortsFest 2014\r\nFinalist, Best Short Film, Ashland Independent Film Festival 2014\r\nDirector's Choice Best Short Doc, Rincon International Film Festival 2014\r\nMoving Mountains Prize nomination, MountainFilm in Telluride 2014\r\nAudience Award for Best Documentary Short, Traverse City Film Festival 2014\r\nshortlisted for Best Documentary Short, Academy Awards 2015","torrent":{"xt":"urn:btih:edda7b4fb24cb4bbc70c7493ea539e4b8beea94c","amp;dn":"The.Lions.Mouth.Opens.2015.1080p.HBO.WEBRip.DD5.1.H.264-monkee","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edda7b4fb24cb4bbc70c7493ea539e4b8beea94c","infoHashBuffer":{"type":"Buffer","data":[237,218,123,79,178,76,180,187,199,12,116,147,234,83,158,75,139,238,169,76]},"announce":[],"urlList":[]}}