{"title":"Hitler's Charisma: Leading Millions...  (2013) Laurence Rees (mu","uid":9505998,"size":20911310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee06896d6c3886a22c72d99bb414bdf70cb1f57a&amp;dn=Hitler%27s+Charisma%3A+Leading+Millions...++%282013%29+Laurence+Rees+%28mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"7","files":-1,"time":1390318448,"description":"Hitler's Charisma: Leading Millions into the Abyss (2013) Laurence Rees (multi) \n\nHitler's Charisma: Leading Millions into the Abyss by Laurence Rees\n\n\nFormat: mobi/epub/azw3\nLength: 384 pages\nGenre: History\nDate: 16 April 2013\n\nFuelled by hate, incapable of forming normal human relationships, unwilling to listen to dissenting voices, Adolf Hitler seemed an unlikely leader, and yet he commanded enormous support and was able to exert a powerful influence over those who encountered him. How did Hitler become such an attractive figure to millions of people? That is the question at the core of Hitler's Charisma.\n\nAcclaimed historian and documentary filmmaker Laurence Rees examines the nature of Hitler's appeal and reveals the role his supposed 'charisma' played in his success. Here is a fascinating social, psychological and historical investigation into the formation of a personality whose determination and vision would at the outset convince a small group of like-minded political and social outcasts but would eventually win over an entire nation and plunge the rest of the world into a cataclysm unlike any that had ever been seen before.\n\nHitler's Charisma is a natural culmination of twenty years of writing and research on the Third Reich and a remarkable examination of the man and the mind at the heart of it all.\n\nAuthor:\n\nLaurence Rees has won the British Book Award for History Book of the Year 2006 for his international bestseller Auschwitz: The Nazis and the 'Final Solution'. His career as a writer and filmmaker, focusing on the Nazis and World War II, stretches back nearly 20 years and includes the acclaimed television series Nazis: A Warning from History, War of the Century. His work has won him a myriad of awards including a BAFTA. a Grierson Award and an international Documentary Award. ","torrent":{"xt":"urn:btih:ee06896d6c3886a22c72d99bb414bdf70cb1f57a","amp;dn":"Hitler%27s+Charisma%3A+Leading+Millions...++%282013%29+Laurence+Rees+%28mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee06896d6c3886a22c72d99bb414bdf70cb1f57a","infoHashBuffer":{"type":"Buffer","data":[238,6,137,109,108,56,134,162,44,114,217,155,180,20,189,247,12,177,245,122]},"announce":[],"urlList":[]}}