{"title":"The Toon - The Complete History of Newcastle United Football Clu","uid":8733120,"size":6540106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eed2a543a4a37aef93fac8ae46dfa41cc5f7edaa&amp;dn=The+Toon+-+The+Complete+History+of+Newcastle+United+Football+Clu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Ehhhhtozebec","files":-1,"time":1374637899,"description":"Overview\n\nThis is the full story, unofficial and uncensored, of one of the greatest football clubs in the country. From its birth in the 1890s to its rebirth in the 1990s and up to season 2003-4, The Toon tells of a small soccer club, long in the shadow of an enormous rival, which grew to eclipse that rival - and every other club in Great Britain. Roger Hutchinson brings to life the sensational early successes of Newcastle United, recreating the great Anglo-Scottish team which dominated the Football League before the First World War. He vividly describes the helter-skelter attacking sides of the 1930s and the Cup giants of the 1950s, and gives us the European conquerors of the 1960s and the squads of the 1970s and '80s, before showing us how today's cosmopolitan side of title-chasing internationals was built.This lively, hard-hitting book portrays the brilliant management of such legends as Frank Watt and takes us down through the thrilling decades right up to the reign of Sir Bobby Robson. In its pages we see the educated play of Andy Aitken and Colin Veitch; we watch as the fast and furious centre-forward play of Jock Peddie paves the way for the era of the great Hughie Gallacher and the unique Jackie Milburn. It assesses the merits of all of their heirs, from Keegan to Beardsley, from Macdonald to Shearer, from Moncur to Dyer. Exploring and explaining the lean years as well as the successful decades, The Toon exposes the bad managers, incompetent directors and players who were unworthy of the black and white stripes. It takes an unflinching look at the lost opportunities and the Geordie footballers who went missing. But it also offers us the geniuses, the household names, the men who have lit up Tyneside and the world beyond in a hundred-year sequence of unforgettable League and Cup campaigns. Most of all, The Toon looks from the past towards a glorious future.\n\n\n\nProduct Details\n\n    ISBN-13: 9781780573144\n    Publisher: Mainstream Publishing Company, Limited\n    Publication date: 11/4/2011\n    Format: eBook \n\n\nMeet the Author\n\nRoger Hutchinson is an award-winning author and journalist. After working as an editor in London, in 1977 he joined the West Highland Free Press in Skye. Since then he has published thirteen books, including Polly: the True Story Behind Whisky Galore. He is still attached to the WHFP as editorialist and columnist, and has written for BBC Radio, The Scotsman, The Guardian, The Herald and The Literary Review. His book The Soap Man (Birlinn 2003) was shortlisted for the Saltire Scottish Book of the Year (2004). Calum's Road has been a huge bestseller, shortlisted for the Ondaatje Prize (2007) with film rights sold.","torrent":{"xt":"urn:btih:eed2a543a4a37aef93fac8ae46dfa41cc5f7edaa","amp;dn":"The+Toon+-+The+Complete+History+of+Newcastle+United+Football+Clu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eed2a543a4a37aef93fac8ae46dfa41cc5f7edaa","infoHashBuffer":{"type":"Buffer","data":[238,210,165,67,164,163,122,239,147,250,200,174,70,223,164,28,197,247,237,170]},"announce":[],"urlList":[]}}