{"title":"Bruce Springsteen - The Ties That Bind (1979) @320","uid":5490622,"size":95069904,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eff4901f35ef590570725d423acd318397ae1a33&amp;dn=Bruce+Springsteen+-+The+Ties+That+Bind+%281979%29+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"artpepper","files":-1,"time":1270979560,"description":"Bruce Springsteen - The Ties That Bind (1979)\n\nMP3 CBR 320 Kbps | 86 MB | Scans included\n\n\n\n\nIn the Fall of 1979, Bruce Springsteen finished a series of songs that would comprise The Ties That Bind, his fifth album. CBS Records hoped for a Christmas release, or early 1980 at the latest, but Springtsteen scrapped the project entirely after the songs were chosen and the album even sequenced. Hearing that lost album was only wishful thinking for Springsteen fans. Until now.\n\nOriginal master tapes from the Power Station, location of recording sessions for The Ties That Bind and its ultimate successor, The River, serve as the source for this release. As a result, the sound quality is superb, rivaling and often surpassing even the Japanese version of The River on CD (which sounds slightly warmer than its American counterpart).\n\nThe Chief difference in sound is a greater ambiance. Listeners will note a warmer, more intimate sound on common songs like &quot;Hungry Heart&quot; (which is identical to the officially released version) and on slightly different versions of familar songs like &quot;The Ties That Bind&quot; and &quot;The River&quot;. Perhaps the best example is &quot;The Price You Pay&quot;, which Power Station notes indicate is the first take. Greater separation between the acoustic guitar (left channel) and electric guitar (right channel) and improved sound on Max Weinberg's snare and cymbals, not to mention the alternate third verse, make for a new aural experience. Furthermore, the E Street Band flat-out nailed this song on the first take.\n\nWhile fans will enjoy the alternate takes of songs that made it to The River, the flawless sound of the still-unreleased gem &quot;Cindy&quot; will cause jaws to drop. Sound on previously circulated tapes, records, and CD's has ranged from fair to very good, but The Ties That Bind will render those versions vastly inferior. The material is bright, distinct in both channels, pitched correctly, and without any of the evident flaws of the past.\n\nIn addition to the quantum leap in sound, there are also considerable thematic differences that distinguish The Ties That Bind from The River. From the original version of &quot;Stolen Car&quot; (in its &quot;Son, You May Kiss The Bride&quot; arrangement) to the sequencing of the rockabilly &quot;You Can Look (But You Better Not Touch)&quot; immediately after &quot;The River&quot; (which opens the second side- contrast that with its place as the final song on the first disc of The River. Yet Springsteen told Marsh that after the excitement of the MUSE shows in September 1979, the album &quot;seemed inadequate.&quot; Fifteen years after Springsteen shelved The Ties That Bind, there is little to suggest inadequancy. And, for once, fans have as much proof as they need.\n\n\n\n\nTracklist:\n\n\n1. The Ties That Bind (3:37)\n2. Cindy (2:28)\n3. Hungry Heart (3:28)\n4. Stolen Car (4:33)\n5. To Be True (3:54) - aka &quot;Be True&quot;\n6. The River (4:54)\n7. You Can Look (But You Better Not Touch) (2:12)\n8. The Price You Pay (5:51)\n9. I Wanna Marry You (3:31)\n10. Loose Ends (4:08)","torrent":{"xt":"urn:btih:eff4901f35ef590570725d423acd318397ae1a33","amp;dn":"Bruce+Springsteen+-+The+Ties+That+Bind+%281979%29+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff4901f35ef590570725d423acd318397ae1a33","infoHashBuffer":{"type":"Buffer","data":[239,244,144,31,53,239,89,5,112,114,93,66,58,205,49,131,151,174,26,51]},"announce":[],"urlList":[]}}