{"title":"Ciudad De Vida Y Muerte BR-Screener Spanish 2009","uid":5489854,"size":2072154112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f0730ac40db592cd9575597ed93d3f6f51c84e2c&amp;dn=Ciudad+De+Vida+Y+Muerte+BR-Screener+Spanish+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Mois20","files":1,"time":1270929344,"description":"China, Diciembre de 1937. El paÃƒÂ­s estÃƒÂ¡ en guerra con JapÃƒÂ³n. Beijing y Shanghai ya han caÃƒÂ­do. Las tropas japonesas llegan a las puertas de Nanking, la capital. DespuÃƒÂ©s de semanas de bombardeos los oficiales locales y extranjeros han huido de la ciudad en ruinas.\n\nLu, un carismÃƒÂ¡tico general chino, se propone firmemente echar al enemigo y lidera a sus hombres en la defensa de la capital. Les queda poca municiÃƒÂ³n y estÃƒÂ¡n llegando los tanques japoneses. Pero ellos, se niegan a abandonar la ciudad.\n\nEl Sr. Tang es cautelosamente optimista. El y su familia son conducidos a la zona de Seguridad Internacional, donde un creciente nÃƒÂºmero de chinos encuentran refugio. Bajo el mando de un pequeÃƒÂ±o grupo de extranjeros que se han quedado en la ciudad, la zona se ha convertido en un autÃƒÂ©ntico campo de refugiados. La Sra, Jiang, una joven profesora china con un fuerte sentido de la ayuda, coordina la vida en este lugar lleno de gente, tratando de proteger a tantas personas como pueda.\n\nLos japoneses se estÃƒÂ¡n apropiando de la ciudad e instalando sus tropas. Comienza la ocupaciÃƒÂ³n de Nanking.\n\nKadokawa, un silencioso y romÃƒÂ¡ntico soldado japonÃƒÂ©s, observa la brutalidad de la guerra, incapaz de impedir sus acciones.\n\nNanking se estÃƒÂ¡ convirtiendo en un infierno. Todos se esfuerzan en sobrevivir en una ciudad donde la muerte es mÃƒÂ¡s fÃƒÂ¡cil que la vida.","torrent":{"xt":"urn:btih:f0730ac40db592cd9575597ed93d3f6f51c84e2c","amp;dn":"Ciudad+De+Vida+Y+Muerte+BR-Screener+Spanish+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0730ac40db592cd9575597ed93d3f6f51c84e2c","infoHashBuffer":{"type":"Buffer","data":[240,115,10,196,13,181,146,205,149,117,89,126,217,61,63,111,81,200,78,44]},"announce":[],"urlList":[]}}