{"title":"Directory List and Print Pro v2.17.0.0 Pre-Activated [TorDigger]","uid":8335544,"size":5346828,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f252e4e913e7e8aa0e8b263b5f70c2f07b7e908d&amp;dn=Directory+List+and+Print+Pro+v2.17.0.0+Pre-Activated+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"TorDigger","files":9,"time":1364982775,"description":"Directory List &amp; Print Pro\n\nDirectory List &amp; Print is a software tool for Windows and enables listing and printing the content of any directory in a simplest way. By copying to the clipboard the lists can be exported into other programs or opened directly in Word and Excel.\n\nFeatues:\n\nSave own directory favorites.\nSet directory recursion depth for subdirectories.\nDisplay of file attributes such as Read Only, Hidden, System, etc.\nCalculate CRC32 checksums for files.\nDisplay of title of document files (pdf,doc,docx,xls,xlsx,ppt,pptx).\nDisplay of extent of document files if possible (pdf,doc,docx,xlsx,pptx).\nDisplay the version number and title of executables (exe,dll).\nDisplay format of audio/video and image files.\nDisplay of dimensions like width, height, bit depth, dpi or frames/s.\nDisplay duration and title of audio and video files.\nDisplay of sampling and bit rates for audio files.\nDisplay of frame rate and bit rate of video files.\nDisplay of a continuous numbering of the objects.\nDisplay of column titles in the first row.\nShow number and sum of size and length of the displayed objects.\nDisplay of the date in many different international formats.\nDisplay the duration of media files in different time formats.\nSet filter to certain file size range.\nSet filter to include or exclude certain file types.\nSet filter to include or exclude files and directories by certain terms.\nSet filter to include or exclude files by date range, date created or modified.\nSet filter to include or exclude files by attributes (archive, read-only etc.).\nSet filter on length of filenames, eg. to analyze the file system when copying it to a new directory structure (path+filename, filename only, &gt;, =, &lt;).\nOutput the list directly to the default printer.\nOutput the list as HTML table (font and color etc. customizable).\nOutput the list as XML file.\nOutput the list in comma- or tab-delimited file or CSV file.\nLinking of files and directories in Excelâ„¢ and HTML output for direct open by mouse click. \n(This function is customizable for any language variant of Excel)\n\nSystem Requirements:\n\nMicrosoft Windowsâ„¢ XP/Vista/7/8 (32bit application, executable on 64bit).\nAbout 10 MB disk space.\n\nHomepage: http://www.infonautics.ch \n\nInstallation Instructions:\n\n- No need of Installation, Keep program folder anywhere and run.\n- Pre-Activated Pro, No any key/crack needed.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:f252e4e913e7e8aa0e8b263b5f70c2f07b7e908d","amp;dn":"Directory+List+and+Print+Pro+v2.17.0.0+Pre-Activated+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f252e4e913e7e8aa0e8b263b5f70c2f07b7e908d","infoHashBuffer":{"type":"Buffer","data":[242,82,228,233,19,231,232,170,14,139,38,59,95,112,194,240,123,126,144,141]},"announce":[],"urlList":[]}}