{"title":"Learn PYTHON the HARD WAY 3rd Ed. 2013","uid":9437373,"size":2666484,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2965f590be11e4bcf8149edf829f6b58d2041ba&amp;dn=Learn+PYTHON+the+HARD+WAY+3rd+Ed.+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1388932387,"description":"LEARN PYTHON THE HARD WAY, 3RD EDITION \n\nBOOK DETAILS: Pages: 320\nPublisher: Addison-Wesley Professional; 3rd Edition (October 2013) \nISBN-10: 0321884914 \nISBN-13: 978-0321884916\nFormat: PDF\n\nBOOK DESCRIPTION:\n\nYou Will Learn Python! Zed Shaw has perfected the worlds best system for learning Python. Follow it and you will succeed just like the hundreds of thousands of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else. \n\nIn Learn Python the Hard Way, Third Edition, you will learn Python by working through 52 brilliantly crafted exercises. Read them. Type their code precisely. (No copying and pasting!) Fix your mistakes. Watch the programs run. As you do, you will learn how software works; what good programs look like; how to read, write, and think about code; and how to find and fix your mistakes using tricks professional programmers use. \n\nMost importantly, you will learn the following, which you need to start writing excellent Python software of your own: \n\nInstalling a complete Python environment \nOrganizing and writing code \nBasic mathematics \nVariables Strings and text \nInteracting with users \nWorking with files \nLooping and logic \nData structures using lists and dictionaries \nProgram design \nObject-oriented programming \nInheritance and composition \nModules, classes, and objects \nPython packaging \nDebugging Automated testing \nBasic game development \nBasic web development \n\nIt will be hard at first. But soon, you will just get it and that will feel great! This tutorial will reward you for every minute you put into it. Soon, you will know one of the worlds most powerful, popular programming languages. You will be a Python programmer.  \n\nTable of Contents:\n\nExercise 1. A Good First Program Exercise 2. Comments and Pound Characters Exercise 3. Numbers and Math Exercise 4. Variables and Names Exercise 5. More Variables and Printing Exercise 6. Strings and Text Exercise 7. More Printing Exercise 8. Printing, Printing Exercise 9. Printing, Printing, Printing Exercise 10. What Was That? Exercise 11. Asking Questions Exercise 12. Prompting People Exercise 13. Parameters, Unpacking, Variables Exercise 14. Prompting and Passing Exercise 15. Reading Files Exercise 16. Reading and Writing Files Exercise 17. More Files Exercise 18. Names, Variables, Code, Functions Exercise 19. Functions and Variables Exercise 20. Functions and Files Exercise 21. Functions Can Return Something Exercise 22. What Do You Know So Far? Exercise 23. Read Some Code Exercise 24. More Practice Exercise 25. Even More Practice Exercise 26. Congratulations, Take a Test! Exercise 27. Memorizing Logic Exercise 28. Boolean Practice Exercise 29. What If Exercise 30. Else and If Exercise 31. Making Decisions Exercise 32. Loops and Lists Exercise 33. While-Loops Exercise 34. Accessing Elements of Lists Exercise 35. Branches and Functions Exercise 36. Designing and Debugging Exercise 37. Symbol Review Exercise 38. Doing Things to Lists Exercise 39. Dictionaries, Oh Lovely Dictionaries Exercise 40. Modules, Classes, and Objects Exercise 41. Learning to Speak Object Oriented Exercise 42. Is-A, Has-A, Objects, and Classes Exercise 43. Basic Object-Oriented Analysis and Design Exercise 44. Inheritance vs. Composition Exercise 45. You Make a Game Exercise 46. A Project Skeleton Exercise 47. Automated Testing Exercise 48. Advanced User Input Exercise 49. Making Sentences Exercise 50. Your First Website Exercise 51. Getting Input from a Browser Exercise 52. The Start of Your Web Game Appendix. Command Line Crash Course\n","torrent":{"xt":"urn:btih:f2965f590be11e4bcf8149edf829f6b58d2041ba","amp;dn":"Learn+PYTHON+the+HARD+WAY+3rd+Ed.+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2965f590be11e4bcf8149edf829f6b58d2041ba","infoHashBuffer":{"type":"Buffer","data":[242,150,95,89,11,225,30,75,207,129,73,237,248,41,246,181,141,32,65,186]},"announce":[],"urlList":[]}}