{"title":"Prentice.Hall.PTR.Solaris.Internals.Solaris.10.and.OpenSolaris.K","uid":4953800,"size":8996259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2bd425687c4631af8657570871623d2df7602a6&amp;dn=Prentice.Hall.PTR.Solaris.Internals.Solaris.10.and.OpenSolaris.K&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vishwap","files":1,"time":1245011800,"description":"Solaris Internals, Second Edition: Solaris 10 and OpenSolaris Kernel Architecture\nBy Richard McDougall and Jim Mauro\nSecond edition, 1072 pages\nISBN 0131482092\n\nDescription\n\n&quot;The Solaris Internals volumes are simply the best and most comprehensive treatment of the Solaris (and OpenSolaris) Operating Environment. Any person using Solaris--in any capacity--would be remiss not to include these two new volumes in their personal library. With advanced observability tools in Solaris (like DTrace), you will more often find yourself in what was previously unchartable territory. Solaris Internals, Second Edition, provides us a fantastic means to be able to quickly understand these systems and further explore the Solaris architecture--especially when coupled with OpenSolaris source availability.&quot;\n--Jarod Jenson, chief systems architect, Aeysis\n\n&quot;The Solaris Internals volumes by Jim Mauro and Richard McDougall must be on your bookshelf if you are interested in in-depth knowledge of Solaris Operating System internals and architecture. As a senior Unix engineer for many years, I found the first edition of Solaris Internals the only fully comprehensive source for kernel developers, systems programmers, and systems administrators. The new second edition, with the companion performance and debugging book, is an indispensable reference set, containing many useful and practical explanations of Solaris and its underlying subsystems, including tools and methods for observing and analyzing any system running Solaris 10 or OpenSolaris.&quot;\n--Marc Strahl, senior Unix engineer\n\nSolaris Internals, Second Edition, describes the algorithms and data structures of all the major subsystems in the Solaris 10 and OpenSolaris kernel. The text has been extensively revised since the first edition, with more than 600 pages of new material. Integrated Solaris tools and utilities, including DTrace, MDB, kstat, and the process tools, are used throughout to illustrate how the reader can observe the Solaris kernel in action. The companion volume, Solaris Performance and Observability Tools, extends the examples contained here, and expands the scope to performance and behavior analysis.\n\nCoverage includes\n\n    * Virtual and physical memory\n    * Processes, threads and scheduling\n    * File system framework and UFS implementation\n    * Networking: TCP/IP implementation\n    * Resource management facilities and zones\n\nThis text, along with the companion volume, Solaris Performance and Observability Tools, make a superb reference for anyone using Solaris 10 and OpenSolaris.\n","torrent":{"xt":"urn:btih:f2bd425687c4631af8657570871623d2df7602a6","amp;dn":"Prentice.Hall.PTR.Solaris.Internals.Solaris.10.and.OpenSolaris.K","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bd425687c4631af8657570871623d2df7602a6","infoHashBuffer":{"type":"Buffer","data":[242,189,66,86,135,196,99,26,248,101,117,112,135,22,35,210,223,118,2,166]},"announce":[],"urlList":[]}}