{"title":"Railworks TS2014 Just trains ","uid":9897656,"size":468225,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f338da10e60e0735b4049643c437cef601601ac1&amp;dn=Railworks+TS2014+Just+trains+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tygn547","files":-1,"time":1396731785,"description":"SCENARIOS\n \n[SRS ] Intermodal Unload\nYour job this morning is to bring this loaded container train round to the container yard and unload before running round the wagons ready for the next duty.\n \nDuration: 20 minutes\n \n\n[SRS 2] Wagon Repairs\nAfter loading and unloading, one of the wagons has been noted as faulty so needs removing from the consist and taking to the depot for repair.\n \nDuration: 40 minutes\n \n\n[SRS ] Tea Time\n70018 has failed in the main yard.  Run up and collect the loco and its train before delivering the TEA wagons to the petroleum yard and then bring 70018 back to the depot.\n \nDuration: 25 minutes\n \n\n[SRS 4] Wood Stone\nAfter having taken a break, it's now time to run some empty MJA wagons up to the wood yard for loading.\n \nDuration: 20 minutes\n \n\n[SRS 5] Tanks Away\nRun down to the petroleum yard and collect some TEA wagons before running them up to Hedborough Yard where you will run round ready for another driver to take the train away from the area.\n \nDuration: 30 minutes\n \n\n[SRS 6] Container Swap \nTake a rake of container wagons to one of the container yards then return with another set of container wagons from the other container yard.\n \nDuration: 25 minutes\n \n\n[SRS 7] Trafford Park 'Liner'\nIt's just after the morning rush and you are currently waiting on Reading West Curve for a path through to Oxford. It's wet and cold, but your freightliner service still needs to get through. As soon as you get a path you may proceed towards Didcot and through to Oxford.\n \nDuration: 45 minutes\n \n\n[SRS 8] Hinksey Empties\nTake a rake of empty MJA wagons from Hinksey Yard to Tilehurst where another driver is waiting to take the train down to Westbury.\n \nDuration: 40 minutes\n \n\n[SRS 9] First Stock Moves\nTaking over at Reading, you are to take a stock move hauled by a Freightliner 70 to St Philips Marsh depot in Bristol. You are routed via Swindon with your train this evening.\n\n \n[SRS 10] Didcot Power Station Farewell Railtour \nWith 70029 having just arrived into Didcot Parkway platform 4, you are to couple to the rear and haul the entire train on a circuit of Didcot Power Station.\n \nDuration: 15 minutes\n \n\nBONUS SCENARIOS FOR TOTHAM\n \n[SRS] FLB1 Foreley Tanks \nYour tanks have been loaded and you are now ready to depart for Theale with loaded TEA wagons. You will take the service as far as Axford where another driver will take over.\n \nDuration: 30 minutes\n \n\n[SRS] FLB2 Royton Containers\nTake over your train at Axford from a driver who has run out of hours and continue the train through to Royton container terminal where you will swap and take a pre-loaded rake of containers forward to Portsbridge Central where another driver is waiting to take the train forward.\n \nDuration: 30 minutes\n\n\n\nsystem Requirements:\n\nTrain Simulator 2013\nClass 70\nClass 66 v2\nEuropean Asset Pack\nGreat Western Main Line (Oxford - Paddington) and Hedborough North routes.\nTotham route is required if you wish to drive the bonus scenarios\n\nNote: These scenarios need a selection of default Train Simulator and payware routes, so please check the System Requitements below to ensure that you have the required routes to run these scenarios correctly\n\nENJOY GUYS AND SEEED PLS!!!!","torrent":{"xt":"urn:btih:f338da10e60e0735b4049643c437cef601601ac1","amp;dn":"Railworks+TS2014+Just+trains+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f338da10e60e0735b4049643c437cef601601ac1","infoHashBuffer":{"type":"Buffer","data":[243,56,218,16,230,14,7,53,180,4,150,67,196,55,206,246,1,96,26,193]},"announce":[],"urlList":[]}}