{"title":"Railworks TS2014 Just Trains CRH380D High Speed Train","uid":10046405,"size":24187830,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f350e2c2b574baf16a7d7aaef1deef8ccc486c2d&amp;dn=Railworks+TS2014+Just+Trains+CRH380D+High+Speed+Train&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"tygn547","files":-1,"time":1398537100,"description":"High-speed Chinese rail services were first introduced in 2007 and operated with existing CRH (China Railways) rolling stock running on existing lines which had been upgraded for speeds of up to 250 km/h (160 mph) and on newer dedicated high-speed track rated up to 350 km/h (220 mph).\n\nThe CRH380D is the newest generation of Chinese high speed train, capable of running at 380km/h and one of the fastest production trains in the world. In service with China Railways these trains have been designated as CRH380D (8-car set) &amp; CRH380DL (16-car set) using the new numbering system.\n\nIn September 2009, Bombardier announced an order for eighty Zefiro 380 high-speed trains by the Chinese Ministry of Railways (MOR) to be produced at Bombardier's joint venture Sifang (Qingdao) Transportation Ltd. \n\nThe CRH380D uses state-of-the-art flat-screen glass panels to display train information as well as the route speed and signal data from suitably equipped routes. It can be driven manually or by using the on-board computers which mean you need to do little more than adjust the cruise control to comply with the speed limits between your departure and destination stations.\n\nThe CRH380D has been developed for and interacts with the speed and signalling system included in the Chengdu-Suining High Speed Route, also available from Just Trains by Download or included in a money-saving Bundle with this loco.  \n\nHighly detailed models\nAuthentic custom sounds\nDetailed passenger view\nDetailed state-of-the-art driver's cab\nAdjustable Cruise Control\nFlat screen in-cab displays that show next signal aspect, distance to next signal, next speed limit and distance to it on suitably equipped routes, along with information about acceleration and deceleration forces to allow greater customer comfort, cruise control speed set, brake pressures, door status, pantograph operation and much more\nOperational speed monitor\nAudible alerts for driver vigilance, overspeed and more\nRealistic and definable train service number display on the exterior of the cars set from the drivers cab\nCan be driven in 8-car or 16-car set configurations\nRed flashing tail light as per the real train\nLight lens flare effects\nRain effects on windscreen and carriage windows\nQuick Drive enabled\n\nSCENARIOS\n\nThe CRH380D train comes with a set of scenarios designed to be used with the Chengdu-Suining route (available to purchase separately) or it can be used via the Quick Drive option in Train Simulator.\n\nStandard scenarios\n\nJT CRH380D - Dawn Service\nDrive service G01 from Chengdu to Suining before returning with G02 as far as JiJin.\n\nJT CRH380D - Evening Rescue\nA CRH1A stopping service has broken down at JiJin, you will tow the failed train to Suining, calling at all stations en route.\n\nJT CRH380D - Morning Service\nDrive service G01 from Suining to Chengdu on a bright summer morning in 2014.\n\nJT CRH380D - Night Express\nDrive Service G21 from Chengdu to JiJin before returning with service G22 to Chengdu. You will call at all stations en route. \n\n\nFree Roam scenarios\n\nTwo Free Roams are provided so you can drive the CRH380D and explore the Chengdu- Suining Route at your leisure. These are found in the Drive&gt;Free Roam section of the TS2014 interface.\n\nChengdu Free Roam \nClick on a train and take it for a drive!\n\nSuining Free Roam\nClick on a train and take it for a drive!\n\n\nQuick Drive scenario\n\nThe CRH380D is Quick Drive-enabled and can be driven on any suitable Quick Drive-enabled route of your choice \n\n\nENJOYYYYYYYYYYYY AND SEEEDDDDDDDDDDDD!!!!","torrent":{"xt":"urn:btih:f350e2c2b574baf16a7d7aaef1deef8ccc486c2d","amp;dn":"Railworks+TS2014+Just+Trains+CRH380D+High+Speed+Train","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f350e2c2b574baf16a7d7aaef1deef8ccc486c2d","infoHashBuffer":{"type":"Buffer","data":[243,80,226,194,181,116,186,241,106,125,122,174,241,222,239,140,204,72,108,45]},"announce":[],"urlList":[]}}