{"title":"Marco Polo - Miniserie - DVD 3 - TBS (The Interceptor - 1982)","uid":6319297,"size":4683637673,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f40cb8d30af3dd75b8d8b42b0cbc2f0c0a2e7d39&amp;dn=Marco+Polo+-+Miniserie+-+DVD+3+-+TBS+%28The+Interceptor+-+1982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"SAIMOR","files":-1,"time":1302809377,"description":"*************************************************************************\nItaliÃƒÂ«\nAvontuur/Drama\n270 Minuten (Miniserie, 3 delen) / 450 Minuten (DVD-Versie).\n\nRegisseur: Giuliano Montaldo.\nmet Denholm Elliott, Ken Marshall en Burt Lancaster. \n\nBeschrijving:\n\nMarco Polo (1254-1324) / De Ontdekking Van Het Verre Oosten. \n \nKoopman en ontdekkingsreiziger uit VenetiÃƒÂ« die beroemd is geworden door zijn reizen naar het Verre Oosten. \nHij was de eerste Europese beschrijver van het Verre Oosten.\nMarco Polo wordt op 15 september geboren. \nZijn vader NicolÃƒÂ² Polo vertrekt rond 1260 samen met zijn broer Matteo naar China en keert in 1269 terug met het verzoek van de Mongool Koebilai (1214-1294) aan de paus om missionarissen naar het gebied te zenden. \nIn 1271 vertrekken NicolÃƒÂ² en Matteo opnieuw naar China. \nDe nog jonge Marco Polo gaat dit keer mee.\nHet gezelschap reist via Bagdad naar de Perzische golf, van Oermoez uit dwars door PerziÃƒÂ« naar de Boven-Oxus en over Pamir voorbij het dorp Lom-Nor, naar de stad Cambalig (Peking). \nMarco Polo valt hier in de gunst van de groot-chan Koebilai en maakt namens de Mongolen-leider verschillende reizen, onder meer naar Tibet, Burma en Tsjamba. \nVan 1282 tot 1285 is Marco Polo zelfs gouverneur van de grote stad Sangui (Nanking).\nNa zeventien jaar krijgt Marco Polo toestemming uit het gebied te vertrekken. \nIn 1295 keert hij, als rijk man, terug in VenetiÃƒÂ«. \nDe terugreis liep via de Zuidchinese Zee, Sumatra, Java, de Straat van Malakka, Ceylon (Sri-Lanka), naar Ormoez. \nHier gingen de Polo's aan land. Via ArmeniÃƒÂ«, Trebizonde en Constantinopel bereikten ze uiteindelijk VenetiÃƒÂ«.\nVan september 1298 tot juli 1299 zit Marco Polo gevangen, nadat Genuezen de Venetianen bij Curzola hebben verslagen. \nIn zijn cel heeft Polo alle tijd. \nHij dicteert het verhaal van zijn verre reizen aan celgenoot Rustichello van Pisa, die de verhalen in het Frans opschrijft. \nHet werk wordt bekend onder de naam Il Milione of 'Boek der miljoenen wonderen'.\nDe beschrijving van de reizen van Marco Polo waren van grote waarde voor de Europeanen die tot op dat moment nog bijna niets wisten over AziÃƒÂ«. \nBekend is dat de beroemde ontdekkingsreiziger Columbus zich door het boek liet inspireren.\nSommige geschiedkundigen betwijfelen of Marco Polo de reizen zoals die staan beschreven in het boek wel gemaakt heeft. \nSommigen menen dat hij nooit verder is gekomen dan PerziÃƒÂ« en de informatie over de verder gelegen streken daar via horen zeggen opdeed. \n\n*************************************************************************\nUitvoering   : 3 X DVD / Speelduur 270:00 Minuten.\nBeeldformaat : 4:3 Full Frame (1:33:1).\nKleur \t    : Color.\nRegio \t    : 2.\nTaal         : Engels.\nAudio \t    : Dolby Stereo 2.0.\nOndertiteling: Nederlands. \n\n*************************************************************************\nItaly \nAdventure/Drama \n270 Minutes (Mini Series 3 Parts) / 450 Minutes (DVD Version). \n\nDirector: Giuliano Montaldo. \nwith Denholm Elliott, Ken Marshall and Burt Lancaster. \n\nDescription: \n\nMarco Polo (1254-1324) / The Discovery Of The Far East. \n  \nVenetian merchant and explorer who became famous through his travels to the Far East.\nHe was the first European describer of the Far East. \nMarco Polo is born on September 15. \nHis father NicolÃƒÂ² Polo leaves around 1260 with his brother Matteo returns to China in 1269 and returned with the request of the Mongolian Koebilai (1214-1294) to the pope to send missionaries to the area.\nNicolÃƒÂ² Matteo leave in 1271 and returned to China. \nThe young Marco Polo, this once. \nThe group travels through Baghdad to the Persian Gulf, from Persia to Oermoez from across the Upper Oxus and Pamir past the village of Lom-Nor, to the city Cambalig (Beijing).\nMarco Polo is here in the favor of big-chan Koebilai and on behalf of the Mongols leader makes several trips, including to Tibet, Burma and Tsjamba.\nFrom 1282 to 1285, Marco Polo even governor of the city Sangui (Nanking). \nAfter seventeen years Marco Polo get permission from the area to leave. \nIn 1295 he returned as a rich man, back in Venice. \nThe return trip went through the South China Sea, Sumatra, Java, the Straits of Malacca, Ceylon (Sri Lanka), to Ormoez.\nThis is where the Polos on land. Via Armenia, Constantinople and Trebizond finally they reached Venice.\nFrom September 1298 until July 1299 Marco Polo is caught after Genoese defeated the Venetians at Curzola.\nPolo in his cell all the time. \nHe dictates the story of his extensive travel to Rustichello cellmate of Pisa, who write the stories in French.\nThe work is known Milione or &quot;Book of millions of miracles. \nThe description of the travels of Marco Polo were of great value to the Europeans who until then knew almost nothing about Asia.\nIt is known that the famous explorer Columbus was inspired by the book. \nSome historians doubt whether Marco Polo journeys which are described in the book is made.\nSome believe that he never went beyond Persia and the information about the area further it gained through hearsay.\n\n*************************************************************************\nDesign      : 3 X DVD / Length 270:00 Minutes.\nAspect ratio: 4:3 Full Frame (1.33:1).\nColor       : Color.\nRegion      : 2.\nLanguage    : English.\nAudio       : Dolby Stereo 2.0.\nSubtitles   : Dutch.\n\n**************************************************************************\nSAIMOR/ROMIAS (The Interceptor)\n\n\nHash: F40CB8D30AF3DD75B8D8B42B0CBC2F0C0A2E7D39\n\n**************************************************************************\nBeste mensen;\n\nProbeer zolang mogelijk te seeden zodat een ander ook mee kan genieten !!!!!!!!\n\nBedankt namens SAIMOR/ROMIAS (The Interceptor).\n\nDear People;\n\nTry to seed as long as possible so that another may enjoy it too !!!!!!!!\n\nThanks on behalf SAIMOR/ROMIAS (The Interceptor).\n\n***************************************************************************","torrent":{"xt":"urn:btih:f40cb8d30af3dd75b8d8b42b0cbc2f0c0a2e7d39","amp;dn":"Marco+Polo+-+Miniserie+-+DVD+3+-+TBS+%28The+Interceptor+-+1982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f40cb8d30af3dd75b8d8b42b0cbc2f0c0a2e7d39","infoHashBuffer":{"type":"Buffer","data":[244,12,184,211,10,243,221,117,184,216,180,43,12,188,47,12,10,46,125,57]},"announce":[],"urlList":[]}}