{"title":"Sheila Skemp - The Making of a Patriot. Benjamin Franklin at the","uid":10411971,"size":4675980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f447af7971d770c9e4ff2f9c53c7c9a5e6ba4852&amp;dn=Sheila+Skemp+-+The+Making+of+a+Patriot.+Benjamin+Franklin+at+the&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Anette14","files":-1,"time":1403551569,"description":"Description\nProduct Details\nBook Title: The Making of a Patriot: Benjamin Franklin at the Cockpit (Critical Historical Encounters)\t\nBook Author: Sheila Skemp\nSeries: Critical Historical Encounters\nPaperback: 208 pages\nPublisher: Oxford University Press; 1 edition (July 15, 2013)\nLanguage: English\nISBN-10: 0195386566\nISBN-13: 978-0195386561\n\n===================================================================================\nBook Description\nPublication Date: July 15, 2013 | ISBN-10: 0195386566 | ISBN-13: 978-0195386561 | Edition: 1\nOn January 29, 1774, Benjamin Franklin was called to appear before the Privy Council--a select group of the king's advisors--in an octagonal-shaped room in Whitehall Palace known as the Cockpit. Spurred by jeers and applause from the audience in the Cockpit, Solicitor General Alexander Wedderburn unleashed a withering tirade against Franklin. Though Franklin entered the room as a dutiful servant of the British crown, he left as a budding American revolutionary. In The Making of a Patriot, renowned Franklin historian Sheila L. Skemp presents an insightful, lively narrative that goes beyond the traditional Franklin biography--and behind the common myths--to demonstrate how Franklin's ultimate decision to support the colonists was by no means a foregone conclusion. In fact, up until the Cockpit ordeal, he was steadfastly committed to achieving &quot;an accommodation of our differences.&quot;\nThe Making of a Patriot sheds light on the conspiratorial framework within which actors on both sides of the Atlantic moved toward revolution. It highlights how this event ultimately pitted Franklin against his son, suggesting that the Revolution was, in no small part, also a civil war.\n\n===================================================================================\nReviews\n&quot;Using a single incident as a point of departure--Benjamin Franklin's humiliation by the Privy Council in 1774--Sheila Skemp explores how and why Franklin came to renounce his allegiance to the King in order to become one of the foremost proponents of American independence. Through her incisive examination of Frankli''s personal and political struggles, Skemp sheds light on the intellectual choices and painful decisions that were necessary for those who came to support the American cause.&quot;--Rosemarie Zagarri, George Mason University, author of Revolutionary Backlash: Women and Politics in the Early American Republic\n\n&quot;Once again Sheila Skemp demonstrates her unique ability to illustrate the long-term consequences of an isolated incident through a single individual. This time the person is Benjamin Franklin and the critical moment is the withering tongue lashing he received at the Cockpit. As she skillfully contextualizes the events preceding and following that scathing interview in a highly readable narrative, Skemp makes a compelling case for Franklin's disenchantment with England and the development of his American identity.&quot;--Elaine Forman Crane, Fordham University\n\n&quot;Sheila Skemp's lively and immensely informative book is full of insights into both leading individuals and politics, balancing a crucial event and the actions and intentions that shaped it. Her Franklin is a good politician, not a perfect one; she writes to understand rather than to celebrate. Her narrative highlights contingency while bringing together many themes of recent scholarship.&quot;--David Waldstreicher, Temple University, author of Runaway America: Benjamin Franklin, Slavery and the American Revolution\n\n===================================================================================\nAbout the Author\nSheila L. Skemp is the Clare Leslie Marquette Professor of American History at the University of Mississippi.\n===================================================================================","torrent":{"xt":"urn:btih:f447af7971d770c9e4ff2f9c53c7c9a5e6ba4852","amp;dn":"Sheila+Skemp+-+The+Making+of+a+Patriot.+Benjamin+Franklin+at+the","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f447af7971d770c9e4ff2f9c53c7c9a5e6ba4852","infoHashBuffer":{"type":"Buffer","data":[244,71,175,121,113,215,112,201,228,255,47,156,83,199,201,165,230,186,72,82]},"announce":[],"urlList":[]}}