{"title":"RE: Vision Effects plug-ins (11 in 1) for AfterEffects CS5 ","uid":7151028,"size":156298068,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f4b9a9494940b016ce99e153485a51c493369121&amp;dn=RE%3A+Vision+Effects+plug-ins+%2811+in+1%29+for+AfterEffects+CS5+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"mdusanjay","files":11,"time":1333310713,"description":"The Company RE: Vision Effects released updates for all of their plugin for Adobe After Effects. Added support for products Adobe CS5.5. Issued the following update: DE: Noise 2.0.2, FieldsKit 3.0, PV Feather 1.0, RE: Fill v2.0.2, RE: Flex 4.0., RE: Map v2.0, ReelSmart Motion Blur 4.0., Shade / Shape 4.0, SmoothKit 3.0., Twixtor 5.0., Video Gogh v3.5 ..\n\nRE: Vision FX PV Feather - plug-in for After Effects, designed to work with masks, offers better control of the angle cut into After Effects for quite a short time. PV Feather starts regulating the use of inner mask for filling, and the outer mask to control the cut. The distance between the inner and outer mask controls the amount of cut. PV Feather uses built-in mask splines, AE, so there is no need to learn a new spline interface.\n\nREVisionFX RE: Fill - Plugin for After Effects, Premiere Pro, and others, designed to recover the missing pixels in video images, and dynamic, offering several ways to edit by moving the nearest &quot;good&quot; pixel, mirroring them, copying from another area, etc. d. RE: Fill can help hide the flaws of any professional image.\n\nRE: Vision FX Shade / Shape - Plugin for After Effects, Premiere Pro, Combustion, Boris Red, and others, designed to transform the flat objects in 3D-model, giving the images of the scope and depth, using technology shading-from-shape, designed RE: Vision.\n\nREVisionFX FieldsKit - Plugin for After Effects, Premiere Pro, Final Cut Pro, Combustion and Fusion, designed to vysokourovnego deinterlasinga. Interlacing (the effect of &quot;comb&quot;) - is the negative effect that occurs when you digitize the analog video signal. Deinterlacing is the reverse process of restoring the video image in order to minimize the effect of &quot;comb&quot;.\n\nREVisionFX RE: Flex - Plugin for After Effects, Shake, Autodesk Systems (Sparks), Combustion and Fusion, designed to morph, create visual effects, transformations and distortions in video images. Supports automatic and manual transformation uses the tools of rotoscoping (drawing and overlay masks for multi-track without the use of nodal points) of the main program. Has a simple, easily mastered the interface.\n\nREVisionFX DE: Noise - Plugin for After Effects, Premiere Pro, Combustion, Boris Red, and others, designed to remove noise from video. Removes noise such as digital (caused by poor lighting), film grain, caused by the ray tracing rendering artifacts, fingerprints and traces of dust (captured during scanning) and many other types of noise.\n\nREVisionFX ReelSmart Motion Blur - plug-in programs for After Effects, Premiere Pro, Combustion, Final Cut Pro, Boris Red, and others, with a very precise process control filtering for high-quality images, automatically tracks every point in the video series, allows you to control the process tracking pixels, which reduces the percentage of incorrect Blur when they overlap.\n\nwww.revisionfx.com","torrent":{"xt":"urn:btih:f4b9a9494940b016ce99e153485a51c493369121","amp;dn":"RE%3A+Vision+Effects+plug-ins+%2811+in+1%29+for+AfterEffects+CS5+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4b9a9494940b016ce99e153485a51c493369121","infoHashBuffer":{"type":"Buffer","data":[244,185,169,73,73,64,176,22,206,153,225,83,72,90,81,196,147,54,145,33]},"announce":[],"urlList":[]}}