{"title":"Akiko Tsuruga - 3 Albums - Jazz Organ","uid":5600189,"size":302039322,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f5aae64c63f17dc6a7153b12128c8d5b59a0fd1d&amp;dn=Akiko+Tsuruga+-+3+Albums+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1275260978,"description":"Akiko Tsuruga - 3 Albums - Jazz Organ\n\nAkiko Tsuruga is a jazz organist from Osaka, Japan. A graduate of the Osaka College Of Music, she has resided in New York since 2001.\n\nAkiko began organ lessons at age three, and started to performing professionally throughout Japan after graduating from Osaka College Of Music. While performing in Japan, she encountered and played with many noted American musicians as Roy Hargrove, Jeff 'Tain' Watts and Grady Tate, to name a few. Grady Tate has been most influential in her career. He played on her debut CD, 'Harlem Dreams' and encouraged her to move to New York.\n\nAfter arriving in New York Akiko established herself as one of area's top organists. Her trio has been working many jazz nightclubs, private parties and summer outdoor concerts. \n\nList of included albums:\n2003 Harlem Dreams\n2006 Sweet And Funky \n2007 St. Louis Blues\n\n----------\n\nMP3 format. All songs are tagged by the book.\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------","torrent":{"xt":"urn:btih:f5aae64c63f17dc6a7153b12128c8d5b59a0fd1d","amp;dn":"Akiko+Tsuruga+-+3+Albums+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5aae64c63f17dc6a7153b12128c8d5b59a0fd1d","infoHashBuffer":{"type":"Buffer","data":[245,170,230,76,99,241,125,198,167,21,59,18,18,140,141,91,89,160,253,29]},"announce":[],"urlList":[]}}