{"title":"Survivors (2008) S01E02 [BBC One] [H.264] [Frank_UK].mp4","uid":4534207,"size":451428895,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f5e661fe56b2e80ced6282b8002bf80c0993da28&amp;dn=Survivors+%282008%29+S01E02+%5BBBC+One%5D+%5BH.264%5D+%5BFrank_UK%5D.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"Frank_UK","files":1,"time":1227674852,"description":"Survivors (2008) - Series 1 - Episode 2\n\nBBC One - 25 November 2008\n\nImagine being the only survivor of a disease that kills every member of your family, that kills lovers, strangers, friends, nearly everyone you&amp;#039;ve ever met.\n\nYou are among the lonely few to live and now you must start over in a strange new world where everything that was once safe and familiar is now strange and dangerous.\n\nSet in the present day, Survivors focuses on the world in the aftermath of a devastating virus which wipes out most of the world&amp;#039;s population. What would we do? How would any of us cope in a brave new world where all traditional 21st Century comforts - electricity, clean running water, advanced technology - have disappeared?\n\nThese are the questions faced by the bewildered but resilient group of survivors at the centre of the drama. It is an opportunity for new beginnings, but with no society, no police and no law and order, they now face terrible dangers - not just the daily struggle for food and water but also the deadly threat from other survivors.\n\n&quot;Survivors is about what it means to be human,&quot; explains writer and executive producer Adrian Hodges. &quot;It asks questions about our nature and confronts us with our deepest fears. When everything else is stripped away, would we band together and find the best in ourselves, or would we fall apart and retreat into barbarism and savagery? Survivors is about adventure, fear, love, loyalty and friendship. But above all, it&amp;#039;s about new hope.&quot;\n\nSurvivors, by Adrian Hodges is a re-imagining of the classic 1970s BBC drama series which was based on the novel by Terry Nation. It launched in April 1975 and ran for 38 episodes over three series.\n\nAspect Ratio: 720 x 576 : 16:9 Anamorphic Widescreen\n\nVideo: H.264 High Profile : 1000kbps 25fps : 2 Pass Encoded\n\nAudio: AAC-HE V2 48000Hz 32kbps ABR Parametric Stereo\n\nMD5 Checksum: 7CA9FE69F7A02081162D634A93981C8B\n\n[Frank_UK]","torrent":{"xt":"urn:btih:f5e661fe56b2e80ced6282b8002bf80c0993da28","amp;dn":"Survivors+%282008%29+S01E02+%5BBBC+One%5D+%5BH.264%5D+%5BFrank_UK%5D.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e661fe56b2e80ced6282b8002bf80c0993da28","infoHashBuffer":{"type":"Buffer","data":[245,230,97,254,86,178,232,12,237,98,130,184,0,43,248,12,9,147,218,40]},"announce":[],"urlList":[]}}