{"title":"The Sensational Alex Harvey Band - Next [1973] [FLAC]","uid":8044494,"size":250249287,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f66490a67da0d9c961d1df0451216faf1c1e558c&amp;dn=The+Sensational+Alex+Harvey+Band+-+Next+%5B1973%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"dickspic","files":10,"time":1358716422,"description":"01. Swampsnake (4:52)\n02. Gang Bang (4:44)\n03. The Faith Healer (7:09)\n04. Giddy-Up-A-Ding-Dong (3:14)\n05. Next (4:01)\n06. Vambo Marble Eye (4:16)\n07. The Last Of The Teenage Idols (7:15)\n\n&quot;After making an impressive and promising debut with Framed, the Sensational Alex Harvey Band perfected their unique, glam-inspired fusion of hard rock and cabaret styles on Next. It also happens to be their best-sounding album thanks to the efforts of Phil Wainman, a producer best known for his work as a bubblegum-pop svengali to the likes of Sweet and the Bay City Rollers. Wainman puts the band's sound over the top by adding a sense of studio polish that fleshes out their odd combination of styles without taking away from the music's sense of rock and roll power. The result is an album that has all the muscle of a good hard-rock recording but tempers its bombast with a sense of big-production depth and clarity that brings outs the band's tight musicianship. Next also produced the Sensational Alex Harvey Band's first hit single with &quot;Faith Healer,&quot; the creepy tale of a religious con artist that blends an intense vocal from Harvey with a thunderous, guitar-driven wall of sound production. Other standout moments include the title track, a frenzied reading of a ribald Jacques Brel tune that effectively pits Harvey's anguished wail against lovely orchestrations, and &quot;The Last Of The Teenage Idols,&quot; an autobiographical exploration of Harvey's travails in the music business that shows off the band's versatility through an arrangement that encompasses hard rock, big-band soul, and even doo-wop. To sum up, Next is one of the true high points of the English glam-rock boom and required listening for anyone with an interest in Alex Harvey's music.&quot;\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:f66490a67da0d9c961d1df0451216faf1c1e558c","amp;dn":"The+Sensational+Alex+Harvey+Band+-+Next+%5B1973%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f66490a67da0d9c961d1df0451216faf1c1e558c","infoHashBuffer":{"type":"Buffer","data":[246,100,144,166,125,160,217,201,97,209,223,4,81,33,111,175,28,30,85,140]},"announce":[],"urlList":[]}}