{"title":"private_dancer.pdf","uid":4261052,"size":1048569,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6856d5ab8c11a0ebbe2c7a365e4da8a70875994&amp;dn=private_dancer.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"realdexter","files":1,"time":1214439827,"description":" &lt;a href=&quot;http://www.stephenleather.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.stephenleather.com/&lt;/a&gt;\n\nLove, Lies and Death in the Land of Smiles\n\n&quot;I don&amp;#039;t know if it was love at first sight, but it was pretty close. She had the longest hair I&amp;#039;d ever seen, jet black and almost down to her waist. She had soft brown eyes that made my heart melt, long legs that just wouldn&amp;#039;t quit and a figure to die for. She was naked except for a pair of black leather ankle boots with small chrome chains on the side. I think it was the boots that did it for me.&quot;\n\nPrivate Dancer, the on-line cult novel chronicling the disastrous relationship between a travel writer and a Bangkok bargirl, is finally available in print. The on-line version of the novel, written by best-selling thriller writer Stephen Leather, has been downloaded more than sixty thousand times over the past five years. Now Leather has decided to publish the book in Thailand.\n\nThe novel is set in Thailand in 1996.Pete, a young travel writer, wanders into a Bangkok bar and meets the love of his life.Pete thinks that Joy is the girl of his dreams: young, stunningly pretty, and one of the top-earning go-go dancers in Nana Plaza. What follows is a roller-coaster ride of sex, drugs, lies and murder, as Pete discovers that his very own private dancer is not all that she claims to be. And that far from being the girl of his dreams, Joy is his own personal nightmare.\n\nOften described as the best book ever written about the Bangkok bar scene, Private Dancer has been a huge hit around the world, and has been downloaded in more than forty countries.\n\n&quot;I have been getting dozens of emails a week asking for the novel to be published, as most people seem to prefer a book they can hold, and put on their shelves,&quot; said Leather. &quot;Now that the whole bar scene here is changing, it seemed a good time to finally publish a hard copy.&quot;\n\nThe striking cover photograph, of a naked girl holding a cut-throat razor behind her back, was taken in Anglewitch Bar in Nana Plaza and features one of the bar?s top showgirls.\n\nLeather, a frequent visitor to the Land of Smiles, is the author of seventeen thrillers that have been translated into more than a dozen languages, including The Tunnel Rats, set in Bangkok and Vietnam, and The Solitary Man, set in Thailand and Hong Kong. He has sold more than a million books worldwide. Two of his novels, The Bombmaker and The Stretch, have been filmed for television in the UK and he has written for TV shows such as London?s Burning and the BBC?s Murder In Mind.","torrent":{"xt":"urn:btih:f6856d5ab8c11a0ebbe2c7a365e4da8a70875994","amp;dn":"private_dancer.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6856d5ab8c11a0ebbe2c7a365e4da8a70875994","infoHashBuffer":{"type":"Buffer","data":[246,133,109,90,184,193,26,14,187,226,199,163,101,228,218,138,112,135,89,148]},"announce":[],"urlList":[]}}