{"title":"Emile Ajar (Romain Gary) - Momo (The Life Before Us) (pdf)","uid":10153422,"size":2601975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f73869657aebab816cb063ec4729e4495b4687d7&amp;dn=Emile+Ajar+%28Romain+Gary%29+-+Momo+%28The+Life+Before+Us%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1400126057,"description":"Emile Ajar (Ralph Manheim, trans.) - Momo (Doubleday, 1978). 182 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis book was first published in France in 1975 as La vie devant soi, by Emile Ajar, and it won the Prix Goncourt. In 1978 it was first published in English as Momo, by the same author. The author's identity was later revealed as Romain Gary, and the later editions of the book in English have been published as The Life Before Us, by Romain Gary.\n\nAnd if that's not confusing enough, the book was adapted into a film called Madame Rosa in 1977, and some editions are entitled Madame Rosa.\n\n\ndescription:\n\nThe Life Before Us is the story of an orphaned Arab boy, Momo, and his devotion to Madame Rosa, a dying, 68-year-old, 220-lb. survivor of Auschwitz and retired &quot;lady of the night.&quot;\n\nMomo has been one of the ever-changing ragbag of whores' children at Madame Rosa's boardinghouse in Paris ever since he can remember. But when the check that pays for his keep no longer arrives and as Madame Rosa becomes too ill to climb the stairs to their apartment, he determines to support her any way he can.\n\nThis sensitive, slightly macabre love story between Momo and Madame Rosa has a supporting cast of transvestites, pimps, and witch doctors from Paris's immigrant slum, Belleville. Profoundly moving, The Life Before Us earned France's premier literary prize, the Prix Goncourt.\n\n","torrent":{"xt":"urn:btih:f73869657aebab816cb063ec4729e4495b4687d7","amp;dn":"Emile+Ajar+%28Romain+Gary%29+-+Momo+%28The+Life+Before+Us%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f73869657aebab816cb063ec4729e4495b4687d7","infoHashBuffer":{"type":"Buffer","data":[247,56,105,101,122,235,171,129,108,176,99,236,71,41,228,73,91,70,135,215]},"announce":[],"urlList":[]}}