{"title":"Bio- and Bioinspired Nanomaterials - D. Ruiz-Molina et al.","uid":15388096,"size":11154327,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7909e1cdaa04f21ca67cdcff16aeb8f4165819c&amp;dn=Bio-+and+Bioinspired+Nanomaterials+-+D.+Ruiz-Molina+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"clouderone","files":1,"time":1469307470,"description":"Bio- and Bioinspired Nanomaterials - D. Ruiz-Molina et al. (Wiley-VCH, 2015).pdf\r\n\r\nA comprehensive overview of nanomaterials that are inspired by or targeted at biology, including some of the latest breakthrough research. Throughout, valuable contributions from top-level scientists illustrate how bionanomaterials could lead to novel devices or structures with unique properties. \r\nThe first and second part cover the most relevant synthetic and bioinspired nanomaterials, including surfaces with extreme wettability properties, functional materials with improved adhesion or structural and functional systems based on the complex and hierarchical organization of natural composites. These lessons from nature are explored in the last section where bioinspired materials are proposed for biomedical applications, showing their potential for future applications in drug delivery, theragnosis, and regenerative medicine. \r\nA navigational guide aimed at advanced and specialist readers, while equally relevant for readers in research, academia or private companies focused on high added-value contributions. Young researchers will also find this an indispensable guide in choosing or continuing to work in this stimulating area, which involves a wide range of disciplines, including chemistry, physics, materials science and engineering, biology, and medicine","torrent":{"xt":"urn:btih:f7909e1cdaa04f21ca67cdcff16aeb8f4165819c","amp;dn":"Bio-+and+Bioinspired+Nanomaterials+-+D.+Ruiz-Molina+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7909e1cdaa04f21ca67cdcff16aeb8f4165819c","infoHashBuffer":{"type":"Buffer","data":[247,144,158,28,218,160,79,33,202,103,205,207,241,106,235,143,65,101,129,156]},"announce":[],"urlList":[]}}