{"title":"David Baldacci - The Innocent - unabridged","uid":7194299,"size":176513326,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f8293aa32bd012075cc0be701f8a8f317b439c62&amp;dn=David+Baldacci+-+The+Innocent+-+unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"rmctmrx6","files":3,"time":1334741615,"description":"David Baldacci - The Innocent - unabridged 32 kbps\n\nAmerica has enemies - ruthless people that the police, the FBI, even the military can't stop. That's when the U.S. government calls on Will Robie, a stone-cold hitman who never questions orders and always nails his target.\nBut Will Robie may have just made the first - and last - mistake of his career....\nIt begins with a hit gone wrong. Robie is dispatched to eliminate a target unusually close to home in Washington, D.C. But something about this mission doesn't seem right to Robie, and he does the unthinkable: He refuses to kill. Now, Robie becomes a target himself and must escape from his own people.\nFleeing the scene, Robie crosses paths with a wayward teenage girl, a 14-year-old runaway from a foster home. But she isn't an ordinary runaway - her parents were murdered, and her own life is in danger. Against all of his professional habits, Robie rescues her and finds he can't walk away. He needs to help her.\nEven worse, the more Robie learns about the girl, the more he's convinced she is at the center of a vast cover-up, one that may explain her parents' deaths and stretch to unimaginable levels of power. Now, Robie may have to step out of the shadows in order to save this girl's life... and perhaps his own.","torrent":{"xt":"urn:btih:f8293aa32bd012075cc0be701f8a8f317b439c62","amp;dn":"David+Baldacci+-+The+Innocent+-+unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8293aa32bd012075cc0be701f8a8f317b439c62","infoHashBuffer":{"type":"Buffer","data":[248,41,58,163,43,208,18,7,92,192,190,112,31,138,143,49,123,67,156,98]},"announce":[],"urlList":[]}}