{"title":"(SWAT Tactics) High Risk Entry (.ISO dvd file and DivX video on ","uid":4407236,"size":5350286721,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f8d54e4d318d3818517951088b5cfab8ae641dd9&amp;dn=%28SWAT+Tactics%29+High+Risk+Entry+%28.ISO+dvd+file+and+DivX+video+on+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"x_DontTreadOnMe_x","files":3,"time":1222025517,"description":"Some are called SWAT Teams. Others are referred to as Special Response Teams. Some prefer being called Emergency Tactical Response units. By any name, they are the tactical units called upon to perform some of law enforcements most dangerous jobs:\n* Hostage Rescue\n* Barricaded Subjects\n* Warrant Service\n* Active Shooter Calls\n* And Most Recently, Incidents Involving Chemical Or Biological Warfare Agents\n\nExperience proves that we will react the way we are trained. That&amp;#039;s why we need to train exactly the same way we need to perform. Any unit that has high-risk entry as part of their mission needs to train in a live fire environment. Teams that do not practice live fire training disciplines are not being trained for the job they&amp;#039;ve been tasked to do.\n\nHigh Risk Entry DVD Menu #2Live Fire Training for entry teams is an important facet of cutting edge training. High Risk Entry teaches vital entry tactics using live fire exercises. The DVD format allows you to watch the program in its entirety or go directly to just the lessons you want to review. This 1 hour &amp; 45 minute tactical training DVD includes team instruction and practice in field proven tactics, techniques, and theories used in high risk entry situations, including:\n* Wall Flood\n* Penetration Flood\n* Leap Frog Techniques\n* Hallway Clearing\n* Cover Drills\n* Check Drills\n* Barricade Clearing\n* Entries With Gas Masks\n* Entries With Level &quot;A&quot; Suits\n* Two Man Entries\n* Four Man Entries\n* Live Fire Room Clearing\n\nCQB Inc founder, Chuck Habermehl is an internationally recognized expert in the field of tactical training. His law enforcement credits span more than two decades. During his career, Habermehl has served as a deputy Chief of police, firearms instructor, tactical trainer, and the Commander of a South Florida SWAT Team. He uses his expertise and experience to address the unique training needs of special operations units world wide. To date, Habermehl has spent nearly 30 years teaching tactical combat courses to police and military personnel.\n\nBoth the ISO and DivX file are in this torrent; choose which one you would like and seed. :) \n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:f8d54e4d318d3818517951088b5cfab8ae641dd9","amp;dn":"%28SWAT+Tactics%29+High+Risk+Entry+%28.ISO+dvd+file+and+DivX+video+on+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8d54e4d318d3818517951088b5cfab8ae641dd9","infoHashBuffer":{"type":"Buffer","data":[248,213,78,77,49,141,56,24,81,121,81,8,139,92,250,184,174,100,29,217]},"announce":[],"urlList":[]}}