{"title":"Walter Brueggemann - Intro to the Old Testament (pdf)","uid":8188105,"size":1473747,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8f1b1694866bf2e9236ef247bd55dd57ad585b2&amp;dn=Walter+Brueggemann+-+Intro+to+the+Old+Testament+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"pharmakate","files":-1,"time":1361769115,"description":"Walter Brueggemann and Tod Linafelt - An Introduction to the Old Testament, Second Edition (Westerminster John Knox Press, 2012). 512 pages.\n\nRetail pdf\n\nShort description:\n\nNon-fundamentalist Protestant introduction to the Old Testament, directly primarily towards seminarians and grad students. Oddly enough, the contents are arranged around the Jewish canon rather than the Christian canon.\n\nDescription:\n\nIn this updated edition of the popular textbook, Walter Brueggemann and Tod Linafelt introduce the reader to the broad theological scope of the Old Testament, treating some of the most important issues and methods in contemporary biblical interpretation. This clearly written textbook focuses on the literature of the Old Testament as it grew out of religious, political, and ideological contexts over many centuries in Israel's history. Covering every book in the Old Testament (arranged in canonical order), the authors demonstrate the development of theological concepts in biblical writings from the Torah through post-exilic Judaism. This introduction invites readers to engage in the construction of meaning as they venture into these timeless texts.\n\nAbout the Author\n\nWalter Brueggemann is William Marcellus McPheeters Professor Emeritus of Old Testament at Columbia Theological Seminary.\n\nTod Linafelt is Professor of Biblical Literature in the Theology Department at Georgetown University.","torrent":{"xt":"urn:btih:f8f1b1694866bf2e9236ef247bd55dd57ad585b2","amp;dn":"Walter+Brueggemann+-+Intro+to+the+Old+Testament+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8f1b1694866bf2e9236ef247bd55dd57ad585b2","infoHashBuffer":{"type":"Buffer","data":[248,241,177,105,72,102,191,46,146,54,239,36,123,213,93,213,122,213,133,178]},"announce":[],"urlList":[]}}