{"title":"Lisztomania (laserdisc) [1975] Ken Russell","uid":6480312,"size":1048600079,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f953eab9a3296387675cebfcea9d42a24339468f&amp;dn=Lisztomania+%28laserdisc%29+%5B1975%5D+Ken+Russell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1308444845,"description":" &lt;a href=&quot;http://bayimg.com/GAibBaAdl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GAibBaAdl&lt;/a&gt;\n\nLisztomania (1975)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0073298/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0073298/&lt;/a&gt;\n\nThis is a widescreen rip from the laserdisc release of the film, downloaded from Cinemageddon.net\n\nFROM THE UPLOADER:\n\nThis rip was made from the letterboxed LD (that would replace a heavily cropped VHS rip already on the tracker) that was upped as a DVD-r on Cinematik. Thanks to Cineleech for uploading it there. Lisztomania is not on DVD and with its bizarre, explicit content and small following isn't likely to be released any time soon. The laserdisc was framed at 2.55, but there was windowboxing, so I autocropped that as well as the non-anamorphic source, which is how autogk came up with 2.44, which looks about right. The quality  of the LD was also a bit rough, so consider that when looking at the screenshots. Also, ignore the fact that the opening Warner Brothers logo looks off, it is because it was full frame and I had to crop that too. The rest of the movie looks normal. This rip is larger and cleaner than the one I put up on Karagarga, I also encoded the 5 minutes of credits at 20% and deleted the opening FBI warning and logo, so the limited source became less of a factor. \n\n\nLisztomania is a 1975 film by Ken Russell, drawn from a biography of Franz Liszt.\n\nDepicting the flamboyant Liszt as the first classical pop star, Lisztomania features then-contemporary rock star Roger Daltrey in the leading role. The film was released the same year as Tommy, also starring Daltrey and directed by Russell. The film is derived in part from an actual &quot;kiss-and-tell&quot; book, NÃƒÂ©lida, by Marie d'Agoult, about her affair with Liszt.\n\nThe term &quot;Lisztomania&quot; was coined by the German romantic literary figure Heinrich Heine to describe the massive public response to Liszt's virtuosic piano performances. There were screaming women and concerts were often standing room only.\n\nRick Wakeman, from the progressive rock band Yes, composed the Lisztomania album soundtrack for the movie, making synthesizer arrangements of Liszt and Wagner. He also appears in the movie as the nordic god of thunder Thor. Daltrey and Russell wrote the lyrics for the songs, and Daltrey sang on the soundtrack.\n\nOther rock celebrities appear in the movie such as The Beatles' drummer Ringo Starr, who appears as the Pope.\n\nThis movie was first to use the relatively new Dolby Stereo noise reduction sound system.\n\nLisztomania is ostensibly a biographical picture of the notable 19th century composer and pianist, Franz Liszt (here played by erstwhile Who vocalist Roger Daltry). It follows his superstardom as a concert maestro, his numerous affairs, his desire to compose serious work, and his friendship with fellow radical Richard Wagner. However, Russell uses this tangible historical basis as an ever-diminishing basis for his expressionistic flourishes and barmy flights of fancy.\n\nTo rate this film with the current mode of film-reviewing method - acting, scripting, narrative coherence - would be a pointless endeavour. For the most part, Lisztomania fails as a traditional movie experience. Daltrey heads a cast that root their performances in camp and pantomime, which supports the film's absurdism, but derails its attempts at depth and complexity.\n\nEqually, the score, integral to such a musically-minded piece, is mostly fumbled, with Liszt pieces turned into elaborate musical moments (with added lyrics and vocals by Daltrey in powerful Who mode), or buried in overwrought rock-prog arrangements by Rick Wakeman.\n\nNevertheless, Lisztomania begins as an interesting twist on musical biography, with the easy-to-promote theme of Liszt as a 19th century rock star. He plays to screaming audiences who quash any attempts at original composition, who instead want to hear 'Chopsticks' over and over, which leads to a cheeky rendition of Wagner's Rienzi overture mixed with hints of that more sweet melody.\n\nThe superstar performs with a vacant grin, whilst pointing out promising beauties for his assistant to groom for that evening's post-gig recreation. There are also trippy winks to the muso-geeks in the crowd, with a whiplash-inducing scene where every notable composer of the period gets brief screen-time or a mention - from Mendelssohn, a wiry old codger, to Rossini, a fat food fetishist.\n\nHowever, Lisztomania's true form soon reveals itself. It becomes reminiscent of Italian director Federico Fellini's more indulgent films like Roma and Satyricon, where chronology, time and plotting seem elastic and uncertain, where fantasy and reality mix to dizzying degrees. However, Russell's film is much more expressionistic, with huge stylistic deviations and side-glances.\n\nOne scene, where Liszt imagines courting Russian Princess Carolyn, and giving up touring to concentrate on his music, features Daltry rodeo-riding a gigantic prosthetic penis, which is eventually guillotined. Likewise, a reflective flash-back to young Liszt's romance with his partner Marie d'Agoult is presented as a homage to Charlie Chaplin, complete with bowler hat, cane, and jerky projection speed.\n\nBut all this pales in comparison to the film's final act, which brings together distinct visual cues from Frankenstein, Dracula and Metropolis as Wagner, electric bass in hand, foretells the coming of a super-man who will forge a Germanic empire. In a development that must be seen to be believed, Liszt literally blows Vamp-Wagner away with the power of his fiery piano playing -- only for the proto-Nazi to rise from the grave at a swastika-themed funeral, now sporting a slick parting and distinctively precise moustache. Let loose in the Jewish quarter, he fires waves of bullets at shopkeepers and tradesmen from his machine gun / bass guitar combo, backed by an uncomfortably off-key synth rendition of 'Ride of the Valkyries'.\n\nIt's a peculiar sort of mindfuck, is Lisztomania. It displays the same mad visionary genius as seen in the films of Fellini, or David Lynch, but has little of the qualities of Eraserhead or 8 1/2. More of a crackpot 'experience movie', perhaps. Maybe something to project onto the wall of your hipster apartment, and enjoy with a side order of perception-altering hors d'oeuvres.\n\nOtherwise, it serves as a maddeningly uneven, at times irritating and meandering example of unfettered imagination, inexplicably (and, to Russell's credit, boldly) backed by studio money and unquestioning collaborators. But it's almost worth it, just to subject others to its moments of transcendent insanity, and watch their jaws drop open.\n\n\nDirected by Ken Russell \nProduced by Roy Baird David Puttnam \nWritten by Ken Russell \nMusic by Rick Wakeman Franz Liszt Richard Wagner \nCinematography Peter Suschitzky \nEditing by Stuart Baird \nDistributed by Warner Bros. \nRelease date 10 October 1975 \nRunning time 103 min. \nCountry U.K. \nLanguage English \n\n\nRoger Daltrey ...  Franz Liszt \nSara Kestelman ...  Princess Carolyn \nPaul Nicholas ...  Richard Wagner \nRingo Starr ...  The Pope \nRick Wakeman ...  Thor \nJohn Justin ...  Count d'Agoult \nFiona Lewis ...  Marie d'Agoult \nVeronica Quilligan ...  Cosima \nNell Campbell ...  Olga Janina \nAndrew Reilly ...  Hans Von Buelow \nDavid English ...  Captain \nImogen Claire ...  George Sand \nRikki Howard ...  Countess \nDavid Corti ...  Daniel \nAnulka Dziubinska ...  Lola Montez \n","torrent":{"xt":"urn:btih:f953eab9a3296387675cebfcea9d42a24339468f","amp;dn":"Lisztomania+%28laserdisc%29+%5B1975%5D+Ken+Russell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f953eab9a3296387675cebfcea9d42a24339468f","infoHashBuffer":{"type":"Buffer","data":[249,83,234,185,163,41,99,135,103,92,235,252,234,157,66,162,67,57,70,143]},"announce":[],"urlList":[]}}