{"title":"Mixed-Media Collage (gnv64)","uid":7356361,"size":36231426,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9590520c47f729dede05fe768d8cf3463e4e5d8&amp;dn=Mixed-Media+Collage+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"gnv65","files":-1,"time":1339784867,"description":"Mixed-Media Collage: An Exploration of Contemporary Artists, Methods, and Materials\nby Holly Harrison\nQuarry Books | September 2007 | 128 Pages | ISBN: 1592533167 | PDF | 34.5 mb &lt;a href=&quot;\nhttp://www.amazon.com/Mixed-Media-Collage-Exploration-Contemporary-Materials/dp/1592533167&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mixed-Media-Collage-Exploration-Contemporary-Materials/dp/1592533167&lt;/a&gt;\n\nMore than 60 new mixed-media collages by leading mixed-media artists.\nMixed-media collage artists are embracing, unearthing, and reconstructing the flotsam and jetsam of modern life with abandon, integrating discards along with a range of art materials and novel techniques to create compelling, new works. Original, idiosyncratic, and delightful, this catch-as-catch-can approach to making art is inspiring and can have eye-catching results. It can also have its own set of technical challenges. Mixed-Media Collage takes you into the studios of five talented mixed-media artists: Laurinda Bedingfield, Barbara De Pirro, Paula Grasdal, Sharon McCartney, and Teesha Moore. The artists reveal their own step-by-step processes, offer tips on working with unconventional materials, and share their insights on creativity and finding inspiration. A deluxe gallery features forty never-before published mixed-media pieces, complete with detailed descriptions of the work and the materials used to create them.\n\n* In-depth chapters detailing the work and techniques of Laurinda Bedingfield, Barbara De Pirro, Paula Grasdal, Sharon McCartney, and Teesha Moore\n* Techniques for making faux encaustics out of acrylic gel medium (no hot palette or wax required), adding stitching to paper, layering surfaces, finding inspiration in texts, building shrines and book-page panels out of sew-through interfacing, using simple printmaking techniques to create one-of-a-kind collage materials, building three-dimensional photo collages, and more\n* A special feature by best-selling author Jennifer Crusie, who shares her thoughts on the connections between writing and collage, as well as several previously unpublished assemblages she has used as a tool to plot and edit her books\n* A humorous essay by best-selling author Alisa Kwitney, who shares her thoughts on the connections between writing and collage, and explains why she canÃ†t use collage as a tool for anything\n\nAbout the Author\nHolly Harrison is the author of Collage for the Soul: Expressing Your Hopes and Dreams Through Art, Altered Books, Collaborative Journals, and Other Adventures in Bookmaking, and Complete Bathroom Design. A contributor to Metropolitan Home and other magazines, she has also taught at City College in New York and edited both fiction and nonfiction books. She currently lives in Massachusetts with her family, where she hides her secret collection of Elvis-themed art.","torrent":{"xt":"urn:btih:f9590520c47f729dede05fe768d8cf3463e4e5d8","amp;dn":"Mixed-Media+Collage+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9590520c47f729dede05fe768d8cf3463e4e5d8","infoHashBuffer":{"type":"Buffer","data":[249,89,5,32,196,127,114,157,237,224,95,231,104,216,207,52,99,228,229,216]},"announce":[],"urlList":[]}}