{"title":"The Manipulative Man: Identify His Behavior, Counter the Abuse, ","uid":9135809,"size":1361544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9b60e3d08d4d85f6e3419978b6c5f768e9b1a0b&amp;dn=The+Manipulative+Man%3A+Identify+His+Behavior%2C+Counter+the+Abuse%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"acer47x","files":-1,"time":1383412129,"description":"Conventional wisdom says that women are the manipulative ones - but tell that to the thousands of desperate women suffering at the hands of a manipulative man. Men can be just as sneaky, passive-aggressive, needy, underhanded, whiny, guilt-inducing and emotionally demanding as women are accused of being - and perhaps more so! As any woman in love with a manipulative man can tell you, it's not easy to get past his charm and your guilt to a place where you can see your relationship for what it is - out of balance, extraordinarily stressful, emotionally exhausting and potentially dangerous. This book is a groundbreaking prescription for dealing with the manipulative men in your life by using: tests to help women decide if they are involved with mama's boys, narcissists, sociopaths or even psychopaths; techniques for defining and setting boundaries with their men; and tools to help women improve their relationships with manipulative men. In &quot;The Manipulative Man&quot;, acclaimed psychotherapist Dr. Dorothy McCoy shows readers how to identify the type of manipulative man they're involved with, deal with the issues his behaviour provokes and ultimately, salvage the relationship - or move on.","torrent":{"xt":"urn:btih:f9b60e3d08d4d85f6e3419978b6c5f768e9b1a0b","amp;dn":"The+Manipulative+Man%3A+Identify+His+Behavior%2C+Counter+the+Abuse%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b60e3d08d4d85f6e3419978b6c5f768e9b1a0b","infoHashBuffer":{"type":"Buffer","data":[249,182,14,61,8,212,216,95,110,52,25,151,139,108,95,118,142,155,26,11]},"announce":[],"urlList":[]}}