{"title":"Eyeless in Gaza - 1986 - back from the rains (+ 12'' risen [19","uid":3830458,"size":82511023,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa21e4683baedd95c88f36b7806da63080b04038&amp;dn=Eyeless+in+Gaza+-+1986+-+back+from+the+rains+%28%2B+12%5C%27%5C%27+risen+%5B19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"80zforever","files":19,"time":1191574640,"description":"After releasing experimental/industrial tapes of Antagonistic Music/Dissonance (as Migraine Inducers), Martyn Bates formed Eyeless In Gaza in 1980 as a duo with Peter Becker. Eager to explore musical territories that veered crazily from filmic ambience to rock and pop, industrial funk to avant-folk styles, the duo steered hungrily and rapidly through several albums that culminated in the reflective swan songs of Rust Red September and Back From the Rains, whilst chalking up along the way hundreds of concerts all over Europe and several best selling Independent Chart singles and albums.\n\nIn February 1987, citing a need to explore fresh territories and musical configurations/situations, Eyeless In Gaza suspended activities, leaving behind an eclectic legacy and influential body of work that whilst being recognised by peers and contemporaries has yet to be fully acknowledged by the press.\n\nPost-Eyeless, Peter Becker worked with Indie doyens In Embrace before briefly eschewing music concerns to teach computer skills. Bates, meanwhile, avidly pursued a solo career, covering a wide and varied remit ? including collaborations to the soundtracks of Derek Jarman?s? The Garden and The Last of England, as well as a series of solo albums that saw Bates armed with a 12-string acoustic guitar investigating traditional troubadour stylings whilst moving further and further from that particular context with each successive release.\n\n","torrent":{"xt":"urn:btih:fa21e4683baedd95c88f36b7806da63080b04038","amp;dn":"Eyeless+in+Gaza+-+1986+-+back+from+the+rains+%28%2B+12%5C%27%5C%27+risen+%5B19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa21e4683baedd95c88f36b7806da63080b04038","infoHashBuffer":{"type":"Buffer","data":[250,33,228,104,59,174,221,149,200,143,54,183,128,109,166,48,128,176,64,56]},"announce":[],"urlList":[]}}