{"title":"Mob Cop - My Life of Crime in the Chicago Police Department 2015","uid":12626372,"size":8821095,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fac10f9216b87aaeff3017ae550a6f24c9bf4d15&amp;dn=Mob+Cop+-+My+Life+of+Crime+in+the+Chicago+Police+Department+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445778850,"description":"Publisher: Chicago Review Press; First Edition edition (June 1, 2015)\r\nLanguage: English\r\nISBN-10: 1613731345\r\nISBN-13: 978-1613731345\r\n\r\nFormer Chicago police officer and Outfit associate Fred Pascente is the man who links Tony Spilotro, a central character in Nicholas Pileggi’s Casino and one of Chicago’s most notori­ous mob figures, to William Hanhardt, chief of detectives of the Chicago Police Department. Pascente and Spilotro grew up together on Chicago’s Near West Side, and as young toughs they were rousted and shaken down by Hanhardt. While Spilotro became one of the youngest made men in Chicago Outfit history, Pascente was draft­ed into the army and then joined the police department. Soon taken under Hanhardt’s wing, Pascente served as Hanhardt’s fixer and bagman on the department for more than a decade. At the same time, Pascente remained close to Spilotro, mak­ing frequent trips to Las Vegas to party with his old friend while helping to rob the casinos blind. As a policeman he led a double life, doing genuine police work un­der Hanhardt’s tutelage while at the same time keeping an eye out for opportunities for bribery and theft. His position on both sides of the law gave him unrivaled knowl­edge of the workings of Chicago’s deeply rooted culture of corruption.\r\n\r\nMob Cop details the decline of tra­ditional organized crime in the United States, and reveals information about the inner workings of the Outfit that has never been publicly released. Fred Pascente’s col­orful stories of crooked cops and danger­ous criminals make his memoir a matchless tell-all","torrent":{"xt":"urn:btih:fac10f9216b87aaeff3017ae550a6f24c9bf4d15","amp;dn":"Mob+Cop+-+My+Life+of+Crime+in+the+Chicago+Police+Department+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fac10f9216b87aaeff3017ae550a6f24c9bf4d15","infoHashBuffer":{"type":"Buffer","data":[250,193,15,146,22,184,122,174,255,48,23,174,85,10,111,36,201,191,77,21]},"announce":[],"urlList":[]}}