{"title":"A Man of His Own - Susan Wilson - Audiobook MP3","uid":10363065,"size":286214589,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fba08395bdb02b8e95592f07646e7671e0c62f5c&amp;dn=A+Man+of+His+Own+-+Susan+Wilson+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1402837544,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nA Man of His Own\n\nWritten by: Susan Wilson\nNarrated by: Fred Berman, Jeff Gurner, Christina Delaine, Rick Adamson\nLength: 9 hrs and 54 mins\nFormat: Unabridged\nRelease Date:09-24-13\nProgram Type: Audiobook\n\nRick Stanton was a promising professional baseball player with dreams of playing in the major leagues and starting a family with his young wife, Francesca, when World War II changed everything. Rick returns from the war with his body broken and his dreams shattered. But it was not just body and spirit he sacrificed for the war. He and Francesca volunteered their beloved dog, Pax, for the Army's K-9 Corp, not knowing if they'd ever see him again.\n\nKeller Nicholson is the soldier who fought the war with Pax by his side, and the two have the kind of profound bond that can only be forged in war. Pax is the closest Keller has to a sense of family, and he can't bear the thought of returning him to the Stantons. But Rick and Francesca refuse to give him up. Instead, an arrangement is made: Keller will work as Rick's live-in aide. And thus an unlikely family is formed, with steadfast Pax at the center. As they try to build a new life out of the ashes, Keller and Francesca struggle to ignore their growing attraction to each other, and Rick, believing that he can no longer give Francesca what she needs and wants, quietly plans a way out.\n\nAll three of them need healing. All three of them are lost. And in Susan Wilson's A Man of His Own, Pax, with his unconditional love and unwavering loyalty, may be the only one who can guide them home.","torrent":{"xt":"urn:btih:fba08395bdb02b8e95592f07646e7671e0c62f5c","amp;dn":"A+Man+of+His+Own+-+Susan+Wilson+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fba08395bdb02b8e95592f07646e7671e0c62f5c","infoHashBuffer":{"type":"Buffer","data":[251,160,131,149,189,176,43,142,149,89,47,7,100,110,118,113,224,198,47,92]},"announce":[],"urlList":[]}}