{"title":"Why We Fight [DVD - NTSC - Conspiracy - Sept 11th - 911 - NWO -","uid":3623637,"size":4681398272,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:fc3b8a9cc8cadea3a187dbefd7ab561f71480d68&amp;dn=Why+We+Fight+%5BDVD+-+NTSC+-+Conspiracy+-+Sept+11th+-+911+-+NWO+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"lkobescak","files":1,"time":1172080535,"description":"Why We Fight\n------------\n\nIs American foreign policy dominated by the idea of military supremacy? Has the military become too important in American life? Jarecki&amp;#039;s shrewd and intelligent polemic would seem to give an affirmative answer to each of these questions. \n\nHe may have been the ultimate icon of 1950s conformity and postwar complacency, but Dwight D. Eisenhower was an iconoclast, visionary, and the Cassandra of the New World Order. Upon departing his presidency, Eisenhower issued a stern, cogent warning about the burgeoning &quot;military industrial complex,&quot; foretelling with ominous clarity the state of the world in 2004 with its incestuous entanglement of political, corporate, and Defense Department interests. \n\n\nReviews:\n--------\n\n&quot;Doesn&amp;#039;t so much explain the military-industrial complex as expose it naked and shivering on the table for all to see.&quot;\n-Mickey Rapkin, GQ\n\n\n&quot;Ambitious... This scary, eye-opening documentary looks back from a post-9/11 vantage point to see how Ike&amp;#039;s prophecy has come horribly true, with the collusion of Congress, corporations and the rise of unelected think tanks in determining foreign policy. Why are we in Iraq? Jarecki wants us to look beyond individual villains to a bigger idea: that we&amp;#039;ve become an empire in the thrall of a system whose economic survival depends on preparing for, and waging, constant war.&quot;\n?David Ansen, NEWSWEEK\n\n\n&quot;The year is still young but it&amp;#039;s hard to imagine we will see another film that is more important, more urgent and more disturbing than WHY WE FIGHT. You owe it to yourself to see this mind-blowing movie on the reasons we go to war. YOU WON&amp;#039;T SOON FORGET IT.&quot;\n-Pete Hammond, MAXIM\n\n\n&quot;Balanced, reasoned, and utterly damning, it deserves to reach as wide an audience as possible.&quot;\n-Ty Burr, THE BOSTON GLOBE\n\n\n&quot;I can&amp;#039;t think of a better way to kick off the new movie year than with Eugene Jarecki&amp;#039;s potent provocation to see what&amp;#039;s right in front of us. Jarecki is not the kind of documentarian to tell us the war in Iraq is a mess. His purpose is to show us how we got there. And he does it the hard way, with nothing up his sleeve but the facts and the human cost of ignoring them. WHY WE FIGHT wants to shake us up, and boy, does it ever... The impact is shattering. You have to hand it to... Jarecki&amp;#039;s film ? fluidly edited by Nancy Kennedy ? mounts a strong case against those who would exploit patriotism and human lives as a business proposition... WHY WE FIGHT deserves high praise for making it that much tougher to wear blinders.&quot;\n-Peter Travers, ROLLING STONE\n\n\nRun Time: 98 minutes\n\nTo Purchase This Video Please Visit: http://www.amazon.com/Why-We-Fight-John-McCain/dp/B000FBH3W2/sr=8-1/qid=1172025956/ref=pd_bbs_sr_1/002-9079492-0333643?ie=UTF8&amp;s=dvd\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO, the Illuminati and the great threat to you can be found at www.infowars.com or www.prisonplanet.com\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:fc3b8a9cc8cadea3a187dbefd7ab561f71480d68","amp;dn":"Why+We+Fight+%5BDVD+-+NTSC+-+Conspiracy+-+Sept+11th+-+911+-+NWO+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3b8a9cc8cadea3a187dbefd7ab561f71480d68","infoHashBuffer":{"type":"Buffer","data":[252,59,138,156,200,202,222,163,161,135,219,239,215,171,86,31,113,72,13,104]},"announce":[],"urlList":[]}}