{"title":"Nuclear Throne Update 31 v.480 [6/16/2014]","uid":10373820,"size":82973669,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fda111de70fe3ebc069c6fc1228c4e4ceb2b0d18&amp;dn=Nuclear+Throne+Update+31+v.480+%5B6%2F16%2F2014%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":2,"uploader":"xAbs_Zero","files":34,"time":1402968159,"description":"Nuclear Throne is an action roguelike-like by Vlambeer about mutants fighting their way through a post-apocalyptic world. The radioactive waste in the world allows mutants to get ahead by mutating new limbs on the fly, the abundant availability of powerful weaponry make the quest to become ruler of the Wasteland one fraught with peril. \n\nGame Trailer:\n\nDeveloper Interview:\n\nUpdate Info: &lt;a href=&quot;\nhttp://nuclear-throne.wikia.com/wiki/Update_History&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nuclear-throne.wikia.com/wiki/Update_History&lt;/a&gt;\n\nUploader Info:\nHello, I'm Absolut Zero, and this is my first torrent. The new updates to this game are amazing and to my dismay, I couldn't find a torrent of any version newer then Update 25 anywhere on the net. So I went ahead and bought it on steam so I could share it with people that are less fortunate. Keep in mind that this is an Early Access game through steam and is getting weekly updates, to which I will be creating new torrents to keep you guys updated as well, as long as the update is big enough to warrant creating another torrent. Also, My internet isn't the best my upload is throttled to only 50KB/ps, but seeing as how it's only 79MB so It shouldn't take forever to spread. I will do my best to keep this seeding at all times until it is sustained or a new version comes out.\n\nInstallation Info:\nAs far as I can tell, there isn't anything fancy required, I didn't pack it into a RAR or anything, just copy the folder to where you want the game to be installed and run the .exe from inside the directory, and it should work with or without steam installed. To test this I copied the game onto a flash drive as you see it here and played it directly from the flash drive on a laptop running windows 7 without steam installed. If it doesn't work for some reason please make a comment and I will figure it out. This torrent is 100% virus/malware free trust me on that I absolutely hate the scum of the earth that upload malware with their torrents.\n\nI hope everything works great and you enjoy this awesome game! If you like it and can afford it then support the developers by buying it!\n &lt;a href=&quot;\nhttp://store.steampowered.com/app/242680&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/242680&lt;/a&gt;","torrent":{"xt":"urn:btih:fda111de70fe3ebc069c6fc1228c4e4ceb2b0d18","amp;dn":"Nuclear+Throne+Update+31+v.480+%5B6%2F16%2F2014%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fda111de70fe3ebc069c6fc1228c4e4ceb2b0d18","infoHashBuffer":{"type":"Buffer","data":[253,161,17,222,112,254,62,188,6,156,111,193,34,140,78,76,235,43,13,24]},"announce":[],"urlList":[]}}