{"title":"Stazione Termini (1953)","uid":4394700,"size":734546448,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fdc02f1261fcd366a32f50fb8f5e57a918bef210&amp;dn=Stazione+Termini+%281953%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"angelo.barcelos","files":3,"time":1221365583,"description":"Quando a Mulher Erra Stazione Termini (1953)\n\nVittorio De Sica\n\nLanguage: English, Italian\n\nSubtitles: Portuguese, Spanish\n \nAlso Known As:\nIndiscretion (UK)\nIndiscretion of an American Wife (USA)\nStation Terminus (International: English title)\nTerminal Station\nTerminal Station Indiscretion (International: English title)\nTerminus Station (International: English title) \n\n\n\nCo-produÃƒÂ§ÃƒÂ£o do famoso David O. Selznick e do diretor Vittorio de Sica. A histÃƒÂ³ria ÃƒÂ© sobre Jennifer Jones, a esposa americana que vai ÃƒÂ  Roma passar um feriado. Montgomery Clift ÃƒÂ© seu amante italiano. Ela tenta dizer adeus na EstaÃƒÂ§ÃƒÂ£o Central de trem e ele implora para que ela fique. O amor levado ÃƒÂ s ÃƒÂºltimas conseqÃƒÂ¼ÃƒÂªncias, chegando ao limite da degradaÃƒÂ§ÃƒÂ£o humana.\n\n\n\nThe concept of &quot;Stazione Termini&quot; has always been highly appealing to me. In the mode of &quot;Brief Encounter,&quot; which director David Lean brought successfully to the screen earlier, &quot;Stazione&quot; potentially offers the same rewards.\n\nThe combination of director Vittorio De Sica and writer Cesare Zavattini was natural. Likewise, the pairing of Montgomery Clift and Jennifer Jones was intriguing.\n\nYet, the efforts of all these great talents failed to produce the monumental work expected. What went wrong?\n\nThe contribution of David O. Selznick, while thoroughly professional as always, may have strangely thrown off the delicate balance.\n\nThis was very much an Italian work. The American actors were portraying characters who were essentially visitors to a foreign land--guests and tourists operating within the cultural discretion of their Roman hosts. Where these characters failed to completely understand and operate with respect to the Italian sensibility and heritage, so Mr. Selznick may likewise have inadvertently intruded upon the proceedings by introducing his own distinctive American values and approaches to filmmaking.\n\nIn short, Selnick and De Sica did not mix well here. To this viewer, the production would have been much more viable had Selnick remained more in the background, allowing the proven creativity of the De Sica team to work its own magic.\n\nLikewise, a more distinctive score could have made a considerable difference. While the music was most appropriate, it did not make a truly &quot;classic&quot; statement. Finally, the unfortunate editing paired the film down to so short a duration that the drama simply lacked the time to make a moving impression. &quot;Stazione&quot; seems as much a mood as character piece, and De Sica required footage to accomplish this.\n\nDespite these shortcomings, &quot;Stazione Termini&quot; contains beautifully modulated performances by Clift and Jones, as the sad lovers who must part and go their separate ways. De Sica&amp;#039;s direction is sensitive and compassionate, and the film remains a poignant moment in the lives of two lonely people clinging to one final opportunity to express forbidden love. ","torrent":{"xt":"urn:btih:fdc02f1261fcd366a32f50fb8f5e57a918bef210","amp;dn":"Stazione+Termini+%281953%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc02f1261fcd366a32f50fb8f5e57a918bef210","infoHashBuffer":{"type":"Buffer","data":[253,192,47,18,97,252,211,102,163,47,80,251,143,94,87,169,24,190,242,16]},"announce":[],"urlList":[]}}