{"title":"The Go! Team - Rolling Blackouts (2011) mp3@320","uid":6372048,"size":104795215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe0996fad2f3621a1541898308780189efa5be4c&amp;dn=The+Go%21+Team+-+Rolling+Blackouts+%282011%29+mp3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1304711819,"description":"The Go! Team\nRolling Blackouts (2011)\n\n\n\n\nThe sound of the Go! Team, a six-piece group from Brighton, England, is a stunning blend of indie rock guitars, police show themes, hip-hop beats, and schoolyard chants built on samples and then augmented by live instrumentation. The founder and leader of the Team is Ian Parton, who provides guitar and sculpts their sound. The rest of the group includes Sam Dook on guitar, banjo, and drums; Chi &quot;Ky&quot; Fukami Taylor on drums; Jaime Bell on bass; Ninja on vocals; and Kaori Tsuchida on drums, guitar, keyboards, and melodica. Their first release, 2000's Get It Together, was primarily a solo effort by Parton that gained support from John Peel and others, but legal problems prevented a timely follow up. By the time of 2003's Junior Kickstart single, the group had been assembled (and included Silke Steidinger, who left in the fall of 2005) and signed to Memphis Industries. Thunder, Lightning, Strike was released in 2004 and quickly became a sensation in the U.K., where it was nominated for the Mercury Prize, and in the U.S., where the band became an MP3 blog darling. A bidding war ensued in the U.S., with Columbia winning, but before the album could gain release, many of the samples had to be replaced (which didn't affect the quality of the record at all). The group followed up the album with two U.K. singles, 2005's Bottle Rocket and 2006's Ladyflash, and extensive world touring. While Thunder, Lightning, Strike was an artistic success, it didn't sell the way Columbia would have liked and the band found itself label-less in America. Sub Pop soon picked them up and (with Memphis Industries) released Proof of Youth in 2007. After a long break, the group returned in early 2011 with its third album. Rolling Blackouts has the same core group as previous records and features guest appearances by Deerhoof's Satomi Matsuzaki and Bethany Cosentino of Best Coast. \n\n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 CBR\nContains:\t\tAlbum Art/ID Tags\n\n\n\n\nAudio-Info\n\n\n01.T.O.R.N.A.D.O.\n02.Secretary Song\n03.Apollo Throwdown\n04.Ready To Go Steady\n05.Bust-Out Brigade\n06.Buy Nothing Day\n07.Super Triangle\n08.Voice Yr Choice\n09.Yosemite Theme\n10.The Running Range\n11.Lazy Poltergeist\n12.Rolling Blackouts\n13.Back Like 8 Track\n\n\n\n\n\n\n\n\n\n\n              ****Support the artists &amp; buy it if you like it.****\n\n\n                  ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:fe0996fad2f3621a1541898308780189efa5be4c","amp;dn":"The+Go%21+Team+-+Rolling+Blackouts+%282011%29+mp3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0996fad2f3621a1541898308780189efa5be4c","infoHashBuffer":{"type":"Buffer","data":[254,9,150,250,210,243,98,26,21,65,137,131,8,120,1,137,239,165,190,76]},"announce":[],"urlList":[]}}