{"title":"Herbie Mann - Gagaku &amp; Beyond (1976) [Jazz][mp3 320][h33t][schon","uid":4850626,"size":117589502,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe644fe9c327b4223da3808c2fa52d3d4f9d9174&amp;dn=Herbie+Mann+-+Gagaku+%26+Beyond+%281976%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":0,"uploader":"schon55","files":10,"time":1239857253,"description":"Herbie Mann Gagaku &amp; Beyond\nRecord Label: Rhino Atlantic\nOriginally released: 26-Jul-1976\nVinyl\nBitrate: 320 kbps\n\nThis is easily the strangest record Herbie Mann ever made -- and that's saying something.  Released as an import-only in 1976, Gagaku &amp; Beyond had Mann working in the world music fusion genre with great success long before new age or &quot;world music&quot; were ever marketing catch phrases.  This set puts the &quot;family of Mann&quot; -- that included bassist Tony Levin, drummer Steve Gadd, guitarist Sam T. Brown, as well as Pat Rebillot on keyboards -- in close proximity to the stellar Japanese ensemble Minuro Muraoka.  Muraoka's group concentrated on performing the royal court music of Japan, gagaku, with original instruments that include samisen, koto, riu teki, kakko, shoko, shakuhachi, and the big drums, taiko o-daiko and the wa-daiko. In addition, on track one, &quot;Shomyo,&quot; the two bands are joined by Modern Shomyo Study, a quartet of chanting zen monks.  Exotic, huh? Yes, and so stirring and beautifully textured it's a wonder that hundreds of recordings were not modeled on its subtle ambiences, gloriously rich charts, and tasteful engagements.  Mann's group doesn't try to be Japanese, nor do the Japanese musicians try to be jazzers. They engage each other in a place of respect, frankness, and hauntingly similar intentions: to articulate inner spaces using spare structures to illuminate timbre, breath, space, and tonalities.  Yes, the music is melodic, though some may find &quot;Shomyo&quot; a little jarring with its chants, but they are seamless, edgeless, warm, and full.  The two ensembles don't play together all the time -- there are various configurations at work over the album's five cuts -- but those details are for listeners to sort on their own.  For now, this is, along with Mann's more soul- and bossa-oriented recordings, one of his most essential works: groundbreaking, heartrendingly beautiful, and full of deep, contemplative soul. ~ Thom Jurek, All Music Guide\n \nPersonnel:\nBass - Tony Levin (tracks: A1, A2, B3) \nDrums - Steve Gadd (tracks: A1, A2, B3) \nEngineer - Yuichi Shima \nFlute - Herbie Mann (tracks: A1 to B1, B3) \nGuitar - Sam Brown (tracks: A1, A2, B3) \nKeyboards - Pat Rebillot (tracks: A1, A2, B3) \nMastered By - George Piros \nProducer - Herbie Mann \nRemix - Lew Hahn \n\nHerbie Mann Gagaku &amp; Beyond Tracks:\n01  Shomyo (Monk's Chant) (14:22)\n02  Mavue Over Blues (13:00)\n03  Kurodabushi (5:25)\n04  Etenraku (8:51)\n05  Gagaku And Beyond (7:21)\n\n","torrent":{"xt":"urn:btih:fe644fe9c327b4223da3808c2fa52d3d4f9d9174","amp;dn":"Herbie+Mann+-+Gagaku+%26+Beyond+%281976%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe644fe9c327b4223da3808c2fa52d3d4f9d9174","infoHashBuffer":{"type":"Buffer","data":[254,100,79,233,195,39,180,34,61,163,128,140,47,165,45,61,79,157,145,116]},"announce":[],"urlList":[]}}