{"title":"DANCE CENTRAL 2 - IMARS - XBOX360 - REGION FREE {BOOBSMAN}","uid":6783694,"size":7264925734,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:ff25e4acd5702d887af5ccb0b09db2957a7503a4&amp;dn=DANCE+CENTRAL+2+-+IMARS+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":2,"leechers":1,"uploader":"boobsman","files":80,"time":1320007661,"description":"LT1.9 REQUIRED!!!\nDO NOT PLAY THIS GAME UNLESS YOU HAVE UPDATED TO THE LATEST FIRMWARE!!!\nIF YOU ARE ASKED TO UPDATE AND YOUR NOT RUNNING LT1.9 STOP THE GAME!!!\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-5AF0_4EAD9591.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-5AF0_4EAD9591.jpg&lt;/a&gt;\n\nPlease Note: Requires Microsoft Kinect\n\nFollowing on from the best-selling dance game for Kinect, Harmonix expands the full-body dance game universe with Dance Central 2, which provides new multiplayer experiences and all-new routines set to an unstoppable soundtrack, featuring Usher, Rihanna, La Roux, Nicki Minaj, Montell Jordan and more. Meet the crews and dance collaboratively with friends in Perform It! or challenge them to a simultaneous head-to-head Dance Battle to determine dance floor supremacy.\n\nIt's Party Time: Dance Central 2 keeps the wildly addictive &quot;Dance Central&quot; experience going with a new focus on simultaneous multiplayer. Friends can team up in Perform It or go head-to-head in a simultaneous dance off within Dance Battle. Players can drop in or out at any point during a song, so the party never has to stop!\n\nPump Up the Volume: Continuing the tradition Harmonix pioneered with its &quot;Rock Band&quot; series, the library from the original &quot;Dance Central&quot; disc will be importable into Dance Central 2 for a nominal fee. &quot;Dance Central 2&quot;'s fully integrated in-game Music Store will allow players to expand their &quot;Dance Central&quot; libraries, with more than 40 additional tracks available at launch All told, more than 100 songs will be available to play in &quot;Dance Central 2&quot; at launch!\n\nAs Real As It Gets: Dance Central 2 provides detailed per-limb feedback for each player, allowing them to refine their moves. A reimagining of &quot;Dance Central&quot;'s &quot;Break-It-Down&quot; mode lets dancers dive even deeper into move combinations and, for the first time, enables voice commands within the practice process! Harmonix continues to combine time-tested technical savvy and design polish with the fun and authenticity of the dance world to create an unparalleled dance experience.\n\nKick it with the Crews: Dance Central 2 features a variety of new characters and fan favorites paired up as dance crews, each with custom outfits, backup dancers and signature venues. Emilia, the sporty fan favorite from &quot;Dance Central,&quot; teams up with new character Bodie to form &quot;RipTide,&quot; while &quot;Dance Central&quot;'s stand-out b-boy Mo joins newcomer Glitch to make up &quot;Hi-Def.&quot; Both crews are featured in the E3 demo, with more to be unveiled later this year. Additionally, these crews call a brand new beachside city home, featuring all new venues, including a luxury yacht and a beachfront bash.\n\nTHIS IS A SCENE RELEASE, ALL CREDIT GOES TO THE ORIGINAL RIPPER!!!\n","torrent":{"xt":"urn:btih:ff25e4acd5702d887af5ccb0b09db2957a7503a4","amp;dn":"DANCE+CENTRAL+2+-+IMARS+-+XBOX360+-+REGION+FREE+%7BBOOBSMAN%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff25e4acd5702d887af5ccb0b09db2957a7503a4","infoHashBuffer":{"type":"Buffer","data":[255,37,228,172,213,112,45,136,122,245,204,176,176,157,178,149,122,117,3,164]},"announce":[],"urlList":[]}}